{
    "nodes": [
        {
            "ix": "2-155_v2_0",
            "content": "Prevalence of antibiotic-resistant E. coli in retail chicken: comparing conventional, organic, kosher, and raised without antibiotics",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_2",
            "content": "Retail poultry products are known sources of antibiotic-resistant Escherichia coli , a major human health concern. Consumers have a range of choices for poultry, including conventional, organic, kosher, and raised without antibiotics (RWA) – designations that are perceived to indicate differences in quality and safety. However, whether these categories vary in the frequency of contamination with antibiotic-resistant E. coli is unknown. We examined the occurrence of antibiotic-resistant E. coli on raw chicken marketed as conventional, organic, kosher and RWA. From April – June 2012, we purchased 213 samples of raw chicken from 15 locations in the New York City metropolitan area. We screened E. coli isolates from each sample for resistance to 12 common antibiotics. Although the organic and RWA labels restrict the use of antibiotics, the frequency of antibiotic-resistant E. coli tended to be only slightly lower for RWA, and organic chicken was statistically indistinguishable from conventional products that have no restrictions. Kosher chicken had the highest frequency of antibiotic-resistant E. coli , nearly twice that of conventional products, a result that belies the historical roots of kosher as a means to ensure food safety. These results indicate that production methods influence the frequency of antibiotic-resistant E. coli on poultry products available to consumers. Future research to identify the specific practices that cause the high frequency of antibiotic-resistant E. coli in kosher chicken could promote efforts to reduce consumer exposure to this potential pathogen.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_4",
            "content": "The use of antibiotics in livestock production may pose health risks to humans, as such usage has been correlated with the occurrence of antibiotic-resistant bacteria isolated from human infections <REF-1> , <REF-2> . Methods of livestock production differ in antibiotic use, and this can influence the frequency of antibiotic-resistant bacteria on retail meats. For example, antibiotic-resistant Escherichia coli has been shown to be less common on poultry raised without antibiotics (RWA) as compared to poultry raised conventionally <REF-3> . Likewise, organic poultry can have lower frequencies of antibiotic-resistant bacteria than poultry raised conventionally <REF-4> – <REF-10> , although this is not always the case <REF-11> – <REF-13> . Organic, RWA, and kosher food products supply a growing market niche <REF-14> . Consumers perceive that they offer health benefits <REF-14> – <REF-21> and are willing to pay a premium for them <REF-22> – <REF-24> . The actual health benefits of organic food are not always clear <REF-25> , and the health benefits of kosher foods are largely anecdotal. Little is known about the frequency of antibiotic-resistant microorganisms on kosher products.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_5",
            "content": "The organic and RWA labels require specific production methods as stipulated in US federal regulations, whereas the kosher label adheres to religious requirements that are regulated privately. The RWA label requires that “livestock have never received antibiotics from birth to harvest” <REF-26> . The United States Department of Agriculture (USDA) organic standard is only slightly less strict, stipulating that “The producer of an organic livestock operation must not sell, label, or represent as organic any animal or edible product derived from any animal treated with antibiotics”, but also that “Poultry or edible poultry products must be from poultry that has been under continuous organic management beginning no later than the second day of life” <REF-26> , <REF-27> . Therefore, injecting antibiotics into eggs or administering them during the first 24 hours of the chick’s life will not violate the letter of the USDA organic standard <REF-28> , <REF-29> . Kosher production differs from organic and RWA in that it is inherently predicated on religious requirements. For kosher meat, the major requirements are that it must be from animals that have split hooves and chew their cud, it must not be mixed with dairy products, and all equipment used must be used exclusively for kosher food <REF-19> . Animals must be slaughtered “humanely”, and meat is typically salted to remove blood rapidly, a practice that has been shown to reduce the microbial load <REF-30> . Unlike for organic and RWA, kosher poultry is not regulated by Federal laws but rather by private certification organizations, and thus the specific practices vary <REF-19> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_6",
            "content": "Here, we compared four major types of poultry-conventional, kosher, organic, and RWA-in order to assess the frequency of contamination with antibiotic-resistant E. coli . We focused on poultry products from a major metropolitan center (the greater New York City area) and products available to typical consumers by studying multiple brands of chicken from multiple stores. Our goal was to compare the frequency of antibiotic-resistant E. coli in these four categories of chicken.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_7",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_8",
            "content": "Sample collection",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_9",
            "content": "During April–June 2012, raw chicken was purchased from supermarkets, butcher shops, specialty stores, and food distributors in the greater New York City area. A variety of widely available brands were procured in four categories: conventional, kosher, organic and RWA. Within each category of chicken purchased, we collected at least four samples of each brand. Some samples included more than one category (e.g., kosher and organic). Five collections occurred resulting in 213 total samples. Samples were drumsticks or samples from which drumsticks were removed for analysis (all with skin). After purchase, each chicken sample was placed in a labeled, ziplock bag, and placed in a cooler with ice packs. Three coolers with ice packs were shipped overnight to T-Gen North within two days of collection.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_10",
            "content": "Laboratory analyses",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_11",
            "content": "Chicken samples arrived at the laboratory in their original packaging and were refrigerated at 4°C until processed. One putative E. coli strain was isolated and screened from each sample using standard methods for assaying for antimicrobial resistance described by the Clinical and Laboratory Standards Institute (CLSI) <REF-31> . The use of one strain per sample enabled efficient testing among a population of chicken samples for differences in the frequency of antibiotic resistance.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_12",
            "content": "One whole drumstick was selected from each package or removed from each whole chicken sample using a sterilized knife. Each sample was transferred aseptically to a Stomacher Bag (VWR, Radon, PA, USA, catalog number 11216–902) containing 250 ml MacConkey broth (Alpha Biosciences, Baltimore, MD) and agitated at speed 7 for 3 min on a rocking platform shaker (VWR, Radon, PA, USA, model no. 40000–302) and incubated overnight at 44°C. A 10 μl loop was used to inoculate a VRBA+MUG (Teknova, Hollister, CA) plate with the enriched broth. The plate was incubated at 37°C for 2 h and then at 44°C for 22 h, along with QA/QC strains ATCC E. coli 35218, Klebsiella pneumoniae , Hafnia alvei , Citrobacter freundii and Serratia plymuthica. QA/QC strains not listed as ATCC were isolated and identified using the BD Phoenix at Flagstaff Medical Center. From each VRBA+MUG plate, four putative E. coli colonies were streaked to CHROMagar (Hardy Diagnostics, Santa Maria, CA) and incubated 20 to 24 h at 37°C. One putative E. coli colony, appearing pink to rose, was streaked to a second CHROMagar plate and incubated 20 to 24 h at 37°C. For each sample, a putative E. coli isolate was inoculated into an assigned well of a 96-well plate containing 75 µl of Tris EDTA (TE) buffer. DNA was released from cell suspension with a thermal cycler (Bio-Rad, Hercules, CA) using the following parameters: heated lid, 95°C; block temperature, 90°C for 15 min. To confirm the identity of putative E. coli isolates, a uidA qPCR assay and a universal bacterial qPCR (BactQuant <REF-32> ) were used. For each reaction, 2 μl of DNA was added into 8 μl of master mix, with the final reaction containing 1.8 μM of each forward and reverse uidA primer, 0.25 μM uidA- VIC probe, 0.90 μM of each forward and reverse Pan16S primer, 0.25 μM Pan16S-FAM probe, 1X QuantaPerfeCTa ® Multiplex qPCR SuperMix w⁄ROX (Quanta Biosciences, Gaithersburg, MD) and molecular-grade water. All samples were run in triplicate and each experiment included a standard curve and no-template controls. The 7900HT Real-Time PCR System (Applied Biosystems, Carlsbad, CA) was used to run the reactions with following conditions: 3 min at 50°C for UNG treatment, 10 min at 95°C for Taq activation, 15 s at 95°C for denaturation and 1 min at 60°C for annealing and extension × 40 cycles. Six isolates were excluded from further analysis because they were not confirmed as E. coli using the qPCR assay.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_13",
            "content": "Guidelines from the Clinical and Laboratory Standards Institute (CLSI) for disk diffusion methods <REF-31> were used to test each strain for resistance to antibiotics. Some strains did not grow under assay conditions (n=23) and were excluded from further analysis. Twelve antibiotics were tested, representing seven classes of drugs: tetracycline (class, tetracyclines); ampicillin and ampicillin sulbactam (class, penicillins); cefazolin, cefoxitin, and ceftriaxone (class, cephalosporins); gentamicin and amikacin (class, aminoglycosides); nalidixic acid and ciprofloxacin (class, quinolones); trimethoprim sulfamethoxazole (class, folate pathway inhibitors); and imipenem (class, carbapenems) (VWR, Radon, PA). Breakpoint guidelines from the CLSI M100 Tables 2A through 2J for E. coli <REF-31> were used to classify strains into “resistant”, “intermediate” or “susceptible”; designations of “intermediate” were lumped with “resistant” for purposes of statistics and inference, a conservative approach with respect to consumer safety.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_14",
            "content": "Statistical analyses",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_15",
            "content": "Analysis of variance (ANOVA) was used to test whether antibiotic resistance varied among the brands of chicken sampled, using SYSTAT 13.1. Effects of brand within each category were tested (i.e., using all the data within conventional, organic, kosher, RWA). For each drug, Microsoft Excel for Mac Version 14.1.0 was used to conduct chi-square tests to determine whether the frequency of resistance varied among categories of chicken: conventional, organic, kosher and RWA.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_16",
            "content": "The total number of drugs and drug classes to which each strain was resistant were enumerated. One-way ANOVA was used to compare the average number of drugs to which strains were resistant among categories, using samples with only one category designation (n=120). This test captures the effect of a consumer’s choice whether to purchase chicken in one category over another on the likelihood of exposure to antibiotic-resistant E. coli .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_17",
            "content": "Multi-factor ANOVA was used to test whether trends held across the broader dataset (n=184), including samples with multiple category designations. The collection of samples included adequate replication (>14) for every possible two-way combination of labels (organic & kosher, RWA & organic, and RWA & kosher). Replication for the three-way combination (organic, kosher & RWA) was low (n=5), and all samples were from one brand. To avoid bias, these samples were excluded from the ANOVA. Each of the three labeling categories was included as a factor in three-way ANOVAs (organic, RWA, and kosher, each with two levels), with the number of drugs and drug classes exhibiting resistance as response variables. This tests for the effect of each category and for interactive effects of combining categories.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_18",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_19",
            "content": "Across the entire dataset, resistance to cefazolin was most common (41.3%), followed by ampicillin (31.5%), tetracycline (30.4%), and ampicillin sulbactam (19.6%). Some resistance was detected for cefoxitin, (12.5%) and gentamicin (10.9% of strains), but no strain was resistant to amikacin, the other aminoglycoside tested. For the quinolones, some (3.3%) of strains were resistant to nalidixic acid, but none was resistant to ciprofloxacin. Resistance was low (3.3%) for trimethoprim sulfamethoxazole, the one folate pathway inhibitor tested, and was absent for imipenem, the one carbapenem tested. Over half of all strains collected exhibited resistance to one or more antibiotics: 55%, 58%, 60%, and 76% from conventional, RWA, organic, and kosher chicken samples, respectively.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_20",
            "content": "Within categories of chicken purchased, brands did not vary in the extent of antibiotic resistance ( Table 1 ). By contrast, categories of chicken differed in the number of drugs to which strains of E. coli were resistant ( Figure 1 ). Strains of E. coli isolated from kosher chicken were resistant to more drugs than were strains from the other categories (Tukey’s HSD comparisons: kosher vs. conventional, P=0.023; kosher vs. organic, P=0.041; kosher vs. RWA, P=0.002).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_21",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Results from four one-way ANOVA testing for the effect of brand on E. coli drug resistance. The response variable was the number of drugs to which strains of E. coli exhibited resistance. N indicates numbers of brands within each category. The P-values are for the effect of brand, tested for each category.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_22",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Results from four one-way ANOVA testing for the effect of brand on <italic>E. coli</italic> drug resistance.</title> <p>The response variable was the number of drugs to which strains of <italic>E. coli</italic> exhibited resistance. N indicates numbers of brands within each category. The P-values are for the effect of brand, tested for each category.</p> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">Category</th> <th align=\"left\">N</th> <th align=\"left\">P-value</th> </tr> </thead> <tbody> <tr> <td>Conventional</td> <td>9</td> <td>0.129</td> </tr> <tr> <td>Organic</td> <td>13</td> <td>0.367</td> </tr> <tr> <td>Kosher</td> <td>10</td> <td>0.789</td> </tr> <tr> <td>RWA</td> <td>14</td> <td>0.607</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Results from four one-way ANOVA testing for the effect of brand on E. coli drug resistance. The response variable was the number of drugs to which strains of E. coli exhibited resistance. N indicates numbers of brands within each category. The P-values are for the effect of brand, tested for each category.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_23",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "A . The percentage of resistant strains of E. coli as a function of the number of drugs tested for each of the four categories of chicken sampled. Values shown on the x-axis are cumulative. For example, the percentage of strains resistant to five or more drugs includes strains resistant to five to seven drugs. B . The average number of drugs to which strains of E. coli exhibited resistance in each of the four categories of chicken sampled. Values shown are means ± standard errors of the mean. Category was a significant factor in a one-way ANOVA (P=0.003). Bars with different letters are significantly different at P<0.05 (Tukey’s HSD). RWA-raised without antibiotics.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/2226/8f6db273-2864-41ed-a22f-71935dfa2b12_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_24",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <p> <bold>A</bold>. The percentage of resistant strains of <italic>E. coli</italic> as a function of the number of drugs tested for each of the four categories of chicken sampled. Values shown on the x-axis are cumulative. For example, the percentage of strains resistant to five or more drugs includes strains resistant to five to seven drugs. <bold>B</bold>. The average number of drugs to which strains of <italic>E. coli</italic> exhibited resistance in each of the four categories of chicken sampled. Values shown are means &#177; standard errors of the mean. Category was a significant factor in a one-way ANOVA (P=0.003). Bars with different letters are significantly different at P&lt;0.05 (Tukey&#8217;s HSD). RWA-raised without antibiotics.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/2226/8f6db273-2864-41ed-a22f-71935dfa2b12_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "A . The percentage of resistant strains of E. coli as a function of the number of drugs tested for each of the four categories of chicken sampled. Values shown on the x-axis are cumulative. For example, the percentage of strains resistant to five or more drugs includes strains resistant to five to seven drugs. B . The average number of drugs to which strains of E. coli exhibited resistance in each of the four categories of chicken sampled. Values shown are means ± standard errors of the mean. Category was a significant factor in a one-way ANOVA (P=0.003). Bars with different letters are significantly different at P<0.05 (Tukey’s HSD). RWA-raised without antibiotics.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/2226/8f6db273-2864-41ed-a22f-71935dfa2b12_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_25",
            "content": "These patterns held when analyzing the broader dataset, including the samples with multiple designations. Strains of E. coli isolated from kosher chicken samples were resistant to more drugs compared to the other categories ( Figure 2 ). Strains of E. coli isolated from samples in the RWA category tended to be resistant to fewer drugs but the difference was not significant versus conventional and organic which did not differ from each other.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_26",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Antibiotic resistance across all categories tested, showing the number of drugs to which strains of E. coli were resistant among categories. Values shown are means ± standard errors of the mean. Kosher was a significant factor in the analysis of variance (P=0.00374), whereas ‘raised without antibiotics’ (RWA) (P=0.122), organic (P=0.874), and all interactions (P<0.050) were not significant.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/2226/8f6db273-2864-41ed-a22f-71935dfa2b12_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_27",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Antibiotic resistance across all categories tested, showing the number of drugs to which strains of <italic>E. coli</italic> were resistant among categories.</title> <p>Values shown are means &#177; standard errors of the mean. Kosher was a significant factor in the analysis of variance (P=0.00374), whereas &#8216;raised without antibiotics&#8217; (RWA) (P=0.122), organic (P=0.874), and all interactions (P&lt;0.050) were not significant.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/2226/8f6db273-2864-41ed-a22f-71935dfa2b12_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Antibiotic resistance across all categories tested, showing the number of drugs to which strains of E. coli were resistant among categories. Values shown are means ± standard errors of the mean. Kosher was a significant factor in the analysis of variance (P=0.00374), whereas ‘raised without antibiotics’ (RWA) (P=0.122), organic (P=0.874), and all interactions (P<0.050) were not significant.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/2226/8f6db273-2864-41ed-a22f-71935dfa2b12_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_28",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_29",
            "content": "Poultry growers use antibiotics both for therapeutic purposes and for growth promotion <REF-33> , <REF-34> . Based on a national survey conducted by the USDA of poultry and hog producers in the United States, use of antibiotics at sub-therapeutic levels for growth promotion is common <REF-35> , <REF-36> . One estimate places growth promotion in livestock production as the single largest sector in which antibiotics are used in the US, accounting for 70% of the total of 50 million pounds for the year 2008 <REF-37> . The use of antibiotics in poultry production can select for antibiotic-resistant microorganisms including Salmonella , Campylobacter , Enterococcus , and extra-intestinal pathogenic E. coli <REF-38> . Studies of E. coli from bloodstream infections in Europe suggest that poultry are an important source of antibiotic-resistant infections <REF-39> . Use of antibiotics is restricted in production of chicken carrying the USDA organic and USDA RWA labels. Like conventional chicken, chicken with a certified kosher label does not indicate any special restrictions in the use of antibiotics.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_30",
            "content": "Our finding that brands within categories did not differ significantly in the extent of antibiotic resistant E. coli ( Table 1 ) could arise from the fact that individual brands of chicken obtain product from multiple farms whose production practices may differ, obscuring clear patterns associated with individual brands. Our ability to detect an effect of brand might also be constrained by low statistical power. Our finding that the frequency of antibiotic resistant strains of E. coli on organic poultry did not differ significantly from conventional ( Figure 1 and Figure 2 ) reflects some past studies in this area that have found no difference in antibiotic resistance between organic and conventional practices <REF-11> – <REF-13> . Others found that pathogens on organic or RWA poultry products had lower resistance to antibiotics compared to conventional products <REF-4> , <REF-10> , <REF-40> – <REF-43> , which was the trend we observed for RWA. The distinction between USDA organic from USDA RWA may be important, given that organic chicks can receive antibiotics via in ovo injections and during the first day of life. Previous studies have provided unequivocal evidence that even in ovo injection of antibiotics can affect the susceptibility of the bacteria that contaminate poultry products <REF-2> . With a larger sample, the tendency for E. coli isolated from RWA samples to have lower frequency of antibiotic resistance than other categories (P=0.122; Figure 1 and Figure 2 ) may emerge as significant.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_31",
            "content": "Cross-contamination is another possible source of antibiotic resistance <REF-44> . Shared facilities for product and slaughter could promote cross-contamination and antibiotic strains could be spread among organism and environments <REF-45> , <REF-46> . Poultry could then be inadvertently exposed to antibiotic-resistant E. coli . For example, companies with both conventional and organic products may slaughter in the same facilities, promoting cross-contamination. Production facilities that convert from one practice to another could also experience residual contamination, though there is evidence that converting from conventional to organic can reduce frequency of resistance <REF-8> . The identification of possible cross-contamination is outside the scope of this study, but these possibilities would need to be considered when investigating the sources of antibiotic resistance.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_32",
            "content": "The increased resistance of E. coli in kosher chicken compared to conventional was surprising, because, while kosher does not stipulate anything about antibiotic use, kosher is perceived as clean and safe to consume <REF-19> . The higher resistance found in isolates from kosher chicken ( Figure 1 and Figure 2 ), and the distinct antibiotic-resistance profile ( Table 2 ) suggests that use of antibiotics in the kosher production chain is common and that it may be more intensive than use of antibiotics among conventional, organic, or RWA practices. It is not immediately obvious where in the kosher chicken production process antibiotic use might be more prevalent, or where exposure to antibiotic-resistant organisms is more likely. Consumers perceive organic, kosher and RWA products to be healthier <REF-14> – <REF-21> , though the real health benefits from organic products are unclear <REF-10> , and, to our knowledge, the actual health benefits of kosher have not been assessed. Our findings are consistent with the suggestion that some ‘niche market’ products, while perceived to be safer, may have higher incidence of foodborne pathogens compared to conventional products <REF-47> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_33",
            "content": "Table 2.",
            "ntype": "label",
            "meta": {
                "id": "T2",
                "caption": "Antibiotic-resistance profiles of conventional, organic, kosher and ‘raised without antibiotics’ (RWA) chicken products. Bold text denotes significant differences among categories according to one-way ANOVA.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_34",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T2\" position=\"anchor\"> <caption> <title>Antibiotic-resistance profiles of conventional, organic, kosher and &#8216;raised without antibiotics&#8217; (RWA) chicken products.</title> <p>Bold text denotes significant differences among categories according to one-way ANOVA.</p> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">Antibiotic</th> <th align=\"left\">Conventional</th> <th align=\"left\">Organic</th> <th align=\"left\">Kosher</th> <th align=\"left\">RWA</th> <th align=\"left\">P-value</th> </tr> </thead> <tbody> <tr> <td>Ampicillin</td> <td>24%</td> <td>33%</td> <td>62%</td> <td>14%</td> <td> <bold>0.002</bold> </td> </tr> <tr> <td>Ampicillin sulbactam</td> <td>18%</td> <td>13%</td> <td>52%</td> <td>8%</td> <td> <bold>0.001</bold> </td> </tr> <tr> <td>Cefazolin</td> <td>30%</td> <td>43%</td> <td>62%</td> <td>31%</td> <td>0.072</td> </tr> <tr> <td>Cefoxitin</td> <td>3%</td> <td>10%</td> <td>33%</td> <td>6%</td> <td> <bold>0.003</bold> </td> </tr> <tr> <td>Ceftriaxone</td> <td>3%</td> <td>7%</td> <td>33%</td> <td>6%</td> <td> <bold>0.001</bold> </td> </tr> <tr> <td>Nalidixic acid</td> <td>3%</td> <td>3%</td> <td>5%</td> <td>3%</td> <td>0.981</td> </tr> <tr> <td>Gentamicin</td> <td>24%</td> <td>13%</td> <td>5%</td> <td>11%</td> <td>0.206</td> </tr> <tr> <td>Tetracycline</td> <td>30%</td> <td>30%</td> <td>33%</td> <td>25%</td> <td>0.917</td> </tr> <tr> <td>Trimethoprim sulfamethoxazole</td> <td>9%</td> <td>0%</td> <td>5%</td> <td>3%</td> <td>0.321</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T2",
                "caption": "Antibiotic-resistance profiles of conventional, organic, kosher and ‘raised without antibiotics’ (RWA) chicken products. Bold text denotes significant differences among categories according to one-way ANOVA.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_35",
            "content": "Our study was limited in geographic and temporal scale, as we focused on the New York metropolitan area over a three-month time period. Yet, the region is large and populous, we focused on the most widely available brands in all categories, and this area particularly offered multiple kosher brands. Our final sample size was limited (n=184) but not atypical for the field <REF-48> – <REF-51> . Finally, we only assayed for generic E. coli and did not assess virulence or virulence group assignments for each sample. However, E. coli is a useful focal organism because it is widespread and an important potential pathogen.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_36",
            "content": "More studies are needed to test whether antibiotic resistance among kosher products is consistently higher than conventional and other categories. Nevertheless, our study offers insight into another area of the food production system increasing the exposure of people to microorganisms that are resistant to antibiotics. In addition to regulation, more consistent surveillance or auditing would add of consumer protection, enabling improved purchase decisions based on price and health benefits guided by meaningful labels.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_37",
            "content": "<REF-1> Silbergeld EK Graham J Price LB : Industrial food animal production, antimicrobial resistance, and human health. Annu Rev Public Health. 2008 ; 29 : 151 – 169 . 18348709 10.1146/annurev.publhealth.29.020907.090904",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_38",
            "content": "<REF-2> Dutil L Irwin R Finley R : Ceftiofur resistance in Salmonella enterica serovar Heidelberg from chicken meat and humans, Canada. Emerg Infect Dis. 2010 ; 16 ( 1 ): 48 – 54 . 20031042 10.3201/eid1601.090729 2874360",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_39",
            "content": "<REF-3> Zhang J Massow A Stanley M : Contamination rates and antimicrobial resistance in Enterococcus spp., Escherichia coli, and Salmonella Isolated from \"no antibiotics added''-labeled chicken products. Foodborne Pathog Dis. 2011 ; 8 ( 11 ): 1147 – 1152 . 21714636 10.1089/fpd.2011.0852",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_40",
            "content": "<REF-4> Miranda JM Guarddon M Mondragon A : Antimicrobial resistance in Enterococcus spp. strains isolated from organic chicken, conventional chicken, and turkey meat: A comparative survey. J Food Prot. 2007 ; 70 ( 4 ): 1021 – 1024 . 17477278",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_41",
            "content": "<REF-8> Sapkota AR Hulet RM Zhang G : Lower prevalence of antibiotic-resistant Enterococci on U.S. conventional poultry farms that transitioned to organic practices. Environ Health Perspect. 2011 ; 119 ( 11 ): 1622 – 1628 . 21827979 10.1289/ehp.1003350 3226496",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_42",
            "content": "<REF-10> Smith-Spangler C Brandeau ML Hunter GE : Are organic foods safer or healthier than conventional alternatives?: a systematic review. Ann Intern Med. 2012 ; 157 ( 5 ): 348 – 66 . 22944875 10.7326/0003-4819-157-5-201209040-00007",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_43",
            "content": "<REF-11> LeJeune JT Christie NP : Microbiological quality of ground beef from conventionally-reared cattle and \"Raised without antibiotics\" label claims. J Food Prot. 2004 ; 67 ( 7 ): 1433 – 1437 . 15270497",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_44",
            "content": "<REF-13> Luangtongkum T Morishita TY Ison AJ : Effect of conventional and organic production practices on the prevalence and antimicrobial resistance of Campylobacter spp. in poultry. Appl Environ Microbiol. 2006 ; 72 ( 5 ): 3600 – 3607 . 16672508 10.1128/AEM.72.5.3600-3607.2006 1472326",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_45",
            "content": "<REF-14> Cohen E Schwartz Z Antonovski R : Consumer perceptions of kosher products. J Foodserv Bus Res. 2002 ; 5 ( 3 ): 69 – 88 . 10.1300/J369v05n03_06",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_46",
            "content": "<REF-19> Campbell H Murcott A MacKenzie A : Kosher in New York City, halal in Aquitaine: challenging the relationship between neoliberalism and food auditing. Agric Human Values. 2011 ; 28 ( 1 ): 67 – 79 . 10.1007/s10460-010-9260-3",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_47",
            "content": "<REF-21> Shafie FA Rennie D : Consumer Perceptions towards Organic Food . In: Abbass MY, Bajunid AFI, editors. Proceedings of the 1st National Conference on Environment-Behaviour Studies. Amsterdam: Elsevier Science Bv. 2012 ; 49 : 360 – 367 . 10.1016/j.sbspro.2012.07.034",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_48",
            "content": "<REF-22> Batte MT Hooker NH Haab TC : Putting their money where their mouths are: Consumer willingness to pay for multi-ingredient, processed organic food products. Food Policy. 2007 ; 32 ( 2 ): 145 – 159 . 10.1016/j.foodpol.2006.05.003",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_49",
            "content": "<REF-24> Yiridoe EK Bonti-Ankomah S Martin RC : Comparison of consumer perceptions and preference toward organic versus conventionally produced foods: A review and update of the literature. Renew Agric Food Syst. 2005 ; 20 ( 4 ): 193 – 205 . 10.1079/RAF2005113",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_50",
            "content": "<REF-25> Brandt K Leifert C Sanderson R : Agroecosystem Management and Nutritional Quality of Plant Foods: The Case of Organic Fruits and Vegetables. CRC Crit Rev Plant Sci. 2011 ; 30 ( 1–2 ): 177 – 197 . 10.1080/07352689.2011.554417",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_51",
            "content": "<REF-26> USDA United States Standards for Livestock and Meat Marketing Claims . In: Agriculture USDo, editor. FR 79552: Federal Register 2002 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_52",
            "content": "<REF-27> Code of Federal Regulations t, part 205, subpart C. National Organic Program, Organic Production and Handling Requirements . In: Regulations CoF, editor. 7. Code of Federal Regulations 2012 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_53",
            "content": "<REF-28> Crandall PG Seideman S Ricke SC : Organic poultry: Consumer perceptions, opportunities, and regulatory issues. J Appl Poult Res. 2009 ; 18 ( 4 ): 795 – 802 . 10.3382/japr.2009-00025",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_54",
            "content": "<REF-29> Fanatico AC Owens CM Emmert JL : Organic poultry production in the United States: Broilers. J Appl Poult Res. 2009 ; 18 ( 2 ): 355 – 366 . 10.3382/japr.2008-00123",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_55",
            "content": "<REF-30> Shin D Kakani G Molina VA : Effect of kosher salt application on microbial profiles of poultry carcasses. Poult Sci. 2012 ; 91 ( 12 ): 3247 – 3252 . 23155037 10.3382/ps.2012-02457",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_56",
            "content": "<REF-31> Clinical and Laboratory Stnadards Institute. Performance Standards for Antimicrobial Susceptibility Testing M100–S21 . 940 West Valley Road, Suite 1400, Wayne, Pennsylvania 19087–1898, USA: Clinical and Laboratory. 2011 ; Standards Institute. pp. 178. Accessed 21 June 2013 from . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_57",
            "content": "<REF-32> Liu CM Aziz M Kachur S : BactQuant: An enhanced broad-coverage bacterial quantitative real-time PCR assay. BMC Microbiol. 2012 ; 12 : 56 . 22510143 10.1186/1471-2180-12-56 3464140",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_58",
            "content": "<REF-33> MacDonald JM Wang SL : Foregoing sub-therapeutic antibiotics: the impact on broiler grow-out operations. Appl Econ Perspect Policy. 2011 ; 33 ( 1 ): 79 – 98 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_59",
            "content": "<REF-34> Ricke SC Jarquin R Hanning I : Antimicrobials in animal feed: benefits and limitations . Pages 411–431, in Animal Feed Contamination, Woodhead Publishing Series in Food Science, Technology and Nutrition No. 215. ISBN 978 1 84569 715 9. 10.1533/9780857093615",
            "ntype": "ref",
            "meta": {
                "id": "ref-34",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_60",
            "content": "<REF-35> MacDonald JM Wang SL : Subtherapeutic Antibiotics and U.S. Broiler Production . Economic Research Service, U.S. Department of Agriculture. Agricultural & Applied Economics Association’s 2009 AAEA & ACCI Joint Annual Meeting, Milwaukee, WI, July 26–28, 2009 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-35",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_61",
            "content": "<REF-36> McBride WD Key N Mathews K : Sub-therapeutic Antibiotics and Productivity in U.S. Hog Production. Rev Agric Econ. 2008 ; 30 ( 2 ): 270 – 288 . 10.1111/j.1467-9353.2008.00404.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-36",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_62",
            "content": "<REF-37> Dorit R : Routes of resistance. Am Sci. 2009 ; 97 : 20 – 22 . 10.1511/2009.76.20",
            "ntype": "ref",
            "meta": {
                "id": "ref-37",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_63",
            "content": "<REF-38> Davis MF Price LB Liu CM : An ecological perspective on US industrial poultry production: the role of anthropogenic ecosystems on the emergence of drug-resistant bacteria from agricultural environments. Curr Opin Microbiol. 2011 ; 14 ( 3 ): 244 – 250 . 21621451 10.1016/j.mib.2011.04.003",
            "ntype": "ref",
            "meta": {
                "id": "ref-38",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_64",
            "content": "<REF-39> Vieira AR Collignon P Aarestrup FM : Association between antimicrobial resistance in Escherichia coli isolates from food animals and blood stream isolates from humans in Europe: an ecological study. Foodborne Pathog Dis. 2011 ; 8 ( 12 ): 1295 – 1301 . 21883007 10.1089/fpd.2011.0950",
            "ntype": "ref",
            "meta": {
                "id": "ref-39",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_65",
            "content": "<REF-40> Cui S Ge B Zheng J : Prevalence and antimicrobial resistance of Campylobacter spp. and Salmonella serovars in organic chickens from Maryland retail stores. Appl Environ Microbiol. 2005 ; 71 ( 12 ): 4108 – 4111 . 16000828 10.1128/AEM.71.7.4108-4111.2005 1169031",
            "ntype": "ref",
            "meta": {
                "id": "ref-40",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_66",
            "content": "<REF-43> Lestari SI Han F Wang F : Prevalence and antimicrobial resistance of Salmonella serovars in conventional and organic chickens from Louisiana retail stores. J Food Prot. 2009 ; 72 ( 6 ): 1165 – 1172 . 19610326",
            "ntype": "ref",
            "meta": {
                "id": "ref-43",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_67",
            "content": "<REF-44> Smith JL Drum DJ Dai Y : Impact of antimicrobial usage on antimicrobial resistance in commensal Escherichia coli strains colonizing broiler chickens. Appl Environ Microbiol. 2007 ; 73 ( 5 ): 1404 – 1414 . 17194843 10.1128/AEM.01193-06 1828781",
            "ntype": "ref",
            "meta": {
                "id": "ref-44",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_68",
            "content": "<REF-45> Moodley A Guardabassi L : Clonal spread of methicillin-resistant coagulase-negative staphylococci among horses, personnel and environmental sites at equine facilities. Vet Microbiol. 2009 ; 137 ( 3–4 ): 397 – 401 . 19251386 10.1016/j.vetmic.2009.01.034",
            "ntype": "ref",
            "meta": {
                "id": "ref-45",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_69",
            "content": "<REF-46> Graham JP Leibler JH Price LB : The animal-human interface and infectious disease in industrial food animal production: Rethinking biosecurity and biocontainment. Public Health Rep. 2008 ; 123 ( 3 ): 282 – 299 . 19006971 2289982",
            "ntype": "ref",
            "meta": {
                "id": "ref-46",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_70",
            "content": "<REF-47> Fox JT Reinstein S Jacob ME : Niche marketing production practices for beef cattle in the United States and prevalence of foodborne pathogens. Foodborne Pathog Dis. 2008 ; 5 ( 5 ): 559 – 569 . 18681794 10.1089/fpd.2008.0094",
            "ntype": "ref",
            "meta": {
                "id": "ref-47",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_71",
            "content": "<REF-48> Cui S Ge B Zheng J : Prevalence and antimicrobial resistance of Campylobacter spp. and Salmonella serovars in organic chickens from Maryland retail stores. Appl Environ Microbiol. 2005 ; 71 ( 7 ): 4108 – 4111 . 16000828 10.1128/AEM.71.7.4108-4111.2005 1169031",
            "ntype": "ref",
            "meta": {
                "id": "ref-48",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-155_v2_72",
            "content": "<REF-51> Miranda JM Guarddon M Vázquez BI : Antimicrobial resistance in Enterobacteriaceae strains isolated from organic chicken, conventional chicken and conventional turkey meat: a comparative survey. Food Control. 2008 ; 19 : 412 – 416 . 10.1016/j.foodcont.2007.05.002",
            "ntype": "ref",
            "meta": {
                "id": "ref-51",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "2-155_v2_0@0",
            "content": "Prevalence of antibiotic-resistant E. coli in retail chicken: comparing conventional, organic, kosher, and raised without antibiotics",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_0",
            "start": 0,
            "end": 132,
            "label": {}
        },
        {
            "ix": "2-155_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-155_v2_2@0",
            "content": "Retail poultry products are known sources of antibiotic-resistant Escherichia coli , a major human health concern.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_2",
            "start": 0,
            "end": 113,
            "label": {}
        },
        {
            "ix": "2-155_v2_2@1",
            "content": "Consumers have a range of choices for poultry, including conventional, organic, kosher, and raised without antibiotics (RWA) – designations that are perceived to indicate differences in quality and safety.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_2",
            "start": 115,
            "end": 319,
            "label": {}
        },
        {
            "ix": "2-155_v2_2@2",
            "content": "However, whether these categories vary in the frequency of contamination with antibiotic-resistant E. coli is unknown.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_2",
            "start": 321,
            "end": 438,
            "label": {}
        },
        {
            "ix": "2-155_v2_2@3",
            "content": "We examined the occurrence of antibiotic-resistant E. coli on raw chicken marketed as conventional, organic, kosher and RWA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_2",
            "start": 440,
            "end": 563,
            "label": {}
        },
        {
            "ix": "2-155_v2_2@4",
            "content": "From April – June 2012, we purchased 213 samples of raw chicken from 15 locations in the New York City metropolitan area.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_2",
            "start": 565,
            "end": 685,
            "label": {}
        },
        {
            "ix": "2-155_v2_2@5",
            "content": "We screened E. coli isolates from each sample for resistance to 12 common antibiotics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_2",
            "start": 687,
            "end": 772,
            "label": {}
        },
        {
            "ix": "2-155_v2_2@6",
            "content": "Although the organic and RWA labels restrict the use of antibiotics, the frequency of antibiotic-resistant E. coli tended to be only slightly lower for RWA, and organic chicken was statistically indistinguishable from conventional products that have no restrictions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_2",
            "start": 774,
            "end": 1039,
            "label": {}
        },
        {
            "ix": "2-155_v2_2@7",
            "content": "Kosher chicken had the highest frequency of antibiotic-resistant E. coli , nearly twice that of conventional products, a result that belies the historical roots of kosher as a means to ensure food safety.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_2",
            "start": 1041,
            "end": 1244,
            "label": {}
        },
        {
            "ix": "2-155_v2_2@8",
            "content": "These results indicate that production methods influence the frequency of antibiotic-resistant E. coli on poultry products available to consumers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_2",
            "start": 1246,
            "end": 1391,
            "label": {}
        },
        {
            "ix": "2-155_v2_2@9",
            "content": "Future research to identify the specific practices that cause the high frequency of antibiotic-resistant E. coli in kosher chicken could promote efforts to reduce consumer exposure to this potential pathogen.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_2",
            "start": 1393,
            "end": 1600,
            "label": {}
        },
        {
            "ix": "2-155_v2_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-155_v2_4@0",
            "content": "The use of antibiotics in livestock production may pose health risks to humans, as such usage has been correlated with the occurrence of antibiotic-resistant bacteria isolated from human infections <REF-1> , <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_4",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "2-155_v2_4@1",
            "content": "Methods of livestock production differ in antibiotic use, and this can influence the frequency of antibiotic-resistant bacteria on retail meats.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_4",
            "start": 218,
            "end": 361,
            "label": {}
        },
        {
            "ix": "2-155_v2_4@2",
            "content": "For example, antibiotic-resistant Escherichia coli has been shown to be less common on poultry raised without antibiotics (RWA) as compared to poultry raised conventionally <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_4",
            "start": 363,
            "end": 544,
            "label": {}
        },
        {
            "ix": "2-155_v2_4@3",
            "content": "Likewise, organic poultry can have lower frequencies of antibiotic-resistant bacteria than poultry raised conventionally <REF-4> – <REF-10> , although this is not always the case <REF-11> – <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_4",
            "start": 546,
            "end": 745,
            "label": {}
        },
        {
            "ix": "2-155_v2_4@4",
            "content": "Organic, RWA, and kosher food products supply a growing market niche <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_4",
            "start": 747,
            "end": 825,
            "label": {}
        },
        {
            "ix": "2-155_v2_4@5",
            "content": "Consumers perceive that they offer health benefits <REF-14> – <REF-21> and are willing to pay a premium for them <REF-22> – <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_4",
            "start": 827,
            "end": 960,
            "label": {}
        },
        {
            "ix": "2-155_v2_4@6",
            "content": "The actual health benefits of organic food are not always clear <REF-25> , and the health benefits of kosher foods are largely anecdotal.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_4",
            "start": 962,
            "end": 1098,
            "label": {}
        },
        {
            "ix": "2-155_v2_4@7",
            "content": "Little is known about the frequency of antibiotic-resistant microorganisms on kosher products.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_4",
            "start": 1100,
            "end": 1193,
            "label": {}
        },
        {
            "ix": "2-155_v2_5@0",
            "content": "The organic and RWA labels require specific production methods as stipulated in US federal regulations, whereas the kosher label adheres to religious requirements that are regulated privately.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_5",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "2-155_v2_5@1",
            "content": "The RWA label requires that “livestock have never received antibiotics from birth to harvest” <REF-26> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_5",
            "start": 193,
            "end": 296,
            "label": {}
        },
        {
            "ix": "2-155_v2_5@2",
            "content": "The United States Department of Agriculture (USDA) organic standard is only slightly less strict, stipulating that “The producer of an organic livestock operation must not sell, label, or represent as organic any animal or edible product derived from any animal treated with antibiotics”, but also that “Poultry or edible poultry products must be from poultry that has been under continuous organic management beginning no later than the second day of life” <REF-26> , <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_5",
            "start": 298,
            "end": 776,
            "label": {}
        },
        {
            "ix": "2-155_v2_5@3",
            "content": "Therefore, injecting antibiotics into eggs or administering them during the first 24 hours of the chick’s life will not violate the letter of the USDA organic standard <REF-28> , <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_5",
            "start": 778,
            "end": 966,
            "label": {}
        },
        {
            "ix": "2-155_v2_5@4",
            "content": "Kosher production differs from organic and RWA in that it is inherently predicated on religious requirements.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_5",
            "start": 968,
            "end": 1076,
            "label": {}
        },
        {
            "ix": "2-155_v2_5@5",
            "content": "For kosher meat, the major requirements are that it must be from animals that have split hooves and chew their cud, it must not be mixed with dairy products, and all equipment used must be used exclusively for kosher food <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_5",
            "start": 1078,
            "end": 1309,
            "label": {}
        },
        {
            "ix": "2-155_v2_5@6",
            "content": "Animals must be slaughtered “humanely”, and meat is typically salted to remove blood rapidly, a practice that has been shown to reduce the microbial load <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_5",
            "start": 1311,
            "end": 1474,
            "label": {}
        },
        {
            "ix": "2-155_v2_5@7",
            "content": "Unlike for organic and RWA, kosher poultry is not regulated by Federal laws but rather by private certification organizations, and thus the specific practices vary <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_5",
            "start": 1476,
            "end": 1649,
            "label": {}
        },
        {
            "ix": "2-155_v2_6@0",
            "content": "Here, we compared four major types of poultry-conventional, kosher, organic, and RWA-in order to assess the frequency of contamination with antibiotic-resistant E. coli .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_6",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "2-155_v2_6@1",
            "content": "We focused on poultry products from a major metropolitan center (the greater New York City area) and products available to typical consumers by studying multiple brands of chicken from multiple stores.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_6",
            "start": 171,
            "end": 371,
            "label": {}
        },
        {
            "ix": "2-155_v2_6@2",
            "content": "Our goal was to compare the frequency of antibiotic-resistant E. coli in these four categories of chicken.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_6",
            "start": 373,
            "end": 478,
            "label": {}
        },
        {
            "ix": "2-155_v2_7@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_7",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-155_v2_8@0",
            "content": "Sample collection",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_8",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "2-155_v2_9@0",
            "content": "During April–June 2012, raw chicken was purchased from supermarkets, butcher shops, specialty stores, and food distributors in the greater New York City area.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_9",
            "start": 0,
            "end": 157,
            "label": {}
        },
        {
            "ix": "2-155_v2_9@1",
            "content": "A variety of widely available brands were procured in four categories: conventional, kosher, organic and RWA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_9",
            "start": 159,
            "end": 267,
            "label": {}
        },
        {
            "ix": "2-155_v2_9@2",
            "content": "Within each category of chicken purchased, we collected at least four samples of each brand.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_9",
            "start": 269,
            "end": 360,
            "label": {}
        },
        {
            "ix": "2-155_v2_9@3",
            "content": "Some samples included more than one category (e.g., kosher and organic).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_9",
            "start": 362,
            "end": 433,
            "label": {}
        },
        {
            "ix": "2-155_v2_9@4",
            "content": "Five collections occurred resulting in 213 total samples.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_9",
            "start": 435,
            "end": 491,
            "label": {}
        },
        {
            "ix": "2-155_v2_9@5",
            "content": "Samples were drumsticks or samples from which drumsticks were removed for analysis (all with skin).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_9",
            "start": 493,
            "end": 591,
            "label": {}
        },
        {
            "ix": "2-155_v2_9@6",
            "content": "After purchase, each chicken sample was placed in a labeled, ziplock bag, and placed in a cooler with ice packs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_9",
            "start": 593,
            "end": 704,
            "label": {}
        },
        {
            "ix": "2-155_v2_9@7",
            "content": "Three coolers with ice packs were shipped overnight to T-Gen North within two days of collection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_9",
            "start": 706,
            "end": 802,
            "label": {}
        },
        {
            "ix": "2-155_v2_10@0",
            "content": "Laboratory analyses",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_10",
            "start": 0,
            "end": 18,
            "label": {}
        },
        {
            "ix": "2-155_v2_11@0",
            "content": "Chicken samples arrived at the laboratory in their original packaging and were refrigerated at 4°C until processed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_11",
            "start": 0,
            "end": 114,
            "label": {}
        },
        {
            "ix": "2-155_v2_11@1",
            "content": "One putative E. coli strain was isolated and screened from each sample using standard methods for assaying for antimicrobial resistance described by the Clinical and Laboratory Standards Institute (CLSI) <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_11",
            "start": 116,
            "end": 329,
            "label": {}
        },
        {
            "ix": "2-155_v2_11@2",
            "content": "The use of one strain per sample enabled efficient testing among a population of chicken samples for differences in the frequency of antibiotic resistance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_11",
            "start": 331,
            "end": 485,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@0",
            "content": "One whole drumstick was selected from each package or removed from each whole chicken sample using a sterilized knife.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 0,
            "end": 117,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@1",
            "content": "Each sample was transferred aseptically to a Stomacher Bag (VWR, Radon, PA, USA, catalog number 11216–902) containing 250 ml MacConkey broth (Alpha Biosciences, Baltimore, MD) and agitated at speed 7 for 3 min on a rocking platform shaker (VWR, Radon, PA, USA, model no. 40000–302) and incubated overnight at 44°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 119,
            "end": 432,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@2",
            "content": "A 10 μl loop was used to inoculate a VRBA+MUG (Teknova, Hollister, CA) plate with the enriched broth.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 434,
            "end": 534,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@3",
            "content": "The plate was incubated at 37°C for 2 h and then at 44°C for 22 h, along with QA/QC strains ATCC E. coli 35218, Klebsiella pneumoniae , Hafnia alvei , Citrobacter freundii and Serratia plymuthica.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 536,
            "end": 731,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@4",
            "content": "QA/QC strains not listed as ATCC were isolated and identified using the BD Phoenix at Flagstaff Medical Center.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 733,
            "end": 843,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@5",
            "content": "From each VRBA+MUG plate, four putative E. coli colonies were streaked to CHROMagar (Hardy Diagnostics, Santa Maria, CA) and incubated 20 to 24 h at 37°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 845,
            "end": 998,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@6",
            "content": "One putative E. coli colony, appearing pink to rose, was streaked to a second CHROMagar plate and incubated 20 to 24 h at 37°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 1000,
            "end": 1126,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@7",
            "content": "For each sample, a putative E. coli isolate was inoculated into an assigned well of a 96-well plate containing 75 µl of Tris EDTA (TE) buffer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 1128,
            "end": 1269,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@8",
            "content": "DNA was released from cell suspension with a thermal cycler (Bio-Rad, Hercules, CA) using the following parameters: heated lid, 95°C; block temperature, 90°C for 15 min.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 1271,
            "end": 1439,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@9",
            "content": "To confirm the identity of putative E. coli isolates, a uidA qPCR assay and a universal bacterial qPCR (BactQuant <REF-32> ) were used.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 1441,
            "end": 1575,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@10",
            "content": "For each reaction, 2 μl of DNA was added into 8 μl of master mix, with the final reaction containing 1.8 μM of each forward and reverse uidA primer, 0.25 μM uidA- VIC probe, 0.90 μM of each forward and reverse Pan16S primer, 0.25 μM Pan16S-FAM probe, 1X QuantaPerfeCTa ® Multiplex qPCR SuperMix w⁄ROX (Quanta Biosciences, Gaithersburg, MD) and molecular-grade water.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 1577,
            "end": 1942,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@11",
            "content": "All samples were run in triplicate and each experiment included a standard curve and no-template controls.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 1944,
            "end": 2049,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@12",
            "content": "The 7900HT Real-Time PCR System (Applied Biosystems, Carlsbad, CA) was used to run the reactions with following conditions: 3 min at 50°C for UNG treatment, 10 min at 95°C for Taq activation, 15 s at 95°C for denaturation and 1 min at 60°C for annealing and extension × 40 cycles.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 2051,
            "end": 2330,
            "label": {}
        },
        {
            "ix": "2-155_v2_12@13",
            "content": "Six isolates were excluded from further analysis because they were not confirmed as E. coli using the qPCR assay.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_12",
            "start": 2332,
            "end": 2444,
            "label": {}
        },
        {
            "ix": "2-155_v2_13@0",
            "content": "Guidelines from the Clinical and Laboratory Standards Institute (CLSI) for disk diffusion methods <REF-31> were used to test each strain for resistance to antibiotics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_13",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "2-155_v2_13@1",
            "content": "Some strains did not grow under assay conditions (n=23) and were excluded from further analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_13",
            "start": 168,
            "end": 263,
            "label": {}
        },
        {
            "ix": "2-155_v2_13@2",
            "content": "Twelve antibiotics were tested, representing seven classes of drugs: tetracycline (class, tetracyclines); ampicillin and ampicillin sulbactam (class, penicillins); cefazolin, cefoxitin, and ceftriaxone (class, cephalosporins); gentamicin and amikacin (class, aminoglycosides); nalidixic acid and ciprofloxacin (class, quinolones); trimethoprim sulfamethoxazole (class, folate pathway inhibitors); and imipenem (class, carbapenems) (VWR, Radon, PA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_13",
            "start": 265,
            "end": 712,
            "label": {}
        },
        {
            "ix": "2-155_v2_13@3",
            "content": "Breakpoint guidelines from the CLSI M100 Tables 2A through 2J for E. coli <REF-31> were used to classify strains into “resistant”, “intermediate” or “susceptible”; designations of “intermediate” were lumped with “resistant” for purposes of statistics and inference, a conservative approach with respect to consumer safety.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_13",
            "start": 714,
            "end": 1035,
            "label": {}
        },
        {
            "ix": "2-155_v2_14@0",
            "content": "Statistical analyses",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_14",
            "start": 0,
            "end": 19,
            "label": {}
        },
        {
            "ix": "2-155_v2_15@0",
            "content": "Analysis of variance (ANOVA) was used to test whether antibiotic resistance varied among the brands of chicken sampled, using SYSTAT 13.1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_15",
            "start": 0,
            "end": 137,
            "label": {}
        },
        {
            "ix": "2-155_v2_15@1",
            "content": "Effects of brand within each category were tested (i.e., using all the data within conventional, organic, kosher, RWA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_15",
            "start": 139,
            "end": 257,
            "label": {}
        },
        {
            "ix": "2-155_v2_15@2",
            "content": "For each drug, Microsoft Excel for Mac Version 14.1.0 was used to conduct chi-square tests to determine whether the frequency of resistance varied among categories of chicken: conventional, organic, kosher and RWA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_15",
            "start": 259,
            "end": 472,
            "label": {}
        },
        {
            "ix": "2-155_v2_16@0",
            "content": "The total number of drugs and drug classes to which each strain was resistant were enumerated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_16",
            "start": 0,
            "end": 93,
            "label": {}
        },
        {
            "ix": "2-155_v2_16@1",
            "content": "One-way ANOVA was used to compare the average number of drugs to which strains were resistant among categories, using samples with only one category designation (n=120).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_16",
            "start": 95,
            "end": 263,
            "label": {}
        },
        {
            "ix": "2-155_v2_16@2",
            "content": "This test captures the effect of a consumer’s choice whether to purchase chicken in one category over another on the likelihood of exposure to antibiotic-resistant E. coli .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_16",
            "start": 265,
            "end": 437,
            "label": {}
        },
        {
            "ix": "2-155_v2_17@0",
            "content": "Multi-factor ANOVA was used to test whether trends held across the broader dataset (n=184), including samples with multiple category designations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_17",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "2-155_v2_17@1",
            "content": "The collection of samples included adequate replication (>14) for every possible two-way combination of labels (organic & kosher, RWA & organic, and RWA & kosher).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_17",
            "start": 147,
            "end": 309,
            "label": {}
        },
        {
            "ix": "2-155_v2_17@2",
            "content": "Replication for the three-way combination (organic, kosher & RWA) was low (n=5), and all samples were from one brand.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_17",
            "start": 311,
            "end": 427,
            "label": {}
        },
        {
            "ix": "2-155_v2_17@3",
            "content": "To avoid bias, these samples were excluded from the ANOVA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_17",
            "start": 429,
            "end": 486,
            "label": {}
        },
        {
            "ix": "2-155_v2_17@4",
            "content": "Each of the three labeling categories was included as a factor in three-way ANOVAs (organic, RWA, and kosher, each with two levels), with the number of drugs and drug classes exhibiting resistance as response variables.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_17",
            "start": 488,
            "end": 706,
            "label": {}
        },
        {
            "ix": "2-155_v2_17@5",
            "content": "This tests for the effect of each category and for interactive effects of combining categories.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_17",
            "start": 708,
            "end": 802,
            "label": {}
        },
        {
            "ix": "2-155_v2_18@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_18",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-155_v2_19@0",
            "content": "Across the entire dataset, resistance to cefazolin was most common (41.3%), followed by ampicillin (31.5%), tetracycline (30.4%), and ampicillin sulbactam (19.6%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_19",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "2-155_v2_19@1",
            "content": "Some resistance was detected for cefoxitin, (12.5%) and gentamicin (10.9% of strains), but no strain was resistant to amikacin, the other aminoglycoside tested.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_19",
            "start": 164,
            "end": 323,
            "label": {}
        },
        {
            "ix": "2-155_v2_19@2",
            "content": "For the quinolones, some (3.3%) of strains were resistant to nalidixic acid, but none was resistant to ciprofloxacin.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_19",
            "start": 325,
            "end": 441,
            "label": {}
        },
        {
            "ix": "2-155_v2_19@3",
            "content": "Resistance was low (3.3%) for trimethoprim sulfamethoxazole, the one folate pathway inhibitor tested, and was absent for imipenem, the one carbapenem tested.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_19",
            "start": 443,
            "end": 599,
            "label": {}
        },
        {
            "ix": "2-155_v2_19@4",
            "content": "Over half of all strains collected exhibited resistance to one or more antibiotics: 55%, 58%, 60%, and 76% from conventional, RWA, organic, and kosher chicken samples, respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_19",
            "start": 601,
            "end": 781,
            "label": {}
        },
        {
            "ix": "2-155_v2_20@0",
            "content": "Within categories of chicken purchased, brands did not vary in the extent of antibiotic resistance ( Table 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_20",
            "start": 0,
            "end": 110,
            "label": {}
        },
        {
            "ix": "2-155_v2_20@1",
            "content": "By contrast, categories of chicken differed in the number of drugs to which strains of E. coli were resistant ( Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_20",
            "start": 112,
            "end": 234,
            "label": {}
        },
        {
            "ix": "2-155_v2_20@2",
            "content": "Strains of E. coli isolated from kosher chicken were resistant to more drugs than were strains from the other categories (Tukey’s HSD comparisons: kosher vs. conventional, P=0.023; kosher vs. organic, P=0.041; kosher vs. RWA, P=0.002).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_20",
            "start": 236,
            "end": 470,
            "label": {}
        },
        {
            "ix": "2-155_v2_21@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_21",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-155_v2_23@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_23",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-155_v2_25@0",
            "content": "These patterns held when analyzing the broader dataset, including the samples with multiple designations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_25",
            "start": 0,
            "end": 104,
            "label": {}
        },
        {
            "ix": "2-155_v2_25@1",
            "content": "Strains of E. coli isolated from kosher chicken samples were resistant to more drugs compared to the other categories ( Figure 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_25",
            "start": 106,
            "end": 236,
            "label": {}
        },
        {
            "ix": "2-155_v2_25@2",
            "content": "Strains of E. coli isolated from samples in the RWA category tended to be resistant to fewer drugs but the difference was not significant versus conventional and organic which did not differ from each other.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_25",
            "start": 238,
            "end": 444,
            "label": {}
        },
        {
            "ix": "2-155_v2_26@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_26",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-155_v2_28@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_28",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "2-155_v2_29@0",
            "content": "Poultry growers use antibiotics both for therapeutic purposes and for growth promotion <REF-33> , <REF-34> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_29",
            "start": 0,
            "end": 107,
            "label": {}
        },
        {
            "ix": "2-155_v2_29@1",
            "content": "Based on a national survey conducted by the USDA of poultry and hog producers in the United States, use of antibiotics at sub-therapeutic levels for growth promotion is common <REF-35> , <REF-36> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_29",
            "start": 109,
            "end": 305,
            "label": {}
        },
        {
            "ix": "2-155_v2_29@2",
            "content": "One estimate places growth promotion in livestock production as the single largest sector in which antibiotics are used in the US, accounting for 70% of the total of 50 million pounds for the year 2008 <REF-37> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_29",
            "start": 307,
            "end": 518,
            "label": {}
        },
        {
            "ix": "2-155_v2_29@3",
            "content": "The use of antibiotics in poultry production can select for antibiotic-resistant microorganisms including Salmonella , Campylobacter , Enterococcus , and extra-intestinal pathogenic E. coli <REF-38> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_29",
            "start": 520,
            "end": 719,
            "label": {}
        },
        {
            "ix": "2-155_v2_29@4",
            "content": "Studies of E. coli from bloodstream infections in Europe suggest that poultry are an important source of antibiotic-resistant infections <REF-39> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_29",
            "start": 721,
            "end": 867,
            "label": {}
        },
        {
            "ix": "2-155_v2_29@5",
            "content": "Use of antibiotics is restricted in production of chicken carrying the USDA organic and USDA RWA labels.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_29",
            "start": 869,
            "end": 972,
            "label": {}
        },
        {
            "ix": "2-155_v2_29@6",
            "content": "Like conventional chicken, chicken with a certified kosher label does not indicate any special restrictions in the use of antibiotics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_29",
            "start": 974,
            "end": 1107,
            "label": {}
        },
        {
            "ix": "2-155_v2_30@0",
            "content": "Our finding that brands within categories did not differ significantly in the extent of antibiotic resistant E. coli ( Table 1 ) could arise from the fact that individual brands of chicken obtain product from multiple farms whose production practices may differ, obscuring clear patterns associated with individual brands.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_30",
            "start": 0,
            "end": 321,
            "label": {}
        },
        {
            "ix": "2-155_v2_30@1",
            "content": "Our ability to detect an effect of brand might also be constrained by low statistical power.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_30",
            "start": 323,
            "end": 414,
            "label": {}
        },
        {
            "ix": "2-155_v2_30@2",
            "content": "Our finding that the frequency of antibiotic resistant strains of E. coli on organic poultry did not differ significantly from conventional ( Figure 1 and Figure 2 ) reflects some past studies in this area that have found no difference in antibiotic resistance between organic and conventional practices <REF-11> – <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_30",
            "start": 416,
            "end": 740,
            "label": {}
        },
        {
            "ix": "2-155_v2_30@3",
            "content": "Others found that pathogens on organic or RWA poultry products had lower resistance to antibiotics compared to conventional products <REF-4> , <REF-10> , <REF-40> – <REF-43> , which was the trend we observed for RWA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_30",
            "start": 742,
            "end": 957,
            "label": {}
        },
        {
            "ix": "2-155_v2_30@4",
            "content": "The distinction between USDA organic from USDA RWA may be important, given that organic chicks can receive antibiotics via in ovo injections and during the first day of life.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_30",
            "start": 959,
            "end": 1132,
            "label": {}
        },
        {
            "ix": "2-155_v2_30@5",
            "content": "Previous studies have provided unequivocal evidence that even in ovo injection of antibiotics can affect the susceptibility of the bacteria that contaminate poultry products <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_30",
            "start": 1134,
            "end": 1316,
            "label": {}
        },
        {
            "ix": "2-155_v2_30@6",
            "content": "With a larger sample, the tendency for E. coli isolated from RWA samples to have lower frequency of antibiotic resistance than other categories (P=0.122; Figure 1 and Figure 2 ) may emerge as significant.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_30",
            "start": 1318,
            "end": 1521,
            "label": {}
        },
        {
            "ix": "2-155_v2_31@0",
            "content": "Cross-contamination is another possible source of antibiotic resistance <REF-44> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_31",
            "start": 0,
            "end": 81,
            "label": {}
        },
        {
            "ix": "2-155_v2_31@1",
            "content": "Shared facilities for product and slaughter could promote cross-contamination and antibiotic strains could be spread among organism and environments <REF-45> , <REF-46> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_31",
            "start": 83,
            "end": 252,
            "label": {}
        },
        {
            "ix": "2-155_v2_31@2",
            "content": "Poultry could then be inadvertently exposed to antibiotic-resistant E. coli .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_31",
            "start": 254,
            "end": 330,
            "label": {}
        },
        {
            "ix": "2-155_v2_31@3",
            "content": "For example, companies with both conventional and organic products may slaughter in the same facilities, promoting cross-contamination.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_31",
            "start": 332,
            "end": 466,
            "label": {}
        },
        {
            "ix": "2-155_v2_31@4",
            "content": "Production facilities that convert from one practice to another could also experience residual contamination, though there is evidence that converting from conventional to organic can reduce frequency of resistance <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_31",
            "start": 468,
            "end": 691,
            "label": {}
        },
        {
            "ix": "2-155_v2_31@5",
            "content": "The identification of possible cross-contamination is outside the scope of this study, but these possibilities would need to be considered when investigating the sources of antibiotic resistance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_31",
            "start": 693,
            "end": 887,
            "label": {}
        },
        {
            "ix": "2-155_v2_32@0",
            "content": "The increased resistance of E. coli in kosher chicken compared to conventional was surprising, because, while kosher does not stipulate anything about antibiotic use, kosher is perceived as clean and safe to consume <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_32",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "2-155_v2_32@1",
            "content": "The higher resistance found in isolates from kosher chicken ( Figure 1 and Figure 2 ), and the distinct antibiotic-resistance profile ( Table 2 ) suggests that use of antibiotics in the kosher production chain is common and that it may be more intensive than use of antibiotics among conventional, organic, or RWA practices.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_32",
            "start": 227,
            "end": 550,
            "label": {}
        },
        {
            "ix": "2-155_v2_32@2",
            "content": "It is not immediately obvious where in the kosher chicken production process antibiotic use might be more prevalent, or where exposure to antibiotic-resistant organisms is more likely.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_32",
            "start": 552,
            "end": 735,
            "label": {}
        },
        {
            "ix": "2-155_v2_32@3",
            "content": "Consumers perceive organic, kosher and RWA products to be healthier <REF-14> – <REF-21> , though the real health benefits from organic products are unclear <REF-10> , and, to our knowledge, the actual health benefits of kosher have not been assessed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_32",
            "start": 737,
            "end": 986,
            "label": {}
        },
        {
            "ix": "2-155_v2_32@4",
            "content": "Our findings are consistent with the suggestion that some ‘niche market’ products, while perceived to be safer, may have higher incidence of foodborne pathogens compared to conventional products <REF-47> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_32",
            "start": 988,
            "end": 1192,
            "label": {}
        },
        {
            "ix": "2-155_v2_33@0",
            "content": "Table 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_33",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-155_v2_35@0",
            "content": "Our study was limited in geographic and temporal scale, as we focused on the New York metropolitan area over a three-month time period.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_35",
            "start": 0,
            "end": 134,
            "label": {}
        },
        {
            "ix": "2-155_v2_35@1",
            "content": "Yet, the region is large and populous, we focused on the most widely available brands in all categories, and this area particularly offered multiple kosher brands.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_35",
            "start": 136,
            "end": 298,
            "label": {}
        },
        {
            "ix": "2-155_v2_35@2",
            "content": "Our final sample size was limited (n=184) but not atypical for the field <REF-48> – <REF-51> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_35",
            "start": 300,
            "end": 393,
            "label": {}
        },
        {
            "ix": "2-155_v2_35@3",
            "content": "Finally, we only assayed for generic E. coli and did not assess virulence or virulence group assignments for each sample.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_35",
            "start": 395,
            "end": 515,
            "label": {}
        },
        {
            "ix": "2-155_v2_35@4",
            "content": "However, E. coli is a useful focal organism because it is widespread and an important potential pathogen.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_35",
            "start": 517,
            "end": 621,
            "label": {}
        },
        {
            "ix": "2-155_v2_36@0",
            "content": "More studies are needed to test whether antibiotic resistance among kosher products is consistently higher than conventional and other categories.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_36",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "2-155_v2_36@1",
            "content": "Nevertheless, our study offers insight into another area of the food production system increasing the exposure of people to microorganisms that are resistant to antibiotics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_36",
            "start": 147,
            "end": 319,
            "label": {}
        },
        {
            "ix": "2-155_v2_36@2",
            "content": "In addition to regulation, more consistent surveillance or auditing would add of consumer protection, enabling improved purchase decisions based on price and health benefits guided by meaningful labels.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_36",
            "start": 321,
            "end": 522,
            "label": {}
        },
        {
            "ix": "2-155_v2_37@0",
            "content": "<REF-1> Silbergeld EK Graham J Price LB : Industrial food animal production, antimicrobial resistance, and human health. Annu Rev Public Health. 2008 ; 29 : 151 – 169 . 18348709 10.1146/annurev.publhealth.29.020907.090904",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_37",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "2-155_v2_38@0",
            "content": "<REF-2> Dutil L Irwin R Finley R : Ceftiofur resistance in Salmonella enterica serovar Heidelberg from chicken meat and humans, Canada. Emerg Infect Dis. 2010 ; 16 ( 1 ): 48 – 54 . 20031042 10.3201/eid1601.090729 2874360",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_38",
            "start": 0,
            "end": 219,
            "label": {}
        },
        {
            "ix": "2-155_v2_39@0",
            "content": "<REF-3> Zhang J Massow A Stanley M : Contamination rates and antimicrobial resistance in Enterococcus spp., Escherichia coli, and Salmonella Isolated from \"no antibiotics added''-labeled chicken products. Foodborne Pathog Dis. 2011 ; 8 ( 11 ): 1147 – 1152 . 21714636 10.1089/fpd.2011.0852",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_39",
            "start": 0,
            "end": 287,
            "label": {}
        },
        {
            "ix": "2-155_v2_40@0",
            "content": "<REF-4> Miranda JM Guarddon M Mondragon A : Antimicrobial resistance in Enterococcus spp. strains isolated from organic chicken, conventional chicken, and turkey meat: A comparative survey. J Food Prot. 2007 ; 70 ( 4 ): 1021 – 1024 . 17477278",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_40",
            "start": 0,
            "end": 241,
            "label": {}
        },
        {
            "ix": "2-155_v2_41@0",
            "content": "<REF-8> Sapkota AR Hulet RM Zhang G : Lower prevalence of antibiotic-resistant Enterococci on U.S. conventional poultry farms that transitioned to organic practices. Environ Health Perspect. 2011 ; 119 ( 11 ): 1622 – 1628 . 21827979 10.1289/ehp.1003350 3226496",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_41",
            "start": 0,
            "end": 259,
            "label": {}
        },
        {
            "ix": "2-155_v2_42@0",
            "content": "<REF-10> Smith-Spangler C Brandeau ML Hunter GE : Are organic foods safer or healthier than conventional alternatives?: a systematic review. Ann Intern Med. 2012 ; 157 ( 5 ): 348 – 66 . 22944875 10.7326/0003-4819-157-5-201209040-00007",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_42",
            "start": 0,
            "end": 233,
            "label": {}
        },
        {
            "ix": "2-155_v2_43@0",
            "content": "<REF-11> LeJeune JT Christie NP : Microbiological quality of ground beef from conventionally-reared cattle and \"Raised without antibiotics\" label claims. J Food Prot. 2004 ; 67 ( 7 ): 1433 – 1437 . 15270497",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_43",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "2-155_v2_44@0",
            "content": "<REF-13> Luangtongkum T Morishita TY Ison AJ : Effect of conventional and organic production practices on the prevalence and antimicrobial resistance of Campylobacter spp. in poultry. Appl Environ Microbiol. 2006 ; 72 ( 5 ): 3600 – 3607 . 16672508 10.1128/AEM.72.5.3600-3607.2006 1472326",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_44",
            "start": 0,
            "end": 286,
            "label": {}
        },
        {
            "ix": "2-155_v2_45@0",
            "content": "<REF-14> Cohen E Schwartz Z Antonovski R : Consumer perceptions of kosher products. J Foodserv Bus Res. 2002 ; 5 ( 3 ): 69 – 88 . 10.1300/J369v05n03_06",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_45",
            "start": 0,
            "end": 150,
            "label": {}
        },
        {
            "ix": "2-155_v2_46@0",
            "content": "<REF-19> Campbell H Murcott A MacKenzie A : Kosher in New York City, halal in Aquitaine: challenging the relationship between neoliberalism and food auditing. Agric Human Values. 2011 ; 28 ( 1 ): 67 – 79 . 10.1007/s10460-010-9260-3",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_46",
            "start": 0,
            "end": 230,
            "label": {}
        },
        {
            "ix": "2-155_v2_47@0",
            "content": "<REF-21> Shafie FA Rennie D : Consumer Perceptions towards Organic Food . In: Abbass MY, Bajunid AFI, editors. Proceedings of the 1st National Conference on Environment-Behaviour Studies. Amsterdam: Elsevier Science Bv. 2012 ; 49 : 360 – 367 . 10.1016/j.sbspro.2012.07.034",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_47",
            "start": 0,
            "end": 271,
            "label": {}
        },
        {
            "ix": "2-155_v2_48@0",
            "content": "<REF-22> Batte MT Hooker NH Haab TC : Putting their money where their mouths are: Consumer willingness to pay for multi-ingredient, processed organic food products. Food Policy. 2007 ; 32 ( 2 ): 145 – 159 . 10.1016/j.foodpol.2006.05.003",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_48",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "2-155_v2_49@0",
            "content": "<REF-24> Yiridoe EK Bonti-Ankomah S Martin RC : Comparison of consumer perceptions and preference toward organic versus conventionally produced foods: A review and update of the literature. Renew Agric Food Syst. 2005 ; 20 ( 4 ): 193 – 205 . 10.1079/RAF2005113",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_49",
            "start": 0,
            "end": 259,
            "label": {}
        },
        {
            "ix": "2-155_v2_50@0",
            "content": "<REF-25> Brandt K Leifert C Sanderson R : Agroecosystem Management and Nutritional Quality of Plant Foods: The Case of Organic Fruits and Vegetables. CRC Crit Rev Plant Sci. 2011 ; 30 ( 1–2 ): 177 – 197 . 10.1080/07352689.2011.554417",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_50",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "2-155_v2_51@0",
            "content": "<REF-26> USDA United States Standards for Livestock and Meat Marketing Claims . In: Agriculture USDo, editor. FR 79552: Federal Register 2002 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_51",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "2-155_v2_52@0",
            "content": "<REF-27> Code of Federal Regulations t, part 205, subpart C. National Organic Program, Organic Production and Handling Requirements . In: Regulations CoF, editor. 7. Code of Federal Regulations 2012 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_52",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "2-155_v2_53@0",
            "content": "<REF-28> Crandall PG Seideman S Ricke SC : Organic poultry: Consumer perceptions, opportunities, and regulatory issues. J Appl Poult Res. 2009 ; 18 ( 4 ): 795 – 802 . 10.3382/japr.2009-00025",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_53",
            "start": 0,
            "end": 189,
            "label": {}
        },
        {
            "ix": "2-155_v2_54@0",
            "content": "<REF-29> Fanatico AC Owens CM Emmert JL : Organic poultry production in the United States: Broilers. J Appl Poult Res. 2009 ; 18 ( 2 ): 355 – 366 . 10.3382/japr.2008-00123",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_54",
            "start": 0,
            "end": 170,
            "label": {}
        },
        {
            "ix": "2-155_v2_55@0",
            "content": "<REF-30> Shin D Kakani G Molina VA : Effect of kosher salt application on microbial profiles of poultry carcasses. Poult Sci. 2012 ; 91 ( 12 ): 3247 – 3252 . 23155037 10.3382/ps.2012-02457",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_55",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "2-155_v2_56@0",
            "content": "<REF-31> Clinical and Laboratory Stnadards Institute. Performance Standards for Antimicrobial Susceptibility Testing M100–S21 . 940 West Valley Road, Suite 1400, Wayne, Pennsylvania 19087–1898, USA: Clinical and Laboratory. 2011 ; Standards Institute. pp. 178. Accessed 21 June 2013 from . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_56",
            "start": 0,
            "end": 305,
            "label": {}
        },
        {
            "ix": "2-155_v2_57@0",
            "content": "<REF-32> Liu CM Aziz M Kachur S : BactQuant: An enhanced broad-coverage bacterial quantitative real-time PCR assay. BMC Microbiol. 2012 ; 12 : 56 . 22510143 10.1186/1471-2180-12-56 3464140",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_57",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "2-155_v2_58@0",
            "content": "<REF-33> MacDonald JM Wang SL : Foregoing sub-therapeutic antibiotics: the impact on broiler grow-out operations. Appl Econ Perspect Policy. 2011 ; 33 ( 1 ): 79 – 98 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_58",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "2-155_v2_59@0",
            "content": "<REF-34> Ricke SC Jarquin R Hanning I : Antimicrobials in animal feed: benefits and limitations . Pages 411–431, in Animal Feed Contamination, Woodhead Publishing Series in Food Science, Technology and Nutrition No. 215. ISBN 978 1 84569 715 9. 10.1533/9780857093615",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_59",
            "start": 0,
            "end": 265,
            "label": {}
        },
        {
            "ix": "2-155_v2_60@0",
            "content": "<REF-35> MacDonald JM Wang SL : Subtherapeutic Antibiotics and U.S. Broiler Production . Economic Research Service, U.S. Department of Agriculture. Agricultural & Applied Economics Association’s 2009 AAEA & ACCI Joint Annual Meeting, Milwaukee, WI, July 26–28, 2009 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_60",
            "start": 0,
            "end": 283,
            "label": {}
        },
        {
            "ix": "2-155_v2_61@0",
            "content": "<REF-36> McBride WD Key N Mathews K : Sub-therapeutic Antibiotics and Productivity in U.S. Hog Production. Rev Agric Econ. 2008 ; 30 ( 2 ): 270 – 288 . 10.1111/j.1467-9353.2008.00404.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_61",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "2-155_v2_62@0",
            "content": "<REF-37> Dorit R : Routes of resistance. Am Sci. 2009 ; 97 : 20 – 22 . 10.1511/2009.76.20",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_62",
            "start": 0,
            "end": 88,
            "label": {}
        },
        {
            "ix": "2-155_v2_63@0",
            "content": "<REF-38> Davis MF Price LB Liu CM : An ecological perspective on US industrial poultry production: the role of anthropogenic ecosystems on the emergence of drug-resistant bacteria from agricultural environments. Curr Opin Microbiol. 2011 ; 14 ( 3 ): 244 – 250 . 21621451 10.1016/j.mib.2011.04.003",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_63",
            "start": 0,
            "end": 295,
            "label": {}
        },
        {
            "ix": "2-155_v2_64@0",
            "content": "<REF-39> Vieira AR Collignon P Aarestrup FM : Association between antimicrobial resistance in Escherichia coli isolates from food animals and blood stream isolates from humans in Europe: an ecological study. Foodborne Pathog Dis. 2011 ; 8 ( 12 ): 1295 – 1301 . 21883007 10.1089/fpd.2011.0950",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_64",
            "start": 0,
            "end": 290,
            "label": {}
        },
        {
            "ix": "2-155_v2_65@0",
            "content": "<REF-40> Cui S Ge B Zheng J : Prevalence and antimicrobial resistance of Campylobacter spp. and Salmonella serovars in organic chickens from Maryland retail stores. Appl Environ Microbiol. 2005 ; 71 ( 12 ): 4108 – 4111 . 16000828 10.1128/AEM.71.7.4108-4111.2005 1169031",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_65",
            "start": 0,
            "end": 268,
            "label": {}
        },
        {
            "ix": "2-155_v2_66@0",
            "content": "<REF-43> Lestari SI Han F Wang F : Prevalence and antimicrobial resistance of Salmonella serovars in conventional and organic chickens from Louisiana retail stores. J Food Prot. 2009 ; 72 ( 6 ): 1165 – 1172 . 19610326",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_66",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "2-155_v2_67@0",
            "content": "<REF-44> Smith JL Drum DJ Dai Y : Impact of antimicrobial usage on antimicrobial resistance in commensal Escherichia coli strains colonizing broiler chickens. Appl Environ Microbiol. 2007 ; 73 ( 5 ): 1404 – 1414 . 17194843 10.1128/AEM.01193-06 1828781",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_67",
            "start": 0,
            "end": 250,
            "label": {}
        },
        {
            "ix": "2-155_v2_68@0",
            "content": "<REF-45> Moodley A Guardabassi L : Clonal spread of methicillin-resistant coagulase-negative staphylococci among horses, personnel and environmental sites at equine facilities. Vet Microbiol. 2009 ; 137 ( 3–4 ): 397 – 401 . 19251386 10.1016/j.vetmic.2009.01.034",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_68",
            "start": 0,
            "end": 260,
            "label": {}
        },
        {
            "ix": "2-155_v2_69@0",
            "content": "<REF-46> Graham JP Leibler JH Price LB : The animal-human interface and infectious disease in industrial food animal production: Rethinking biosecurity and biocontainment. Public Health Rep. 2008 ; 123 ( 3 ): 282 – 299 . 19006971 2289982",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_69",
            "start": 0,
            "end": 236,
            "label": {}
        },
        {
            "ix": "2-155_v2_70@0",
            "content": "<REF-47> Fox JT Reinstein S Jacob ME : Niche marketing production practices for beef cattle in the United States and prevalence of foodborne pathogens. Foodborne Pathog Dis. 2008 ; 5 ( 5 ): 559 – 569 . 18681794 10.1089/fpd.2008.0094",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_70",
            "start": 0,
            "end": 231,
            "label": {}
        },
        {
            "ix": "2-155_v2_71@0",
            "content": "<REF-48> Cui S Ge B Zheng J : Prevalence and antimicrobial resistance of Campylobacter spp. and Salmonella serovars in organic chickens from Maryland retail stores. Appl Environ Microbiol. 2005 ; 71 ( 7 ): 4108 – 4111 . 16000828 10.1128/AEM.71.7.4108-4111.2005 1169031",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_71",
            "start": 0,
            "end": 267,
            "label": {}
        },
        {
            "ix": "2-155_v2_72@0",
            "content": "<REF-51> Miranda JM Guarddon M Vázquez BI : Antimicrobial resistance in Enterobacteriaceae strains isolated from organic chicken, conventional chicken and conventional turkey meat: a comparative survey. Food Control. 2008 ; 19 : 412 – 416 . 10.1016/j.foodcont.2007.05.002",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-155_v2_72",
            "start": 0,
            "end": 270,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "2-155_v2_0",
            "tgt_ix": "2-155_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_1",
            "tgt_ix": "2-155_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_0",
            "tgt_ix": "2-155_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_3",
            "tgt_ix": "2-155_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_3",
            "tgt_ix": "2-155_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_3",
            "tgt_ix": "2-155_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_0",
            "tgt_ix": "2-155_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_7",
            "tgt_ix": "2-155_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_8",
            "tgt_ix": "2-155_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_7",
            "tgt_ix": "2-155_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_10",
            "tgt_ix": "2-155_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_10",
            "tgt_ix": "2-155_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_10",
            "tgt_ix": "2-155_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_7",
            "tgt_ix": "2-155_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_14",
            "tgt_ix": "2-155_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_14",
            "tgt_ix": "2-155_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_14",
            "tgt_ix": "2-155_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_0",
            "tgt_ix": "2-155_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_18",
            "tgt_ix": "2-155_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_18",
            "tgt_ix": "2-155_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_18",
            "tgt_ix": "2-155_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_21",
            "tgt_ix": "2-155_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_18",
            "tgt_ix": "2-155_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_23",
            "tgt_ix": "2-155_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_18",
            "tgt_ix": "2-155_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_18",
            "tgt_ix": "2-155_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_26",
            "tgt_ix": "2-155_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_0",
            "tgt_ix": "2-155_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_28",
            "tgt_ix": "2-155_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_28",
            "tgt_ix": "2-155_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_28",
            "tgt_ix": "2-155_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_28",
            "tgt_ix": "2-155_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_28",
            "tgt_ix": "2-155_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_33",
            "tgt_ix": "2-155_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_28",
            "tgt_ix": "2-155_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_28",
            "tgt_ix": "2-155_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_0",
            "tgt_ix": "2-155_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_1",
            "tgt_ix": "2-155_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_3",
            "tgt_ix": "2-155_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_6",
            "tgt_ix": "2-155_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_7",
            "tgt_ix": "2-155_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_8",
            "tgt_ix": "2-155_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_9",
            "tgt_ix": "2-155_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_10",
            "tgt_ix": "2-155_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_11",
            "tgt_ix": "2-155_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_13",
            "tgt_ix": "2-155_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_14",
            "tgt_ix": "2-155_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_15",
            "tgt_ix": "2-155_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_16",
            "tgt_ix": "2-155_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_17",
            "tgt_ix": "2-155_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_18",
            "tgt_ix": "2-155_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_19",
            "tgt_ix": "2-155_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_20",
            "tgt_ix": "2-155_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_21",
            "tgt_ix": "2-155_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_22",
            "tgt_ix": "2-155_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_23",
            "tgt_ix": "2-155_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_24",
            "tgt_ix": "2-155_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_25",
            "tgt_ix": "2-155_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_26",
            "tgt_ix": "2-155_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_27",
            "tgt_ix": "2-155_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_28",
            "tgt_ix": "2-155_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_30",
            "tgt_ix": "2-155_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_32",
            "tgt_ix": "2-155_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_33",
            "tgt_ix": "2-155_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_34",
            "tgt_ix": "2-155_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_35",
            "tgt_ix": "2-155_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_37",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_38",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_39",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_40",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_41",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_42",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_43",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_44",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_45",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_46",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_48",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_11",
            "tgt_ix": "2-155_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_30",
            "tgt_ix": "2-155_v2_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_30",
            "tgt_ix": "2-155_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_32",
            "tgt_ix": "2-155_v2_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_35",
            "tgt_ix": "2-155_v2_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_35",
            "tgt_ix": "2-155_v2_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_20",
            "tgt_ix": "2-155_v2_22",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_20",
            "tgt_ix": "2-155_v2_24",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_25",
            "tgt_ix": "2-155_v2_27",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_32",
            "tgt_ix": "2-155_v2_34",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-155_v2_0",
            "tgt_ix": "2-155_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_1",
            "tgt_ix": "2-155_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_2@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_2@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_2@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_2",
            "tgt_ix": "2-155_v2_2@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_3",
            "tgt_ix": "2-155_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_4@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_4",
            "tgt_ix": "2-155_v2_4@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_5@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_5@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_5@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_5",
            "tgt_ix": "2-155_v2_5@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_6",
            "tgt_ix": "2-155_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_6",
            "tgt_ix": "2-155_v2_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_6",
            "tgt_ix": "2-155_v2_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_7",
            "tgt_ix": "2-155_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_8",
            "tgt_ix": "2-155_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_9",
            "tgt_ix": "2-155_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_9",
            "tgt_ix": "2-155_v2_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_9",
            "tgt_ix": "2-155_v2_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_9",
            "tgt_ix": "2-155_v2_9@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_9",
            "tgt_ix": "2-155_v2_9@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_9",
            "tgt_ix": "2-155_v2_9@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_9",
            "tgt_ix": "2-155_v2_9@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_9",
            "tgt_ix": "2-155_v2_9@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_10",
            "tgt_ix": "2-155_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_11",
            "tgt_ix": "2-155_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_11",
            "tgt_ix": "2-155_v2_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_11",
            "tgt_ix": "2-155_v2_11@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_12",
            "tgt_ix": "2-155_v2_12@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_13",
            "tgt_ix": "2-155_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_13",
            "tgt_ix": "2-155_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_13",
            "tgt_ix": "2-155_v2_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_13",
            "tgt_ix": "2-155_v2_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_14",
            "tgt_ix": "2-155_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_15",
            "tgt_ix": "2-155_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_15",
            "tgt_ix": "2-155_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_15",
            "tgt_ix": "2-155_v2_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_16",
            "tgt_ix": "2-155_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_16",
            "tgt_ix": "2-155_v2_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_16",
            "tgt_ix": "2-155_v2_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_17",
            "tgt_ix": "2-155_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_17",
            "tgt_ix": "2-155_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_17",
            "tgt_ix": "2-155_v2_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_17",
            "tgt_ix": "2-155_v2_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_17",
            "tgt_ix": "2-155_v2_17@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_17",
            "tgt_ix": "2-155_v2_17@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_18",
            "tgt_ix": "2-155_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_19",
            "tgt_ix": "2-155_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_19",
            "tgt_ix": "2-155_v2_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_19",
            "tgt_ix": "2-155_v2_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_19",
            "tgt_ix": "2-155_v2_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_19",
            "tgt_ix": "2-155_v2_19@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_20",
            "tgt_ix": "2-155_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_20",
            "tgt_ix": "2-155_v2_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_20",
            "tgt_ix": "2-155_v2_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_21",
            "tgt_ix": "2-155_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_23",
            "tgt_ix": "2-155_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_25",
            "tgt_ix": "2-155_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_25",
            "tgt_ix": "2-155_v2_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_25",
            "tgt_ix": "2-155_v2_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_26",
            "tgt_ix": "2-155_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_28",
            "tgt_ix": "2-155_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_29@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_29@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_29@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_29@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_29@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_29",
            "tgt_ix": "2-155_v2_29@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_30",
            "tgt_ix": "2-155_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_30",
            "tgt_ix": "2-155_v2_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_30",
            "tgt_ix": "2-155_v2_30@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_30",
            "tgt_ix": "2-155_v2_30@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_30",
            "tgt_ix": "2-155_v2_30@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_30",
            "tgt_ix": "2-155_v2_30@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_30",
            "tgt_ix": "2-155_v2_30@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_31@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_31@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_31",
            "tgt_ix": "2-155_v2_31@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_32",
            "tgt_ix": "2-155_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_32",
            "tgt_ix": "2-155_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_32",
            "tgt_ix": "2-155_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_32",
            "tgt_ix": "2-155_v2_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_32",
            "tgt_ix": "2-155_v2_32@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_33",
            "tgt_ix": "2-155_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_35",
            "tgt_ix": "2-155_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_35",
            "tgt_ix": "2-155_v2_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_35",
            "tgt_ix": "2-155_v2_35@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_35",
            "tgt_ix": "2-155_v2_35@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_35",
            "tgt_ix": "2-155_v2_35@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_36",
            "tgt_ix": "2-155_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_36",
            "tgt_ix": "2-155_v2_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_36",
            "tgt_ix": "2-155_v2_36@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_37",
            "tgt_ix": "2-155_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_38",
            "tgt_ix": "2-155_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_39",
            "tgt_ix": "2-155_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_40",
            "tgt_ix": "2-155_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_41",
            "tgt_ix": "2-155_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_42",
            "tgt_ix": "2-155_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_43",
            "tgt_ix": "2-155_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_44",
            "tgt_ix": "2-155_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_45",
            "tgt_ix": "2-155_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_46",
            "tgt_ix": "2-155_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_47",
            "tgt_ix": "2-155_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_48",
            "tgt_ix": "2-155_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_49",
            "tgt_ix": "2-155_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_50",
            "tgt_ix": "2-155_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_51",
            "tgt_ix": "2-155_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_52",
            "tgt_ix": "2-155_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_53",
            "tgt_ix": "2-155_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_54",
            "tgt_ix": "2-155_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_55",
            "tgt_ix": "2-155_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_56",
            "tgt_ix": "2-155_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_57",
            "tgt_ix": "2-155_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_58",
            "tgt_ix": "2-155_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_59",
            "tgt_ix": "2-155_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_60",
            "tgt_ix": "2-155_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_61",
            "tgt_ix": "2-155_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_62",
            "tgt_ix": "2-155_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_63",
            "tgt_ix": "2-155_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_64",
            "tgt_ix": "2-155_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_65",
            "tgt_ix": "2-155_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_66",
            "tgt_ix": "2-155_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_67",
            "tgt_ix": "2-155_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_68",
            "tgt_ix": "2-155_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_69",
            "tgt_ix": "2-155_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_70",
            "tgt_ix": "2-155_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_71",
            "tgt_ix": "2-155_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-155_v2_72",
            "tgt_ix": "2-155_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "2-155_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.2-155.v2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/3.0/",
        "title": "Prevalence of antibiotic-resistant \n                     E. coli  in retail chicken: comparing conventional, organic, kosher, and raised without antibiotics",
        "abstract": "Retail poultry products are known sources of antibiotic-resistant Escherichia coli , a major human health concern. Consumers have a range of choices for poultry, including conventional, organic, kosher, and raised without antibiotics (RWA) – designations that are perceived to indicate differences in quality and safety. However, whether these categories vary in the frequency of contamination with antibiotic-resistant E. coli is unknown. We examined the occurrence of antibiotic-resistant E. coli on raw chicken marketed as conventional, organic, kosher and RWA. From April – June 2012, we purchased 213 samples of raw chicken from 15 locations in the New York City metropolitan area. We screened E. coli isolates from each sample for resistance to 12 common antibiotics. Although the organic and RWA labels restrict the use of antibiotics, the frequency of antibiotic-resistant E. coli tended to be only slightly lower for RWA, and organic chicken was statistically indistinguishable from conventional products that have no restrictions. Kosher chicken had the highest frequency of antibiotic-resistant E. coli , nearly twice that of conventional products, a result that belies the historical roots of kosher as a means to ensure food safety. These results indicate that production methods influence the frequency of antibiotic-resistant E. coli on poultry products available to consumers. Future research to identify the specific practices that cause the high frequency of antibiotic-resistant E. coli in kosher chicken could promote efforts to reduce consumer exposure to this potential pathogen.",
        "contributors": [
            {
                "surname": "Millman",
                "given-names": "Jack M"
            },
            {
                "surname": "Waits",
                "given-names": "Kara"
            },
            {
                "surname": "Grande",
                "given-names": "Heidi"
            },
            {
                "surname": "Marks",
                "given-names": "Ann R"
            },
            {
                "surname": "Marks",
                "given-names": "Jane C"
            },
            {
                "surname": "Price",
                "given-names": "Lance B"
            },
            {
                "surname": "Hungate",
                "given-names": "Bruce A"
            }
        ],
        "url": "https://f1000research.com/articles/2-155/v2/",
        "doc_id": "2-155",
        "version": 2,
        "ix_counter": 308,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}