{
    "nodes": [
        {
            "ix": "6-36_v1_0",
            "content": "Genome-wide characterization of folate transporter proteins of eukaryotic pathogens",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_2",
            "content": "Background: Medically important pathogens are responsible for the death of millions every year. For many of these pathogens, there are limited options for therapy and resistance to commonly used drugs is fast emerging. The availability of genome sequences of many eukaryotic protozoa is providing important data for understanding parasite biology and identifying new drug and vaccine targets. The folate synthesis and salvage pathway are important for eukaryote pathogen survival and organismal biology and may present new targets for drug discovery.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_3",
            "content": "Methods: We applied a combination of bioinformatics methods to examine the genomes of pathogens in the EupathDB for genes encoding homologues of proteins that mediate folate salvage in a bid to identify and assign putative functions. We also performed phylogenetic comparisons of identified proteins. .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_4",
            "content": "Results: We identified 234 proteins to be involve in folate transport in 63 strains, 28 pathogen species and 12 phyla, 60% of which were identified for the first time. Many of the genomes examined contained genes encoding transporters such as folate-binding protein YgfZ, folate/pteridine transporter, folate/biopterin transporter, reduced folate carrier family protein, folate/methotrexate transporter FT1. The mitochondrion is the predicted location of the majority of the proteins, with 15% possessing signal peptides. Phylogeny computation shows the similarity of the proteins identified.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_5",
            "content": "Conclusion: These findings offer new possibilities for potential drug development targeting folate-salvage proteins in eukaryotic pathogens.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_6",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_7",
            "content": "A heterogeneous diversity of eukaryotic pathogens is responsible for the most economically important diseases of humans and animals <REF-1> , <REF-2> . As a result of underdevelopment, a lack of social infrastructure and insufficient funding of public health facilities, most of these pathogens are endemic to resource-poor countries in sub-Saharan Africa, South-East Asia and South America, where they are responsible for high morbidity and mortality <REF-1> – <REF-3> . Of these, parasitic protozoa form a major group, with the apicomplexans and kinetoplastid parasites represented by important members, which cause diseases such as malaria, cryptosporidiosis, toxoplasmosis, babesiosis, leishmaniasis, Human African trypanosomiasis and south American trypanosomiasis or Chagas’ disease causing most of the morbidity and mortality <REF-4> , <REF-5> . Other important diseases caused by protozoans include giardiasis, amoebic dysentery <REF-6> , <REF-7> and trichomoniasis <REF-8> . A vicious cycle of poverty and disease exists for most of these parasites with a high infection and death rate in affected populations <REF-9> – <REF-11> . The appreciable burden of disease caused by these parasites has been aggravated by the lack of a licensed vaccine for most of them <REF-12> . Furthermore, current drugs of choice for treatment for many of the parasites have significant side effects, with the added emergence of drug resistant strains <REF-13> – <REF-15> . Despite the urgent demand for new therapies for control, few drugs have been developed to combat these parasites <REF-16> . A major limitation to the development of new drugs is the paucity of new drug targets. There is therefore a need for discovery of novel and alternate potential chemotherapeutic targets that can help in drug development efforts for disease control <REF-16> – <REF-18> . A possible approach to selective antimicrobial chemotherapy has been to exploit the inhibition of unique targets, vital to the pathogen and absent in mammals <REF-17> , <REF-18> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_8",
            "content": "A metabolic pathway that has been exploited considerably for the development of drugs is the folate biosynthetic pathway <REF-19> . Antifolate drugs target this pathway and are the most important and successful antimicrobial chemotherapies targeting a range of bacterial and eukaryotic pathogens. While most parasitic protozoa can synthesize folates from simple precursors, such as GTP, p-aminobenzoic acid (pABA) and glutamate, higher animals and humans cannot <REF-20> . Additionally, a few of these parasites can also salvage folate as nutrient from their host <REF-21> . These folate compounds are important for synthesis of DNA, RNA and membrane lipids and are transported via receptor-mediated or/and carrier-mediated transmembrane proteins; folate transporters <REF-20> – <REF-22> . Importantly, antifolate chemotherapies that target the biosynthesis and processing of folate cofactors have been effective in the chemotherapy of bacterial and protozoan parasites <REF-21> . More importantly, the folate pathway has also been confirmed as being essential in some eukaryotic pathogens such as Plasmodium , trypanosomes and Leishmania <REF-19> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_9",
            "content": "In addition to the folate biosynthesis pathway, proteins that mediate transport of useful nutrients such as folic acid have been identified as important chemotherapeutic drug targets <REF-18> , <REF-19> , <REF-23> . Hence, the folate pathway, metabolites and transporters continue to be extensively studied for identification of new enzymes including transporters, which may serve as new drug targets <REF-22> . Recent estimates have ascribed eight different membrane transporters to eukaryotes <REF-24> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_10",
            "content": "Proteins that mediate transportation of folates have been well studied in a few parasites such as Plasmodium falciparum, Trypanosoma brucei, Leishmania donovani and Leishmania major <REF-25> , <REF-26> . These studies have provided information on mode of action of drugs <REF-25> , <REF-27> , <REF-28> in addition to studies describing mechanisms of parasite drug resistance <REF-25> – <REF-32> . However, folate transport proteins remain unidentified and uncharacterized in many other eukaryotic pathogens. This is despite the sequencing of the genomes of most eukaryotic pathogens, which has produced a vast wealth of data that could aid in identification of druggable pathogen-specific proteins <REF-33> – <REF-39> . It is therefore imperative to search and identify from these parasite genomes additional proteins such as folate transporters that may serve as novel drug targets <REF-40> , <REF-41> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_11",
            "content": "Therefore, in an attempt to identify and characterize targets for novel therapeutics, we report herein an extensive search of folate transporters from pathogen genomes. In addition, we investigated the evolutionary relationship of these transporters in a bid to determine similarities and differences that make them attractive drug targets. The knowledge provided may assist in the design of new antifolates for protozoan parasites.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_12",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_13",
            "content": "Our experiment workflow is depicted in Figure 1 . We extracted protein sequences of approximately 200 pathogens that mediate transportation or salvage of folates from Eukaryotic Pathogen Genome Database Resources ( http://eupathdb.org/eupathdb/ ), and from the literature using a key-word search. We also searched the 200 pathogen genome sequences archived at the Eukaryotic Pathogen Genome Database Resources ( http://eupathdb.org/eupathdb/ ). The search was for all proteins that mediate transportation or folate salvage alone or folate salvage and related compounds (such as pteridine, biopterin and methotrexate) together. This database gives public access to most sequenced emerging/re-emerging infectious pathogen genomes <REF-42> . We utilized the word “folate” for search on the gene text and “folic acid” was used to confirm the hits. Hit results containing proteins annotated as folate-binding protein YgfZ, folate/pteridine transporter, folate/biopterin transporter, reduced folate carrier family protein, folate/methotrexate transporter FT1, Folate transporters alone and other folate related proteins were retrieved. The complete list of proteins extracted from Eupthadb is presented in Dataset 1 <REF-43> . The folate transporters were classified based on type of transporter, number of transmembrane helix (TMH) and localization (either cell or mitochondrial membrane) of transporter. Gene sequences were obtained in FASTA format for transporter proteins using the sequence download tool on EupathDB ( http://eupathdb.org/eupathdb/ ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_14",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Conceptual hierarchical methodology workflow showing the various steps employed in this study to identify, characterize and curate protozoan folate transporters.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_15",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Conceptual hierarchical methodology workflow showing the various steps employed in this study to identify, characterize and curate protozoan folate transporters.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Conceptual hierarchical methodology workflow showing the various steps employed in this study to identify, characterize and curate protozoan folate transporters.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_16",
            "content": "To ensure that most of the retrieved proteins had not been previously studied, we performed a literature search on PubMed ( http://www.ncbi.nlm.nih.gov/pubmed/?term= ) and Google Scholar ( https://scholar.google.com ) using the query “folate transporter + Parasite name”. The protein sequence information ( Dataset 1 <REF-43> and Table 1 ) obtained from literature search was used for a BLAST search on EupathDB ( http://eupathdb.org/eupathdb/ ), UniprotDB ( http://www.uniprot.org ) and GeneDB ( http://www.genedb.org/Homepage ). Sequence data were edited on textEdit mac version and uploaded to Molecular Evolutionary Genetics Analysis (MEGA) platform version 7.0 obtained from http://www.megasoftware.net <REF-44> . The 234 sequences were aligned using muscle tools with large alignment (Max iterations = 2) selected while other settings were left at defaults. Evolutionary history was inferred using the Neighbor-Joining method <REF-45> . The percentage of replicate trees in which the associated taxa clustered together in the bootstrap test (500 replicates) was also analysed <REF-46> . The tree was drawn to scale, with branch lengths in the same units as those of the evolutionary distances used to infer the phylogenetic tree. The evolutionary distances were computed using the number of differences method <REF-47> . While uniform rate and complete deletion was selected for substitution rates and data subset, respectively. Other parameters were at default settings. All positions containing gaps and missing data were eliminated. The newick format of the tree was exported and opened on FigTree 1.4.2 platform downloaded from http://tree.bio.ed.ac.uk/software/figtree/ <REF-48> . The final tree was constructed using radial tree layout. Additional analysis consisted of sub-phylogenies based on the transporter type. Since folate-binding protein YgfZ, folate/pteridine transporter, folate/biopterin transporter, putative, reduced folate carrier family protein, folate/methotrexate transporter FT1, putative folate transporters alone and others have 10, 25, 132, 2, 7, 49 and 9. So we decided to reconstruct the phylogeny based folate transporter, folate-biopterin transporter after considering the identification number, the species diversity in each category.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_17",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Pathogen species from which folate transporters were identified. A total of 234 folate transporter proteins from 63 pathogens were identified from the various classes of pathogens. √, Folate transporters found from literature search; X, Folate transporters identified from this study. FTP, Folate Transporter Protein.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_18",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Pathogen species from which folate transporters were identified.</title> <p>A total of 234 folate transporter proteins from 63 pathogens were identified from the various classes of pathogens. &#8730;, Folate transporters found from literature search; X, Folate transporters identified from this study. FTP, Folate Transporter Protein.</p> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"right\">S/N</th> <th align=\"left\">Species/Strain</th> <th align=\"left\">No. of <break/>FTP</th> <th align=\"left\">Genera</th> <th align=\"left\">Family</th> <th align=\"left\">Order</th> <th align=\"left\">Class</th> <th align=\"left\">Phylum/Division</th> <th align=\"left\">Kingdom</th> <th align=\"left\">Confirmation <break/>Search <break/>(References)</th> </tr> </thead> <tbody> <tr> <td align=\"right\">1</td> <td align=\"left\">A. capsulatus <break/>G186AR</td> <td align=\"right\">2</td> <td align=\"left\">Actinobacillus</td> <td align=\"left\">Pasteurellaceae</td> <td align=\"left\">Pasteurellales</td> <td align=\"left\">Gammaproteobacteria</td> <td align=\"left\">Proteobacteria</td> <td align=\"left\">Bacteria</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">2</td> <td align=\"left\">A. clavatus <break/>NRRL 1</td> <td align=\"right\">1</td> <td align=\"left\">Aspergillus</td> <td align=\"left\">Trichocomaceae</td> <td align=\"left\">Eurotiales</td> <td align=\"left\">Eurotiomycetes</td> <td align=\"left\">Ascomycota</td> <td align=\"left\">Fungi</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-69\">69</xref> </sup> </td> </tr> <tr> <td align=\"right\">3</td> <td align=\"left\">A. flavus <break/>NRRL3357</td> <td align=\"right\">1</td> <td align=\"left\">Aspergillus</td> <td align=\"left\">Trichocomaceae</td> <td align=\"left\">Eurotiales</td> <td align=\"left\">Eurotiomycetes</td> <td align=\"left\">Ascomycota</td> <td align=\"left\">Fungi</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-70\">70</xref> </sup> </td> </tr> <tr> <td align=\"right\">4</td> <td align=\"left\">A. macrogynus <break/>ATCC 38327</td> <td align=\"right\">1</td> <td align=\"left\">Allomyces</td> <td align=\"left\">Blastocladiaceae</td> <td align=\"left\">Blastocladiales</td> <td align=\"left\">Blastocladiomycetes</td> <td align=\"left\">Blastocladiomycota</td> <td align=\"left\">Fungi</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">5</td> <td align=\"left\">C. fasciculata <break/>strain Cf-Cl</td> <td align=\"right\">1</td> <td align=\"left\">Crithidia</td> <td align=\"left\">Trypanosomatidadae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">6</td> <td align=\"left\">C. immitis RS</td> <td align=\"right\">2</td> <td align=\"left\">Coccidioides</td> <td align=\"left\">Onygenaceae</td> <td align=\"left\">Onygenales</td> <td align=\"left\">Eurotiomycetes</td> <td align=\"left\">Ascomycota</td> <td align=\"left\">Fungi</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">7</td> <td align=\"left\">C. muris RN66</td> <td align=\"right\">1</td> <td align=\"left\">Cryptosporidium</td> <td align=\"left\">Cryptosporidiidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">8</td> <td align=\"left\">C. neoformans <break/>var. grubii H99</td> <td align=\"right\">2</td> <td align=\"left\">Cryptococcus</td> <td align=\"left\">Tremellaceae</td> <td align=\"left\">Tremellales</td> <td align=\"left\">Tremellomycetes</td> <td align=\"left\">Basidiomycota</td> <td align=\"left\">Fungi</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">9</td> <td align=\"left\">C. velia <break/>CCMP2878</td> <td align=\"right\">11</td> <td align=\"left\">Chromera</td> <td align=\"left\">Chromeraceae</td> <td align=\"left\"/> <td align=\"left\">Chromerida</td> <td align=\"left\">Chromerida</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">10</td> <td align=\"left\">E. acervulina <break/>Houghton</td> <td align=\"right\">1</td> <td align=\"left\">Eimeria</td> <td align=\"left\">Eimeriidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Protista</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">11</td> <td align=\"left\">E. brunetti <break/>Houghton</td> <td align=\"right\">2</td> <td align=\"left\">Eimeria</td> <td align=\"left\">Eimeriidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Protista</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">12</td> <td align=\"left\">E. cuniculi GB-M1</td> <td align=\"right\">1</td> <td align=\"left\">Encephalitozoon</td> <td align=\"left\">Unikaryonidae</td> <td align=\"left\">Microsporida</td> <td align=\"left\">Microsporea</td> <td align=\"left\">Microsporidia</td> <td align=\"left\">Fungi</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-71\">71</xref>, <xref ref-type=\"bibr\" rid=\"ref-72\">72</xref> </sup> </td> </tr> <tr> <td align=\"right\">13</td> <td align=\"left\">E. maxima <break/>Weybridge</td> <td align=\"right\">1</td> <td align=\"left\">Eimeria</td> <td align=\"left\">Eimeriidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Protista</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">14</td> <td align=\"left\">E. necatrix <break/>Houghton</td> <td align=\"right\">1</td> <td align=\"left\">Eimeria</td> <td align=\"left\">Eimeriidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Protista</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">15</td> <td align=\"left\">E. praecox <break/>Houghton</td> <td align=\"right\">1</td> <td align=\"left\">Eimeria</td> <td align=\"left\">Eimeriidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Protista</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">16</td> <td align=\"left\">E. tenella strain <break/>Houghton</td> <td align=\"right\">1</td> <td align=\"left\">Eimeria</td> <td align=\"left\">Eimeriidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Protista</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">17</td> <td align=\"left\">F. graminearum <break/>PH-1</td> <td align=\"right\">2</td> <td align=\"left\">Gibberella</td> <td align=\"left\">Nectriaceae </td> <td align=\"left\">Hypocreales </td> <td align=\"left\">Sordariomycetes </td> <td align=\"left\">Ascomycota </td> <td align=\"left\">Animalia </td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">18</td> <td align=\"left\">H. hammondi <break/>strain H.H.34</td> <td align=\"right\">3</td> <td align=\"left\">Hammondia</td> <td align=\"left\">Sarcocystidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">19</td> <td align=\"left\">L. braziliensis <break/>MHOM/BR/75/ <break/>M2904</td> <td align=\"right\">6</td> <td align=\"left\">Leishmania</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastida</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-73\">73</xref> </sup> </td> </tr> <tr> <td align=\"right\">20</td> <td align=\"left\">L. donovani <break/>BPK282A1</td> <td align=\"right\">10</td> <td align=\"left\">Leishmania</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastida</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-74\">74</xref>, <xref ref-type=\"bibr\" rid=\"ref-75\">75</xref> </sup> </td> </tr> <tr> <td align=\"right\">21</td> <td align=\"left\">L. infantum <break/>JPCM5</td> <td align=\"right\">9</td> <td align=\"left\">Leishmania</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastida</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-76\">76</xref>, <xref ref-type=\"bibr\" rid=\"ref-77\">77</xref> </sup> </td> </tr> <tr> <td align=\"right\">22</td> <td align=\"left\">L. major strain <break/>Friedlin</td> <td align=\"right\">8</td> <td align=\"left\">Leishmania</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastida</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-78\">78</xref> </sup> </td> </tr> <tr> <td align=\"right\">23</td> <td align=\"left\">L. mexicana <break/>MHOM/GT/2001/ <break/>U1103</td> <td align=\"right\">1</td> <td align=\"left\">Leishmania</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastida</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-72\">72</xref> </sup> </td> </tr> <tr> <td align=\"right\">24</td> <td align=\"left\">L. pyrrhocoris <break/>H10</td> <td align=\"right\">16</td> <td align=\"left\">Leptomonas</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastida</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-79\">79</xref> </sup> </td> </tr> <tr> <td align=\"right\">25</td> <td align=\"left\">L. seymouri <break/>ATCC 30220</td> <td align=\"right\">6</td> <td align=\"left\">Leptomonas</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastida</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-80\">80</xref> </sup> </td> </tr> <tr> <td align=\"right\">26</td> <td align=\"left\">M. daphniae <break/>UGP3</td> <td align=\"right\">1</td> <td align=\"left\">Mitosporidium </td> <td align=\"left\">&#8211;</td> <td align=\"left\">&#8211;</td> <td align=\"left\">&#8211;</td> <td align=\"left\">&#8211;</td> <td align=\"left\">&#8211;</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">27</td> <td align=\"left\">N. bombycis <break/>CQ1</td> <td align=\"right\">1</td> <td align=\"left\">Nosema</td> <td align=\"left\">Nosematidae</td> <td align=\"left\">Dissociodihaplophasida</td> <td align=\"left\">Dihaplophasea</td> <td align=\"left\">Microsporidia</td> <td align=\"left\">Fungi</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">28</td> <td align=\"left\">N. caninum <break/>Liverpool</td> <td align=\"right\">1</td> <td align=\"left\">Neospora</td> <td align=\"left\">Sarcocystidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">29</td> <td align=\"left\">N. fischeri NRRL <break/>181</td> <td align=\"right\">1</td> <td align=\"left\"> Neosartorya</td> <td align=\"left\">Trichocomaceae</td> <td align=\"left\">Eurotiales</td> <td align=\"left\">Eurotiomycetidae</td> <td align=\"left\">Ascomycota</td> <td align=\"left\">Fungi</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">30</td> <td align=\"left\">N. fowleri ATCC <break/>30863</td> <td align=\"right\">2</td> <td align=\"left\">Naegleria</td> <td align=\"left\">Vahlkampfiidae</td> <td align=\"left\">Schizopyrenida</td> <td align=\"left\">Heterolobosea</td> <td align=\"left\">Percolozoa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">31</td> <td align=\"left\">P. berghei ANKA</td> <td align=\"right\">2</td> <td align=\"left\">Plasmodium</td> <td align=\"left\">Plasmodiidae</td> <td align=\"left\">Chromatorida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">32</td> <td align=\"left\">P. chabaudi <break/>chabaudi</td> <td align=\"right\">2</td> <td align=\"left\">Plasmodium</td> <td align=\"left\">Plasmodiidae</td> <td align=\"left\">Chromatorida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">33</td> <td align=\"left\">P. falciparum <break/>3D7</td> <td align=\"right\">2</td> <td align=\"left\">Plasmodium</td> <td align=\"left\">Plasmodiidae</td> <td align=\"left\">Chromatorida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-22\">22</xref> </sup> </td> </tr> <tr> <td align=\"right\">34</td> <td align=\"left\">P. falciparum IT</td> <td align=\"right\">2</td> <td align=\"left\">Plasmodium</td> <td align=\"left\">Plasmodiidae</td> <td align=\"left\">Chromatorida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-22\">22</xref> </sup> </td> </tr> <tr> <td align=\"right\">35</td> <td align=\"left\">P. infestans <break/>T30-4</td> <td align=\"right\">16</td> <td align=\"left\">Phytophthora</td> <td align=\"left\">Pythiaceae</td> <td align=\"left\">Peronosporales</td> <td align=\"left\">Oomycota</td> <td align=\"left\">Heterokontophyta</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">36</td> <td align=\"left\">P. knowlesi strain <break/>H</td> <td align=\"right\">2</td> <td align=\"left\">Plasmodium</td> <td align=\"left\">Plasmodiidae</td> <td align=\"left\">Chromatorida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">37</td> <td align=\"left\">P. parasitica <break/>INRA-310</td> <td align=\"right\">20</td> <td align=\"left\">Phytophthora</td> <td align=\"left\">Pythiaceae</td> <td align=\"left\">Peronosporales</td> <td align=\"left\">Oomycetes</td> <td align=\"left\">Oomycota</td> <td align=\"left\">Fungi</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">38</td> <td align=\"left\">P. reichenowi <break/>CDC</td> <td align=\"right\">2</td> <td align=\"left\">Plasmodium</td> <td align=\"left\">Plasmodiidae</td> <td align=\"left\">Chromatorida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">39</td> <td align=\"left\">P. ultimum <break/>DAOM BR144</td> <td align=\"right\">1</td> <td align=\"left\">Pythium</td> <td align=\"left\">Pythiaceae</td> <td align=\"left\">Pythiales</td> <td align=\"left\">Oomycetes</td> <td align=\"left\">Heterokontophyta</td> <td align=\"left\">Chromalveolata</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">40</td> <td align=\"left\">P. vivax Sal-1</td> <td align=\"right\">2</td> <td align=\"left\">Plasmodium</td> <td align=\"left\">Plasmodiidae</td> <td align=\"left\">Chromatorida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">41</td> <td align=\"left\">P. yoelii yoelii <break/>17X</td> <td align=\"right\">2</td> <td align=\"left\">Plasmodium</td> <td align=\"left\">Plasmodiidae</td> <td align=\"left\">Chromatorida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">42</td> <td align=\"left\">P. yoelii yoelii YM</td> <td align=\"right\">2</td> <td align=\"left\">Plasmodium</td> <td align=\"left\">Plasmodiidae</td> <td align=\"left\">Chromatorida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">43</td> <td align=\"left\">S. neurona SN3</td> <td align=\"right\">6</td> <td align=\"left\">Sarcocystis</td> <td align=\"left\">Sarcocystidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">44</td> <td align=\"left\">S. punctatus <break/>DAOM BR117</td> <td align=\"right\">1</td> <td align=\"left\">Spizellomyces</td> <td align=\"left\">Powellomycetaceae</td> <td align=\"left\">Spizellomycetales</td> <td align=\"left\">Chytridiomycetes</td> <td align=\"left\">Chytridiomycota</td> <td align=\"left\">Fungi</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">45</td> <td align=\"left\">T. brucei <break/>gambiense <break/>DAL972</td> <td align=\"right\">3</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">46</td> <td align=\"left\">T. brucei Lister <break/>strain 427</td> <td align=\"right\">9</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-81\">81</xref> </sup> </td> </tr> <tr> <td align=\"right\">47</td> <td align=\"left\">T. brucei <break/>TREU927</td> <td align=\"right\">5</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-81\">81</xref> </sup> </td> </tr> <tr> <td align=\"right\">48</td> <td align=\"left\">T. congolense <break/>IL3000</td> <td align=\"right\">2</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">49</td> <td align=\"left\">T. cruzi <break/>CL Brener <break/>Esmeraldo-like</td> <td align=\"right\">3</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-82\">82</xref> </sup> </td> </tr> <tr> <td align=\"right\">50</td> <td align=\"left\">T. cruzi CL <break/>Brener Non- <break/>Esmeraldo-like</td> <td align=\"right\">2</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-82\">82</xref> </sup> </td> </tr> <tr> <td align=\"right\">51</td> <td align=\"left\">T. cruzi Dm28c</td> <td align=\"right\">2</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-82\">82</xref> </sup> </td> </tr> <tr> <td align=\"right\">52</td> <td align=\"left\">T. cruzi <break/>marinkellei strain <break/>B7</td> <td align=\"right\">6</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-82\">82</xref> </sup> </td> </tr> <tr> <td align=\"right\">53</td> <td align=\"left\">T. cruzi Sylvio <break/>X10/1</td> <td align=\"right\">2</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-82\">82</xref> </sup> </td> </tr> <tr> <td align=\"right\">54</td> <td align=\"left\">T. equi strain WA</td> <td align=\"right\">4</td> <td align=\"left\">Theileria</td> <td align=\"left\">Theileriidae</td> <td align=\"left\">Piroplasmida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-82\">82</xref> </sup> </td> </tr> <tr> <td align=\"right\">55</td> <td align=\"left\">T. evansi strain <break/>STIB 805</td> <td align=\"right\">3</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">56</td> <td align=\"left\">T. gondii GT1</td> <td align=\"right\">3</td> <td align=\"left\">Toxoplasma</td> <td align=\"left\">Sarcocystidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\"> <bold>&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-83\">83</xref> </sup> </bold> </td> </tr> <tr> <td align=\"right\">57</td> <td align=\"left\">T. gondii ME49</td> <td align=\"right\">4</td> <td align=\"left\">Toxoplasma</td> <td align=\"left\">Sarcocystidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\"> <bold>&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-83\">83</xref> </sup> </bold> </td> </tr> <tr> <td align=\"right\">58</td> <td align=\"left\">T. gondii VEG</td> <td align=\"right\">3</td> <td align=\"left\">Toxoplasma</td> <td align=\"left\">Sarcocystidae</td> <td align=\"left\">Eucoccidiorida</td> <td align=\"left\">Conoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\"> <bold>&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-83\">83</xref> </sup> </bold> </td> </tr> <tr> <td align=\"right\">59</td> <td align=\"left\">T. grayi ANR4</td> <td align=\"right\">6</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\"> <bold>&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-84\">84</xref> </sup> </bold> </td> </tr> <tr> <td align=\"right\">60</td> <td align=\"left\">T. parva strain <break/>Muguga</td> <td align=\"right\">2</td> <td align=\"left\">Theileria</td> <td align=\"left\">Theileriidae</td> <td align=\"left\">Piroplasmida</td> <td align=\"left\">Aconoidasida</td> <td align=\"left\">Apicomplexa</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">61</td> <td align=\"left\">T. rangeli SC58</td> <td align=\"right\">3</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">&#8730; <sup> <xref ref-type=\"bibr\" rid=\"ref-85\">85</xref> </sup> </td> </tr> <tr> <td align=\"right\">62</td> <td align=\"left\">T. vivax Y486</td> <td align=\"right\">1</td> <td align=\"left\">Trypanosoma</td> <td align=\"left\">Trypanosomatidae</td> <td align=\"left\">Trypanosomatida</td> <td align=\"left\">Kinetoplastea</td> <td align=\"left\">Euglenozoa</td> <td align=\"left\">Excavata</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"right\">63</td> <td align=\"left\">V. brassicaformis <break/>CCMP3155</td> <td align=\"right\">12</td> <td align=\"left\">Vitrella </td> <td align=\"left\">Vitrellaceae</td> <td align=\"left\">&#8211;</td> <td align=\"left\">&#8211;</td> <td align=\"left\">Chromerida</td> <td align=\"left\">Eukaryota</td> <td align=\"left\">X</td> </tr> <tr> <td align=\"left\"/> <td align=\"left\">Total</td> <td align=\"right\">234</td> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> </tr> <tr> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"> <bold>Keys</bold> </td> <td align=\"left\"/> <td align=\"left\"/> </tr> <tr> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\">&#8730;</td> <td align=\"left\">Folate transporters found from <break/>literature search</td> </tr> <tr> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\">X</td> <td align=\"left\">Folate transporters identified from <break/>this study</td> </tr> <tr> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\"/> <td align=\"left\">FTP</td> <td align=\"left\">Folate Transporter Protein</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Pathogen species from which folate transporters were identified. A total of 234 folate transporter proteins from 63 pathogens were identified from the various classes of pathogens. √, Folate transporters found from literature search; X, Folate transporters identified from this study. FTP, Folate Transporter Protein.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_19",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_20",
            "content": "A methodological search for folate transporters in all eukaryotic pathogen genomes we examined under EupathDB with validation via GenBank, GeneDB and Uniprot contained a total of 234 proteins (detail features of proteins are presented in Dataset 1 <REF-43> ). We identified these transporters in 28 pathogen species (containing 63 strains) cutting across 12 phyla ( Table 1 ). The parasites with the highest number of folate transporters are Phytophthora parasitica INRA-310, P. infestans T30–4 and Leptomonas pyrrhocoris H10 with 20, 16 and 16 proteins, respectively. While Aspergillus clavatus NRRL 1, A. flavus NRRL3357, A. macrogynus ATCC 38327, Crithidia fasciculata strain Cf-Cl and others have one folate transporter protein each ( Table 1 ). The different proteins identified to be involved in folate salvage or related molecules were folate-binding protein YgfZ, folate/pteridine transporter, folate/biopterin transporter, reduced folate carrier family protein, folate/methotrexate transporter FT1 and folate transporters having a 4%, 11%, 56%, 1%, 3% and 21% identity, respectively. Proteins that did not belong to these groups were classified as others (4%) ( Figure 2A ). A good number of the proteins identified had predicted transmembrane helixes with a few having none ( Figure 2B ). Furthermore, a number of the transporters possess signal peptides ( Dataset 1 <REF-43> ), which may be required for targeting to cellular locations. Deciphering the sequence of the targeting signal may indicate its product destination.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_21",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Categorization of proteins identified. This is based on [ A ] Transporter Type [ B ] Number of TMMs [ C ] Novel folate transporters [ D ] Localization [ E ] Presence/absence of Signal peptide. TMM, Transmembrane Helix;",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_22",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Categorization of proteins identified.</title> <p>This is based on [ <bold>A</bold>] Transporter Type [ <bold>B</bold>] Number of TMMs [ <bold>C</bold>] Novel folate transporters [ <bold>D</bold>] Localization [ <bold>E</bold>] Presence/absence of Signal peptide. TMM, Transmembrane Helix;</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Categorization of proteins identified. This is based on [ A ] Transporter Type [ B ] Number of TMMs [ C ] Novel folate transporters [ D ] Localization [ E ] Presence/absence of Signal peptide. TMM, Transmembrane Helix;",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_23",
            "content": "Our literature search for parasite folate transporters on PubMed and Google Scholar indicated 60% (38 out 63) of the proteins were identified for the first time as presented in Table 1 and Figure 2C , while 40% have been previously investigated. Besides, the Leishmania folate transporters we came across were not found on the EupathDB resource. We thus performed a BLAST search of Kinetoplastida on EupathDB, the returned hits were folate/biopterin transporter for L. infantum . The only Plasmodium species with results for proteins that salvage folate was P. falciparum . Our study, however, describes for the first time the presence of these transporters in other Plasmodium species. There were no transporter proteins deposited in EupathDB for P. malariae and P. ovale. However, folate transporters I and II were retrieved from our search of GeneDB for P. malariae and P. ovale curtisi , respectively.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_24",
            "content": "Our analysis of folate transporters indicate the presence in Plasmodium species of two proteoforms; folate transporter I and II ( Dataset 1 <REF-43> ). All Leishmania species identified possess folate/biopterin transporters and not folate transporters. Trypanosome species have both folate/pteridine and folate transporters; T. cruzi Dm28c, T. cruzi Sylvio X10/1 and T. cruzi CL Brener Esmeraldo-like, T. cruzi CL Brener Non-Esmeraldo-like and T. cruzi marinkellei strain B7 all have folate/pteridine transporter while T. brucei TREU927, T. brucei Lister strain 427, T. brucei gambiense DAL972, T. congolense IL3000 possess folate transporters. Eukaryotic parasites like Eimeria acervulina Houghton, E. brunetti Houghton, E. maxima Weybridge, E. necatrix Houghton, E. praecox Houghton, E. tenella strain Houghton and Neospora caninum Liverpool all boast folate/methotrexate transporter FT1. The folate-binding protein YgfZ was found in the fungus, Allomyces macrogynus ATCC 38327, the protist C. fasciculata strain Cf-Cl, C. immitis RS, the feline protozoon, Hammondia hammondi strain H.H.34, Sarcocystis neurona SN3, S. punctatus DAOM BR117, T. gondii GT1, T. gondii ME49, T. gondii VEG and T. brucei TREU927. Parasites such as Microsporidium daphniae UGP3 and the amoeba Naegleria fowleri ATCC 30863 possess the reduced folate carrier family protein ( Figure 2D ). We observed that 7% of the identified proteins are localized on the mitochondrial membrane of some pathogens such as the fungi Aspergillus clavatus NRRL 1, A. flavus NRRL3357, C. immitis RS, the yeast Cryptococcus neoformans var. grubii H99, Fusarium graminearum PH-1, A. capsulatus G186AR, Leptomonas pyrrhocoris H10, the food fungus Neosartorya fischeri NRRL 181, Phytophthora parasitica INRA-310 and P. ultimum DAOM BR144. The remaining proteins are localized on the plasma membrane ( Dataset 1 <REF-43> and Figure 2D ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_25",
            "content": "Approximately 15% (34/234) of the folate transporters identified possess signal peptides ( Figure 2E ) with the trypanosomes with the most signal peptides. Deductions can be made of the probable destination within the cell of any transporter by its signal peptide sequence; thus, further work may seek to decipher the sequence of the targeting signal to determine its localization. The proteins identified all have transmembrane helixes with the exception of the alveolate Chromera velia CCMP2878, apicomplexan P. berghei ANKA, S. neurona SN3, the kinetoplastid T. brucei TREU927, T. grayi ANR4 and protist Vitrella brassicaformis CCMP3155 with Gene ID’s Cvel_17766, PBANKA_0713700, SN3_01500005, Tb927.8.6480, Tgr.2739.1000 and Vbra_15327, respectively ( Dataset 1 <REF-43> ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_26",
            "content": "The phylogenetic tree ( Figure 3 ) shows the evolutionary position, history and relationship of all the folate transporters identified in this work. The type of transporter or species/strain was used for constructing phylogenic trees, with the 234 proteins identified forming two clades, a major and minor. The major clade lacked a sub-clade, while the minor clade possessed a sub-clade. All proteins identified were distributed between the two major clades; except for folate/methotrexate transporter and mitochondrial folate transporter, with the latter present on the major clade and the former on the minor clade exclusively. All the species are represented on both clades, however, V. brassicaformis CCMP3155, Plasmodium species, A. clavatus NRRL, A. flavus NRRL3357, A. macrogynus ATCC 38327, C. fasciculata strain Cf-Cl, C. immitis RS, C. immitis RS, C. muris RN66, C. neoformans var. grubii H99, C. neoformans var. grubii H99, Leishmania species, N. bombycis CQ1, N. caninum Liverpool, F. graminearum PH-1 and H. hammondi strain H.H.34 are exclusively on the major clade. There are some parasites that were identified once, as shown in Dataset 1 <REF-43> ; these are mostly in the large clade. Some of these pathogens include P. ultimum DAOM BR144, which has mitochondrial folate transporter/carrier proteins similar to Homo sapiens , E. cuniculi GB-M1, which has proteins similar to folate transporter, and S. punctatus DAOM BR117, which has folate-binding protein YgfZ. These were the only proteins of the aforementioned species identified in this work. However, M. daphniae UGP3, which had reduced folate carrier domain containing protein, was the only parasite that was found in the small clade. Improving on our phylogenetic analysis, we performed a sub-phylogenetic reconstruction ( Figure 4 – Figure 6 ) based on the substrate type of the transport proteins. After phylogenetic analysis each sub-phylogeny show a clear characterization except for folate-biopterin transporters ( Figure 5 ), which fell in a different clade save for Leptomonas species and C. velia .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_27",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "Phylogenetic tree showing relatedness of folate transporters compared across all studied pathogen species. Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_28",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>Phylogenetic tree showing relatedness of folate transporters compared across all studied pathogen species.</title> <p>Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "Phylogenetic tree showing relatedness of folate transporters compared across all studied pathogen species. Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_29",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Phylogenetic tree showing relatedness of proteins involved in only folate transport across all studied pathogen species. Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_30",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <title>Phylogenetic tree showing relatedness of proteins involved in only folate transport across all studied pathogen species.</title> <p>Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Phylogenetic tree showing relatedness of proteins involved in only folate transport across all studied pathogen species. Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_31",
            "content": "Figure 5.",
            "ntype": "label",
            "meta": {
                "id": "f5",
                "caption": "Phylogenetic tree showing relatedness of proteins involved in either folate or biopterin transport across all studied pathogen species. Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_32",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f5\" position=\"float\"> <caption> <title>Phylogenetic tree showing relatedness of proteins involved in either folate or biopterin transport across all studied pathogen species.</title> <p>Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure5.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f5",
                "caption": "Phylogenetic tree showing relatedness of proteins involved in either folate or biopterin transport across all studied pathogen species. Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_33",
            "content": "Figure 6.",
            "ntype": "label",
            "meta": {
                "id": "f6",
                "caption": "Phylogenetic tree showing relatedness of proteins involved in only folate-binding protein YgfZ transport across all studied pathogen species. Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure6.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_34",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f6\" position=\"float\"> <caption> <title>Phylogenetic tree showing relatedness of proteins involved in only folate-binding protein YgfZ transport across all studied pathogen species.</title> <p>Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure6.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f6",
                "caption": "Phylogenetic tree showing relatedness of proteins involved in only folate-binding protein YgfZ transport across all studied pathogen species. Tree was constructed using Neighbor-Joining method (Boostrap test was a 1000 replicates).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11380/2ea2d8fb-1198-4994-a4aa-004c3ad4ac11_figure6.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_35",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS0\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/10561/ef3fe2e7-4f42-4303-83a5-5d27044613ad_Falade_and_Otarigho_Dataset_1.xlsx\"> <label>Complete list of proteins extracted from Eupthadb and literature search, including their properties</label> <caption> <p>These data are available in a .xlsx file.</p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_36",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_37",
            "content": "Folate transporters are important proteins involved in the salvage of folate, cofactors and related molecules in eukaryotic pathogens important for metabolism and survival in their respective hosts <REF-21> . We identified proteins that could mediate the salvage of folates into cells and/or mitochondria from eukaryotic pathogen genomes in EupathDB. Many of these proteins are involved in folate biosynthesis or transport and are present in many of the eukaryotic pathogens we queried. In this study, 234 genes encoding homologues of folate salvaging proteins were identified in the genome of 64 strains, representing 28 species of eukaryotic pathogens. Some of the pathogens include P. falciparum 3D7 and IT, P. knowlesi H, P. berghei ANKA, P. chabaudi chabaudi, T. brucei Lister 427, T. brucei TREU927, T. brucei gambiense DAL972, Encephalitozoon cuniculi GB-M1. The pathogens range from bacteria through to fungi, intracellular parasites such as Plasmodium and leishmania species, to extracellular parasites such as trypanosome species. This suggests a widespread presence of the proteins cutting across a range of pathogens that infect humans and animals.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_38",
            "content": "A few of the proteins we identified have been previously identified and characterized in parasites such as Plasmodium falciparum <REF-22> , <REF-30> , Trypanosome species <REF-26> , Leishmania species and Toxoplasma gondii <REF-49> . It has been estimated that over half of the drugs currently on the market target integral membrane proteins of which membrane transporters are a part, but unfortunately, these transporters have not been adequately explored as drug targets <REF-50> . Folate transporters therefore represent attractive drug targets for treatment of infectious diseases. Thus their identification from other eukaryotic pathogens could open a window for novel chemotherapeutics for disease control <REF-51> , <REF-52> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_39",
            "content": "In Plasmodium two folate transporters have been identified, namely Pf FT1 and Pf T2. These transporters have been shown to mediate the salvage of folate derivatives and precursors in P. falciparum and proposed blocking of their salvage activities may improve the antimalarial efficacy of several classes of antimalarial drugs. In our work we identified folate transporters for other plasmodial species, which, like P. falciparum , may also be chemotherapeutic targets. Transport of folate in higher eukaryotes is made possible by a high affinity folate-biopterin transporters FBT or BT1 family <REF-22> , <REF-30> . In the trypanosomes and related kinetoplastids, a member of these transporters, the folate biopterin transporter (FBT) family of proteins was identified in Leishmania <REF-28> . It is thought that MFS proteins are related to the FBT. These proteins have been characterized in a few protozoa and cyanobacteria <REF-53> . Results from our study describing the presence of these transporters across several phyla corroborate results other researches, establishing the conservation of folate transport function among FBT family proteins from species from plants and protists <REF-22> , <REF-53> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_40",
            "content": "Malaria parasites encode transporters belonging to the organo anion transporter (OAT) folate-biopterin transporter (FBT), glycoside-pentoside-hexuronide: cation symporter (GPH), families, which are closely related to the major facilitator super-family of membrane proteins <REF-54> . The inhibition of these transporters by blockers of organic anion transporters such as probenecid has been implicated in sensitization of Plasmodium resistant parasites to antifolates <REF-55> , <REF-56> . Thus, in Plasmodium chemotherapy, identification of folate transporters could lead to screening for compounds that interfere with folate transport and salvage for antimalarial chemotherapy <REF-22> , <REF-30> . We identified several types of folate transporters that have been described and functionally characterized in Leishmania with some implicated in the import of the antifolate methotrexate <REF-57> , <REF-58> . Thus far, only protozoan transporters in Plasmodium , Leishmania , and Trypanosoma brucei have been characterized and these are known to mediate the uptake of the vitamins folate and/or biopterin <REF-22> , <REF-59> , <REF-60> . Thus in parasites species of medical importance folate transporter proteins may provide new targets for therapy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_41",
            "content": "We also identified folate salvaging proteins from fungi such as Coccidioides immitis and A. clavatus , fungi found in soil <REF-61> – <REF-63> , vegetable <REF-61> and waters in tropical and subtropical areas <REF-64> . These fungi are known to occasionally become pathogenic and act as opportunistic pathogens for animals and man <REF-63> . Coccidioidomycosis caused by C. immitis in association with AIDS has been known to be a fatal disease <REF-65> . Treatment of acute and chronic infections with antifungals such as amphotericin B have not been adequate, hence folate transporters may present new targets in these group of pathogens. Identification was also made on pathogens such as C. fasciculata that parasitize several species of insects including mosquitoes and has been widely used to test new therapeutic strategies against parasitic infections <REF-66> . As a model organism, folate transporters identified in C. fasciculata may be useful in research for developing new drugs in medically important Kinetoplasts as has been shown for other targets in this protozoan parasite <REF-67> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_42",
            "content": "We noticed that P. parasitica INRA-310 and L. pyrrhocoris H10 had the highest number of folate transporters identified. Their utility as model fungal ( P. parasitica ) and monoxenous kinetoplast may provide models instrumental for developing new antifolates for fungal and protozoan diseases. The relatedness of these proteins across the different pathogens shows that there are two major phylogenetically distinct clades in the eukaryotic pathogens examined. The clustering of these proteins suggests that these transport proteins have highly conserved regions often required for basic cellular function or stability <REF-68> – <REF-85> . Thus, antifolate chemotherapic drugs that are effective against one pathogen might have some effect on others.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_43",
            "content": "Conclusion",
            "ntype": "title",
            "meta": {
                "section": "5",
                "sec-type": "conclusions",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_44",
            "content": "In summary, we have identified and classified 234 proteins after an extensive search of pathogens genome in eukaryotic pathogen resource databases, though experimental studies will be required to confirm the expression and function of these proteins in parasites. Our results show that these proteins that mediate the transportation folate are widely distributed in different pathogen species examined in various phyla. The identification of folate salvage proteins in diverse eukaryotes extend the evolutionary diversity of these proteins and suggests they might offer new possibilities for potential drug development targeting folate-salvaging routes in eukaryotic pathogens.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_45",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_46",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2017 Falade M and Otarigho B",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_47",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_48",
            "content": "Dataset 1: Complete list of proteins extracted from Eupthadb and literature search, including their properties. These data are available in a .xlsx file. Doi, 10.5256/f1000research.10561.d148742 <REF-43>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_49",
            "content": "<REF-1> Fadiel A Isokpehi RD Stambouli N : Protozoan parasite aquaporins. Expert Rev Proteomic. 2009 ; 6 ( 2 ): 199 – 211 . 19385945 10.1586/epr.09.10",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_50",
            "content": "<REF-2> Prole DL Taylor CW : Identification and analysis of putative homologues of mechanosensitive channels in pathogenic protozoa. PLoS One. 2013 ; 8 ( 6 ): e66068 . 23785469 10.1371/journal.pone.0066068 3681921",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_51",
            "content": "<REF-3> Wiser M : Protozoa and human disease. Garland Science. 2010 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_52",
            "content": "<REF-4> Turrens JF : Oxidative stress and antioxidant defenses: a target for the treatment of diseases caused by parasitic protozoa. Mol Aspects Med. 2004 ; 25 ( 1–2 ): 211 – 20 . 15051329 10.1016/j.mam.2004.02.021",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_53",
            "content": "<REF-5> Shiadeh MN Niyyati M Fallahi S : Human parasitic protozoan infection to infertility: a systematic review. Parasitol Res. 2016 ; 115 ( 2 ): 469 – 77 . 26573517 10.1007/s00436-015-4827-y",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_54",
            "content": "<REF-6> Khanum H Kadir R Arju T : Detection of Entamoeba histolytica, Giardia lamblia and Cryptospodium sp. Infection among diarrheal patients. Bangladesh J Zoology. 2015 ; 43 ( 1 ): 1 – 7 . 10.3329/bjz.v43i1.26132",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_55",
            "content": "<REF-7> Herman ML Surawicz CM : Intestinal Parasites . In: Textbook of Pediatric Gastroenterology, Hepatology and Nutrition . Springer International Publishing. 2016 ; 185 – 193 . 10.1007/978-3-319-17169-2_16",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_56",
            "content": "<REF-8> Ton Nu PA Nguyen VQ Cao NT : Prevalence of Trichomonas vaginalis infection in symptomatic and asymptomatic women in Central Vietnam. J Infect Dev Ctries. 2015 ; 9 ( 06 ): 655 – 60 . 26142677 10.3855/jidc.7190",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_57",
            "content": "<REF-9> Garcia LS Bruckner DA : Diagnostic medical parasitology . Washington, DC. 2001 ; 131 – 5 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_58",
            "content": "<REF-11> Andrews KT Fisher G Skinner-Adams TS : Drug repurposing and human parasitic protozoan diseases. Int J Parasitol Drugs Drug Resis. 2014 ; 4 ( 2 ): 95 – 111 . 25057459 10.1016/j.ijpddr.2014.02.002 4095053",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_59",
            "content": "<REF-12> Ouattara A Laurens MB : Vaccines against malaria. Clin Infect Dis. 2015 ; 60 ( 6 ): 930 – 6 . 25452593 10.1093/cid/ciu954 4357819",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_60",
            "content": "<REF-13> Monzote L Siddiq A : Drug development to protozoan diseases. Open Med Chem J. 2011 ; 5 ( 1 ): 1 – 3 . 21629506 10.2174/1874104501105010001 3103878",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_61",
            "content": "<REF-15> Castillo E Dea-Ayuela MA Bolás-Fernández F : The kinetoplastid chemotherapy revisited: current drugs, recent advances and future perspectives. Curr Med Chem. 2010 ; 17 ( 33 ): 4027 – 51 . 20939823 10.2174/092986710793205345",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_62",
            "content": "<REF-16> Dias DA Urban S Roessner U : A historical overview of natural products in drug discovery. Metabolites. 2012 ; 2 ( 2 ): 303 – 36 . 24957513 10.3390/metabo2020303 3901206",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_63",
            "content": "<REF-17> Croft SL : The current status of antiparasite chemotherapy. Parasitology. 1997 ; 114 ( Suppl ): S3 – 15 . 9309765",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_64",
            "content": "<REF-18> Pink R Hudson A Mouriès MA : Opportunities and challenges in antiparasitic drug discovery. Nat Rev Drug Discov. 2005 ; 4 ( 9 ): 727 – 40 . 16138106 10.1038/nrd1824",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_65",
            "content": "<REF-19> Paiardini A Fiascarelli A Rinaldo S : Screening and in vitro testing of antifolate inhibitors of human cytosolic serine hydroxymethyltransferase. ChemMedChem. 2015 ; 10 ( 3 ): 490 – 7 . 25677305 10.1002/cmdc.201500028",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_66",
            "content": "<REF-20> Nzila A Ward SA Marsh K : Comparative folate metabolism in humans and malaria parasites (part I): pointers for malaria treatment from cancer chemotherapy. Trends Parasitol. 2005 ; 21 ( 6 ): 292 – 8 . 15922251 10.1016/j.pt.2005.04.002 2720520",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_67",
            "content": "<REF-21> Nzila A Ward SA Marsh K : Comparative folate metabolism in humans and malaria parasites (part II): activities as yet untargeted or specific to Plasmodium . Trends Parasitol. 2005 ; 21 ( 7 ): 334 – 9 . 15936248 10.1016/j.pt.2005.05.008 2720531",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_68",
            "content": "<REF-22> Salcedo-Sora JE Ward SA : The folate metabolic network of Falciparum malaria. Mol Biochem Parasitol. 2013 ; 188 ( 1 ): 51 – 62 . 23454873 10.1016/j.molbiopara.2013.02.003",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_69",
            "content": "<REF-23> Costi MP Ferrari S : Update on antifolate drugs targets. Curr Drug Targets. 2001 ; 2 ( 2 ): 135 – 66 . 11469716 10.2174/1389450013348669",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_70",
            "content": "<REF-24> Zhao R Diop-Bove N Visentin M : Mechanisms of membrane transport of folates into cells and across epithelia. Annu Rev Nutr. 2011 ; 31 : 177 – 201 . 21568705 10.1146/annurev-nutr-072610-145133 3885234",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_71",
            "content": "<REF-25> Müller IB Hyde JE : Antimalarial drugs: modes of action and mechanisms of parasite resistance. Future Microbiol. 2010 ; 5 ( 12 ): 1857 – 73 . 21155666 10.2217/fmb.10.136",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_72",
            "content": "<REF-26> Emmer BT Nakayasu ES Souther C : Global analysis of protein palmitoylation in African trypanosomes. Eukaryot Cell. 2011 ; 10 ( 3 ): 455 – 63 . 21193548 10.1128/EC.00248-10 3067466",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_73",
            "content": "<REF-27> Müller IB Hyde JE : Folate metabolism in human malaria parasites--75 years on. Mol Biochem Parasitol. 2013 ; 188 ( 1 ): 63 – 77 . 23500968 10.1016/j.molbiopara.2013.02.008",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_74",
            "content": "<REF-28> Vickers TJ Beverley SM : Folate metabolic pathways in Leishmania . Essays Biochem. 2011 ; 51 : 63 – 80 . 22023442 10.1042/bse0510063 3278214",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_75",
            "content": "<REF-30> Wang P Brobey RK Horii T : Utilization of exogenous folate in the human malaria parasite Plasmodium falciparum and its critical role in antifolate drug synergy. Mol Microbiol. 1999 ; 32 ( 6 ): 1254 – 62 . 10383765 10.1046/j.1365-2958.1999.01437.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_76",
            "content": "<REF-32> Stein WD Sanchez CP Lanzer M : Virulence and drug resistance in malaria parasites. Trends Parasitol. 2009 ; 25 ( 10 ): 441 – 3 . 19734096 10.1016/j.pt.2009.07.003",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_77",
            "content": "<REF-33> Agüero F Al-Lazikani B Aslett M : Genomic-scale prioritization of drug targets: the TDR Targets database. Nat Rev Drug Discov. 2008 ; 7 ( 11 ): 900 – 7 . 18927591 10.1038/nrd2684 3184002",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_78",
            "content": "<REF-39> Panwar B Menon R Eksi R : Genome-wide Functional Annotation of Human Protein-coding Splice Variants Using Multiple Instance Learning. J Proteome Res. 2016 ; 15 ( 6 ): 1747 – 53 . 27142340 10.1021/acs.jproteome.5b00883",
            "ntype": "ref",
            "meta": {
                "id": "ref-39",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_79",
            "content": "<REF-40> Antony AC : Folate receptors. Annu Rev Nutr. 1996 ; 16 ( 1 ): 501 – 21 . 8839936 10.1146/annurev.nu.16.070196.002441",
            "ntype": "ref",
            "meta": {
                "id": "ref-40",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_80",
            "content": "<REF-41> Girardin F : Membrane transporter proteins: a challenge for CNS drug development. Dialogues Clin Neurosci. 2006 ; 8 ( 3 ): 311 – 21 . 17117613 3181821",
            "ntype": "ref",
            "meta": {
                "id": "ref-41",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_81",
            "content": "<REF-42> Aurrecoechea C Heiges M Wang H : ApiDB: integrated resources for the apicomplexan bioinformatics resource center. Nucleic Acids Res. 2007 ; 35 ( Database issue ): D427 – 30 . 17098930 10.1093/nar/gkl880 1669770",
            "ntype": "ref",
            "meta": {
                "id": "ref-42",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_82",
            "content": "<REF-43> Falade M Otarigho B : Dataset 1 in: Genome-wide characterization of folate transporter proteins of eukaryotic pathogens. F1000Research. 2017 . Data Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-43",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_83",
            "content": "<REF-44> Saitou N Nei M : The neighbor-joining method: a new method for reconstructing phylogenetic trees. Mol Biol Evol. 1987 ; 4 ( 4 ): 406 – 25 . 3447015",
            "ntype": "ref",
            "meta": {
                "id": "ref-44",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_84",
            "content": "<REF-45> Sanderson MJ : Confidence limits on phylogenies: the bootstrap revisited. Cladistics. 1989 ; 5 ( 2 ): 113 – 29 . 10.1111/j.1096-0031.1989.tb00559.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-45",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_85",
            "content": "<REF-46> Nei M Kumar S : Molecular evolution and phylogenetics . Oxford university press; 2000 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-46",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_86",
            "content": "<REF-47> Rambaut A : FigTree 1.4. 2 software . Institute of Evolutionary Biology, Univ. Edinburgh.",
            "ntype": "ref",
            "meta": {
                "id": "ref-47",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_87",
            "content": "<REF-48> Massimine KM Doan LT Atreya CA : Toxoplasma gondii is capable of exogenous folate transport. A likely expansion of the BT1 family of transmembrane proteins. Mol Biochem Parasitol. 2005 ; 144 ( 1 ): 44 – 54 . 16159678 10.1016/j.molbiopara.2005.07.006",
            "ntype": "ref",
            "meta": {
                "id": "ref-48",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_88",
            "content": "<REF-49> Swaan PW : Membrane Transport Proteins and Drug Transport. Burger's Medicinal Chemistry and Drug Discovery. 2003 . 10.1002/0471266949.bmc027",
            "ntype": "ref",
            "meta": {
                "id": "ref-49",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_89",
            "content": "<REF-50> Mansour TE : Chemotherapeutic targets in parasites: contemporary strategies . Cambridge University Press; 2002 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-50",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_90",
            "content": "<REF-51> Alam A Goyal M Iqbal MS : Novel antimalarial drug targets: hope for new antimalarial drugs. Expert Rev Clin Pharmacol. 2009 ; 2 ( 5 ): 469 – 89 . 22112223 10.1586/ecp.09.28",
            "ntype": "ref",
            "meta": {
                "id": "ref-51",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_91",
            "content": "<REF-52> Dean P Major P Nakjang S : Transport proteins of parasitic protists and their role in nutrient salvage. Front Plant Sci. 2014 ; 5 : 153 . 24808897 10.3389/fpls.2014.00153 4010794",
            "ntype": "ref",
            "meta": {
                "id": "ref-52",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_92",
            "content": "<REF-53> Saier MH Jr Beatty JT Goffeau A : The major facilitator superfamily. J Mol Microbiol Biotechnol. 1999 ; 1 ( 2 ): 257 – 79 . 10943556",
            "ntype": "ref",
            "meta": {
                "id": "ref-53",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_93",
            "content": "<REF-54> Sowunmi A Fehintola FA Adedeji AA : Open randomized study of pyrimethamine-sulphadoxine vs. pyrimethamine-sulphadoxine plus probenecid for the treatment of uncomplicated Plasmodium falciparum malaria in children. Trop Med Int Health. 2004 ; 9 ( 5 ): 606 – 14 . 15117306 10.1111/j.1365-3156.2004.01233.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-54",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_94",
            "content": "<REF-55> Nzila A Mberu E Bray P : Chemosensitization of Plasmodium falciparum by probenecid in vitro . Antimicrob Agents Chemother. 2003 ; 47 ( 7 ): 2108 – 12 . 12821454 10.1128/AAC.47.7.2108-2112.2003 161864",
            "ntype": "ref",
            "meta": {
                "id": "ref-55",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_95",
            "content": "<REF-56> Richard D Kündig C Ouellette M : A new type of high affinity folic acid transporter in the protozoan parasite Leishmania and deletion of its gene in methotrexate-resistant cells. J Biol Chem. 2002 ; 277 ( 33 ): 29460 – 7 . 12023977 10.1074/jbc.M204796200",
            "ntype": "ref",
            "meta": {
                "id": "ref-56",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_96",
            "content": "<REF-57> Richard D Leprohon P Drummelsmith J : Growth phase regulation of the main folate transporter of Leishmania infantum and its role in methotrexate resistance. J Biol Chem. 2004 ; 279 ( 52 ): 54494 – 501 . 15466466 10.1074/jbc.M409264200",
            "ntype": "ref",
            "meta": {
                "id": "ref-57",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_97",
            "content": "<REF-58> Kündig C Haimeur A Légaré D : Increased transport of pteridines compensates for mutations in the high affinity folate transporter and contributes to methotrexate resistance in the protozoan parasite Leishmania tarentolae . EMBO J. 1999 ; 18 ( 9 ): 2342 – 51 . 10228149 10.1093/emboj/18.9.2342 1171317",
            "ntype": "ref",
            "meta": {
                "id": "ref-58",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_98",
            "content": "<REF-59> Gottesdiener KM : A new VSG expression site-associated gene (ESAG) in the promoter region of Trypanosoma brucei encodes a protein with 10 potential transmembrane domains. Mol Biochem Parasitol. 1994 ; 63 ( 1 ): 143 – 51 . 8183314 10.1016/0166-6851(94)90017-5",
            "ntype": "ref",
            "meta": {
                "id": "ref-59",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_99",
            "content": "<REF-60> Stewart RA Meyer KF : Isolation of Coccidioides immitis (Stiles) from the soil. Exp Biol Med. 1932 ; 29 ( 8 ): 937 – 8 . 10.3181/00379727-29-6159",
            "ntype": "ref",
            "meta": {
                "id": "ref-60",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_100",
            "content": "<REF-61> Greene DR Koenig G Fisher MC : Soil isolation and molecular identification of Coccidioides immitis . Mycologia. 2000 ; 92 ( 3 ): 406 – 10 . 10.2307/3761498",
            "ntype": "ref",
            "meta": {
                "id": "ref-61",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_101",
            "content": "<REF-63> Hajji M Kanoun S Nasri M : Purification and characterization of an alkaline serine-protease produced by a new isolated Aspergillus clavatus ES1. Process Biochem. 2007 ; 42 ( 5 ): 791 – 7 . 10.1016/j.procbio.2007.01.011",
            "ntype": "ref",
            "meta": {
                "id": "ref-63",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_102",
            "content": "<REF-64> Rodríguez-Cerdeira C Arenas R Moreno-Coutiño G : Systemic fungal infections in patients with human inmunodeficiency virus. Actas Dermosifiliogr. 2014 ; 105 ( 1 ): 5 – 17 . 23107866 10.1016/j.ad.2012.06.017",
            "ntype": "ref",
            "meta": {
                "id": "ref-64",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_103",
            "content": "<REF-65> Awadelkariem FM Hunter KJ Kirby GC : Crithidia fasciculata as feeder cells for malaria parasites. Exp Parasitol. 1995 ; 80 ( 1 ): 98 – 106 . 7821416 10.1006/expr.1995.1011",
            "ntype": "ref",
            "meta": {
                "id": "ref-65",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_104",
            "content": "<REF-66> Krungkrai J Cerami A Henderson GB : Pyrimidine biosynthesis in parasitic protozoa: purification of a monofunctional dihydroorotase from Plasmodium berghei and Crithidia fasciculata . Biochemistry. 1990 ; 29 ( 26 ): 6270 – 5 . 1976382 10.1021/bi00478a023",
            "ntype": "ref",
            "meta": {
                "id": "ref-66",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_105",
            "content": "<REF-67> Eyal E Najmanovich R Mcconkey BJ : Importance of solvent accessibility and contact surfaces in modeling side-chain conformations in proteins. J Comput Chem. 2004 ; 25 ( 5 ): 712 – 24 . 14978714 10.1002/jcc.10420",
            "ntype": "ref",
            "meta": {
                "id": "ref-67",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_106",
            "content": "<REF-68> Fedorova ND Khaldi N Joardar VS : Genomic islands in the pathogenic filamentous fungus Aspergillus fumigatus . PLoS Genet. 2008 ; 4 ( 4 ): e1000046 . 18404212 10.1371/journal.pgen.1000046 2289846",
            "ntype": "ref",
            "meta": {
                "id": "ref-68",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-36_v1_107",
            "content": "<REF-85> Kumar S Stecher G Tamura K : MEGA7: Molecular Evolutionary Genetics Analysis Version 7.0 for Bigger Datasets. Mol Biol Evol. 2016 ; 33 ( 7 ): 1870 – 4 . 27004904 10.1093/molbev/msw054",
            "ntype": "ref",
            "meta": {
                "id": "ref-85",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "6-36_v1_0@0",
            "content": "Genome-wide characterization of folate transporter proteins of eukaryotic pathogens",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_0",
            "start": 0,
            "end": 82,
            "label": {}
        },
        {
            "ix": "6-36_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "6-36_v1_2@0",
            "content": "Background: Medically important pathogens are responsible for the death of millions every year.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_2",
            "start": 0,
            "end": 94,
            "label": {}
        },
        {
            "ix": "6-36_v1_2@1",
            "content": "For many of these pathogens, there are limited options for therapy and resistance to commonly used drugs is fast emerging.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_2",
            "start": 96,
            "end": 217,
            "label": {}
        },
        {
            "ix": "6-36_v1_2@2",
            "content": "The availability of genome sequences of many eukaryotic protozoa is providing important data for understanding parasite biology and identifying new drug and vaccine targets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_2",
            "start": 219,
            "end": 391,
            "label": {}
        },
        {
            "ix": "6-36_v1_2@3",
            "content": "The folate synthesis and salvage pathway are important for eukaryote pathogen survival and organismal biology and may present new targets for drug discovery.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_2",
            "start": 393,
            "end": 549,
            "label": {}
        },
        {
            "ix": "6-36_v1_3@0",
            "content": "Methods: We applied a combination of bioinformatics methods to examine the genomes of pathogens in the EupathDB for genes encoding homologues of proteins that mediate folate salvage in a bid to identify and assign putative functions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_3",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "6-36_v1_3@1",
            "content": "We also performed phylogenetic comparisons of identified proteins. .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_3",
            "start": 234,
            "end": 301,
            "label": {}
        },
        {
            "ix": "6-36_v1_4@0",
            "content": "Results: We identified 234 proteins to be involve in folate transport in 63 strains, 28 pathogen species and 12 phyla, 60% of which were identified for the first time.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_4",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "6-36_v1_4@1",
            "content": "Many of the genomes examined contained genes encoding transporters such as folate-binding protein YgfZ, folate/pteridine transporter, folate/biopterin transporter, reduced folate carrier family protein, folate/methotrexate transporter FT1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_4",
            "start": 168,
            "end": 406,
            "label": {}
        },
        {
            "ix": "6-36_v1_4@2",
            "content": "The mitochondrion is the predicted location of the majority of the proteins, with 15% possessing signal peptides.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_4",
            "start": 408,
            "end": 520,
            "label": {}
        },
        {
            "ix": "6-36_v1_4@3",
            "content": "Phylogeny computation shows the similarity of the proteins identified.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_4",
            "start": 522,
            "end": 591,
            "label": {}
        },
        {
            "ix": "6-36_v1_5@0",
            "content": "Conclusion: These findings offer new possibilities for potential drug development targeting folate-salvage proteins in eukaryotic pathogens.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_5",
            "start": 0,
            "end": 139,
            "label": {}
        },
        {
            "ix": "6-36_v1_6@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_6",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@0",
            "content": "A heterogeneous diversity of eukaryotic pathogens is responsible for the most economically important diseases of humans and animals <REF-1> , <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 0,
            "end": 150,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@1",
            "content": "As a result of underdevelopment, a lack of social infrastructure and insufficient funding of public health facilities, most of these pathogens are endemic to resource-poor countries in sub-Saharan Africa, South-East Asia and South America, where they are responsible for high morbidity and mortality <REF-1> – <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 152,
            "end": 470,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@2",
            "content": "Of these, parasitic protozoa form a major group, with the apicomplexans and kinetoplastid parasites represented by important members, which cause diseases such as malaria, cryptosporidiosis, toxoplasmosis, babesiosis, leishmaniasis, Human African trypanosomiasis and south American trypanosomiasis or Chagas’ disease causing most of the morbidity and mortality <REF-4> , <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 472,
            "end": 851,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@3",
            "content": "Other important diseases caused by protozoans include giardiasis, amoebic dysentery <REF-6> , <REF-7> and trichomoniasis <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 853,
            "end": 982,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@4",
            "content": "A vicious cycle of poverty and disease exists for most of these parasites with a high infection and death rate in affected populations <REF-9> – <REF-11> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 984,
            "end": 1138,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@5",
            "content": "The appreciable burden of disease caused by these parasites has been aggravated by the lack of a licensed vaccine for most of them <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 1140,
            "end": 1280,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@6",
            "content": "Furthermore, current drugs of choice for treatment for many of the parasites have significant side effects, with the added emergence of drug resistant strains <REF-13> – <REF-15> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 1282,
            "end": 1461,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@7",
            "content": "Despite the urgent demand for new therapies for control, few drugs have been developed to combat these parasites <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 1463,
            "end": 1585,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@8",
            "content": "A major limitation to the development of new drugs is the paucity of new drug targets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 1587,
            "end": 1672,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@9",
            "content": "There is therefore a need for discovery of novel and alternate potential chemotherapeutic targets that can help in drug development efforts for disease control <REF-16> – <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 1674,
            "end": 1854,
            "label": {}
        },
        {
            "ix": "6-36_v1_7@10",
            "content": "A possible approach to selective antimicrobial chemotherapy has been to exploit the inhibition of unique targets, vital to the pathogen and absent in mammals <REF-17> , <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_7",
            "start": 1856,
            "end": 2034,
            "label": {}
        },
        {
            "ix": "6-36_v1_8@0",
            "content": "A metabolic pathway that has been exploited considerably for the development of drugs is the folate biosynthetic pathway <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_8",
            "start": 0,
            "end": 130,
            "label": {}
        },
        {
            "ix": "6-36_v1_8@1",
            "content": "Antifolate drugs target this pathway and are the most important and successful antimicrobial chemotherapies targeting a range of bacterial and eukaryotic pathogens.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_8",
            "start": 132,
            "end": 295,
            "label": {}
        },
        {
            "ix": "6-36_v1_8@2",
            "content": "While most parasitic protozoa can synthesize folates from simple precursors, such as GTP, p-aminobenzoic acid (pABA) and glutamate, higher animals and humans cannot <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_8",
            "start": 297,
            "end": 471,
            "label": {}
        },
        {
            "ix": "6-36_v1_8@3",
            "content": "Additionally, a few of these parasites can also salvage folate as nutrient from their host <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_8",
            "start": 473,
            "end": 573,
            "label": {}
        },
        {
            "ix": "6-36_v1_8@4",
            "content": "These folate compounds are important for synthesis of DNA, RNA and membrane lipids and are transported via receptor-mediated or/and carrier-mediated transmembrane proteins; folate transporters <REF-20> – <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_8",
            "start": 575,
            "end": 788,
            "label": {}
        },
        {
            "ix": "6-36_v1_8@5",
            "content": "Importantly, antifolate chemotherapies that target the biosynthesis and processing of folate cofactors have been effective in the chemotherapy of bacterial and protozoan parasites <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_8",
            "start": 790,
            "end": 979,
            "label": {}
        },
        {
            "ix": "6-36_v1_8@6",
            "content": "More importantly, the folate pathway has also been confirmed as being essential in some eukaryotic pathogens such as Plasmodium , trypanosomes and Leishmania <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_8",
            "start": 981,
            "end": 1148,
            "label": {}
        },
        {
            "ix": "6-36_v1_9@0",
            "content": "In addition to the folate biosynthesis pathway, proteins that mediate transport of useful nutrients such as folic acid have been identified as important chemotherapeutic drug targets <REF-18> , <REF-19> , <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_9",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "6-36_v1_9@1",
            "content": "Hence, the folate pathway, metabolites and transporters continue to be extensively studied for identification of new enzymes including transporters, which may serve as new drug targets <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_9",
            "start": 216,
            "end": 410,
            "label": {}
        },
        {
            "ix": "6-36_v1_9@2",
            "content": "Recent estimates have ascribed eight different membrane transporters to eukaryotes <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_9",
            "start": 412,
            "end": 504,
            "label": {}
        },
        {
            "ix": "6-36_v1_10@0",
            "content": "Proteins that mediate transportation of folates have been well studied in a few parasites such as Plasmodium falciparum, Trypanosoma brucei, Leishmania donovani and Leishmania major <REF-25> , <REF-26> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_10",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "6-36_v1_10@1",
            "content": "These studies have provided information on mode of action of drugs <REF-25> , <REF-27> , <REF-28> in addition to studies describing mechanisms of parasite drug resistance <REF-25> – <REF-32> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_10",
            "start": 204,
            "end": 395,
            "label": {}
        },
        {
            "ix": "6-36_v1_10@2",
            "content": "However, folate transport proteins remain unidentified and uncharacterized in many other eukaryotic pathogens.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_10",
            "start": 397,
            "end": 506,
            "label": {}
        },
        {
            "ix": "6-36_v1_10@3",
            "content": "This is despite the sequencing of the genomes of most eukaryotic pathogens, which has produced a vast wealth of data that could aid in identification of druggable pathogen-specific proteins <REF-33> – <REF-39> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_10",
            "start": 508,
            "end": 718,
            "label": {}
        },
        {
            "ix": "6-36_v1_10@4",
            "content": "It is therefore imperative to search and identify from these parasite genomes additional proteins such as folate transporters that may serve as novel drug targets <REF-40> , <REF-41> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_10",
            "start": 720,
            "end": 903,
            "label": {}
        },
        {
            "ix": "6-36_v1_11@0",
            "content": "Therefore, in an attempt to identify and characterize targets for novel therapeutics, we report herein an extensive search of folate transporters from pathogen genomes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_11",
            "start": 0,
            "end": 167,
            "label": {}
        },
        {
            "ix": "6-36_v1_11@1",
            "content": "In addition, we investigated the evolutionary relationship of these transporters in a bid to determine similarities and differences that make them attractive drug targets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_11",
            "start": 169,
            "end": 339,
            "label": {}
        },
        {
            "ix": "6-36_v1_11@2",
            "content": "The knowledge provided may assist in the design of new antifolates for protozoan parasites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_11",
            "start": 341,
            "end": 431,
            "label": {}
        },
        {
            "ix": "6-36_v1_12@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_12",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "6-36_v1_13@0",
            "content": "Our experiment workflow is depicted in Figure 1 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_13",
            "start": 0,
            "end": 48,
            "label": {}
        },
        {
            "ix": "6-36_v1_13@1",
            "content": "We extracted protein sequences of approximately 200 pathogens that mediate transportation or salvage of folates from Eukaryotic Pathogen Genome Database Resources ( http://eupathdb.org/eupathdb/ ), and from the literature using a key-word search.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_13",
            "start": 50,
            "end": 295,
            "label": {}
        },
        {
            "ix": "6-36_v1_13@2",
            "content": "We also searched the 200 pathogen genome sequences archived at the Eukaryotic Pathogen Genome Database Resources ( http://eupathdb.org/eupathdb/ ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_13",
            "start": 297,
            "end": 443,
            "label": {}
        },
        {
            "ix": "6-36_v1_13@3",
            "content": "The search was for all proteins that mediate transportation or folate salvage alone or folate salvage and related compounds (such as pteridine, biopterin and methotrexate) together.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_13",
            "start": 445,
            "end": 625,
            "label": {}
        },
        {
            "ix": "6-36_v1_13@4",
            "content": "This database gives public access to most sequenced emerging/re-emerging infectious pathogen genomes <REF-42> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_13",
            "start": 627,
            "end": 737,
            "label": {}
        },
        {
            "ix": "6-36_v1_13@5",
            "content": "We utilized the word “folate” for search on the gene text and “folic acid” was used to confirm the hits.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_13",
            "start": 739,
            "end": 842,
            "label": {}
        },
        {
            "ix": "6-36_v1_13@6",
            "content": "Hit results containing proteins annotated as folate-binding protein YgfZ, folate/pteridine transporter, folate/biopterin transporter, reduced folate carrier family protein, folate/methotrexate transporter FT1, Folate transporters alone and other folate related proteins were retrieved.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_13",
            "start": 844,
            "end": 1128,
            "label": {}
        },
        {
            "ix": "6-36_v1_13@7",
            "content": "The complete list of proteins extracted from Eupthadb is presented in Dataset 1 <REF-43> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_13",
            "start": 1130,
            "end": 1219,
            "label": {}
        },
        {
            "ix": "6-36_v1_13@8",
            "content": "The folate transporters were classified based on type of transporter, number of transmembrane helix (TMH) and localization (either cell or mitochondrial membrane) of transporter.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_13",
            "start": 1221,
            "end": 1398,
            "label": {}
        },
        {
            "ix": "6-36_v1_13@9",
            "content": "Gene sequences were obtained in FASTA format for transporter proteins using the sequence download tool on EupathDB ( http://eupathdb.org/eupathdb/ ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_13",
            "start": 1400,
            "end": 1548,
            "label": {}
        },
        {
            "ix": "6-36_v1_14@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_14",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@0",
            "content": "To ensure that most of the retrieved proteins had not been previously studied, we performed a literature search on PubMed ( http://www.ncbi.nlm.nih.gov/pubmed/?term= ) and Google Scholar ( https://scholar.google.com ) using the query “folate transporter + Parasite name”.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 0,
            "end": 270,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@1",
            "content": "The protein sequence information ( Dataset 1 <REF-43> and Table 1 ) obtained from literature search was used for a BLAST search on EupathDB ( http://eupathdb.org/eupathdb/ ), UniprotDB ( http://www.uniprot.org ) and GeneDB ( http://www.genedb.org/Homepage ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 272,
            "end": 529,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@2",
            "content": "Sequence data were edited on textEdit mac version and uploaded to Molecular Evolutionary Genetics Analysis (MEGA) platform version 7.0 obtained from http://www.megasoftware.net <REF-44> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 531,
            "end": 717,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@3",
            "content": "The 234 sequences were aligned using muscle tools with large alignment (Max iterations = 2) selected while other settings were left at defaults.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 719,
            "end": 862,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@4",
            "content": "Evolutionary history was inferred using the Neighbor-Joining method <REF-45> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 864,
            "end": 941,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@5",
            "content": "The percentage of replicate trees in which the associated taxa clustered together in the bootstrap test (500 replicates) was also analysed <REF-46> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 943,
            "end": 1091,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@6",
            "content": "The tree was drawn to scale, with branch lengths in the same units as those of the evolutionary distances used to infer the phylogenetic tree.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 1093,
            "end": 1234,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@7",
            "content": "The evolutionary distances were computed using the number of differences method <REF-47> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 1236,
            "end": 1325,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@8",
            "content": "While uniform rate and complete deletion was selected for substitution rates and data subset, respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 1327,
            "end": 1433,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@9",
            "content": "Other parameters were at default settings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 1435,
            "end": 1476,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@10",
            "content": "All positions containing gaps and missing data were eliminated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 1478,
            "end": 1540,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@11",
            "content": "The newick format of the tree was exported and opened on FigTree 1.4.2 platform downloaded from http://tree.bio.ed.ac.uk/software/figtree/ <REF-48> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 1542,
            "end": 1690,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@12",
            "content": "The final tree was constructed using radial tree layout.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 1692,
            "end": 1747,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@13",
            "content": "Additional analysis consisted of sub-phylogenies based on the transporter type.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 1749,
            "end": 1827,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@14",
            "content": "Since folate-binding protein YgfZ, folate/pteridine transporter, folate/biopterin transporter, putative, reduced folate carrier family protein, folate/methotrexate transporter FT1, putative folate transporters alone and others have 10, 25, 132, 2, 7, 49 and 9.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 1829,
            "end": 2088,
            "label": {}
        },
        {
            "ix": "6-36_v1_16@15",
            "content": "So we decided to reconstruct the phylogeny based folate transporter, folate-biopterin transporter after considering the identification number, the species diversity in each category.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_16",
            "start": 2090,
            "end": 2271,
            "label": {}
        },
        {
            "ix": "6-36_v1_17@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_17",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "6-36_v1_19@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_19",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "6-36_v1_20@0",
            "content": "A methodological search for folate transporters in all eukaryotic pathogen genomes we examined under EupathDB with validation via GenBank, GeneDB and Uniprot contained a total of 234 proteins (detail features of proteins are presented in Dataset 1 <REF-43> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_20",
            "start": 0,
            "end": 258,
            "label": {}
        },
        {
            "ix": "6-36_v1_20@1",
            "content": "We identified these transporters in 28 pathogen species (containing 63 strains) cutting across 12 phyla ( Table 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_20",
            "start": 260,
            "end": 375,
            "label": {}
        },
        {
            "ix": "6-36_v1_20@2",
            "content": "The parasites with the highest number of folate transporters are Phytophthora parasitica INRA-310, P. infestans T30–4 and Leptomonas pyrrhocoris H10 with 20, 16 and 16 proteins, respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_20",
            "start": 377,
            "end": 567,
            "label": {}
        },
        {
            "ix": "6-36_v1_20@3",
            "content": "While Aspergillus clavatus NRRL 1, A. flavus NRRL3357, A. macrogynus ATCC 38327, Crithidia fasciculata strain Cf-Cl and others have one folate transporter protein each ( Table 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_20",
            "start": 569,
            "end": 748,
            "label": {}
        },
        {
            "ix": "6-36_v1_20@4",
            "content": "The different proteins identified to be involved in folate salvage or related molecules were folate-binding protein YgfZ, folate/pteridine transporter, folate/biopterin transporter, reduced folate carrier family protein, folate/methotrexate transporter FT1 and folate transporters having a 4%, 11%, 56%, 1%, 3% and 21% identity, respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_20",
            "start": 750,
            "end": 1091,
            "label": {}
        },
        {
            "ix": "6-36_v1_20@5",
            "content": "Proteins that did not belong to these groups were classified as others (4%) ( Figure 2A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_20",
            "start": 1093,
            "end": 1182,
            "label": {}
        },
        {
            "ix": "6-36_v1_20@6",
            "content": "A good number of the proteins identified had predicted transmembrane helixes with a few having none ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_20",
            "start": 1184,
            "end": 1297,
            "label": {}
        },
        {
            "ix": "6-36_v1_20@7",
            "content": "Furthermore, a number of the transporters possess signal peptides ( Dataset 1 <REF-43> ), which may be required for targeting to cellular locations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_20",
            "start": 1299,
            "end": 1446,
            "label": {}
        },
        {
            "ix": "6-36_v1_20@8",
            "content": "Deciphering the sequence of the targeting signal may indicate its product destination.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_20",
            "start": 1448,
            "end": 1533,
            "label": {}
        },
        {
            "ix": "6-36_v1_21@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_21",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-36_v1_23@0",
            "content": "Our literature search for parasite folate transporters on PubMed and Google Scholar indicated 60% (38 out 63) of the proteins were identified for the first time as presented in Table 1 and Figure 2C , while 40% have been previously investigated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_23",
            "start": 0,
            "end": 244,
            "label": {}
        },
        {
            "ix": "6-36_v1_23@1",
            "content": "Besides, the Leishmania folate transporters we came across were not found on the EupathDB resource.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_23",
            "start": 246,
            "end": 344,
            "label": {}
        },
        {
            "ix": "6-36_v1_23@2",
            "content": "We thus performed a BLAST search of Kinetoplastida on EupathDB, the returned hits were folate/biopterin transporter for L. infantum .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_23",
            "start": 346,
            "end": 478,
            "label": {}
        },
        {
            "ix": "6-36_v1_23@3",
            "content": "The only Plasmodium species with results for proteins that salvage folate was P. falciparum .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_23",
            "start": 480,
            "end": 572,
            "label": {}
        },
        {
            "ix": "6-36_v1_23@4",
            "content": "Our study, however, describes for the first time the presence of these transporters in other Plasmodium species.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_23",
            "start": 574,
            "end": 685,
            "label": {}
        },
        {
            "ix": "6-36_v1_23@5",
            "content": "There were no transporter proteins deposited in EupathDB for P. malariae and P. ovale.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_23",
            "start": 687,
            "end": 772,
            "label": {}
        },
        {
            "ix": "6-36_v1_23@6",
            "content": "However, folate transporters I and II were retrieved from our search of GeneDB for P. malariae and P. ovale curtisi , respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_23",
            "start": 774,
            "end": 904,
            "label": {}
        },
        {
            "ix": "6-36_v1_24@0",
            "content": "Our analysis of folate transporters indicate the presence in Plasmodium species of two proteoforms; folate transporter I and II ( Dataset 1 <REF-43> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_24",
            "start": 0,
            "end": 150,
            "label": {}
        },
        {
            "ix": "6-36_v1_24@1",
            "content": "All Leishmania species identified possess folate/biopterin transporters and not folate transporters.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_24",
            "start": 152,
            "end": 251,
            "label": {}
        },
        {
            "ix": "6-36_v1_24@2",
            "content": "Trypanosome species have both folate/pteridine and folate transporters; T. cruzi Dm28c, T. cruzi Sylvio X10/1 and T. cruzi CL Brener Esmeraldo-like, T. cruzi CL Brener Non-Esmeraldo-like and T. cruzi marinkellei strain B7 all have folate/pteridine transporter while T. brucei TREU927, T. brucei Lister strain 427, T. brucei gambiense DAL972, T. congolense IL3000 possess folate transporters.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_24",
            "start": 253,
            "end": 643,
            "label": {}
        },
        {
            "ix": "6-36_v1_24@3",
            "content": "Eukaryotic parasites like Eimeria acervulina Houghton, E. brunetti Houghton, E. maxima Weybridge, E. necatrix Houghton, E. praecox Houghton, E. tenella strain Houghton and Neospora caninum Liverpool all boast folate/methotrexate transporter FT1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_24",
            "start": 645,
            "end": 889,
            "label": {}
        },
        {
            "ix": "6-36_v1_24@4",
            "content": "The folate-binding protein YgfZ was found in the fungus, Allomyces macrogynus ATCC 38327, the protist C. fasciculata strain Cf-Cl, C. immitis RS, the feline protozoon, Hammondia hammondi strain H.H.34, Sarcocystis neurona SN3, S. punctatus DAOM BR117, T. gondii GT1, T. gondii ME49, T. gondii VEG and T. brucei TREU927.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_24",
            "start": 891,
            "end": 1209,
            "label": {}
        },
        {
            "ix": "6-36_v1_24@5",
            "content": "Parasites such as Microsporidium daphniae UGP3 and the amoeba Naegleria fowleri ATCC 30863 possess the reduced folate carrier family protein ( Figure 2D ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_24",
            "start": 1211,
            "end": 1365,
            "label": {}
        },
        {
            "ix": "6-36_v1_24@6",
            "content": "We observed that 7% of the identified proteins are localized on the mitochondrial membrane of some pathogens such as the fungi Aspergillus clavatus NRRL 1, A. flavus NRRL3357, C. immitis RS, the yeast Cryptococcus neoformans var.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_24",
            "start": 1367,
            "end": 1595,
            "label": {}
        },
        {
            "ix": "6-36_v1_24@7",
            "content": "grubii H99, Fusarium graminearum PH-1, A. capsulatus G186AR, Leptomonas pyrrhocoris H10, the food fungus Neosartorya fischeri NRRL 181, Phytophthora parasitica INRA-310 and P. ultimum DAOM BR144.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_24",
            "start": 1597,
            "end": 1791,
            "label": {}
        },
        {
            "ix": "6-36_v1_24@8",
            "content": "The remaining proteins are localized on the plasma membrane ( Dataset 1 <REF-43> and Figure 2D ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_24",
            "start": 1793,
            "end": 1889,
            "label": {}
        },
        {
            "ix": "6-36_v1_25@0",
            "content": "Approximately 15% (34/234) of the folate transporters identified possess signal peptides ( Figure 2E ) with the trypanosomes with the most signal peptides.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_25",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "6-36_v1_25@1",
            "content": "Deductions can be made of the probable destination within the cell of any transporter by its signal peptide sequence; thus, further work may seek to decipher the sequence of the targeting signal to determine its localization.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_25",
            "start": 156,
            "end": 380,
            "label": {}
        },
        {
            "ix": "6-36_v1_25@2",
            "content": "The proteins identified all have transmembrane helixes with the exception of the alveolate Chromera velia CCMP2878, apicomplexan P. berghei ANKA, S. neurona SN3, the kinetoplastid T. brucei TREU927, T. grayi ANR4 and protist Vitrella brassicaformis CCMP3155 with Gene ID’s Cvel_17766, PBANKA_0713700, SN3_01500005, Tb927.8.6480, Tgr.2739.1000 and Vbra_15327, respectively ( Dataset 1 <REF-43> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_25",
            "start": 382,
            "end": 776,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@0",
            "content": "The phylogenetic tree ( Figure 3 ) shows the evolutionary position, history and relationship of all the folate transporters identified in this work.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@1",
            "content": "The type of transporter or species/strain was used for constructing phylogenic trees, with the 234 proteins identified forming two clades, a major and minor.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 149,
            "end": 305,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@2",
            "content": "The major clade lacked a sub-clade, while the minor clade possessed a sub-clade.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 307,
            "end": 386,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@3",
            "content": "All proteins identified were distributed between the two major clades; except for folate/methotrexate transporter and mitochondrial folate transporter, with the latter present on the major clade and the former on the minor clade exclusively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 388,
            "end": 628,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@4",
            "content": "All the species are represented on both clades, however, V. brassicaformis CCMP3155, Plasmodium species, A. clavatus NRRL, A. flavus NRRL3357, A. macrogynus ATCC 38327, C. fasciculata strain Cf-Cl, C. immitis RS, C. immitis RS, C. muris RN66, C. neoformans var.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 630,
            "end": 890,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@5",
            "content": "grubii H99, C. neoformans var.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 892,
            "end": 921,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@6",
            "content": "grubii H99, Leishmania species, N. bombycis CQ1, N. caninum Liverpool, F. graminearum PH-1 and H. hammondi strain H.H.34 are exclusively on the major clade.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 923,
            "end": 1078,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@7",
            "content": "There are some parasites that were identified once, as shown in Dataset 1 <REF-43> ; these are mostly in the large clade.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 1080,
            "end": 1200,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@8",
            "content": "Some of these pathogens include P. ultimum DAOM BR144, which has mitochondrial folate transporter/carrier proteins similar to Homo sapiens , E. cuniculi GB-M1, which has proteins similar to folate transporter, and S. punctatus DAOM BR117, which has folate-binding protein YgfZ. These were the only proteins of the aforementioned species identified in this work.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 1202,
            "end": 1562,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@9",
            "content": "However, M. daphniae UGP3, which had reduced folate carrier domain containing protein, was the only parasite that was found in the small clade.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 1564,
            "end": 1706,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@10",
            "content": "Improving on our phylogenetic analysis, we performed a sub-phylogenetic reconstruction ( Figure 4 – Figure 6 ) based on the substrate type of the transport proteins.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 1708,
            "end": 1872,
            "label": {}
        },
        {
            "ix": "6-36_v1_26@11",
            "content": "After phylogenetic analysis each sub-phylogeny show a clear characterization except for folate-biopterin transporters ( Figure 5 ), which fell in a different clade save for Leptomonas species and C. velia .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_26",
            "start": 1874,
            "end": 2079,
            "label": {}
        },
        {
            "ix": "6-36_v1_27@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_27",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-36_v1_29@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_29",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-36_v1_31@0",
            "content": "Figure 5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_31",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-36_v1_33@0",
            "content": "Figure 6.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_33",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-36_v1_36@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_36",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "6-36_v1_37@0",
            "content": "Folate transporters are important proteins involved in the salvage of folate, cofactors and related molecules in eukaryotic pathogens important for metabolism and survival in their respective hosts <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_37",
            "start": 0,
            "end": 207,
            "label": {}
        },
        {
            "ix": "6-36_v1_37@1",
            "content": "We identified proteins that could mediate the salvage of folates into cells and/or mitochondria from eukaryotic pathogen genomes in EupathDB.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_37",
            "start": 209,
            "end": 349,
            "label": {}
        },
        {
            "ix": "6-36_v1_37@2",
            "content": "Many of these proteins are involved in folate biosynthesis or transport and are present in many of the eukaryotic pathogens we queried.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_37",
            "start": 351,
            "end": 485,
            "label": {}
        },
        {
            "ix": "6-36_v1_37@3",
            "content": "In this study, 234 genes encoding homologues of folate salvaging proteins were identified in the genome of 64 strains, representing 28 species of eukaryotic pathogens.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_37",
            "start": 487,
            "end": 653,
            "label": {}
        },
        {
            "ix": "6-36_v1_37@4",
            "content": "Some of the pathogens include P. falciparum 3D7 and IT, P. knowlesi H, P. berghei ANKA, P. chabaudi chabaudi, T. brucei Lister 427, T. brucei TREU927, T. brucei gambiense DAL972, Encephalitozoon cuniculi GB-M1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_37",
            "start": 655,
            "end": 864,
            "label": {}
        },
        {
            "ix": "6-36_v1_37@5",
            "content": "The pathogens range from bacteria through to fungi, intracellular parasites such as Plasmodium and leishmania species, to extracellular parasites such as trypanosome species.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_37",
            "start": 866,
            "end": 1039,
            "label": {}
        },
        {
            "ix": "6-36_v1_37@6",
            "content": "This suggests a widespread presence of the proteins cutting across a range of pathogens that infect humans and animals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_37",
            "start": 1041,
            "end": 1159,
            "label": {}
        },
        {
            "ix": "6-36_v1_38@0",
            "content": "A few of the proteins we identified have been previously identified and characterized in parasites such as Plasmodium falciparum <REF-22> , <REF-30> , Trypanosome species <REF-26> , Leishmania species and Toxoplasma gondii <REF-49> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_38",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "6-36_v1_38@1",
            "content": "It has been estimated that over half of the drugs currently on the market target integral membrane proteins of which membrane transporters are a part, but unfortunately, these transporters have not been adequately explored as drug targets <REF-50> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_38",
            "start": 234,
            "end": 482,
            "label": {}
        },
        {
            "ix": "6-36_v1_38@2",
            "content": "Folate transporters therefore represent attractive drug targets for treatment of infectious diseases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_38",
            "start": 484,
            "end": 584,
            "label": {}
        },
        {
            "ix": "6-36_v1_38@3",
            "content": "Thus their identification from other eukaryotic pathogens could open a window for novel chemotherapeutics for disease control <REF-51> , <REF-52> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_38",
            "start": 586,
            "end": 732,
            "label": {}
        },
        {
            "ix": "6-36_v1_39@0",
            "content": "In Plasmodium two folate transporters have been identified, namely Pf FT1 and Pf T2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_39",
            "start": 0,
            "end": 83,
            "label": {}
        },
        {
            "ix": "6-36_v1_39@1",
            "content": "These transporters have been shown to mediate the salvage of folate derivatives and precursors in P. falciparum and proposed blocking of their salvage activities may improve the antimalarial efficacy of several classes of antimalarial drugs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_39",
            "start": 85,
            "end": 325,
            "label": {}
        },
        {
            "ix": "6-36_v1_39@2",
            "content": "In our work we identified folate transporters for other plasmodial species, which, like P. falciparum , may also be chemotherapeutic targets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_39",
            "start": 327,
            "end": 467,
            "label": {}
        },
        {
            "ix": "6-36_v1_39@3",
            "content": "Transport of folate in higher eukaryotes is made possible by a high affinity folate-biopterin transporters FBT or BT1 family <REF-22> , <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_39",
            "start": 469,
            "end": 614,
            "label": {}
        },
        {
            "ix": "6-36_v1_39@4",
            "content": "In the trypanosomes and related kinetoplastids, a member of these transporters, the folate biopterin transporter (FBT) family of proteins was identified in Leishmania <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_39",
            "start": 616,
            "end": 792,
            "label": {}
        },
        {
            "ix": "6-36_v1_39@5",
            "content": "It is thought that MFS proteins are related to the FBT.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_39",
            "start": 794,
            "end": 848,
            "label": {}
        },
        {
            "ix": "6-36_v1_39@6",
            "content": "These proteins have been characterized in a few protozoa and cyanobacteria <REF-53> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_39",
            "start": 850,
            "end": 934,
            "label": {}
        },
        {
            "ix": "6-36_v1_39@7",
            "content": "Results from our study describing the presence of these transporters across several phyla corroborate results other researches, establishing the conservation of folate transport function among FBT family proteins from species from plants and protists <REF-22> , <REF-53> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_39",
            "start": 936,
            "end": 1207,
            "label": {}
        },
        {
            "ix": "6-36_v1_40@0",
            "content": "Malaria parasites encode transporters belonging to the organo anion transporter (OAT) folate-biopterin transporter (FBT), glycoside-pentoside-hexuronide: cation symporter (GPH), families, which are closely related to the major facilitator super-family of membrane proteins <REF-54> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_40",
            "start": 0,
            "end": 282,
            "label": {}
        },
        {
            "ix": "6-36_v1_40@1",
            "content": "The inhibition of these transporters by blockers of organic anion transporters such as probenecid has been implicated in sensitization of Plasmodium resistant parasites to antifolates <REF-55> , <REF-56> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_40",
            "start": 284,
            "end": 488,
            "label": {}
        },
        {
            "ix": "6-36_v1_40@2",
            "content": "Thus, in Plasmodium chemotherapy, identification of folate transporters could lead to screening for compounds that interfere with folate transport and salvage for antimalarial chemotherapy <REF-22> , <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_40",
            "start": 490,
            "end": 699,
            "label": {}
        },
        {
            "ix": "6-36_v1_40@3",
            "content": "We identified several types of folate transporters that have been described and functionally characterized in Leishmania with some implicated in the import of the antifolate methotrexate <REF-57> , <REF-58> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_40",
            "start": 701,
            "end": 908,
            "label": {}
        },
        {
            "ix": "6-36_v1_40@4",
            "content": "Thus far, only protozoan transporters in Plasmodium , Leishmania , and Trypanosoma brucei have been characterized and these are known to mediate the uptake of the vitamins folate and/or biopterin <REF-22> , <REF-59> , <REF-60> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_40",
            "start": 910,
            "end": 1137,
            "label": {}
        },
        {
            "ix": "6-36_v1_40@5",
            "content": "Thus in parasites species of medical importance folate transporter proteins may provide new targets for therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_40",
            "start": 1139,
            "end": 1250,
            "label": {}
        },
        {
            "ix": "6-36_v1_41@0",
            "content": "We also identified folate salvaging proteins from fungi such as Coccidioides immitis and A. clavatus , fungi found in soil <REF-61> – <REF-63> , vegetable <REF-61> and waters in tropical and subtropical areas <REF-64> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_41",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "6-36_v1_41@1",
            "content": "These fungi are known to occasionally become pathogenic and act as opportunistic pathogens for animals and man <REF-63> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_41",
            "start": 220,
            "end": 340,
            "label": {}
        },
        {
            "ix": "6-36_v1_41@2",
            "content": "Coccidioidomycosis caused by C. immitis in association with AIDS has been known to be a fatal disease <REF-65> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_41",
            "start": 342,
            "end": 453,
            "label": {}
        },
        {
            "ix": "6-36_v1_41@3",
            "content": "Treatment of acute and chronic infections with antifungals such as amphotericin B have not been adequate, hence folate transporters may present new targets in these group of pathogens.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_41",
            "start": 455,
            "end": 638,
            "label": {}
        },
        {
            "ix": "6-36_v1_41@4",
            "content": "Identification was also made on pathogens such as C. fasciculata that parasitize several species of insects including mosquitoes and has been widely used to test new therapeutic strategies against parasitic infections <REF-66> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_41",
            "start": 640,
            "end": 867,
            "label": {}
        },
        {
            "ix": "6-36_v1_41@5",
            "content": "As a model organism, folate transporters identified in C. fasciculata may be useful in research for developing new drugs in medically important Kinetoplasts as has been shown for other targets in this protozoan parasite <REF-67> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_41",
            "start": 869,
            "end": 1098,
            "label": {}
        },
        {
            "ix": "6-36_v1_42@0",
            "content": "We noticed that P. parasitica INRA-310 and L. pyrrhocoris H10 had the highest number of folate transporters identified.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_42",
            "start": 0,
            "end": 118,
            "label": {}
        },
        {
            "ix": "6-36_v1_42@1",
            "content": "Their utility as model fungal ( P. parasitica ) and monoxenous kinetoplast may provide models instrumental for developing new antifolates for fungal and protozoan diseases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_42",
            "start": 120,
            "end": 291,
            "label": {}
        },
        {
            "ix": "6-36_v1_42@2",
            "content": "The relatedness of these proteins across the different pathogens shows that there are two major phylogenetically distinct clades in the eukaryotic pathogens examined.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_42",
            "start": 293,
            "end": 458,
            "label": {}
        },
        {
            "ix": "6-36_v1_42@3",
            "content": "The clustering of these proteins suggests that these transport proteins have highly conserved regions often required for basic cellular function or stability <REF-68> – <REF-85> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_42",
            "start": 460,
            "end": 638,
            "label": {}
        },
        {
            "ix": "6-36_v1_42@4",
            "content": "Thus, antifolate chemotherapic drugs that are effective against one pathogen might have some effect on others.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_42",
            "start": 640,
            "end": 749,
            "label": {}
        },
        {
            "ix": "6-36_v1_43@0",
            "content": "Conclusion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_43",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "6-36_v1_44@0",
            "content": "In summary, we have identified and classified 234 proteins after an extensive search of pathogens genome in eukaryotic pathogen resource databases, though experimental studies will be required to confirm the expression and function of these proteins in parasites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_44",
            "start": 0,
            "end": 262,
            "label": {}
        },
        {
            "ix": "6-36_v1_44@1",
            "content": "Our results show that these proteins that mediate the transportation folate are widely distributed in different pathogen species examined in various phyla.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_44",
            "start": 264,
            "end": 418,
            "label": {}
        },
        {
            "ix": "6-36_v1_44@2",
            "content": "The identification of folate salvage proteins in diverse eukaryotes extend the evolutionary diversity of these proteins and suggests they might offer new possibilities for potential drug development targeting folate-salvaging routes in eukaryotic pathogens.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_44",
            "start": 420,
            "end": 676,
            "label": {}
        },
        {
            "ix": "6-36_v1_45@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_45",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "6-36_v1_46@0",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2017 Falade M and Otarigho B",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_46",
            "start": 0,
            "end": 138,
            "label": {}
        },
        {
            "ix": "6-36_v1_47@0",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_47",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "6-36_v1_48@0",
            "content": "Dataset 1: Complete list of proteins extracted from Eupthadb and literature search, including their properties.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_48",
            "start": 0,
            "end": 110,
            "label": {}
        },
        {
            "ix": "6-36_v1_48@1",
            "content": "These data are available in a .xlsx file.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_48",
            "start": 112,
            "end": 152,
            "label": {}
        },
        {
            "ix": "6-36_v1_48@2",
            "content": "Doi, 10.5256/f1000research.10561.d148742 <REF-43>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_48",
            "start": 154,
            "end": 202,
            "label": {}
        },
        {
            "ix": "6-36_v1_49@0",
            "content": "<REF-1> Fadiel A Isokpehi RD Stambouli N : Protozoan parasite aquaporins. Expert Rev Proteomic. 2009 ; 6 ( 2 ): 199 – 211 . 19385945 10.1586/epr.09.10",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_49",
            "start": 0,
            "end": 149,
            "label": {}
        },
        {
            "ix": "6-36_v1_50@0",
            "content": "<REF-2> Prole DL Taylor CW : Identification and analysis of putative homologues of mechanosensitive channels in pathogenic protozoa. PLoS One. 2013 ; 8 ( 6 ): e66068 . 23785469 10.1371/journal.pone.0066068 3681921",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_50",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "6-36_v1_51@0",
            "content": "<REF-3> Wiser M : Protozoa and human disease. Garland Science. 2010 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_51",
            "start": 0,
            "end": 85,
            "label": {}
        },
        {
            "ix": "6-36_v1_52@0",
            "content": "<REF-4> Turrens JF : Oxidative stress and antioxidant defenses: a target for the treatment of diseases caused by parasitic protozoa. Mol Aspects Med. 2004 ; 25 ( 1–2 ): 211 – 20 . 15051329 10.1016/j.mam.2004.02.021",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_52",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "6-36_v1_53@0",
            "content": "<REF-5> Shiadeh MN Niyyati M Fallahi S : Human parasitic protozoan infection to infertility: a systematic review. Parasitol Res. 2016 ; 115 ( 2 ): 469 – 77 . 26573517 10.1007/s00436-015-4827-y",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_53",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "6-36_v1_54@0",
            "content": "<REF-6> Khanum H Kadir R Arju T : Detection of Entamoeba histolytica, Giardia lamblia and Cryptospodium sp. Infection among diarrheal patients. Bangladesh J Zoology. 2015 ; 43 ( 1 ): 1 – 7 . 10.3329/bjz.v43i1.26132",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_54",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "6-36_v1_55@0",
            "content": "<REF-7> Herman ML Surawicz CM : Intestinal Parasites . In: Textbook of Pediatric Gastroenterology, Hepatology and Nutrition . Springer International Publishing. 2016 ; 185 – 193 . 10.1007/978-3-319-17169-2_16",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_55",
            "start": 0,
            "end": 207,
            "label": {}
        },
        {
            "ix": "6-36_v1_56@0",
            "content": "<REF-8> Ton Nu PA Nguyen VQ Cao NT : Prevalence of Trichomonas vaginalis infection in symptomatic and asymptomatic women in Central Vietnam. J Infect Dev Ctries. 2015 ; 9 ( 06 ): 655 – 60 . 26142677 10.3855/jidc.7190",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_56",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "6-36_v1_57@0",
            "content": "<REF-9> Garcia LS Bruckner DA : Diagnostic medical parasitology . Washington, DC. 2001 ; 131 – 5 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_57",
            "start": 0,
            "end": 97,
            "label": {}
        },
        {
            "ix": "6-36_v1_58@0",
            "content": "<REF-11> Andrews KT Fisher G Skinner-Adams TS : Drug repurposing and human parasitic protozoan diseases. Int J Parasitol Drugs Drug Resis. 2014 ; 4 ( 2 ): 95 – 111 . 25057459 10.1016/j.ijpddr.2014.02.002 4095053",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_58",
            "start": 0,
            "end": 210,
            "label": {}
        },
        {
            "ix": "6-36_v1_59@0",
            "content": "<REF-12> Ouattara A Laurens MB : Vaccines against malaria. Clin Infect Dis. 2015 ; 60 ( 6 ): 930 – 6 . 25452593 10.1093/cid/ciu954 4357819",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_59",
            "start": 0,
            "end": 137,
            "label": {}
        },
        {
            "ix": "6-36_v1_60@0",
            "content": "<REF-13> Monzote L Siddiq A : Drug development to protozoan diseases. Open Med Chem J. 2011 ; 5 ( 1 ): 1 – 3 . 21629506 10.2174/1874104501105010001 3103878",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_60",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "6-36_v1_61@0",
            "content": "<REF-15> Castillo E Dea-Ayuela MA Bolás-Fernández F : The kinetoplastid chemotherapy revisited: current drugs, recent advances and future perspectives. Curr Med Chem. 2010 ; 17 ( 33 ): 4027 – 51 . 20939823 10.2174/092986710793205345",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_61",
            "start": 0,
            "end": 231,
            "label": {}
        },
        {
            "ix": "6-36_v1_62@0",
            "content": "<REF-16> Dias DA Urban S Roessner U : A historical overview of natural products in drug discovery. Metabolites. 2012 ; 2 ( 2 ): 303 – 36 . 24957513 10.3390/metabo2020303 3901206",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_62",
            "start": 0,
            "end": 176,
            "label": {}
        },
        {
            "ix": "6-36_v1_63@0",
            "content": "<REF-17> Croft SL : The current status of antiparasite chemotherapy. Parasitology. 1997 ; 114 ( Suppl ): S3 – 15 . 9309765",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_63",
            "start": 0,
            "end": 121,
            "label": {}
        },
        {
            "ix": "6-36_v1_64@0",
            "content": "<REF-18> Pink R Hudson A Mouriès MA : Opportunities and challenges in antiparasitic drug discovery. Nat Rev Drug Discov. 2005 ; 4 ( 9 ): 727 – 40 . 16138106 10.1038/nrd1824",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_64",
            "start": 0,
            "end": 171,
            "label": {}
        },
        {
            "ix": "6-36_v1_65@0",
            "content": "<REF-19> Paiardini A Fiascarelli A Rinaldo S : Screening and in vitro testing of antifolate inhibitors of human cytosolic serine hydroxymethyltransferase. ChemMedChem. 2015 ; 10 ( 3 ): 490 – 7 . 25677305 10.1002/cmdc.201500028",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_65",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "6-36_v1_66@0",
            "content": "<REF-20> Nzila A Ward SA Marsh K : Comparative folate metabolism in humans and malaria parasites (part I): pointers for malaria treatment from cancer chemotherapy. Trends Parasitol. 2005 ; 21 ( 6 ): 292 – 8 . 15922251 10.1016/j.pt.2005.04.002 2720520",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_66",
            "start": 0,
            "end": 249,
            "label": {}
        },
        {
            "ix": "6-36_v1_67@0",
            "content": "<REF-21> Nzila A Ward SA Marsh K : Comparative folate metabolism in humans and malaria parasites (part II): activities as yet untargeted or specific to Plasmodium . Trends Parasitol. 2005 ; 21 ( 7 ): 334 – 9 . 15936248 10.1016/j.pt.2005.05.008 2720531",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_67",
            "start": 0,
            "end": 250,
            "label": {}
        },
        {
            "ix": "6-36_v1_68@0",
            "content": "<REF-22> Salcedo-Sora JE Ward SA : The folate metabolic network of Falciparum malaria. Mol Biochem Parasitol. 2013 ; 188 ( 1 ): 51 – 62 . 23454873 10.1016/j.molbiopara.2013.02.003",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_68",
            "start": 0,
            "end": 178,
            "label": {}
        },
        {
            "ix": "6-36_v1_69@0",
            "content": "<REF-23> Costi MP Ferrari S : Update on antifolate drugs targets. Curr Drug Targets. 2001 ; 2 ( 2 ): 135 – 66 . 11469716 10.2174/1389450013348669",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_69",
            "start": 0,
            "end": 144,
            "label": {}
        },
        {
            "ix": "6-36_v1_70@0",
            "content": "<REF-24> Zhao R Diop-Bove N Visentin M : Mechanisms of membrane transport of folates into cells and across epithelia. Annu Rev Nutr. 2011 ; 31 : 177 – 201 . 21568705 10.1146/annurev-nutr-072610-145133 3885234",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_70",
            "start": 0,
            "end": 207,
            "label": {}
        },
        {
            "ix": "6-36_v1_71@0",
            "content": "<REF-25> Müller IB Hyde JE : Antimalarial drugs: modes of action and mechanisms of parasite resistance. Future Microbiol. 2010 ; 5 ( 12 ): 1857 – 73 . 21155666 10.2217/fmb.10.136",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_71",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "6-36_v1_72@0",
            "content": "<REF-26> Emmer BT Nakayasu ES Souther C : Global analysis of protein palmitoylation in African trypanosomes. Eukaryot Cell. 2011 ; 10 ( 3 ): 455 – 63 . 21193548 10.1128/EC.00248-10 3067466",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_72",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "6-36_v1_73@0",
            "content": "<REF-27> Müller IB Hyde JE : Folate metabolism in human malaria parasites--75 years on. Mol Biochem Parasitol. 2013 ; 188 ( 1 ): 63 – 77 . 23500968 10.1016/j.molbiopara.2013.02.008",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_73",
            "start": 0,
            "end": 179,
            "label": {}
        },
        {
            "ix": "6-36_v1_74@0",
            "content": "<REF-28> Vickers TJ Beverley SM : Folate metabolic pathways in Leishmania . Essays Biochem. 2011 ; 51 : 63 – 80 . 22023442 10.1042/bse0510063 3278214",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_74",
            "start": 0,
            "end": 148,
            "label": {}
        },
        {
            "ix": "6-36_v1_75@0",
            "content": "<REF-30> Wang P Brobey RK Horii T : Utilization of exogenous folate in the human malaria parasite Plasmodium falciparum and its critical role in antifolate drug synergy. Mol Microbiol. 1999 ; 32 ( 6 ): 1254 – 62 . 10383765 10.1046/j.1365-2958.1999.01437.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_75",
            "start": 0,
            "end": 254,
            "label": {}
        },
        {
            "ix": "6-36_v1_76@0",
            "content": "<REF-32> Stein WD Sanchez CP Lanzer M : Virulence and drug resistance in malaria parasites. Trends Parasitol. 2009 ; 25 ( 10 ): 441 – 3 . 19734096 10.1016/j.pt.2009.07.003",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_76",
            "start": 0,
            "end": 170,
            "label": {}
        },
        {
            "ix": "6-36_v1_77@0",
            "content": "<REF-33> Agüero F Al-Lazikani B Aslett M : Genomic-scale prioritization of drug targets: the TDR Targets database. Nat Rev Drug Discov. 2008 ; 7 ( 11 ): 900 – 7 . 18927591 10.1038/nrd2684 3184002",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_77",
            "start": 0,
            "end": 194,
            "label": {}
        },
        {
            "ix": "6-36_v1_78@0",
            "content": "<REF-39> Panwar B Menon R Eksi R : Genome-wide Functional Annotation of Human Protein-coding Splice Variants Using Multiple Instance Learning. J Proteome Res. 2016 ; 15 ( 6 ): 1747 – 53 . 27142340 10.1021/acs.jproteome.5b00883",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_78",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "6-36_v1_79@0",
            "content": "<REF-40> Antony AC : Folate receptors. Annu Rev Nutr. 1996 ; 16 ( 1 ): 501 – 21 . 8839936 10.1146/annurev.nu.16.070196.002441",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_79",
            "start": 0,
            "end": 124,
            "label": {}
        },
        {
            "ix": "6-36_v1_80@0",
            "content": "<REF-41> Girardin F : Membrane transporter proteins: a challenge for CNS drug development. Dialogues Clin Neurosci. 2006 ; 8 ( 3 ): 311 – 21 . 17117613 3181821",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_80",
            "start": 0,
            "end": 158,
            "label": {}
        },
        {
            "ix": "6-36_v1_81@0",
            "content": "<REF-42> Aurrecoechea C Heiges M Wang H : ApiDB: integrated resources for the apicomplexan bioinformatics resource center. Nucleic Acids Res. 2007 ; 35 ( Database issue ): D427 – 30 . 17098930 10.1093/nar/gkl880 1669770",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_81",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "6-36_v1_82@0",
            "content": "<REF-43> Falade M Otarigho B : Dataset 1 in: Genome-wide characterization of folate transporter proteins of eukaryotic pathogens. F1000Research. 2017 . Data Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_82",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "6-36_v1_83@0",
            "content": "<REF-44> Saitou N Nei M : The neighbor-joining method: a new method for reconstructing phylogenetic trees. Mol Biol Evol. 1987 ; 4 ( 4 ): 406 – 25 . 3447015",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_83",
            "start": 0,
            "end": 155,
            "label": {}
        },
        {
            "ix": "6-36_v1_84@0",
            "content": "<REF-45> Sanderson MJ : Confidence limits on phylogenies: the bootstrap revisited. Cladistics. 1989 ; 5 ( 2 ): 113 – 29 . 10.1111/j.1096-0031.1989.tb00559.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_84",
            "start": 0,
            "end": 155,
            "label": {}
        },
        {
            "ix": "6-36_v1_85@0",
            "content": "<REF-46> Nei M Kumar S : Molecular evolution and phylogenetics . Oxford university press; 2000 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_85",
            "start": 0,
            "end": 112,
            "label": {}
        },
        {
            "ix": "6-36_v1_86@0",
            "content": "<REF-47> Rambaut A : FigTree 1.4. 2 software . Institute of Evolutionary Biology, Univ. Edinburgh.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_86",
            "start": 0,
            "end": 97,
            "label": {}
        },
        {
            "ix": "6-36_v1_87@0",
            "content": "<REF-48> Massimine KM Doan LT Atreya CA : Toxoplasma gondii is capable of exogenous folate transport. A likely expansion of the BT1 family of transmembrane proteins. Mol Biochem Parasitol. 2005 ; 144 ( 1 ): 44 – 54 . 16159678 10.1016/j.molbiopara.2005.07.006",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_87",
            "start": 0,
            "end": 257,
            "label": {}
        },
        {
            "ix": "6-36_v1_88@0",
            "content": "<REF-49> Swaan PW : Membrane Transport Proteins and Drug Transport. Burger's Medicinal Chemistry and Drug Discovery. 2003 . 10.1002/0471266949.bmc027",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_88",
            "start": 0,
            "end": 148,
            "label": {}
        },
        {
            "ix": "6-36_v1_89@0",
            "content": "<REF-50> Mansour TE : Chemotherapeutic targets in parasites: contemporary strategies . Cambridge University Press; 2002 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_89",
            "start": 0,
            "end": 137,
            "label": {}
        },
        {
            "ix": "6-36_v1_90@0",
            "content": "<REF-51> Alam A Goyal M Iqbal MS : Novel antimalarial drug targets: hope for new antimalarial drugs. Expert Rev Clin Pharmacol. 2009 ; 2 ( 5 ): 469 – 89 . 22112223 10.1586/ecp.09.28",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_90",
            "start": 0,
            "end": 180,
            "label": {}
        },
        {
            "ix": "6-36_v1_91@0",
            "content": "<REF-52> Dean P Major P Nakjang S : Transport proteins of parasitic protists and their role in nutrient salvage. Front Plant Sci. 2014 ; 5 : 153 . 24808897 10.3389/fpls.2014.00153 4010794",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_91",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "6-36_v1_92@0",
            "content": "<REF-53> Saier MH Jr Beatty JT Goffeau A : The major facilitator superfamily. J Mol Microbiol Biotechnol. 1999 ; 1 ( 2 ): 257 – 79 . 10943556",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_92",
            "start": 0,
            "end": 140,
            "label": {}
        },
        {
            "ix": "6-36_v1_93@0",
            "content": "<REF-54> Sowunmi A Fehintola FA Adedeji AA : Open randomized study of pyrimethamine-sulphadoxine vs. pyrimethamine-sulphadoxine plus probenecid for the treatment of uncomplicated Plasmodium falciparum malaria in children. Trop Med Int Health. 2004 ; 9 ( 5 ): 606 – 14 . 15117306 10.1111/j.1365-3156.2004.01233.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_93",
            "start": 0,
            "end": 310,
            "label": {}
        },
        {
            "ix": "6-36_v1_94@0",
            "content": "<REF-55> Nzila A Mberu E Bray P : Chemosensitization of Plasmodium falciparum by probenecid in vitro . Antimicrob Agents Chemother. 2003 ; 47 ( 7 ): 2108 – 12 . 12821454 10.1128/AAC.47.7.2108-2112.2003 161864",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_94",
            "start": 0,
            "end": 207,
            "label": {}
        },
        {
            "ix": "6-36_v1_95@0",
            "content": "<REF-56> Richard D Kündig C Ouellette M : A new type of high affinity folic acid transporter in the protozoan parasite Leishmania and deletion of its gene in methotrexate-resistant cells. J Biol Chem. 2002 ; 277 ( 33 ): 29460 – 7 . 12023977 10.1074/jbc.M204796200",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_95",
            "start": 0,
            "end": 262,
            "label": {}
        },
        {
            "ix": "6-36_v1_96@0",
            "content": "<REF-57> Richard D Leprohon P Drummelsmith J : Growth phase regulation of the main folate transporter of Leishmania infantum and its role in methotrexate resistance. J Biol Chem. 2004 ; 279 ( 52 ): 54494 – 501 . 15466466 10.1074/jbc.M409264200",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_96",
            "start": 0,
            "end": 242,
            "label": {}
        },
        {
            "ix": "6-36_v1_97@0",
            "content": "<REF-58> Kündig C Haimeur A Légaré D : Increased transport of pteridines compensates for mutations in the high affinity folate transporter and contributes to methotrexate resistance in the protozoan parasite Leishmania tarentolae . EMBO J. 1999 ; 18 ( 9 ): 2342 – 51 . 10228149 10.1093/emboj/18.9.2342 1171317",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_97",
            "start": 0,
            "end": 308,
            "label": {}
        },
        {
            "ix": "6-36_v1_98@0",
            "content": "<REF-59> Gottesdiener KM : A new VSG expression site-associated gene (ESAG) in the promoter region of Trypanosoma brucei encodes a protein with 10 potential transmembrane domains. Mol Biochem Parasitol. 1994 ; 63 ( 1 ): 143 – 51 . 8183314 10.1016/0166-6851(94)90017-5",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_98",
            "start": 0,
            "end": 266,
            "label": {}
        },
        {
            "ix": "6-36_v1_99@0",
            "content": "<REF-60> Stewart RA Meyer KF : Isolation of Coccidioides immitis (Stiles) from the soil. Exp Biol Med. 1932 ; 29 ( 8 ): 937 – 8 . 10.3181/00379727-29-6159",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_99",
            "start": 0,
            "end": 153,
            "label": {}
        },
        {
            "ix": "6-36_v1_100@0",
            "content": "<REF-61> Greene DR Koenig G Fisher MC : Soil isolation and molecular identification of Coccidioides immitis . Mycologia. 2000 ; 92 ( 3 ): 406 – 10 . 10.2307/3761498",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_100",
            "start": 0,
            "end": 163,
            "label": {}
        },
        {
            "ix": "6-36_v1_101@0",
            "content": "<REF-63> Hajji M Kanoun S Nasri M : Purification and characterization of an alkaline serine-protease produced by a new isolated Aspergillus clavatus ES1. Process Biochem. 2007 ; 42 ( 5 ): 791 – 7 . 10.1016/j.procbio.2007.01.011",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_101",
            "start": 0,
            "end": 226,
            "label": {}
        },
        {
            "ix": "6-36_v1_102@0",
            "content": "<REF-64> Rodríguez-Cerdeira C Arenas R Moreno-Coutiño G : Systemic fungal infections in patients with human inmunodeficiency virus. Actas Dermosifiliogr. 2014 ; 105 ( 1 ): 5 – 17 . 23107866 10.1016/j.ad.2012.06.017",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_102",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "6-36_v1_103@0",
            "content": "<REF-65> Awadelkariem FM Hunter KJ Kirby GC : Crithidia fasciculata as feeder cells for malaria parasites. Exp Parasitol. 1995 ; 80 ( 1 ): 98 – 106 . 7821416 10.1006/expr.1995.1011",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_103",
            "start": 0,
            "end": 179,
            "label": {}
        },
        {
            "ix": "6-36_v1_104@0",
            "content": "<REF-66> Krungkrai J Cerami A Henderson GB : Pyrimidine biosynthesis in parasitic protozoa: purification of a monofunctional dihydroorotase from Plasmodium berghei and Crithidia fasciculata . Biochemistry. 1990 ; 29 ( 26 ): 6270 – 5 . 1976382 10.1021/bi00478a023",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_104",
            "start": 0,
            "end": 261,
            "label": {}
        },
        {
            "ix": "6-36_v1_105@0",
            "content": "<REF-67> Eyal E Najmanovich R Mcconkey BJ : Importance of solvent accessibility and contact surfaces in modeling side-chain conformations in proteins. J Comput Chem. 2004 ; 25 ( 5 ): 712 – 24 . 14978714 10.1002/jcc.10420",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_105",
            "start": 0,
            "end": 219,
            "label": {}
        },
        {
            "ix": "6-36_v1_106@0",
            "content": "<REF-68> Fedorova ND Khaldi N Joardar VS : Genomic islands in the pathogenic filamentous fungus Aspergillus fumigatus . PLoS Genet. 2008 ; 4 ( 4 ): e1000046 . 18404212 10.1371/journal.pgen.1000046 2289846",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_106",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "6-36_v1_107@0",
            "content": "<REF-85> Kumar S Stecher G Tamura K : MEGA7: Molecular Evolutionary Genetics Analysis Version 7.0 for Bigger Datasets. Mol Biol Evol. 2016 ; 33 ( 7 ): 1870 – 4 . 27004904 10.1093/molbev/msw054",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-36_v1_107",
            "start": 0,
            "end": 191,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "6-36_v1_0",
            "tgt_ix": "6-36_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_1",
            "tgt_ix": "6-36_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_1",
            "tgt_ix": "6-36_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_1",
            "tgt_ix": "6-36_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_1",
            "tgt_ix": "6-36_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_0",
            "tgt_ix": "6-36_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_6",
            "tgt_ix": "6-36_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_6",
            "tgt_ix": "6-36_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_6",
            "tgt_ix": "6-36_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_6",
            "tgt_ix": "6-36_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_6",
            "tgt_ix": "6-36_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_0",
            "tgt_ix": "6-36_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_12",
            "tgt_ix": "6-36_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_12",
            "tgt_ix": "6-36_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_14",
            "tgt_ix": "6-36_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_12",
            "tgt_ix": "6-36_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_12",
            "tgt_ix": "6-36_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_17",
            "tgt_ix": "6-36_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_0",
            "tgt_ix": "6-36_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_21",
            "tgt_ix": "6-36_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_27",
            "tgt_ix": "6-36_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_29",
            "tgt_ix": "6-36_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_31",
            "tgt_ix": "6-36_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_33",
            "tgt_ix": "6-36_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_0",
            "tgt_ix": "6-36_v1_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_36",
            "tgt_ix": "6-36_v1_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_36",
            "tgt_ix": "6-36_v1_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_36",
            "tgt_ix": "6-36_v1_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_36",
            "tgt_ix": "6-36_v1_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_36",
            "tgt_ix": "6-36_v1_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_36",
            "tgt_ix": "6-36_v1_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_0",
            "tgt_ix": "6-36_v1_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_43",
            "tgt_ix": "6-36_v1_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_0",
            "tgt_ix": "6-36_v1_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_45",
            "tgt_ix": "6-36_v1_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_45",
            "tgt_ix": "6-36_v1_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_45",
            "tgt_ix": "6-36_v1_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_0",
            "tgt_ix": "6-36_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_1",
            "tgt_ix": "6-36_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_2",
            "tgt_ix": "6-36_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_3",
            "tgt_ix": "6-36_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_4",
            "tgt_ix": "6-36_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_5",
            "tgt_ix": "6-36_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_6",
            "tgt_ix": "6-36_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_9",
            "tgt_ix": "6-36_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_11",
            "tgt_ix": "6-36_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_12",
            "tgt_ix": "6-36_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_14",
            "tgt_ix": "6-36_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_15",
            "tgt_ix": "6-36_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_17",
            "tgt_ix": "6-36_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_18",
            "tgt_ix": "6-36_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_21",
            "tgt_ix": "6-36_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_22",
            "tgt_ix": "6-36_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_23",
            "tgt_ix": "6-36_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_24",
            "tgt_ix": "6-36_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_25",
            "tgt_ix": "6-36_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_27",
            "tgt_ix": "6-36_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_28",
            "tgt_ix": "6-36_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_29",
            "tgt_ix": "6-36_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_30",
            "tgt_ix": "6-36_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_31",
            "tgt_ix": "6-36_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_32",
            "tgt_ix": "6-36_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_33",
            "tgt_ix": "6-36_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_34",
            "tgt_ix": "6-36_v1_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_35",
            "tgt_ix": "6-36_v1_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_36",
            "tgt_ix": "6-36_v1_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_37",
            "tgt_ix": "6-36_v1_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_38",
            "tgt_ix": "6-36_v1_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_39",
            "tgt_ix": "6-36_v1_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_42",
            "tgt_ix": "6-36_v1_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_43",
            "tgt_ix": "6-36_v1_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_44",
            "tgt_ix": "6-36_v1_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_45",
            "tgt_ix": "6-36_v1_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_46",
            "tgt_ix": "6-36_v1_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_47",
            "tgt_ix": "6-36_v1_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_9",
            "tgt_ix": "6-36_v1_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_9",
            "tgt_ix": "6-36_v1_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_38",
            "tgt_ix": "6-36_v1_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_38",
            "tgt_ix": "6-36_v1_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_38",
            "tgt_ix": "6-36_v1_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_38",
            "tgt_ix": "6-36_v1_90",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_38",
            "tgt_ix": "6-36_v1_91",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_39",
            "tgt_ix": "6-36_v1_92",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_93",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_94",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_95",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_96",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_97",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_98",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_99",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_100",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_101",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_102",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_103",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_104",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_105",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_42",
            "tgt_ix": "6-36_v1_106",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_42",
            "tgt_ix": "6-36_v1_107",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_15",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_18",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_22",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_28",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_30",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_32",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_34",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-36_v1_0",
            "tgt_ix": "6-36_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_1",
            "tgt_ix": "6-36_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_2",
            "tgt_ix": "6-36_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_2",
            "tgt_ix": "6-36_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_2",
            "tgt_ix": "6-36_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_2",
            "tgt_ix": "6-36_v1_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_3",
            "tgt_ix": "6-36_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_3",
            "tgt_ix": "6-36_v1_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_4",
            "tgt_ix": "6-36_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_4",
            "tgt_ix": "6-36_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_4",
            "tgt_ix": "6-36_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_4",
            "tgt_ix": "6-36_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_5",
            "tgt_ix": "6-36_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_6",
            "tgt_ix": "6-36_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_7",
            "tgt_ix": "6-36_v1_7@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_8@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_8",
            "tgt_ix": "6-36_v1_8@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_9",
            "tgt_ix": "6-36_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_9",
            "tgt_ix": "6-36_v1_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_9",
            "tgt_ix": "6-36_v1_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_10",
            "tgt_ix": "6-36_v1_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_11",
            "tgt_ix": "6-36_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_11",
            "tgt_ix": "6-36_v1_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_11",
            "tgt_ix": "6-36_v1_11@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_12",
            "tgt_ix": "6-36_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_13@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_13@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_13@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_13@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_13@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_13",
            "tgt_ix": "6-36_v1_13@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_14",
            "tgt_ix": "6-36_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@14",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_16",
            "tgt_ix": "6-36_v1_16@15",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_17",
            "tgt_ix": "6-36_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_19",
            "tgt_ix": "6-36_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_20@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_20@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_20@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_20@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_20@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_20",
            "tgt_ix": "6-36_v1_20@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_21",
            "tgt_ix": "6-36_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_23",
            "tgt_ix": "6-36_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_23",
            "tgt_ix": "6-36_v1_23@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_23",
            "tgt_ix": "6-36_v1_23@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_23",
            "tgt_ix": "6-36_v1_23@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_23",
            "tgt_ix": "6-36_v1_23@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_23",
            "tgt_ix": "6-36_v1_23@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_23",
            "tgt_ix": "6-36_v1_23@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_24",
            "tgt_ix": "6-36_v1_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_24",
            "tgt_ix": "6-36_v1_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_24",
            "tgt_ix": "6-36_v1_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_24",
            "tgt_ix": "6-36_v1_24@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_24",
            "tgt_ix": "6-36_v1_24@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_24",
            "tgt_ix": "6-36_v1_24@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_24",
            "tgt_ix": "6-36_v1_24@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_24",
            "tgt_ix": "6-36_v1_24@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_24",
            "tgt_ix": "6-36_v1_24@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_25",
            "tgt_ix": "6-36_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_25",
            "tgt_ix": "6-36_v1_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_25",
            "tgt_ix": "6-36_v1_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_26",
            "tgt_ix": "6-36_v1_26@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_27",
            "tgt_ix": "6-36_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_29",
            "tgt_ix": "6-36_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_31",
            "tgt_ix": "6-36_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_33",
            "tgt_ix": "6-36_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_36",
            "tgt_ix": "6-36_v1_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_37",
            "tgt_ix": "6-36_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_37",
            "tgt_ix": "6-36_v1_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_37",
            "tgt_ix": "6-36_v1_37@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_37",
            "tgt_ix": "6-36_v1_37@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_37",
            "tgt_ix": "6-36_v1_37@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_37",
            "tgt_ix": "6-36_v1_37@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_37",
            "tgt_ix": "6-36_v1_37@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_38",
            "tgt_ix": "6-36_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_38",
            "tgt_ix": "6-36_v1_38@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_38",
            "tgt_ix": "6-36_v1_38@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_38",
            "tgt_ix": "6-36_v1_38@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_39",
            "tgt_ix": "6-36_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_39",
            "tgt_ix": "6-36_v1_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_39",
            "tgt_ix": "6-36_v1_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_39",
            "tgt_ix": "6-36_v1_39@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_39",
            "tgt_ix": "6-36_v1_39@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_39",
            "tgt_ix": "6-36_v1_39@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_39",
            "tgt_ix": "6-36_v1_39@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_39",
            "tgt_ix": "6-36_v1_39@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_40@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_40@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_40",
            "tgt_ix": "6-36_v1_40@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_41@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_41@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_41",
            "tgt_ix": "6-36_v1_41@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_42",
            "tgt_ix": "6-36_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_42",
            "tgt_ix": "6-36_v1_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_42",
            "tgt_ix": "6-36_v1_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_42",
            "tgt_ix": "6-36_v1_42@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_42",
            "tgt_ix": "6-36_v1_42@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_43",
            "tgt_ix": "6-36_v1_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_44",
            "tgt_ix": "6-36_v1_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_44",
            "tgt_ix": "6-36_v1_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_44",
            "tgt_ix": "6-36_v1_44@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_45",
            "tgt_ix": "6-36_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_46",
            "tgt_ix": "6-36_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_47",
            "tgt_ix": "6-36_v1_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_48",
            "tgt_ix": "6-36_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_48",
            "tgt_ix": "6-36_v1_48@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_48",
            "tgt_ix": "6-36_v1_48@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_49",
            "tgt_ix": "6-36_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_50",
            "tgt_ix": "6-36_v1_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_51",
            "tgt_ix": "6-36_v1_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_52",
            "tgt_ix": "6-36_v1_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_53",
            "tgt_ix": "6-36_v1_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_54",
            "tgt_ix": "6-36_v1_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_55",
            "tgt_ix": "6-36_v1_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_56",
            "tgt_ix": "6-36_v1_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_57",
            "tgt_ix": "6-36_v1_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_58",
            "tgt_ix": "6-36_v1_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_59",
            "tgt_ix": "6-36_v1_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_60",
            "tgt_ix": "6-36_v1_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_61",
            "tgt_ix": "6-36_v1_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_62",
            "tgt_ix": "6-36_v1_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_63",
            "tgt_ix": "6-36_v1_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_64",
            "tgt_ix": "6-36_v1_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_65",
            "tgt_ix": "6-36_v1_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_66",
            "tgt_ix": "6-36_v1_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_67",
            "tgt_ix": "6-36_v1_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_68",
            "tgt_ix": "6-36_v1_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_69",
            "tgt_ix": "6-36_v1_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_70",
            "tgt_ix": "6-36_v1_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_71",
            "tgt_ix": "6-36_v1_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_72",
            "tgt_ix": "6-36_v1_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_73",
            "tgt_ix": "6-36_v1_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_74",
            "tgt_ix": "6-36_v1_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_75",
            "tgt_ix": "6-36_v1_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_76",
            "tgt_ix": "6-36_v1_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_77",
            "tgt_ix": "6-36_v1_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_78",
            "tgt_ix": "6-36_v1_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_79",
            "tgt_ix": "6-36_v1_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_80",
            "tgt_ix": "6-36_v1_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_81",
            "tgt_ix": "6-36_v1_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_82",
            "tgt_ix": "6-36_v1_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_83",
            "tgt_ix": "6-36_v1_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_84",
            "tgt_ix": "6-36_v1_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_85",
            "tgt_ix": "6-36_v1_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_86",
            "tgt_ix": "6-36_v1_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_87",
            "tgt_ix": "6-36_v1_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_88",
            "tgt_ix": "6-36_v1_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_89",
            "tgt_ix": "6-36_v1_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_90",
            "tgt_ix": "6-36_v1_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_91",
            "tgt_ix": "6-36_v1_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_92",
            "tgt_ix": "6-36_v1_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_93",
            "tgt_ix": "6-36_v1_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_94",
            "tgt_ix": "6-36_v1_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_95",
            "tgt_ix": "6-36_v1_95@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_96",
            "tgt_ix": "6-36_v1_96@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_97",
            "tgt_ix": "6-36_v1_97@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_98",
            "tgt_ix": "6-36_v1_98@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_99",
            "tgt_ix": "6-36_v1_99@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_100",
            "tgt_ix": "6-36_v1_100@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_101",
            "tgt_ix": "6-36_v1_101@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_102",
            "tgt_ix": "6-36_v1_102@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_103",
            "tgt_ix": "6-36_v1_103@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_104",
            "tgt_ix": "6-36_v1_104@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_105",
            "tgt_ix": "6-36_v1_105@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_106",
            "tgt_ix": "6-36_v1_106@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-36_v1_107",
            "tgt_ix": "6-36_v1_107@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "6-36_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.10561.1",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Genome-wide characterization of folate transporter proteins of eukaryotic pathogens",
        "abstract": "Background: Medically important pathogens are responsible for the death of millions every year. For many of these pathogens, there are limited options for therapy and resistance to commonly used drugs is fast emerging. The availability of genome sequences of many eukaryotic protozoa is providing important data for understanding parasite biology and identifying new drug and vaccine targets. The folate synthesis and salvage pathway are important for eukaryote pathogen survival and organismal biology and may present new targets for drug discovery. Methods: We applied a combination of bioinformatics methods to examine the genomes of pathogens in the EupathDB for genes encoding homologues of proteins that mediate folate salvage in a bid to identify and assign putative functions. We also performed phylogenetic comparisons of identified proteins. . Results: We identified 234 proteins to be involve in folate transport in 63 strains, 28 pathogen species and 12 phyla, 60% of which were identified for the first time. Many of the genomes examined contained genes encoding transporters such as folate-binding protein YgfZ, folate/pteridine transporter, folate/biopterin transporter, reduced folate carrier family protein, folate/methotrexate transporter FT1. The mitochondrion is the predicted location of the majority of the proteins, with 15% possessing signal peptides. Phylogeny computation shows the similarity of the proteins identified. Conclusion: These findings offer new possibilities for potential drug development targeting folate-salvage proteins in eukaryotic pathogens.",
        "contributors": [
            {
                "surname": "Falade",
                "given-names": "Mofolusho"
            },
            {
                "surname": "Otarigho",
                "given-names": "Benson"
            }
        ],
        "url": "https://f1000research.com/articles/6-36/v1/",
        "doc_id": "6-36",
        "version": 1,
        "ix_counter": 439,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}