{
    "nodes": [
        {
            "ix": "6-1863_v1_0",
            "content": "Evaluation of predicted Medfly ( Ceratitis capitata ) quarantine length in the United States utilizing degree-day and agent-based models",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_2",
            "content": "Invasions by pest insects pose a significant threat to agriculture worldwide. In the case of Ceratitis capitata incursions on the US mainland, where it is not officially established, repeated detections are followed by quarantines and treatments to eliminate the invading population. However, it is difficult to accurately set quarantine duration because non-detection may not mean the pest is eliminated. Most programs extend quarantine lengths past the last fly detection by calculating the amount of time required for 3 generations to elapse under a thermal unit accumulation development model (“degree day”). A newer approach is to use an Agent-Based Simulation (ABS) to explicitly simulate population demographics and elimination. Here, predicted quarantine lengths for 11 sites in the continental United States are evaluated using both approaches. Results indicate a strong seasonality in quarantine length, with longer predictions in the second half of the year compared with the first; this pattern is more extreme in degree day predictions compared with ABS. Geographically, quarantine lengths increased with latitude, though this was less pronounced under the ABS. Variation in quarantine lengths for particular times and places was dramatically larger for degree day than ABS, generally spiking in the middle of the year for degree day and peaking in second half of the year for ABS. Analysis of 34 C. capitata quarantines from 1975 to 2017 in California shows that, for all but two, quarantines were started in the second half of the year, when degree day quarantine lengths are longest and have the highest uncertainty. For a set of hypothetical outbreaks based on these historical quarantines, the ABS produced significantly shorter quarantines than degree day calculations. Overall, ABS quarantine lengths were more consistent than degree day predictions, avoided unrealistically long values, and captured effects of rare events such as cold snaps.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_4",
            "content": "Invasions by insects, pathogens and pests are increasingly a defining challenge of the 21 st century, facilitated by global connectivity, climatic shifts, and other factors <REF-1> , <REF-2> , with a particularly severe impact on agriculture <REF-3> . Invasions by insects that do not become established have a lower public profile than those that are “successful” from the point of view of the insect. However, there is a greater chance that cases of invasion followed by elimination will be detected and studied when the invading species is of environmental, human health, or economic concern <REF-4> . Eradicating local populations of such insects can be desirable and feasible <REF-5> depending on several factors.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_5",
            "content": "One factor determining the feasibility of elimination is if the new environment is only marginally or seasonally suitable to the invading insect, facilitating its eradication. Another is when the high cost of allowing establishment leads to extensive efforts for eradication. The invasion of the malaria mosquito species Anopheles gambiae into Northeastern Brazil in the 1930’s <REF-6> is one example of an invasive insect that was successfully eradicated primarily due to the second of these factors <REF-7> , <REF-8> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_6",
            "content": "In the case of An. gambiae there have been no reports of reinvasion, but there are examples of insects that recurrently invade areas outside their native range and are recurrently eliminated within relatively few generations. The Gypsy moth Lymantria dispar in Canada <REF-9> is one such species. Arguably, another example is the screwworm Cochlyomyia hominivorax along the current northernmost edge of its range in Panama <REF-10> and more recently in Florida <REF-11> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_7",
            "content": "One of the most important instances of repeated invasion and elimination by an economically important insect pest is that of the Mediterranean fruit fly Ceratitis capitata (Wiedemann) (Medfly) in California. The last four decades have seen a repeated pattern of invasion, detection, and response interspersed by periods of no detections <REF-12> , <REF-13> . While it has been suggested that this pattern is the result of cryptic establishment <REF-14> , the majority view is that Medfly in California is an example of a “metainvasion”, consisting of multiple sequential or overlapping introductions <REF-15> and repeated eradication <REF-16> . Still other researchers point to the possibility of different situations in different regions of the state <REF-17> , <REF-18> . Medfly is occasionally found in other parts of the mainland US such as Florida <REF-19> , and in other countries or areas that are considered free of the pest including Eastern Australia, Mexico and Chile <REF-20> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_8",
            "content": "The response plan to Medfly in California and the other “free” regions mentioned above is extensive and costly, including a quarantine when detections exceed an established standard (more than a male or unmated female fly is detected) <REF-21> . A practical and important problem is how long to maintain the countermeasures and quarantine after flies are no longer detected. Predicting the likely duration of this ‘post last detection’ quarantine period (hereafter just called quarantine length) would help with management decision-making and planning, and could allow potential cost savings by having sufficient but not excessive resources available.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_9",
            "content": "Currently, most programs extend quarantine periods past when the last fly is found, by calculating the amount of time required for a given number of generations (usually three) to elapse under a thermal unit accumulation (“degree day”) physiological development model. Degree day based quarantine lengths have been codified in some legal regulations, including United States Federal code <REF-22> , California <REF-23> , and Florida. However, the procedure prescribed only defines when the end of a quarantine period has been reached after the fact.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_10",
            "content": "For planning and resource allocation, policy makers and managers typically attempt to predict the quarantine lengths by using normal temperatures for forward projection. Although it frequently works fairly well, this approach is mathematically flawed and also provides no indication as to the variance or uncertainty of those predictions. Even a more rigorous treatment of degree day based values from historical temperature data can still produce highly variable results depending on relatively small changes in temperatures or details of the model formulation <REF-24> , in addition to neglecting important aspects of the biology.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_11",
            "content": "Recently, another approach to determining effective quarantine durations against Medfly via Agent-Based Simulations (ABS) <REF-25> was introduced. The MED-FOES system simulates a population of individual Medflies under inundative sterile insect technique (SIT) and other controls, explicitly modeling elimination as opposed to the degree day approach, which only determines the time for a specific number of generations to elapse to estimate quarantine duration. MED-FOES also allows for the sampling of parameter space (temperature dependent mortality for each stage, fecundity, etc.), producing a distribution of possible outcomes. While an ABS can be arbitrarily complex, MED-FOES is parameterized in such a way that it can model a ‘typical’ or hypothetical outbreak from only hourly temperature data, and is therefore similar to degree day methods in its input data requirements. It is also possible to vary the initial population to model a specific outbreak.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_12",
            "content": "In this paper, predicted quarantine length (PQL) for 11 sites in the continental United States were analyzed ( Figure 1 and Table 1 ) based on both the standard thermal accumulation degree day method <REF-26> as well as the MED-FOES ABS <REF-27> . Seasonal variation dominates quarantine duration, so we aggregated the PQL values for each day of the year (Jan. 1, Jan. 2, etc.) across a large number of years (65 for most locations) to produce normals. This approach enables comparison of the standard degree day method to the ABS, but more importantly provides insight into seasonal and spatial variations, prediction uncertainties, and model reliability.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_13",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Locations of sites analyzed. Labels correspond to last three letters of the weather station call-signs in Table 1 .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_14",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Locations of sites analyzed.</title> <p>Labels correspond to last three letters of the weather station call-signs in <xref ref-type=\"table\" rid=\"T1\">Table 1</xref>.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Locations of sites analyzed. Labels correspond to last three letters of the weather station call-signs in Table 1 .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_15",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Weather station sites used (NOAA ISD).",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_16",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Weather station sites used (NOAA ISD).</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">Callsign</th> <th align=\"left\">Station Name (as shown in data records)</th> <th align=\"left\">State</th> <th align=\"right\">Latitude</th> <th align=\"right\">Longitude</th> <th align=\"right\">Elevation</th> <th align=\"right\">Start <break/>year</th> </tr> </thead> <tbody> <tr> <td align=\"left\">KSFO</td> <td align=\"left\">SAN FRANCISCO INTERNATIONAL A</td> <td align=\"left\">CA</td> <td align=\"right\">+37.620</td> <td align=\"right\">-122.365</td> <td align=\"right\">2.4</td> <td align=\"right\">1950</td> </tr> <tr> <td align=\"left\">KFAT</td> <td align=\"left\">FRESNO YOSEMITE INTERNATIONAL</td> <td align=\"left\">CA</td> <td align=\"right\">+36.780</td> <td align=\"right\">-119.719</td> <td align=\"right\">101.5</td> <td align=\"right\">1950</td> </tr> <tr> <td align=\"left\">KBUR</td> <td align=\"left\">BURBANK-GLENDALE-PASA ARPT</td> <td align=\"left\">CA</td> <td align=\"right\">+34.201</td> <td align=\"right\">-118.358</td> <td align=\"right\">236.2</td> <td align=\"right\">1973</td> </tr> <tr> <td align=\"left\">KLAX</td> <td align=\"left\">LOS ANGELES INTERNATIONAL AIR</td> <td align=\"left\">CA</td> <td align=\"right\">+33.938</td> <td align=\"right\">-118.389</td> <td align=\"right\">29.6</td> <td align=\"right\">1950</td> </tr> <tr> <td align=\"left\">KRIV</td> <td align=\"left\">MARCH AIR RESERVE BASE</td> <td align=\"left\">CA</td> <td align=\"right\">+33.900</td> <td align=\"right\">-117.250</td> <td align=\"right\">468.2</td> <td align=\"right\">1950</td> </tr> <tr> <td align=\"left\">KSAN</td> <td align=\"left\">SAN DIEGO INTERNATIONAL AIRPO</td> <td align=\"left\">CA</td> <td align=\"right\">+32.734</td> <td align=\"right\">-117.183</td> <td align=\"right\">4.6</td> <td align=\"right\">1950</td> </tr> <tr> <td align=\"left\">KJAX</td> <td align=\"left\">JACKSONVILLE INTERNATIONAL A</td> <td align=\"left\">FL</td> <td align=\"right\">+30.495</td> <td align=\"right\">-81.694</td> <td align=\"right\">7.9</td> <td align=\"right\">1950</td> </tr> <tr> <td align=\"left\">KIAH</td> <td align=\"left\">G BUSH INTERCONTINENTAL AP/HO</td> <td align=\"left\">TX</td> <td align=\"right\">+29.980</td> <td align=\"right\">-95.360</td> <td align=\"right\">29.0</td> <td align=\"right\">1970</td> </tr> <tr> <td align=\"left\">KMCO</td> <td align=\"left\">ORLANDO INTERNATIONAL AIRPORT</td> <td align=\"left\">FL</td> <td align=\"right\">+28.434</td> <td align=\"right\">-81.325</td> <td align=\"right\">27.4</td> <td align=\"right\">1973</td> </tr> <tr> <td align=\"left\">KTPA</td> <td align=\"left\">TAMPA INTERNATIONAL AIRPORT</td> <td align=\"left\">FL</td> <td align=\"right\">+27.962</td> <td align=\"right\">-82.540</td> <td align=\"right\">5.8</td> <td align=\"right\">1950</td> </tr> <tr> <td align=\"left\">KMIA</td> <td align=\"left\">MIAMI INTERNATIONAL AIRPORT</td> <td align=\"left\">FL</td> <td align=\"right\">+25.791</td> <td align=\"right\">-80.316</td> <td align=\"right\">8.8</td> <td align=\"right\">1950</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Weather station sites used (NOAA ISD).",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_17",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_18",
            "content": "Sites and temperature data",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_19",
            "content": "Hourly air temperature data for 11 sites was downloaded from NOAA’s publicly available Integrated Surface Database (ISD) dataset <REF-28> , <REF-29> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_20",
            "content": "The airport sites shown in Figure 1 were chosen for their biological relevance and availability of high quality hourly data over a long time frame.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_21",
            "content": "Sites are referred to here by the last three letters of the callsign shown in Table 1 . For 8 sites (SFO, FAT, LAX, RIV, SAN, JAX, TPA, and MIA), temperature data starting on 1950-01-01 was used. The 3 other sites contained large (>14 days) gaps or other problems in the early years of their data, so data starting on 1970-01-01 for IAH and 1973-01-01 for BUR and MCO was used. For all sites, temperature data from the start date through 2017-05-15 was used to generate PQLs for dates ranging from the start date to 2016-01-01.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_22",
            "content": "Data was fetched and parsed using the Fetching and parsing ISH.ipynb program. Records for the same station callsign were merged, since identification, format, and precise location of stations has changed over time. The data was then cleaned using the Cleaning temperatures.ipynb by removing outliers, identifying large gaps (> 3 hours), resampling to every hour on the hour using linear interpolation, and filling the large gaps using day-over-day linear interpolation (interpolating using values for the same hour of day from previous and following days). The resulting temperature datasets are available.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_23",
            "content": "Degree-day calculation",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_24",
            "content": "Degree-days were computed by the single-sine method <REF-26> , using a base development temperature of 12.39°C (53.3°F) and 345.56 degree-days Celsius (DDc; 622 DDf) per generation following the standard set by California Department of Food and Agriculture regulation 3406(b) <REF-23> , <REF-30> . Since hourly temperature data are available, we also calculated degree-days by simple summation for comparison <REF-24> . For each date, the number of days required for 3 generations of degree-day based life cycles was computed. These calculations are implemented in Temperature functions.ipynb .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_25",
            "content": "Agent-based simulations: MED-FOES",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_26",
            "content": "MED-FOES <REF-25> , <REF-27> is an agent-based simulation explicitly modeling the eradication of a population of Medflies under inundative sterile male releases (sterile insect technique or SIT) and other interventions, such as increased trapping and foliar sprays. A MED-FOES simulation models a single non-spatial population, starting from a given population size and age distribution, tracking the number of individuals through time until the last fly (Agent) dies and the population is eliminated. In addition to hourly temperatures, simulation parameters include: the initial population, additional mortality induced by control efforts, the effectiveness of SIT, and a large number of biological parameters for which ranges are known from the literature including temperature-dependent development and mortality. The simulations were performed using the same hourly time series of temperature values used for degree-day calculations.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_27",
            "content": "Due to the fact that many of the parameters are only known to within a range, 2500 individual MED-FOES simulations were run for each start date at each site, evenly sampling different regions of parameter-space via the Latin Hypercube Sampling <REF-31> procedure. This set of simulations, encompassing a range of possible elimination outcomes, is referred to as a ‘run’. The number of days from the start date required for 95% of the simulations in a run to be eliminated is taken as a conservative prediction of needed quarantine length and referred to as ABS PQL <REF-25> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_28",
            "content": "Varying the start date for different simulations was achieved by simply starting at different points in the input temperature file; for this study a run was started every 7 days over the range of dates available for each site. Each set of runs for a single site over a range of starting dates is referred to as a ‘runset’. All runsets were conducted with the same input parameters aside from temperature. Initial population numbers were chosen as a “standard outbreak” based on seven real outbreaks modeled previously <REF-25> . The 7 day interval ABS PQL values were upsampled to daily values using linear interpolation to allow day-of-year aggregations across years and comparisons with daily degree day based PQLs.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_29",
            "content": "MED-FOES version 0.6.2 was run under Open Grid Scheduler/Grid Engine 2011.11 on a CentOS 6.6 HPC cluster. The MED-FOES code, configuration files, helper scripts, and raw results are available. Overall, we created 11 runsets (one for each site). Each runset contained runs starting every 7 days over the input temperature data range for that site, and each run contained 2500 individual simulations sampling different regions of biologically plausible parameter space. This sums to a total of approximately 86 × 10 6 simulations.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_30",
            "content": "Statistical analysis",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_31",
            "content": "The main results reported here are ‘normals’ in a meteorological sense of the term, but without the typical running mean smoothing which would complicate interpretation. For a variable of interest (eg. temperature or PQL), all values for the same calendar day irrespective of year (eg. 20-July) are aggregated, and summary statistics such as mean, minimum, maximum, and standard deviation are computed for each aggregation. Temperature functions.ipynb contains the code used to perform normal calculations, and the code generating figures as well as all statistical analysis is Summary Figures.ipynb (Jupyter Notebook <REF-32> , module and version information documented in the file).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_32",
            "content": "The results reported here are the normals of PQL, computed using the full temperature time series as opposed to computing PQL from the normal of the temperature time series. While the latter is fairly common practice, it is not mathematically proper since, as with means, the normal of a function of X is not generally equal to the function applied to the normal of X . Additionally, by computing the normals of the predicted quarantine durations, we can investigate properties of the distribution of values as shown in Figure 3 and Figure 4 and the “supernorm” supplementary figure S1 , supplementary figure S2 , and supplementary figure S3 .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_33",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "2.5",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_34",
            "content": "Figure 2 shows the mean of the normal PQL based on 3 generation degree day accumulation and MED-FOES 95% elimination along with the minimum and maximum of the normals for temperatures. Figure 3 and Figure 4 show the standard deviations ( σ ) of the normals for the degree day and ABS based PQL.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_35",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Summary of normal predicted quarantine length for each site and start date (last fly detection). Year range of input temperature data used is inclusive. All panels have identical limits except SFO quarantine.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_36",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Summary of normal predicted quarantine length for each site and start date (last fly detection).</title> <p>Year range of input temperature data used is inclusive. All panels have identical limits except SFO quarantine.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Summary of normal predicted quarantine length for each site and start date (last fly detection). Year range of input temperature data used is inclusive. All panels have identical limits except SFO quarantine.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_37",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "Variation in predicted quarantine length for each site and start date based on 3 generations of single-sine degree day accumulation.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_38",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>Variation in predicted quarantine length for each site and start date based on 3 generations of single-sine degree day accumulation.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "Variation in predicted quarantine length for each site and start date based on 3 generations of single-sine degree day accumulation.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_39",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Variation in predicted quarantine length for each site and start date based on 95% of MED-FOES agent-based simulations showing elimination.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_40",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <title>Variation in predicted quarantine length for each site and start date based on 95% of MED-FOES agent-based simulations showing elimination.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Variation in predicted quarantine length for each site and start date based on 95% of MED-FOES agent-based simulations showing elimination.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_41",
            "content": "There is significant variation in PQL across both time and location. The temporal variation in PQL is dominated by a yearly cycle, characterized by the normal values shown in Figure 2 . Table 2 shows the percentage of variance in quarantine length predictions captured by the mean of the normal yearly cycle ( R 2 ) for each site. At all but one site, greater than 75% of the variance in both degree day and ABS based PQLs is accounted for by the mean normal, and the majority exceed 90%. SFO is an exception to this common trend, with the mean normal accounting for only 9.1% of the variation in degree day based PQL and 28.0% of the ABS based PQL. This is also reflected in supplementary figure S2 and supplementary figure S3 .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_42",
            "content": "Table 2.",
            "ntype": "label",
            "meta": {
                "id": "T2",
                "caption": "Percentage of PQL variance captured by the mean of the normal. DD PQL is the 3 generation single sine degree day based prediction, and ABS PQL is the MED-FOES agent-based simulation predictions.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_43",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T2\" position=\"anchor\"> <caption> <title>Percentage of PQL variance captured by the mean of the normal. DD PQL is the 3 generation single sine degree day based prediction, and ABS PQL is the MED-FOES agent-based simulation predictions.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">Site</th> <th align=\"left\">DD PQL <italic>R</italic> <sup>2</sup> </th> <th align=\"left\">ABS PQL <italic>R</italic> <sup>2</sup> </th> </tr> </thead> <tbody> <tr> <td align=\"left\">SFO</td> <td align=\"right\">9.12%</td> <td align=\"right\">28.01%</td> </tr> <tr> <td align=\"left\">FAT</td> <td align=\"right\">93.93%</td> <td align=\"right\">75.68%</td> </tr> <tr> <td align=\"left\">BUR</td> <td align=\"right\">90.71%</td> <td align=\"right\">90.88%</td> </tr> <tr> <td align=\"left\">LAX</td> <td align=\"right\">80.17%</td> <td align=\"right\">83.07%</td> </tr> <tr> <td align=\"left\">RIV</td> <td align=\"right\">92.23%</td> <td align=\"right\">81.89%</td> </tr> <tr> <td align=\"left\">SAN</td> <td align=\"right\">80.99%</td> <td align=\"right\">80.91%</td> </tr> <tr> <td align=\"left\">JAX</td> <td align=\"right\">96.45%</td> <td align=\"right\">94.78%</td> </tr> <tr> <td align=\"left\">IAH</td> <td align=\"right\">95.10%</td> <td align=\"right\">91.80%</td> </tr> <tr> <td align=\"left\">MCO</td> <td align=\"right\">94.62%</td> <td align=\"right\">95.77%</td> </tr> <tr> <td align=\"left\">TPA</td> <td align=\"right\">91.91%</td> <td align=\"right\">94.40%</td> </tr> <tr> <td align=\"left\">MIA</td> <td align=\"right\">88.42%</td> <td align=\"right\">92.00%</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T2",
                "caption": "Percentage of PQL variance captured by the mean of the normal. DD PQL is the 3 generation single sine degree day based prediction, and ABS PQL is the MED-FOES agent-based simulation predictions.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_44",
            "content": "Seasonal dependence",
            "ntype": "title",
            "meta": {
                "section": "2.6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_45",
            "content": "Seasonal variation, evidenced by the general shape of the curves shown in Figure 2 , is doubtless familiar to anyone engaged in Medfly pest management. Outbreaks starting in the late summer, autumn, or early winter will extend through relatively cold periods, when thermal dependent development will be slow and therefore extend the duration of quarantine required for 3 generations of degree days to accumulate (referred to as DD PQL hereafter). Similarly, outbreaks starting in the spring or early summer often lead to short quarantines due to the relatively high temperatures.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_46",
            "content": "This familiar pattern is also seen in the ABS PQLs despite it being quite different in nature from simple degree day accumulation. However, the ABS predictions show a smaller seasonal swing. The ABS generally produces a smaller overall range of PQLs, with longer quarantines than DD PQL for spring and early summer outbreaks, and shorter quarantines for late summer through early winter in almost all cases.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_47",
            "content": "A particular feature of interest, shown most dramatically at FAT in Figure 2 , is that ABS PQL often flattens out or even dips for quarantines starting in the late autumn or early winter. This can be due to relatively rare and brief cold-snaps, normally lasting only a few hours, which increase mortality. Since DD PQL does not account for mortality, it misses the effect of cold-snaps entirely. This effect is most clearly seen at more northern and inland sites where cold-snaps are more likely: particularly FAT and RIV, but also BUR, LAX, JAX, and IAH.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_48",
            "content": "Geographic dependence",
            "ntype": "title",
            "meta": {
                "section": "2.7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_49",
            "content": "PQL generally shows a positive correlation with latitude, and sites are ordered by latitude in the figures and tables here. As seen in Figure 2 , higher latitude sites tend to have longer PQLs as well as larger seasonal swings for both degree day and ABS based predictions.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_50",
            "content": "Figure 5 shows the relationship between PQL and latitude. An ordinary least squares fit to the median PQL at each site shows a significant slope for both DD PQL ( F =14.08, p =0.005) and ABS PQL ( F =10.55, p =0.010), but the degree day based predictions are more sensitive to latitude than the ABS (coefficients of 17.39 and 4.78 respectively). Additionally, the ABS predictions are more stable for SFO, and to a lesser extent FAT, where the degree day model for Medfly produced PQLs that appear either unrealistically long (SFO) or are subject to rapid and extreme seasonal variation in the mid year (FAT).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_51",
            "content": "Figure 5.",
            "ntype": "label",
            "meta": {
                "id": "f5",
                "caption": "Predicted quarantine length dependence on latitude. For each site, the mean, median, and inter-quartile range are shown, similar to a boxplot. An ordinary least-squares linear fit to the median values is shown by the green lines. The left panel is for single sine degree day predictions, and MED-FOES ABS based predictions are in the right panel.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_52",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f5\" position=\"float\"> <caption> <title>Predicted quarantine length dependence on latitude.</title> <p>For each site, the mean, median, and inter-quartile range are shown, similar to a boxplot. An ordinary least-squares linear fit to the median values is shown by the green lines. The left panel is for single sine degree day predictions, and MED-FOES ABS based predictions are in the right panel.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure5.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f5",
                "caption": "Predicted quarantine length dependence on latitude. For each site, the mean, median, and inter-quartile range are shown, similar to a boxplot. An ordinary least-squares linear fit to the median values is shown by the green lines. The left panel is for single sine degree day predictions, and MED-FOES ABS based predictions are in the right panel.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/13887/27fc7d46-4ce5-47e0-a79e-63efcb78e661_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_53",
            "content": "In addition to the variation associated with latitude, large differences in PQLs computed for the same start date can exist between even relatively nearby sites. For example, the differences in both degree day and ABS PQLs for the three sites in the Los Angeles region (LAX, BUR, RIV) (shown in the supplementary figure S4 ) display a strong seasonal component with a spike in July and/or August. The difference in DD PQL between LAX and BUR is normally about a month (overall median=35 days; overall 25% & 75% quantiles are 28 & 45 days), but the median difference of the normal exceeds 75 days in August with some PQL differences up to 142 days. Differences in ABS PQLs are more seasonally stable, with the LAX minus BUR difference not exceeding 42 days for any start date in the 43 years analyzed here.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_54",
            "content": "Variance and uncertainty",
            "ntype": "title",
            "meta": {
                "section": "2.8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_55",
            "content": "Figure 3 and Figure 4 report the standard deviation ( σ ) of the normal for DD PQL and the MED-FOES ABS PQL respectively. These indicate the year to year variability of the PQL for outbreaks starting at a given time of the year and can be used to gauge the uncertainty of predictions based on past PQLs relative to the actual quarantine length which will be required. Similar information is represented by the inter-quartile ranges shown in Figure 5 and supplementary figure S2 and supplementary figure S3 . The distributions of PQL values for a site and day-of-year (aggregating across years) are generally not highly skewed, making σ a relatively easy to interpret measure of uncertainty.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_56",
            "content": "Excluding SFO, the mean normal is a good predictor of DD PQL with σ values below 20 days except for the late summer and early autumn, where variance increases due to quarantines extending through the cold season. FAT and, to a lesser extent, RIV show this increase more dramatically, presumably due to their more arid/inland climates where both daily and seasonal temperature ranges are larger (also see Figure 2 ). The standard deviation generally decreases with decreasing latitude, together with reduced means. The standard deviation in DD PQL for SFO shows an inversion of the seasonal trend other sites exhibit. This is due to the colder temperatures leading to extremely long DD PQLs, frequently extending across two winter seasons.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_57",
            "content": "The standard deviations of the ABS PQL normals shown in Figure 4 are generally about ½ as large as for DD PQL. This indicates that the ABS PQL not only shows less dramatic seasonal swings, but is also produces more consistent predictions across years. Values again generally decrease with latitude, but less consistently than DD PQL σ of normals. Also, unlike with the DD PQL, the results for SFO appear consistent with other sites.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_58",
            "content": "A notable feature is that BUR, LAX, and SAN all show an increase in the year to year variation in ABS PQLs starting in July and extending through November, while that increase for all other sites starts in July or August but extends to January or February. Additionally, results for FAT show a sharp increase in uncertainty starting in September, fitting with the more arid/inland climate. RIV shows a significant but more gradual increase.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_59",
            "content": "Historical quarantines",
            "ntype": "title",
            "meta": {
                "section": "2.9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_60",
            "content": "Thirty-four Medfly quarantines in CA dating from 1975 to early 2017 were analyzed ( supplementary table S1 ). The start of all but two of these quarantines was in the latter half of the year (July through December), when DD PQLs are typically relatively long, with 68% (23 / 34) occurring in September through October, when DD PQLs are longest. August, the month where uncertainty in DD PQL often spikes (see Figure 3 ), accounts for 30% (7 / 34) of historic quarantines.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_61",
            "content": "For each historic quarantine start date, the DD PQL and ABS PQL for the closest of the 11 sites analyzed above (see Figure 1 and Table 1 ) to the actual outbreak location was determined (see supplementary table S1 ). For this set of hypothetical quarantines, the ABS produced significantly shorter quarantines (mean=169.7 days, σ =21.8 days) than simple 3 generation degree day accumulation (mean=234.2 days, σ =79.2 days) ( df =33, t =6.01, p<10 −5 ). Additionally, the variance in the difference between quarantine lengths using a specific date and the mean of the normal PQL for that day of year was smaller for the ABS ( σ =8.2 days) than with degree day ( σ =25.9 days) ( df =33, F =9.92, p<10 −8 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_62",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_63",
            "content": "The principal contributions of this work can be broken down into three categories:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_64",
            "content": "1) Comparison of PQLs as determined by the degree day and ABS methods.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_65",
            "content": "2) Variation in average PQLs across time of year and space; and",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_66",
            "content": "3) Variation in PQLs within a time of year and location.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_67",
            "content": "Consideration of all three of these by program managers, planners and other decision makers is likely to improve management of Medfly outbreaks by informing resource allocation ahead of outbreaks, reducing quarantine costs in some cases, and reducing risk from premature quarantine suspension in others. The results presented cover most of the latitudinal range of Medfly suitability within the United States, as well as many sites of probable introduction, and will hopefully find use as a general guide.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_68",
            "content": "Eradication models are extremely difficult to test for accuracy given the impracticality of experimental introductions and the sparse and idiosyncratic nature of historic outbreaks. However, analyzing the timing and locations of historic outbreaks suggests that quarantine lengths would generally be more consistent and shorter on average in California if estimated by ABS compared with degree day.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_69",
            "content": "Requiring a fixed number of generations (typically 3) of degree days to pass is a “tried and true\" method, but not explicitly an extirpation model. It may overestimate required quarantine length through cold weather <REF-25> and may underestimate length when growth conditions are very favorable, which somewhat paradoxically leads to shorter degree day based quarantine periods after the last fly detection since generation times are shorter. However, the simplicity of the degree day calculation is a point in its favor, together with its record of generally avoiding subsequent detections after eradication measures and quarantine establishment <REF-20> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_70",
            "content": "ABS results may be used to inform and modulate responses and treatments such as delimination trapping, fruit sampling, and eradication measures which are under the some discretion of managers. In situations where DD PQL greatly exceed those from the ABS, it is likely that degree day is missing important effects, such as cold snaps, which may justify shortening quarantine periods. On the other hand, in cases where the ABS predicts longer times to elimination, it is plausible that the degree day indicated quarantine is optimistically short, and eradication treatments and SIT releases should be conducted even more aggressively than normal to ensure eradication is achieved within the degree day based period.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_71",
            "content": "A few specific results arising from overall comparisons of different locations are worth highlighting. In general, DD PQLs for Medfly generated from San Francisco International Airport temperature data are almost certainly too long for the entire year. The ABS PQLs are flatter and seem more realistic at around 200 days for San Francisco compared with the 400–550 days of DD PQLs. For several other California locations (typified by Fresno and Riverside) DD PQLs are in close alignment with those from the ABS for the first half of the year but go significantly longer in the cooler months. For three of the four Florida locations analyzed, DD PQLs are significantly shorter than the ABS results (Miami, Tampa, and Orlando). The extent of the difference in those Florida locations is smaller in the later months of the year, but the generality of this pattern suggests that the margin of safety for quarantines as calculated by degree day in those locations may be smaller than expected.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_72",
            "content": "There is significant variation in PQL depending on the location of the outbreak, with the extremes in our study sites represented by Miami and San Francisco. These geographic results could be compared to previous efforts to model climatic suitability of different parts of the US. One of the early studies on the subject focused on Medfly found higher climatic suitability in Florida locations (Fort Pierce and Orlando) compared with California sites <REF-33> . Within California, however, those authors found a higher number of suitable months in coastal areas such as Oceanside compared with Riverside and Fresno, roughly paralleling our findings (compare Los Angeles or San Diego with Fresno or Riverside). A more recent analysis of climatic suitability likewise concludes that coastal S. California is the most favorable area of the state for Medfly, but favorability drops inland in the south due to desert conditions. Suitability in central and northern California is limited by cold temperatures and freezes <REF-34> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_73",
            "content": "An important aspect of ABS PQLs is variation within particular times of years and locations. Rare events like cold snaps can increase mortality in the ABS, and thereby lead to shorter PQLs than expected based on historical averages, or DD PQLs. The specificity of the ABS is helpful for determining when quarantines might be safely suspended due to a rare event, something that might not be captured by the degree day model. The degree day model includes only development for generating PQLs, and development is halted at low temperatures, extending quarantine lengths. The ABS, however, also includes mortality for generating PQLs, which means that low temperatures can significantly reduce estimates.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_74",
            "content": "Historically in California, quarantines have most frequently occurred at times of year when degree day based quarantines are drawn out by cold weather and the MED-FOES ABS model predicts significantly shorter durations. Furthermore, 30% of those historic quarantines happened in August where there is a great deal of uncertainty in forward predictions of degree day quarantine durations based on normal values. If we assume those historic CA quarantines are a guide, the ABS model would very likely produced more predictable and shorter quarantine durations for future outbreaks.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_75",
            "content": "Combination of the two methods analyzed here could leverage the best aspects of both methods for determining optimal quarantine length. The initial quarantine length estimate could be quickly produced via degree-day calculation or the ABS based on the distribution of PQL values generated using historical temperatures. This would generate not just a single “typical” value as the current method of projecting using historical average/normal temperatures does, but a range of outcomes. The median “most likely” value may be used for official estimates, while the variance and extremes would provide managers and affected parties additional information vital for planning.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_76",
            "content": "Once the three generation period has started after the last fly find, weekly ABS simulations could indicate the likelihood that the pest has been successfully eliminated. If a threshold of 95% of simulations show elimination, the decision to end quarantine early could be made, or in the case where the ABS has not reached the 95% threshold at the end of the DD PQL additional measures could be considered to reduce the risk of re-detection.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_77",
            "content": "Data and software availability",
            "ntype": "title",
            "meta": {
                "section": "4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_78",
            "content": "All data, non-standard programs, and scripts used are available in the GitHub repository: https://github.com/travc/paper-Predicted-MF-Quarantine-Length-Data-and-Code , archived source code as at the time of publication is available at https://doi.org/10.5281/zenodo.1006698 <REF-35> . Files are documented in the repository’s README, and the analysis scripts ( .ipynb files) are viewable online at GitHub. Efforts were made to make the code understandable. It is our intent that someone with a reasonable level of programming knowledge will be able to not only replicate our analysis, but also use portions of the provided code as a basis for their own analysis.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_79",
            "content": "<REF-1> Simberloff D Martin JL Genovesi P : Impacts of biological invasions: what’s what and the way forward. Trends Ecol Evol. 2013 ; 28 ( 1 ): 58 – 66 . 22889499 10.1016/j.tree.2012.07.013",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_80",
            "content": "<REF-2> Pimentel D Pimentel M Wilson A : Plant, Animal, and Microbe Invasive Species in the United States and World . Biological Invasions . Springer Berlin Heidelberg, Berlin, Heidelberg. 2007 ; 193 : 315 – 330 . 10.1007/978-3-540-36920-2_18",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_81",
            "content": "<REF-3> Paini DR Sheppard AW Cook DC : Global threat to agriculture from invasive species. Proc Natl Acad Sci U S A. 2016 ; 113 ( 27 ): 7575 – 7579 . 27325781 10.1073/pnas.1602205113 4941431",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_82",
            "content": "<REF-4> Liebhold AM Tobin PC : Population Ecology of Insect Invasions and Their Management. Annu Rev Entomol. 2008 ; 53 ( 1 ): 387 – 408 . 17877456 10.1146/annurev.ento.52.110405.091401",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_83",
            "content": "<REF-5> Myers JH Simberloff D Kuris AM : Eradication revisited: dealing with exotic species. Trends Ecol Evol. 2000 ; 15 ( 8 ): 316 – 320 . 10884695 10.1016/S0169-5347(00)01914-5",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_84",
            "content": "<REF-6> Soper FL Wilson DB : Anopheles gambiae in Brazil, 1930 to 1940 . The Rockefeller Foundation, New York, 1943 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_85",
            "content": "<REF-7> Causey OR Deane LM Deane MP : Ecology of Anopheles gambiae in Brazil. Am J Trop Med. 1943 ; s1-23 ( 1 ): 73 – 94 . 10.4269/ajtmh.1943.s1-23.73",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_86",
            "content": "<REF-8> Killeen GF Fillinger U Kiche I : Eradication of Anopheles gambiae from Brazil: lessons for malaria control in Africa? Lancet Infect Dis. 2002 ; 2 ( 10 ): 618 – 627 . 12383612 10.1016/S1473-3099(02)00397-3",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_87",
            "content": "<REF-9> Gray DR : Hitchhikers on trade routes: A phenology model estimates the probabilities of gypsy moth introduction and establishment. Ecol Appl. 2010 ; 20 ( 8 ): 2300 – 2309 . 21265459 10.1890/09-1540.1",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_88",
            "content": "<REF-10> Robinson AS Vreysen MJ Hendrichs J : Enabling technologies to improve area-wide integrated pest management programmes for the control of screwworms. Med Vet Entomol. 2009 ; 23 Suppl 1 : 1 – 7 . 19335824 10.1111/j.1365-2915.2008.00769.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_89",
            "content": "<REF-11> Matthews J Caudell JN : In the news spring 2017. Hum Wildl Interact. 2017 ; 11 ( 1 ): 3. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_90",
            "content": "<REF-12> Carey JR : Establishment of the Mediterranean fruit fly in California. Science. 1991 ; 253 ( 5026 ): 1369 – 1373 . 1896848 10.1126/science.1896848",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_91",
            "content": "<REF-13> Papadopoulos NT Plant RE Carey JR : From trickle to flood: the large-scale, cryptic invasion of California by tropical fruit flies. Proc Biol Sci. 2013 ; 280 ( 1768 ): 20131466. 23926154 10.1098/rspb.2013.1466 3757976",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_92",
            "content": "<REF-14> Carey JR Papadopoulos N Plant R : The 30-year debate on a multi-billion-dollar threat: Tephritid fruit fly establishment in California. Am Entomol. 2017 ; 63 ( 2 ): 100 – 113 . 10.1093/ae/tmx036",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_93",
            "content": "<REF-15> Davies N Villablanca FX Roderick GK : Bioinvasions of the Medfly Ceratitis capitata : Source estimation using DNA sequences at multiple intron loci. Genetics. 1999 ; 153 ( 1 ): 351 – 360 . 10471718 1460749",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_94",
            "content": "<REF-16> Haymer DS He M McInnis DO : Genetic marker analysis of spatial and temporal relationships among existing populations and new infestations of the Mediterranean fruit fly ( Ceratitis capitata ). Heredity. 1997 ; 79 ( 3 ): 302 – 309 . 10.1038/sj.hdy.6881960",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_95",
            "content": "<REF-17> Bonizzoni M Zheng L Guglielmino CR : Microsatellite analysis of medfly bioinfestations in California. Mol Ecol. 2001 ; 10 ( 10 ): 2515 – 2524 . 11742551 10.1046/j.0962-1083.2001.01376.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_96",
            "content": "<REF-18> Gasperi G Bonizzoni M Gomulski LM : Genetic Differentiation, Gene Flow and the Origin of Infestations of the Medfly, Ceratitis Capitata . Genetica. 2002 ; 116 ( 1 ): 125 – 135 . 12484532 10.1023/A:1020971911612",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_97",
            "content": "<REF-19> Szyniszewska AM Leppla NC Huang Z : Analysis of seasonal risk for importation of the mediterranean fruit fly, Ceratitis capitata (Diptera: Tephritidae), via air passenger traffic arriving in Florida and California. J Econ Entomol. 2016 ; 109 ( 6 ): 2317 – 2328 . 27594703 10.1093/jee/tow196 5225961",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_98",
            "content": "<REF-20> Mcinnis DO Hendrichs J Shelly T : Can polyphagous invasive tephritid pest populations escape detection for years under favorable climatic and host conditions. Am Entomol. 2017 ; 63 ( 2 ): 89 – 99 . 10.1093/ae/tmx038",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_99",
            "content": "<REF-21> Gilbert AJ Bingham RR Nicolas MA : Insect trapping guide . 13th edition. CDFA., Sacramento CA, 2013 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_100",
            "content": "<REF-22> United States Code of Federal Regulations : Title 7 Subtitle B Chapter III Part 301.32-10 Treatments . 73 FR 32432, June 9, 2008, as amended at 75 FR 4240, Jan. 26, 2010. 2017 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_101",
            "content": "<REF-23> Califorina Code of Regulations : Mediterranean Fruit Fly Interior Quarantine . Title 3, Section 3406. Last vistited 2017-07-17. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_102",
            "content": "<REF-24> Roltsch WJ Zalom FG Strawn AJ : Evaluation of several degree-day estimation methods in California climates. Int J Biometeorol. 1999 ; 42 ( 4 ): 169 – 176 . 10.1007/s004840050101",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_103",
            "content": "<REF-25> Manoukis NC Hoffman K : An agent-based simulation of extirpation of Ceratitis capitata applied to invasions in California. J Pest Sci (2004). 2014 ; 87 ( 1 ): 39 – 51 . 24563646 10.1007/s10340-013-0513-y 3925300",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_104",
            "content": "<REF-26> Baskerville GL Emin P : Rapid estimation of heat accumulation from maximum and minimum temperatures. Ecology. 1969 ; 50 ( 3 ): 514 – 517 . 10.2307/1933912",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_105",
            "content": "<REF-27> Manoukis NC Hall B Geib SM : A computer model of insect traps in a landscape. Sci Rep. 2014 ; 4 : 7015, WOS:000344760700005. 25388652 10.1038/srep07015 4228344",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_106",
            "content": "<REF-28> Smith A Lott N Vose R : The Integrated Surface Database: Recent Developments and Partnerships. Bull Am Meteorol Soc. 2011 ; 92 ( 6 ): 704 – 708 . 10.1175/2011BAMS3015.1",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_107",
            "content": "<REF-29> Integrated Surface Database (ISD) . National Centers for Environmental Information (NCEI) formerly known as National Climatic Data Center (NCDC). Last visited 2017-07-05. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_108",
            "content": "<REF-30> Mediterranean fruit fly: Regulation and quarantine boundaries . Last vistited 2017-07-17. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_109",
            "content": "<REF-31> Blower SM Dowlatabadi H : Sensitivity and uncertainty analysis of complex models of disease transmission: An hiv model, as an example. Int Stat Rev. 1994 ; 62 ( 2 ): 229 – 243 . 10.2307/1403510",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_110",
            "content": "<REF-32> Pérez F Granger BE : IPython: a system for interactive scientific computing. Comput Sci Eng. 2007 ; 9 ( 3 ): 21 – 29 . 10.1109/MCSE.2007.53",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_111",
            "content": "<REF-33> Messenger PS Flitters NE : Bioclimatic Studies of Three Species of Fruit Flies in Hawaii. J Econ Entomol. 1954 ; 47 ( 5 ): 756 – 765 . 10.1093/jee/47.5.756",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_112",
            "content": "<REF-34> Gutierrez AP Ponti L : Assessing the invasive potential of the Mediterranean fruit fly in California and Italy. Biol Invasion. 2011 ; 13 ( 12 ): 2661 – 2676 . 10.1007/s10530-011-9937-6",
            "ntype": "ref",
            "meta": {
                "id": "ref-34",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-1863_v1_113",
            "content": "<REF-35> Collier T Manoukis N : travc/paper-Predicted-MF-Quarantine-Length-Data-and-Code: Initial submission [Data set]. Zenodo. 2017 . Data Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-35",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "6-1863_v1_0@0",
            "content": "Evaluation of predicted Medfly ( Ceratitis capitata ) quarantine length in the United States utilizing degree-day and agent-based models",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_0",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "6-1863_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@0",
            "content": "Invasions by pest insects pose a significant threat to agriculture worldwide.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 0,
            "end": 76,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@1",
            "content": "In the case of Ceratitis capitata incursions on the US mainland, where it is not officially established, repeated detections are followed by quarantines and treatments to eliminate the invading population.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 78,
            "end": 282,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@2",
            "content": "However, it is difficult to accurately set quarantine duration because non-detection may not mean the pest is eliminated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 284,
            "end": 404,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@3",
            "content": "Most programs extend quarantine lengths past the last fly detection by calculating the amount of time required for 3 generations to elapse under a thermal unit accumulation development model (“degree day”).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 406,
            "end": 611,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@4",
            "content": "A newer approach is to use an Agent-Based Simulation (ABS) to explicitly simulate population demographics and elimination.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 613,
            "end": 734,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@5",
            "content": "Here, predicted quarantine lengths for 11 sites in the continental United States are evaluated using both approaches.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 736,
            "end": 852,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@6",
            "content": "Results indicate a strong seasonality in quarantine length, with longer predictions in the second half of the year compared with the first; this pattern is more extreme in degree day predictions compared with ABS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 854,
            "end": 1066,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@7",
            "content": "Geographically, quarantine lengths increased with latitude, though this was less pronounced under the ABS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 1068,
            "end": 1173,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@8",
            "content": "Variation in quarantine lengths for particular times and places was dramatically larger for degree day than ABS, generally spiking in the middle of the year for degree day and peaking in second half of the year for ABS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 1175,
            "end": 1393,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@9",
            "content": "Analysis of 34 C. capitata quarantines from 1975 to 2017 in California shows that, for all but two, quarantines were started in the second half of the year, when degree day quarantine lengths are longest and have the highest uncertainty.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 1395,
            "end": 1631,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@10",
            "content": "For a set of hypothetical outbreaks based on these historical quarantines, the ABS produced significantly shorter quarantines than degree day calculations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 1633,
            "end": 1787,
            "label": {}
        },
        {
            "ix": "6-1863_v1_2@11",
            "content": "Overall, ABS quarantine lengths were more consistent than degree day predictions, avoided unrealistically long values, and captured effects of rare events such as cold snaps.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_2",
            "start": 1789,
            "end": 1962,
            "label": {}
        },
        {
            "ix": "6-1863_v1_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "6-1863_v1_4@0",
            "content": "Invasions by insects, pathogens and pests are increasingly a defining challenge of the 21 st century, facilitated by global connectivity, climatic shifts, and other factors <REF-1> , <REF-2> , with a particularly severe impact on agriculture <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_4",
            "start": 0,
            "end": 250,
            "label": {}
        },
        {
            "ix": "6-1863_v1_4@1",
            "content": "Invasions by insects that do not become established have a lower public profile than those that are “successful” from the point of view of the insect.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_4",
            "start": 252,
            "end": 401,
            "label": {}
        },
        {
            "ix": "6-1863_v1_4@2",
            "content": "However, there is a greater chance that cases of invasion followed by elimination will be detected and studied when the invading species is of environmental, human health, or economic concern <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_4",
            "start": 403,
            "end": 603,
            "label": {}
        },
        {
            "ix": "6-1863_v1_4@3",
            "content": "Eradicating local populations of such insects can be desirable and feasible <REF-5> depending on several factors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_4",
            "start": 605,
            "end": 717,
            "label": {}
        },
        {
            "ix": "6-1863_v1_5@0",
            "content": "One factor determining the feasibility of elimination is if the new environment is only marginally or seasonally suitable to the invading insect, facilitating its eradication.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_5",
            "start": 0,
            "end": 174,
            "label": {}
        },
        {
            "ix": "6-1863_v1_5@1",
            "content": "Another is when the high cost of allowing establishment leads to extensive efforts for eradication.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_5",
            "start": 176,
            "end": 274,
            "label": {}
        },
        {
            "ix": "6-1863_v1_5@2",
            "content": "The invasion of the malaria mosquito species Anopheles gambiae into Northeastern Brazil in the 1930’s <REF-6> is one example of an invasive insect that was successfully eradicated primarily due to the second of these factors <REF-7> , <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_5",
            "start": 276,
            "end": 519,
            "label": {}
        },
        {
            "ix": "6-1863_v1_6@0",
            "content": "In the case of An.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_6",
            "start": 0,
            "end": 17,
            "label": {}
        },
        {
            "ix": "6-1863_v1_6@1",
            "content": "gambiae there have been no reports of reinvasion, but there are examples of insects that recurrently invade areas outside their native range and are recurrently eliminated within relatively few generations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_6",
            "start": 19,
            "end": 224,
            "label": {}
        },
        {
            "ix": "6-1863_v1_6@2",
            "content": "The Gypsy moth Lymantria dispar in Canada <REF-9> is one such species.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_6",
            "start": 226,
            "end": 295,
            "label": {}
        },
        {
            "ix": "6-1863_v1_6@3",
            "content": "Arguably, another example is the screwworm Cochlyomyia hominivorax along the current northernmost edge of its range in Panama <REF-10> and more recently in Florida <REF-11> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_6",
            "start": 297,
            "end": 470,
            "label": {}
        },
        {
            "ix": "6-1863_v1_7@0",
            "content": "One of the most important instances of repeated invasion and elimination by an economically important insect pest is that of the Mediterranean fruit fly Ceratitis capitata (Wiedemann) (Medfly) in California.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_7",
            "start": 0,
            "end": 206,
            "label": {}
        },
        {
            "ix": "6-1863_v1_7@1",
            "content": "The last four decades have seen a repeated pattern of invasion, detection, and response interspersed by periods of no detections <REF-12> , <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_7",
            "start": 208,
            "end": 357,
            "label": {}
        },
        {
            "ix": "6-1863_v1_7@2",
            "content": "While it has been suggested that this pattern is the result of cryptic establishment <REF-14> , the majority view is that Medfly in California is an example of a “metainvasion”, consisting of multiple sequential or overlapping introductions <REF-15> and repeated eradication <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_7",
            "start": 359,
            "end": 643,
            "label": {}
        },
        {
            "ix": "6-1863_v1_7@3",
            "content": "Still other researchers point to the possibility of different situations in different regions of the state <REF-17> , <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_7",
            "start": 645,
            "end": 772,
            "label": {}
        },
        {
            "ix": "6-1863_v1_7@4",
            "content": "Medfly is occasionally found in other parts of the mainland US such as Florida <REF-19> , and in other countries or areas that are considered free of the pest including Eastern Australia, Mexico and Chile <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_7",
            "start": 774,
            "end": 988,
            "label": {}
        },
        {
            "ix": "6-1863_v1_8@0",
            "content": "The response plan to Medfly in California and the other “free” regions mentioned above is extensive and costly, including a quarantine when detections exceed an established standard (more than a male or unmated female fly is detected) <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_8",
            "start": 0,
            "end": 244,
            "label": {}
        },
        {
            "ix": "6-1863_v1_8@1",
            "content": "A practical and important problem is how long to maintain the countermeasures and quarantine after flies are no longer detected.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_8",
            "start": 246,
            "end": 373,
            "label": {}
        },
        {
            "ix": "6-1863_v1_8@2",
            "content": "Predicting the likely duration of this ‘post last detection’ quarantine period (hereafter just called quarantine length) would help with management decision-making and planning, and could allow potential cost savings by having sufficient but not excessive resources available.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_8",
            "start": 375,
            "end": 650,
            "label": {}
        },
        {
            "ix": "6-1863_v1_9@0",
            "content": "Currently, most programs extend quarantine periods past when the last fly is found, by calculating the amount of time required for a given number of generations (usually three) to elapse under a thermal unit accumulation (“degree day”) physiological development model.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_9",
            "start": 0,
            "end": 267,
            "label": {}
        },
        {
            "ix": "6-1863_v1_9@1",
            "content": "Degree day based quarantine lengths have been codified in some legal regulations, including United States Federal code <REF-22> , California <REF-23> , and Florida.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_9",
            "start": 269,
            "end": 432,
            "label": {}
        },
        {
            "ix": "6-1863_v1_9@2",
            "content": "However, the procedure prescribed only defines when the end of a quarantine period has been reached after the fact.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_9",
            "start": 434,
            "end": 548,
            "label": {}
        },
        {
            "ix": "6-1863_v1_10@0",
            "content": "For planning and resource allocation, policy makers and managers typically attempt to predict the quarantine lengths by using normal temperatures for forward projection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_10",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "6-1863_v1_10@1",
            "content": "Although it frequently works fairly well, this approach is mathematically flawed and also provides no indication as to the variance or uncertainty of those predictions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_10",
            "start": 170,
            "end": 337,
            "label": {}
        },
        {
            "ix": "6-1863_v1_10@2",
            "content": "Even a more rigorous treatment of degree day based values from historical temperature data can still produce highly variable results depending on relatively small changes in temperatures or details of the model formulation <REF-24> , in addition to neglecting important aspects of the biology.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_10",
            "start": 339,
            "end": 631,
            "label": {}
        },
        {
            "ix": "6-1863_v1_11@0",
            "content": "Recently, another approach to determining effective quarantine durations against Medfly via Agent-Based Simulations (ABS) <REF-25> was introduced.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_11",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "6-1863_v1_11@1",
            "content": "The MED-FOES system simulates a population of individual Medflies under inundative sterile insect technique (SIT) and other controls, explicitly modeling elimination as opposed to the degree day approach, which only determines the time for a specific number of generations to elapse to estimate quarantine duration.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_11",
            "start": 147,
            "end": 461,
            "label": {}
        },
        {
            "ix": "6-1863_v1_11@2",
            "content": "MED-FOES also allows for the sampling of parameter space (temperature dependent mortality for each stage, fecundity, etc.), producing a distribution of possible outcomes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_11",
            "start": 463,
            "end": 632,
            "label": {}
        },
        {
            "ix": "6-1863_v1_11@3",
            "content": "While an ABS can be arbitrarily complex, MED-FOES is parameterized in such a way that it can model a ‘typical’ or hypothetical outbreak from only hourly temperature data, and is therefore similar to degree day methods in its input data requirements.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_11",
            "start": 634,
            "end": 882,
            "label": {}
        },
        {
            "ix": "6-1863_v1_11@4",
            "content": "It is also possible to vary the initial population to model a specific outbreak.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_11",
            "start": 884,
            "end": 963,
            "label": {}
        },
        {
            "ix": "6-1863_v1_12@0",
            "content": "In this paper, predicted quarantine length (PQL) for 11 sites in the continental United States were analyzed ( Figure 1 and Table 1 ) based on both the standard thermal accumulation degree day method <REF-26> as well as the MED-FOES ABS <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_12",
            "start": 0,
            "end": 246,
            "label": {}
        },
        {
            "ix": "6-1863_v1_12@1",
            "content": "Seasonal variation dominates quarantine duration, so we aggregated the PQL values for each day of the year (Jan. 1, Jan. 2, etc.) across a large number of years (65 for most locations) to produce normals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_12",
            "start": 248,
            "end": 451,
            "label": {}
        },
        {
            "ix": "6-1863_v1_12@2",
            "content": "This approach enables comparison of the standard degree day method to the ABS, but more importantly provides insight into seasonal and spatial variations, prediction uncertainties, and model reliability.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_12",
            "start": 453,
            "end": 655,
            "label": {}
        },
        {
            "ix": "6-1863_v1_13@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_13",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-1863_v1_15@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_15",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "6-1863_v1_17@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_17",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "6-1863_v1_18@0",
            "content": "Sites and temperature data",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_18",
            "start": 0,
            "end": 25,
            "label": {}
        },
        {
            "ix": "6-1863_v1_19@0",
            "content": "Hourly air temperature data for 11 sites was downloaded from NOAA’s publicly available Integrated Surface Database (ISD) dataset <REF-28> , <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_19",
            "start": 0,
            "end": 149,
            "label": {}
        },
        {
            "ix": "6-1863_v1_20@0",
            "content": "The airport sites shown in Figure 1 were chosen for their biological relevance and availability of high quality hourly data over a long time frame.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_20",
            "start": 0,
            "end": 146,
            "label": {}
        },
        {
            "ix": "6-1863_v1_21@0",
            "content": "Sites are referred to here by the last three letters of the callsign shown in Table 1 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_21",
            "start": 0,
            "end": 86,
            "label": {}
        },
        {
            "ix": "6-1863_v1_21@1",
            "content": "For 8 sites (SFO, FAT, LAX, RIV, SAN, JAX, TPA, and MIA), temperature data starting on 1950-01-01 was used.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_21",
            "start": 88,
            "end": 194,
            "label": {}
        },
        {
            "ix": "6-1863_v1_21@2",
            "content": "The 3 other sites contained large (>14 days) gaps or other problems in the early years of their data, so data starting on 1970-01-01 for IAH and 1973-01-01 for BUR and MCO was used.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_21",
            "start": 196,
            "end": 376,
            "label": {}
        },
        {
            "ix": "6-1863_v1_21@3",
            "content": "For all sites, temperature data from the start date through 2017-05-15 was used to generate PQLs for dates ranging from the start date to 2016-01-01.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_21",
            "start": 378,
            "end": 526,
            "label": {}
        },
        {
            "ix": "6-1863_v1_22@0",
            "content": "Data was fetched and parsed using the Fetching and parsing ISH.ipynb program.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_22",
            "start": 0,
            "end": 76,
            "label": {}
        },
        {
            "ix": "6-1863_v1_22@1",
            "content": "Records for the same station callsign were merged, since identification, format, and precise location of stations has changed over time.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_22",
            "start": 78,
            "end": 213,
            "label": {}
        },
        {
            "ix": "6-1863_v1_22@2",
            "content": "The data was then cleaned using the Cleaning temperatures.ipynb by removing outliers, identifying large gaps (> 3 hours), resampling to every hour on the hour using linear interpolation, and filling the large gaps using day-over-day linear interpolation (interpolating using values for the same hour of day from previous and following days).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_22",
            "start": 215,
            "end": 555,
            "label": {}
        },
        {
            "ix": "6-1863_v1_22@3",
            "content": "The resulting temperature datasets are available.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_22",
            "start": 557,
            "end": 605,
            "label": {}
        },
        {
            "ix": "6-1863_v1_23@0",
            "content": "Degree-day calculation",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_23",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "6-1863_v1_24@0",
            "content": "Degree-days were computed by the single-sine method <REF-26> , using a base development temperature of 12.39°C (53.3°F) and 345.56 degree-days Celsius (DDc; 622 DDf) per generation following the standard set by California Department of Food and Agriculture regulation 3406(b) <REF-23> , <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_24",
            "start": 0,
            "end": 296,
            "label": {}
        },
        {
            "ix": "6-1863_v1_24@1",
            "content": "Since hourly temperature data are available, we also calculated degree-days by simple summation for comparison <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_24",
            "start": 298,
            "end": 418,
            "label": {}
        },
        {
            "ix": "6-1863_v1_24@2",
            "content": "For each date, the number of days required for 3 generations of degree-day based life cycles was computed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_24",
            "start": 420,
            "end": 525,
            "label": {}
        },
        {
            "ix": "6-1863_v1_24@3",
            "content": "These calculations are implemented in Temperature functions.ipynb .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_24",
            "start": 527,
            "end": 593,
            "label": {}
        },
        {
            "ix": "6-1863_v1_25@0",
            "content": "Agent-based simulations: MED-FOES",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_25",
            "start": 0,
            "end": 32,
            "label": {}
        },
        {
            "ix": "6-1863_v1_26@0",
            "content": "MED-FOES <REF-25> , <REF-27> is an agent-based simulation explicitly modeling the eradication of a population of Medflies under inundative sterile male releases (sterile insect technique or SIT) and other interventions, such as increased trapping and foliar sprays.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_26",
            "start": 0,
            "end": 264,
            "label": {}
        },
        {
            "ix": "6-1863_v1_26@1",
            "content": "A MED-FOES simulation models a single non-spatial population, starting from a given population size and age distribution, tracking the number of individuals through time until the last fly (Agent) dies and the population is eliminated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_26",
            "start": 266,
            "end": 500,
            "label": {}
        },
        {
            "ix": "6-1863_v1_26@2",
            "content": "In addition to hourly temperatures, simulation parameters include: the initial population, additional mortality induced by control efforts, the effectiveness of SIT, and a large number of biological parameters for which ranges are known from the literature including temperature-dependent development and mortality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_26",
            "start": 502,
            "end": 816,
            "label": {}
        },
        {
            "ix": "6-1863_v1_26@3",
            "content": "The simulations were performed using the same hourly time series of temperature values used for degree-day calculations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_26",
            "start": 818,
            "end": 937,
            "label": {}
        },
        {
            "ix": "6-1863_v1_27@0",
            "content": "Due to the fact that many of the parameters are only known to within a range, 2500 individual MED-FOES simulations were run for each start date at each site, evenly sampling different regions of parameter-space via the Latin Hypercube Sampling <REF-31> procedure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_27",
            "start": 0,
            "end": 262,
            "label": {}
        },
        {
            "ix": "6-1863_v1_27@1",
            "content": "This set of simulations, encompassing a range of possible elimination outcomes, is referred to as a ‘run’.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_27",
            "start": 264,
            "end": 369,
            "label": {}
        },
        {
            "ix": "6-1863_v1_27@2",
            "content": "The number of days from the start date required for 95% of the simulations in a run to be eliminated is taken as a conservative prediction of needed quarantine length and referred to as ABS PQL <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_27",
            "start": 371,
            "end": 574,
            "label": {}
        },
        {
            "ix": "6-1863_v1_28@0",
            "content": "Varying the start date for different simulations was achieved by simply starting at different points in the input temperature file; for this study a run was started every 7 days over the range of dates available for each site.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_28",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "6-1863_v1_28@1",
            "content": "Each set of runs for a single site over a range of starting dates is referred to as a ‘runset’.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_28",
            "start": 227,
            "end": 321,
            "label": {}
        },
        {
            "ix": "6-1863_v1_28@2",
            "content": "All runsets were conducted with the same input parameters aside from temperature.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_28",
            "start": 323,
            "end": 403,
            "label": {}
        },
        {
            "ix": "6-1863_v1_28@3",
            "content": "Initial population numbers were chosen as a “standard outbreak” based on seven real outbreaks modeled previously <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_28",
            "start": 405,
            "end": 527,
            "label": {}
        },
        {
            "ix": "6-1863_v1_28@4",
            "content": "The 7 day interval ABS PQL values were upsampled to daily values using linear interpolation to allow day-of-year aggregations across years and comparisons with daily degree day based PQLs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_28",
            "start": 529,
            "end": 716,
            "label": {}
        },
        {
            "ix": "6-1863_v1_29@0",
            "content": "MED-FOES version 0.6.2 was run under Open Grid Scheduler/Grid Engine 2011.11 on a CentOS 6.6 HPC cluster.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_29",
            "start": 0,
            "end": 104,
            "label": {}
        },
        {
            "ix": "6-1863_v1_29@1",
            "content": "The MED-FOES code, configuration files, helper scripts, and raw results are available.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_29",
            "start": 106,
            "end": 191,
            "label": {}
        },
        {
            "ix": "6-1863_v1_29@2",
            "content": "Overall, we created 11 runsets (one for each site).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_29",
            "start": 193,
            "end": 243,
            "label": {}
        },
        {
            "ix": "6-1863_v1_29@3",
            "content": "Each runset contained runs starting every 7 days over the input temperature data range for that site, and each run contained 2500 individual simulations sampling different regions of biologically plausible parameter space.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_29",
            "start": 245,
            "end": 466,
            "label": {}
        },
        {
            "ix": "6-1863_v1_29@4",
            "content": "This sums to a total of approximately 86 × 10 6 simulations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_29",
            "start": 468,
            "end": 527,
            "label": {}
        },
        {
            "ix": "6-1863_v1_30@0",
            "content": "Statistical analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_30",
            "start": 0,
            "end": 19,
            "label": {}
        },
        {
            "ix": "6-1863_v1_31@0",
            "content": "The main results reported here are ‘normals’ in a meteorological sense of the term, but without the typical running mean smoothing which would complicate interpretation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_31",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "6-1863_v1_31@1",
            "content": "For a variable of interest (eg. temperature or PQL), all values for the same calendar day irrespective of year (eg. 20-July) are aggregated, and summary statistics such as mean, minimum, maximum, and standard deviation are computed for each aggregation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_31",
            "start": 170,
            "end": 422,
            "label": {}
        },
        {
            "ix": "6-1863_v1_31@2",
            "content": "Temperature functions.ipynb contains the code used to perform normal calculations, and the code generating figures as well as all statistical analysis is Summary Figures.ipynb (Jupyter Notebook <REF-32> , module and version information documented in the file).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_31",
            "start": 424,
            "end": 683,
            "label": {}
        },
        {
            "ix": "6-1863_v1_32@0",
            "content": "The results reported here are the normals of PQL, computed using the full temperature time series as opposed to computing PQL from the normal of the temperature time series.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_32",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "6-1863_v1_32@1",
            "content": "While the latter is fairly common practice, it is not mathematically proper since, as with means, the normal of a function of X is not generally equal to the function applied to the normal of X .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_32",
            "start": 174,
            "end": 368,
            "label": {}
        },
        {
            "ix": "6-1863_v1_32@2",
            "content": "Additionally, by computing the normals of the predicted quarantine durations, we can investigate properties of the distribution of values as shown in Figure 3 and Figure 4 and the “supernorm” supplementary figure S1 , supplementary figure S2 , and supplementary figure S3 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_32",
            "start": 370,
            "end": 642,
            "label": {}
        },
        {
            "ix": "6-1863_v1_33@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_33",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "6-1863_v1_34@0",
            "content": "Figure 2 shows the mean of the normal PQL based on 3 generation degree day accumulation and MED-FOES 95% elimination along with the minimum and maximum of the normals for temperatures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_34",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "6-1863_v1_34@1",
            "content": "Figure 3 and Figure 4 show the standard deviations ( σ ) of the normals for the degree day and ABS based PQL.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_34",
            "start": 185,
            "end": 293,
            "label": {}
        },
        {
            "ix": "6-1863_v1_35@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_35",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-1863_v1_37@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_37",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-1863_v1_39@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_39",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-1863_v1_41@0",
            "content": "There is significant variation in PQL across both time and location.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_41",
            "start": 0,
            "end": 67,
            "label": {}
        },
        {
            "ix": "6-1863_v1_41@1",
            "content": "The temporal variation in PQL is dominated by a yearly cycle, characterized by the normal values shown in Figure 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_41",
            "start": 69,
            "end": 184,
            "label": {}
        },
        {
            "ix": "6-1863_v1_41@2",
            "content": "Table 2 shows the percentage of variance in quarantine length predictions captured by the mean of the normal yearly cycle ( R 2 ) for each site.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_41",
            "start": 186,
            "end": 329,
            "label": {}
        },
        {
            "ix": "6-1863_v1_41@3",
            "content": "At all but one site, greater than 75% of the variance in both degree day and ABS based PQLs is accounted for by the mean normal, and the majority exceed 90%.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_41",
            "start": 331,
            "end": 487,
            "label": {}
        },
        {
            "ix": "6-1863_v1_41@4",
            "content": "SFO is an exception to this common trend, with the mean normal accounting for only 9.1% of the variation in degree day based PQL and 28.0% of the ABS based PQL.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_41",
            "start": 489,
            "end": 648,
            "label": {}
        },
        {
            "ix": "6-1863_v1_41@5",
            "content": "This is also reflected in supplementary figure S2 and supplementary figure S3 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_41",
            "start": 650,
            "end": 728,
            "label": {}
        },
        {
            "ix": "6-1863_v1_42@0",
            "content": "Table 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_42",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "6-1863_v1_44@0",
            "content": "Seasonal dependence",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_44",
            "start": 0,
            "end": 18,
            "label": {}
        },
        {
            "ix": "6-1863_v1_45@0",
            "content": "Seasonal variation, evidenced by the general shape of the curves shown in Figure 2 , is doubtless familiar to anyone engaged in Medfly pest management.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_45",
            "start": 0,
            "end": 150,
            "label": {}
        },
        {
            "ix": "6-1863_v1_45@1",
            "content": "Outbreaks starting in the late summer, autumn, or early winter will extend through relatively cold periods, when thermal dependent development will be slow and therefore extend the duration of quarantine required for 3 generations of degree days to accumulate (referred to as DD PQL hereafter).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_45",
            "start": 152,
            "end": 445,
            "label": {}
        },
        {
            "ix": "6-1863_v1_45@2",
            "content": "Similarly, outbreaks starting in the spring or early summer often lead to short quarantines due to the relatively high temperatures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_45",
            "start": 447,
            "end": 578,
            "label": {}
        },
        {
            "ix": "6-1863_v1_46@0",
            "content": "This familiar pattern is also seen in the ABS PQLs despite it being quite different in nature from simple degree day accumulation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_46",
            "start": 0,
            "end": 129,
            "label": {}
        },
        {
            "ix": "6-1863_v1_46@1",
            "content": "However, the ABS predictions show a smaller seasonal swing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_46",
            "start": 131,
            "end": 189,
            "label": {}
        },
        {
            "ix": "6-1863_v1_46@2",
            "content": "The ABS generally produces a smaller overall range of PQLs, with longer quarantines than DD PQL for spring and early summer outbreaks, and shorter quarantines for late summer through early winter in almost all cases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_46",
            "start": 191,
            "end": 406,
            "label": {}
        },
        {
            "ix": "6-1863_v1_47@0",
            "content": "A particular feature of interest, shown most dramatically at FAT in Figure 2 , is that ABS PQL often flattens out or even dips for quarantines starting in the late autumn or early winter.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_47",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "6-1863_v1_47@1",
            "content": "This can be due to relatively rare and brief cold-snaps, normally lasting only a few hours, which increase mortality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_47",
            "start": 188,
            "end": 304,
            "label": {}
        },
        {
            "ix": "6-1863_v1_47@2",
            "content": "Since DD PQL does not account for mortality, it misses the effect of cold-snaps entirely.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_47",
            "start": 306,
            "end": 394,
            "label": {}
        },
        {
            "ix": "6-1863_v1_47@3",
            "content": "This effect is most clearly seen at more northern and inland sites where cold-snaps are more likely: particularly FAT and RIV, but also BUR, LAX, JAX, and IAH.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_47",
            "start": 396,
            "end": 554,
            "label": {}
        },
        {
            "ix": "6-1863_v1_48@0",
            "content": "Geographic dependence",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_48",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "6-1863_v1_49@0",
            "content": "PQL generally shows a positive correlation with latitude, and sites are ordered by latitude in the figures and tables here.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_49",
            "start": 0,
            "end": 122,
            "label": {}
        },
        {
            "ix": "6-1863_v1_49@1",
            "content": "As seen in Figure 2 , higher latitude sites tend to have longer PQLs as well as larger seasonal swings for both degree day and ABS based predictions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_49",
            "start": 124,
            "end": 272,
            "label": {}
        },
        {
            "ix": "6-1863_v1_50@0",
            "content": "Figure 5 shows the relationship between PQL and latitude.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_50",
            "start": 0,
            "end": 56,
            "label": {}
        },
        {
            "ix": "6-1863_v1_50@1",
            "content": "An ordinary least squares fit to the median PQL at each site shows a significant slope for both DD PQL ( F =14.08, p =0.005) and ABS PQL ( F =10.55, p =0.010), but the degree day based predictions are more sensitive to latitude than the ABS (coefficients of 17.39 and 4.78 respectively).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_50",
            "start": 58,
            "end": 344,
            "label": {}
        },
        {
            "ix": "6-1863_v1_50@2",
            "content": "Additionally, the ABS predictions are more stable for SFO, and to a lesser extent FAT, where the degree day model for Medfly produced PQLs that appear either unrealistically long (SFO) or are subject to rapid and extreme seasonal variation in the mid year (FAT).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_50",
            "start": 346,
            "end": 607,
            "label": {}
        },
        {
            "ix": "6-1863_v1_51@0",
            "content": "Figure 5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_51",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-1863_v1_53@0",
            "content": "In addition to the variation associated with latitude, large differences in PQLs computed for the same start date can exist between even relatively nearby sites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_53",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "6-1863_v1_53@1",
            "content": "For example, the differences in both degree day and ABS PQLs for the three sites in the Los Angeles region (LAX, BUR, RIV) (shown in the supplementary figure S4 ) display a strong seasonal component with a spike in July and/or August.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_53",
            "start": 162,
            "end": 395,
            "label": {}
        },
        {
            "ix": "6-1863_v1_53@2",
            "content": "The difference in DD PQL between LAX and BUR is normally about a month (overall median=35 days; overall 25% & 75% quantiles are 28 & 45 days), but the median difference of the normal exceeds 75 days in August with some PQL differences up to 142 days.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_53",
            "start": 397,
            "end": 646,
            "label": {}
        },
        {
            "ix": "6-1863_v1_53@3",
            "content": "Differences in ABS PQLs are more seasonally stable, with the LAX minus BUR difference not exceeding 42 days for any start date in the 43 years analyzed here.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_53",
            "start": 648,
            "end": 804,
            "label": {}
        },
        {
            "ix": "6-1863_v1_54@0",
            "content": "Variance and uncertainty",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_54",
            "start": 0,
            "end": 23,
            "label": {}
        },
        {
            "ix": "6-1863_v1_55@0",
            "content": "Figure 3 and Figure 4 report the standard deviation ( σ ) of the normal for DD PQL and the MED-FOES ABS PQL respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_55",
            "start": 0,
            "end": 120,
            "label": {}
        },
        {
            "ix": "6-1863_v1_55@1",
            "content": "These indicate the year to year variability of the PQL for outbreaks starting at a given time of the year and can be used to gauge the uncertainty of predictions based on past PQLs relative to the actual quarantine length which will be required.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_55",
            "start": 122,
            "end": 366,
            "label": {}
        },
        {
            "ix": "6-1863_v1_55@2",
            "content": "Similar information is represented by the inter-quartile ranges shown in Figure 5 and supplementary figure S2 and supplementary figure S3 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_55",
            "start": 368,
            "end": 506,
            "label": {}
        },
        {
            "ix": "6-1863_v1_55@3",
            "content": "The distributions of PQL values for a site and day-of-year (aggregating across years) are generally not highly skewed, making σ a relatively easy to interpret measure of uncertainty.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_55",
            "start": 508,
            "end": 689,
            "label": {}
        },
        {
            "ix": "6-1863_v1_56@0",
            "content": "Excluding SFO, the mean normal is a good predictor of DD PQL with σ values below 20 days except for the late summer and early autumn, where variance increases due to quarantines extending through the cold season.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_56",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "6-1863_v1_56@1",
            "content": "FAT and, to a lesser extent, RIV show this increase more dramatically, presumably due to their more arid/inland climates where both daily and seasonal temperature ranges are larger (also see Figure 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_56",
            "start": 213,
            "end": 414,
            "label": {}
        },
        {
            "ix": "6-1863_v1_56@2",
            "content": "The standard deviation generally decreases with decreasing latitude, together with reduced means.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_56",
            "start": 416,
            "end": 512,
            "label": {}
        },
        {
            "ix": "6-1863_v1_56@3",
            "content": "The standard deviation in DD PQL for SFO shows an inversion of the seasonal trend other sites exhibit.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_56",
            "start": 514,
            "end": 615,
            "label": {}
        },
        {
            "ix": "6-1863_v1_56@4",
            "content": "This is due to the colder temperatures leading to extremely long DD PQLs, frequently extending across two winter seasons.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_56",
            "start": 617,
            "end": 737,
            "label": {}
        },
        {
            "ix": "6-1863_v1_57@0",
            "content": "The standard deviations of the ABS PQL normals shown in Figure 4 are generally about ½ as large as for DD PQL.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_57",
            "start": 0,
            "end": 109,
            "label": {}
        },
        {
            "ix": "6-1863_v1_57@1",
            "content": "This indicates that the ABS PQL not only shows less dramatic seasonal swings, but is also produces more consistent predictions across years.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_57",
            "start": 111,
            "end": 250,
            "label": {}
        },
        {
            "ix": "6-1863_v1_57@2",
            "content": "Values again generally decrease with latitude, but less consistently than DD PQL σ of normals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_57",
            "start": 252,
            "end": 345,
            "label": {}
        },
        {
            "ix": "6-1863_v1_57@3",
            "content": "Also, unlike with the DD PQL, the results for SFO appear consistent with other sites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_57",
            "start": 347,
            "end": 431,
            "label": {}
        },
        {
            "ix": "6-1863_v1_58@0",
            "content": "A notable feature is that BUR, LAX, and SAN all show an increase in the year to year variation in ABS PQLs starting in July and extending through November, while that increase for all other sites starts in July or August but extends to January or February.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_58",
            "start": 0,
            "end": 255,
            "label": {}
        },
        {
            "ix": "6-1863_v1_58@1",
            "content": "Additionally, results for FAT show a sharp increase in uncertainty starting in September, fitting with the more arid/inland climate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_58",
            "start": 257,
            "end": 388,
            "label": {}
        },
        {
            "ix": "6-1863_v1_58@2",
            "content": "RIV shows a significant but more gradual increase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_58",
            "start": 390,
            "end": 439,
            "label": {}
        },
        {
            "ix": "6-1863_v1_59@0",
            "content": "Historical quarantines",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_59",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "6-1863_v1_60@0",
            "content": "Thirty-four Medfly quarantines in CA dating from 1975 to early 2017 were analyzed ( supplementary table S1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_60",
            "start": 0,
            "end": 108,
            "label": {}
        },
        {
            "ix": "6-1863_v1_60@1",
            "content": "The start of all but two of these quarantines was in the latter half of the year (July through December), when DD PQLs are typically relatively long, with 68% (23 / 34) occurring in September through October, when DD PQLs are longest.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_60",
            "start": 110,
            "end": 343,
            "label": {}
        },
        {
            "ix": "6-1863_v1_60@2",
            "content": "August, the month where uncertainty in DD PQL often spikes (see Figure 3 ), accounts for 30% (7 / 34) of historic quarantines.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_60",
            "start": 345,
            "end": 470,
            "label": {}
        },
        {
            "ix": "6-1863_v1_61@0",
            "content": "For each historic quarantine start date, the DD PQL and ABS PQL for the closest of the 11 sites analyzed above (see Figure 1 and Table 1 ) to the actual outbreak location was determined (see supplementary table S1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_61",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "6-1863_v1_61@1",
            "content": "For this set of hypothetical quarantines, the ABS produced significantly shorter quarantines (mean=169.7 days, σ =21.8 days) than simple 3 generation degree day accumulation (mean=234.2 days, σ =79.2 days) ( df =33, t =6.01, p<10 −5 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_61",
            "start": 217,
            "end": 451,
            "label": {}
        },
        {
            "ix": "6-1863_v1_61@2",
            "content": "Additionally, the variance in the difference between quarantine lengths using a specific date and the mean of the normal PQL for that day of year was smaller for the ABS ( σ =8.2 days) than with degree day ( σ =25.9 days) ( df =33, F =9.92, p<10 −8 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_61",
            "start": 453,
            "end": 703,
            "label": {}
        },
        {
            "ix": "6-1863_v1_62@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_62",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "6-1863_v1_63@0",
            "content": "The principal contributions of this work can be broken down into three categories:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_63",
            "start": 0,
            "end": 81,
            "label": {}
        },
        {
            "ix": "6-1863_v1_64@0",
            "content": "1) Comparison of PQLs as determined by the degree day and ABS methods.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_64",
            "start": 0,
            "end": 69,
            "label": {}
        },
        {
            "ix": "6-1863_v1_65@0",
            "content": "2) Variation in average PQLs across time of year and space; and",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_65",
            "start": 0,
            "end": 62,
            "label": {}
        },
        {
            "ix": "6-1863_v1_66@0",
            "content": "3) Variation in PQLs within a time of year and location.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_66",
            "start": 0,
            "end": 55,
            "label": {}
        },
        {
            "ix": "6-1863_v1_67@0",
            "content": "Consideration of all three of these by program managers, planners and other decision makers is likely to improve management of Medfly outbreaks by informing resource allocation ahead of outbreaks, reducing quarantine costs in some cases, and reducing risk from premature quarantine suspension in others.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_67",
            "start": 0,
            "end": 302,
            "label": {}
        },
        {
            "ix": "6-1863_v1_67@1",
            "content": "The results presented cover most of the latitudinal range of Medfly suitability within the United States, as well as many sites of probable introduction, and will hopefully find use as a general guide.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_67",
            "start": 304,
            "end": 504,
            "label": {}
        },
        {
            "ix": "6-1863_v1_68@0",
            "content": "Eradication models are extremely difficult to test for accuracy given the impracticality of experimental introductions and the sparse and idiosyncratic nature of historic outbreaks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_68",
            "start": 0,
            "end": 180,
            "label": {}
        },
        {
            "ix": "6-1863_v1_68@1",
            "content": "However, analyzing the timing and locations of historic outbreaks suggests that quarantine lengths would generally be more consistent and shorter on average in California if estimated by ABS compared with degree day.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_68",
            "start": 182,
            "end": 397,
            "label": {}
        },
        {
            "ix": "6-1863_v1_69@0",
            "content": "Requiring a fixed number of generations (typically 3) of degree days to pass is a “tried and true\" method, but not explicitly an extirpation model.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_69",
            "start": 0,
            "end": 146,
            "label": {}
        },
        {
            "ix": "6-1863_v1_69@1",
            "content": "It may overestimate required quarantine length through cold weather <REF-25> and may underestimate length when growth conditions are very favorable, which somewhat paradoxically leads to shorter degree day based quarantine periods after the last fly detection since generation times are shorter.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_69",
            "start": 148,
            "end": 442,
            "label": {}
        },
        {
            "ix": "6-1863_v1_69@2",
            "content": "However, the simplicity of the degree day calculation is a point in its favor, together with its record of generally avoiding subsequent detections after eradication measures and quarantine establishment <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_69",
            "start": 444,
            "end": 657,
            "label": {}
        },
        {
            "ix": "6-1863_v1_70@0",
            "content": "ABS results may be used to inform and modulate responses and treatments such as delimination trapping, fruit sampling, and eradication measures which are under the some discretion of managers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_70",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "6-1863_v1_70@1",
            "content": "In situations where DD PQL greatly exceed those from the ABS, it is likely that degree day is missing important effects, such as cold snaps, which may justify shortening quarantine periods.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_70",
            "start": 193,
            "end": 381,
            "label": {}
        },
        {
            "ix": "6-1863_v1_70@2",
            "content": "On the other hand, in cases where the ABS predicts longer times to elimination, it is plausible that the degree day indicated quarantine is optimistically short, and eradication treatments and SIT releases should be conducted even more aggressively than normal to ensure eradication is achieved within the degree day based period.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_70",
            "start": 383,
            "end": 712,
            "label": {}
        },
        {
            "ix": "6-1863_v1_71@0",
            "content": "A few specific results arising from overall comparisons of different locations are worth highlighting.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_71",
            "start": 0,
            "end": 101,
            "label": {}
        },
        {
            "ix": "6-1863_v1_71@1",
            "content": "In general, DD PQLs for Medfly generated from San Francisco International Airport temperature data are almost certainly too long for the entire year.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_71",
            "start": 103,
            "end": 251,
            "label": {}
        },
        {
            "ix": "6-1863_v1_71@2",
            "content": "The ABS PQLs are flatter and seem more realistic at around 200 days for San Francisco compared with the 400–550 days of DD PQLs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_71",
            "start": 253,
            "end": 380,
            "label": {}
        },
        {
            "ix": "6-1863_v1_71@3",
            "content": "For several other California locations (typified by Fresno and Riverside) DD PQLs are in close alignment with those from the ABS for the first half of the year but go significantly longer in the cooler months.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_71",
            "start": 382,
            "end": 590,
            "label": {}
        },
        {
            "ix": "6-1863_v1_71@4",
            "content": "For three of the four Florida locations analyzed, DD PQLs are significantly shorter than the ABS results (Miami, Tampa, and Orlando).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_71",
            "start": 592,
            "end": 724,
            "label": {}
        },
        {
            "ix": "6-1863_v1_71@5",
            "content": "The extent of the difference in those Florida locations is smaller in the later months of the year, but the generality of this pattern suggests that the margin of safety for quarantines as calculated by degree day in those locations may be smaller than expected.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_71",
            "start": 726,
            "end": 987,
            "label": {}
        },
        {
            "ix": "6-1863_v1_72@0",
            "content": "There is significant variation in PQL depending on the location of the outbreak, with the extremes in our study sites represented by Miami and San Francisco.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_72",
            "start": 0,
            "end": 156,
            "label": {}
        },
        {
            "ix": "6-1863_v1_72@1",
            "content": "These geographic results could be compared to previous efforts to model climatic suitability of different parts of the US.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_72",
            "start": 158,
            "end": 279,
            "label": {}
        },
        {
            "ix": "6-1863_v1_72@2",
            "content": "One of the early studies on the subject focused on Medfly found higher climatic suitability in Florida locations (Fort Pierce and Orlando) compared with California sites <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_72",
            "start": 281,
            "end": 460,
            "label": {}
        },
        {
            "ix": "6-1863_v1_72@3",
            "content": "Within California, however, those authors found a higher number of suitable months in coastal areas such as Oceanside compared with Riverside and Fresno, roughly paralleling our findings (compare Los Angeles or San Diego with Fresno or Riverside).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_72",
            "start": 462,
            "end": 708,
            "label": {}
        },
        {
            "ix": "6-1863_v1_72@4",
            "content": "A more recent analysis of climatic suitability likewise concludes that coastal S. California is the most favorable area of the state for Medfly, but favorability drops inland in the south due to desert conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_72",
            "start": 710,
            "end": 922,
            "label": {}
        },
        {
            "ix": "6-1863_v1_72@5",
            "content": "Suitability in central and northern California is limited by cold temperatures and freezes <REF-34> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_72",
            "start": 924,
            "end": 1024,
            "label": {}
        },
        {
            "ix": "6-1863_v1_73@0",
            "content": "An important aspect of ABS PQLs is variation within particular times of years and locations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_73",
            "start": 0,
            "end": 91,
            "label": {}
        },
        {
            "ix": "6-1863_v1_73@1",
            "content": "Rare events like cold snaps can increase mortality in the ABS, and thereby lead to shorter PQLs than expected based on historical averages, or DD PQLs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_73",
            "start": 93,
            "end": 243,
            "label": {}
        },
        {
            "ix": "6-1863_v1_73@2",
            "content": "The specificity of the ABS is helpful for determining when quarantines might be safely suspended due to a rare event, something that might not be captured by the degree day model.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_73",
            "start": 245,
            "end": 423,
            "label": {}
        },
        {
            "ix": "6-1863_v1_73@3",
            "content": "The degree day model includes only development for generating PQLs, and development is halted at low temperatures, extending quarantine lengths.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_73",
            "start": 425,
            "end": 568,
            "label": {}
        },
        {
            "ix": "6-1863_v1_73@4",
            "content": "The ABS, however, also includes mortality for generating PQLs, which means that low temperatures can significantly reduce estimates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_73",
            "start": 570,
            "end": 701,
            "label": {}
        },
        {
            "ix": "6-1863_v1_74@0",
            "content": "Historically in California, quarantines have most frequently occurred at times of year when degree day based quarantines are drawn out by cold weather and the MED-FOES ABS model predicts significantly shorter durations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_74",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "6-1863_v1_74@1",
            "content": "Furthermore, 30% of those historic quarantines happened in August where there is a great deal of uncertainty in forward predictions of degree day quarantine durations based on normal values.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_74",
            "start": 220,
            "end": 409,
            "label": {}
        },
        {
            "ix": "6-1863_v1_74@2",
            "content": "If we assume those historic CA quarantines are a guide, the ABS model would very likely produced more predictable and shorter quarantine durations for future outbreaks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_74",
            "start": 411,
            "end": 578,
            "label": {}
        },
        {
            "ix": "6-1863_v1_75@0",
            "content": "Combination of the two methods analyzed here could leverage the best aspects of both methods for determining optimal quarantine length.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_75",
            "start": 0,
            "end": 134,
            "label": {}
        },
        {
            "ix": "6-1863_v1_75@1",
            "content": "The initial quarantine length estimate could be quickly produced via degree-day calculation or the ABS based on the distribution of PQL values generated using historical temperatures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_75",
            "start": 136,
            "end": 318,
            "label": {}
        },
        {
            "ix": "6-1863_v1_75@2",
            "content": "This would generate not just a single “typical” value as the current method of projecting using historical average/normal temperatures does, but a range of outcomes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_75",
            "start": 320,
            "end": 484,
            "label": {}
        },
        {
            "ix": "6-1863_v1_75@3",
            "content": "The median “most likely” value may be used for official estimates, while the variance and extremes would provide managers and affected parties additional information vital for planning.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_75",
            "start": 486,
            "end": 670,
            "label": {}
        },
        {
            "ix": "6-1863_v1_76@0",
            "content": "Once the three generation period has started after the last fly find, weekly ABS simulations could indicate the likelihood that the pest has been successfully eliminated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_76",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "6-1863_v1_76@1",
            "content": "If a threshold of 95% of simulations show elimination, the decision to end quarantine early could be made, or in the case where the ABS has not reached the 95% threshold at the end of the DD PQL additional measures could be considered to reduce the risk of re-detection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_76",
            "start": 171,
            "end": 440,
            "label": {}
        },
        {
            "ix": "6-1863_v1_77@0",
            "content": "Data and software availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_77",
            "start": 0,
            "end": 29,
            "label": {}
        },
        {
            "ix": "6-1863_v1_78@0",
            "content": "All data, non-standard programs, and scripts used are available in the GitHub repository: https://github.com/travc/paper-Predicted-MF-Quarantine-Length-Data-and-Code , archived source code as at the time of publication is available at https://doi.org/10.5281/zenodo.1006698 <REF-35> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_78",
            "start": 0,
            "end": 283,
            "label": {}
        },
        {
            "ix": "6-1863_v1_78@1",
            "content": "Files are documented in the repository’s README, and the analysis scripts ( .ipynb files) are viewable online at GitHub.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_78",
            "start": 285,
            "end": 404,
            "label": {}
        },
        {
            "ix": "6-1863_v1_78@2",
            "content": "Efforts were made to make the code understandable.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_78",
            "start": 406,
            "end": 455,
            "label": {}
        },
        {
            "ix": "6-1863_v1_78@3",
            "content": "It is our intent that someone with a reasonable level of programming knowledge will be able to not only replicate our analysis, but also use portions of the provided code as a basis for their own analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_78",
            "start": 457,
            "end": 661,
            "label": {}
        },
        {
            "ix": "6-1863_v1_79@0",
            "content": "<REF-1> Simberloff D Martin JL Genovesi P : Impacts of biological invasions: what’s what and the way forward. Trends Ecol Evol. 2013 ; 28 ( 1 ): 58 – 66 . 22889499 10.1016/j.tree.2012.07.013",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_79",
            "start": 0,
            "end": 189,
            "label": {}
        },
        {
            "ix": "6-1863_v1_80@0",
            "content": "<REF-2> Pimentel D Pimentel M Wilson A : Plant, Animal, and Microbe Invasive Species in the United States and World . Biological Invasions . Springer Berlin Heidelberg, Berlin, Heidelberg. 2007 ; 193 : 315 – 330 . 10.1007/978-3-540-36920-2_18",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_80",
            "start": 0,
            "end": 241,
            "label": {}
        },
        {
            "ix": "6-1863_v1_81@0",
            "content": "<REF-3> Paini DR Sheppard AW Cook DC : Global threat to agriculture from invasive species. Proc Natl Acad Sci U S A. 2016 ; 113 ( 27 ): 7575 – 7579 . 27325781 10.1073/pnas.1602205113 4941431",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_81",
            "start": 0,
            "end": 189,
            "label": {}
        },
        {
            "ix": "6-1863_v1_82@0",
            "content": "<REF-4> Liebhold AM Tobin PC : Population Ecology of Insect Invasions and Their Management. Annu Rev Entomol. 2008 ; 53 ( 1 ): 387 – 408 . 17877456 10.1146/annurev.ento.52.110405.091401",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_82",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "6-1863_v1_83@0",
            "content": "<REF-5> Myers JH Simberloff D Kuris AM : Eradication revisited: dealing with exotic species. Trends Ecol Evol. 2000 ; 15 ( 8 ): 316 – 320 . 10884695 10.1016/S0169-5347(00)01914-5",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_83",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "6-1863_v1_84@0",
            "content": "<REF-6> Soper FL Wilson DB : Anopheles gambiae in Brazil, 1930 to 1940 . The Rockefeller Foundation, New York, 1943 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_84",
            "start": 0,
            "end": 133,
            "label": {}
        },
        {
            "ix": "6-1863_v1_85@0",
            "content": "<REF-7> Causey OR Deane LM Deane MP : Ecology of Anopheles gambiae in Brazil. Am J Trop Med. 1943 ; s1-23 ( 1 ): 73 – 94 . 10.4269/ajtmh.1943.s1-23.73",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_85",
            "start": 0,
            "end": 149,
            "label": {}
        },
        {
            "ix": "6-1863_v1_86@0",
            "content": "<REF-8> Killeen GF Fillinger U Kiche I : Eradication of Anopheles gambiae from Brazil: lessons for malaria control in Africa? Lancet Infect Dis. 2002 ; 2 ( 10 ): 618 – 627 . 12383612 10.1016/S1473-3099(02)00397-3",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_86",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "6-1863_v1_87@0",
            "content": "<REF-9> Gray DR : Hitchhikers on trade routes: A phenology model estimates the probabilities of gypsy moth introduction and establishment. Ecol Appl. 2010 ; 20 ( 8 ): 2300 – 2309 . 21265459 10.1890/09-1540.1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_87",
            "start": 0,
            "end": 206,
            "label": {}
        },
        {
            "ix": "6-1863_v1_88@0",
            "content": "<REF-10> Robinson AS Vreysen MJ Hendrichs J : Enabling technologies to improve area-wide integrated pest management programmes for the control of screwworms. Med Vet Entomol. 2009 ; 23 Suppl 1 : 1 – 7 . 19335824 10.1111/j.1365-2915.2008.00769.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_88",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "6-1863_v1_89@0",
            "content": "<REF-11> Matthews J Caudell JN : In the news spring 2017. Hum Wildl Interact. 2017 ; 11 ( 1 ): 3. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_89",
            "start": 0,
            "end": 113,
            "label": {}
        },
        {
            "ix": "6-1863_v1_90@0",
            "content": "<REF-12> Carey JR : Establishment of the Mediterranean fruit fly in California. Science. 1991 ; 253 ( 5026 ): 1369 – 1373 . 1896848 10.1126/science.1896848",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_90",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "6-1863_v1_91@0",
            "content": "<REF-13> Papadopoulos NT Plant RE Carey JR : From trickle to flood: the large-scale, cryptic invasion of California by tropical fruit flies. Proc Biol Sci. 2013 ; 280 ( 1768 ): 20131466. 23926154 10.1098/rspb.2013.1466 3757976",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_91",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "6-1863_v1_92@0",
            "content": "<REF-14> Carey JR Papadopoulos N Plant R : The 30-year debate on a multi-billion-dollar threat: Tephritid fruit fly establishment in California. Am Entomol. 2017 ; 63 ( 2 ): 100 – 113 . 10.1093/ae/tmx036",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_92",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "6-1863_v1_93@0",
            "content": "<REF-15> Davies N Villablanca FX Roderick GK : Bioinvasions of the Medfly Ceratitis capitata : Source estimation using DNA sequences at multiple intron loci. Genetics. 1999 ; 153 ( 1 ): 351 – 360 . 10471718 1460749",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_93",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "6-1863_v1_94@0",
            "content": "<REF-16> Haymer DS He M McInnis DO : Genetic marker analysis of spatial and temporal relationships among existing populations and new infestations of the Mediterranean fruit fly ( Ceratitis capitata ). Heredity. 1997 ; 79 ( 3 ): 302 – 309 . 10.1038/sj.hdy.6881960",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_94",
            "start": 0,
            "end": 262,
            "label": {}
        },
        {
            "ix": "6-1863_v1_95@0",
            "content": "<REF-17> Bonizzoni M Zheng L Guglielmino CR : Microsatellite analysis of medfly bioinfestations in California. Mol Ecol. 2001 ; 10 ( 10 ): 2515 – 2524 . 11742551 10.1046/j.0962-1083.2001.01376.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_95",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "6-1863_v1_96@0",
            "content": "<REF-18> Gasperi G Bonizzoni M Gomulski LM : Genetic Differentiation, Gene Flow and the Origin of Infestations of the Medfly, Ceratitis Capitata . Genetica. 2002 ; 116 ( 1 ): 125 – 135 . 12484532 10.1023/A:1020971911612",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_96",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "6-1863_v1_97@0",
            "content": "<REF-19> Szyniszewska AM Leppla NC Huang Z : Analysis of seasonal risk for importation of the mediterranean fruit fly, Ceratitis capitata (Diptera: Tephritidae), via air passenger traffic arriving in Florida and California. J Econ Entomol. 2016 ; 109 ( 6 ): 2317 – 2328 . 27594703 10.1093/jee/tow196 5225961",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_97",
            "start": 0,
            "end": 306,
            "label": {}
        },
        {
            "ix": "6-1863_v1_98@0",
            "content": "<REF-20> Mcinnis DO Hendrichs J Shelly T : Can polyphagous invasive tephritid pest populations escape detection for years under favorable climatic and host conditions. Am Entomol. 2017 ; 63 ( 2 ): 89 – 99 . 10.1093/ae/tmx038",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_98",
            "start": 0,
            "end": 223,
            "label": {}
        },
        {
            "ix": "6-1863_v1_99@0",
            "content": "<REF-21> Gilbert AJ Bingham RR Nicolas MA : Insect trapping guide . 13th edition. CDFA., Sacramento CA, 2013 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_99",
            "start": 0,
            "end": 126,
            "label": {}
        },
        {
            "ix": "6-1863_v1_100@0",
            "content": "<REF-22> United States Code of Federal Regulations : Title 7 Subtitle B Chapter III Part 301.32-10 Treatments . 73 FR 32432, June 9, 2008, as amended at 75 FR 4240, Jan. 26, 2010. 2017 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_100",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "6-1863_v1_101@0",
            "content": "<REF-23> Califorina Code of Regulations : Mediterranean Fruit Fly Interior Quarantine . Title 3, Section 3406. Last vistited 2017-07-17. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_101",
            "start": 0,
            "end": 152,
            "label": {}
        },
        {
            "ix": "6-1863_v1_102@0",
            "content": "<REF-24> Roltsch WJ Zalom FG Strawn AJ : Evaluation of several degree-day estimation methods in California climates. Int J Biometeorol. 1999 ; 42 ( 4 ): 169 – 176 . 10.1007/s004840050101",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_102",
            "start": 0,
            "end": 185,
            "label": {}
        },
        {
            "ix": "6-1863_v1_103@0",
            "content": "<REF-25> Manoukis NC Hoffman K : An agent-based simulation of extirpation of Ceratitis capitata applied to invasions in California. J Pest Sci (2004). 2014 ; 87 ( 1 ): 39 – 51 . 24563646 10.1007/s10340-013-0513-y 3925300",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_103",
            "start": 0,
            "end": 219,
            "label": {}
        },
        {
            "ix": "6-1863_v1_104@0",
            "content": "<REF-26> Baskerville GL Emin P : Rapid estimation of heat accumulation from maximum and minimum temperatures. Ecology. 1969 ; 50 ( 3 ): 514 – 517 . 10.2307/1933912",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_104",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "6-1863_v1_105@0",
            "content": "<REF-27> Manoukis NC Hall B Geib SM : A computer model of insect traps in a landscape. Sci Rep. 2014 ; 4 : 7015, WOS:000344760700005. 25388652 10.1038/srep07015 4228344",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_105",
            "start": 0,
            "end": 167,
            "label": {}
        },
        {
            "ix": "6-1863_v1_106@0",
            "content": "<REF-28> Smith A Lott N Vose R : The Integrated Surface Database: Recent Developments and Partnerships. Bull Am Meteorol Soc. 2011 ; 92 ( 6 ): 704 – 708 . 10.1175/2011BAMS3015.1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_106",
            "start": 0,
            "end": 176,
            "label": {}
        },
        {
            "ix": "6-1863_v1_107@0",
            "content": "<REF-29> Integrated Surface Database (ISD) . National Centers for Environmental Information (NCEI) formerly known as National Climatic Data Center (NCDC). Last visited 2017-07-05. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_107",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "6-1863_v1_108@0",
            "content": "<REF-30> Mediterranean fruit fly: Regulation and quarantine boundaries . Last vistited 2017-07-17. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_108",
            "start": 0,
            "end": 114,
            "label": {}
        },
        {
            "ix": "6-1863_v1_109@0",
            "content": "<REF-31> Blower SM Dowlatabadi H : Sensitivity and uncertainty analysis of complex models of disease transmission: An hiv model, as an example. Int Stat Rev. 1994 ; 62 ( 2 ): 229 – 243 . 10.2307/1403510",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_109",
            "start": 0,
            "end": 201,
            "label": {}
        },
        {
            "ix": "6-1863_v1_110@0",
            "content": "<REF-32> Pérez F Granger BE : IPython: a system for interactive scientific computing. Comput Sci Eng. 2007 ; 9 ( 3 ): 21 – 29 . 10.1109/MCSE.2007.53",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_110",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "6-1863_v1_111@0",
            "content": "<REF-33> Messenger PS Flitters NE : Bioclimatic Studies of Three Species of Fruit Flies in Hawaii. J Econ Entomol. 1954 ; 47 ( 5 ): 756 – 765 . 10.1093/jee/47.5.756",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_111",
            "start": 0,
            "end": 163,
            "label": {}
        },
        {
            "ix": "6-1863_v1_112@0",
            "content": "<REF-34> Gutierrez AP Ponti L : Assessing the invasive potential of the Mediterranean fruit fly in California and Italy. Biol Invasion. 2011 ; 13 ( 12 ): 2661 – 2676 . 10.1007/s10530-011-9937-6",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_112",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "6-1863_v1_113@0",
            "content": "<REF-35> Collier T Manoukis N : travc/paper-Predicted-MF-Quarantine-Length-Data-and-Code: Initial submission [Data set]. Zenodo. 2017 . Data Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-1863_v1_113",
            "start": 0,
            "end": 146,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "6-1863_v1_0",
            "tgt_ix": "6-1863_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_1",
            "tgt_ix": "6-1863_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_0",
            "tgt_ix": "6-1863_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_13",
            "tgt_ix": "6-1863_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_15",
            "tgt_ix": "6-1863_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_0",
            "tgt_ix": "6-1863_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_18",
            "tgt_ix": "6-1863_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_18",
            "tgt_ix": "6-1863_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_18",
            "tgt_ix": "6-1863_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_18",
            "tgt_ix": "6-1863_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_23",
            "tgt_ix": "6-1863_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_25",
            "tgt_ix": "6-1863_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_25",
            "tgt_ix": "6-1863_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_25",
            "tgt_ix": "6-1863_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_25",
            "tgt_ix": "6-1863_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_30",
            "tgt_ix": "6-1863_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_30",
            "tgt_ix": "6-1863_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_33",
            "tgt_ix": "6-1863_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_33",
            "tgt_ix": "6-1863_v1_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_35",
            "tgt_ix": "6-1863_v1_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_33",
            "tgt_ix": "6-1863_v1_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_37",
            "tgt_ix": "6-1863_v1_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_33",
            "tgt_ix": "6-1863_v1_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_39",
            "tgt_ix": "6-1863_v1_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_33",
            "tgt_ix": "6-1863_v1_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_33",
            "tgt_ix": "6-1863_v1_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_42",
            "tgt_ix": "6-1863_v1_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_44",
            "tgt_ix": "6-1863_v1_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_44",
            "tgt_ix": "6-1863_v1_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_44",
            "tgt_ix": "6-1863_v1_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_48",
            "tgt_ix": "6-1863_v1_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_48",
            "tgt_ix": "6-1863_v1_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_48",
            "tgt_ix": "6-1863_v1_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_51",
            "tgt_ix": "6-1863_v1_52",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_48",
            "tgt_ix": "6-1863_v1_53",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_54",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_54",
            "tgt_ix": "6-1863_v1_55",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_54",
            "tgt_ix": "6-1863_v1_56",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_54",
            "tgt_ix": "6-1863_v1_57",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_54",
            "tgt_ix": "6-1863_v1_58",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_59",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_59",
            "tgt_ix": "6-1863_v1_60",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_59",
            "tgt_ix": "6-1863_v1_61",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_0",
            "tgt_ix": "6-1863_v1_62",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_63",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_64",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_65",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_66",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_67",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_68",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_69",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_70",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_71",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_72",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_73",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_74",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_75",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_76",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_0",
            "tgt_ix": "6-1863_v1_77",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_77",
            "tgt_ix": "6-1863_v1_78",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_0",
            "tgt_ix": "6-1863_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_1",
            "tgt_ix": "6-1863_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_4",
            "tgt_ix": "6-1863_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_5",
            "tgt_ix": "6-1863_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_6",
            "tgt_ix": "6-1863_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_8",
            "tgt_ix": "6-1863_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_9",
            "tgt_ix": "6-1863_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_10",
            "tgt_ix": "6-1863_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_11",
            "tgt_ix": "6-1863_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_12",
            "tgt_ix": "6-1863_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_13",
            "tgt_ix": "6-1863_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_14",
            "tgt_ix": "6-1863_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_15",
            "tgt_ix": "6-1863_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_16",
            "tgt_ix": "6-1863_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_18",
            "tgt_ix": "6-1863_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_19",
            "tgt_ix": "6-1863_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_20",
            "tgt_ix": "6-1863_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_21",
            "tgt_ix": "6-1863_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_22",
            "tgt_ix": "6-1863_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_23",
            "tgt_ix": "6-1863_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_24",
            "tgt_ix": "6-1863_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_25",
            "tgt_ix": "6-1863_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_26",
            "tgt_ix": "6-1863_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_27",
            "tgt_ix": "6-1863_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_28",
            "tgt_ix": "6-1863_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_29",
            "tgt_ix": "6-1863_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_30",
            "tgt_ix": "6-1863_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_31",
            "tgt_ix": "6-1863_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_32",
            "tgt_ix": "6-1863_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_33",
            "tgt_ix": "6-1863_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_34",
            "tgt_ix": "6-1863_v1_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_35",
            "tgt_ix": "6-1863_v1_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_36",
            "tgt_ix": "6-1863_v1_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_37",
            "tgt_ix": "6-1863_v1_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_38",
            "tgt_ix": "6-1863_v1_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_39",
            "tgt_ix": "6-1863_v1_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_40",
            "tgt_ix": "6-1863_v1_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_41",
            "tgt_ix": "6-1863_v1_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_42",
            "tgt_ix": "6-1863_v1_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_43",
            "tgt_ix": "6-1863_v1_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_44",
            "tgt_ix": "6-1863_v1_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_45",
            "tgt_ix": "6-1863_v1_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_46",
            "tgt_ix": "6-1863_v1_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_47",
            "tgt_ix": "6-1863_v1_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_48",
            "tgt_ix": "6-1863_v1_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_49",
            "tgt_ix": "6-1863_v1_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_50",
            "tgt_ix": "6-1863_v1_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_51",
            "tgt_ix": "6-1863_v1_52",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_52",
            "tgt_ix": "6-1863_v1_53",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_53",
            "tgt_ix": "6-1863_v1_54",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_54",
            "tgt_ix": "6-1863_v1_55",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_55",
            "tgt_ix": "6-1863_v1_56",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_56",
            "tgt_ix": "6-1863_v1_57",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_57",
            "tgt_ix": "6-1863_v1_58",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_58",
            "tgt_ix": "6-1863_v1_59",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_59",
            "tgt_ix": "6-1863_v1_60",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_60",
            "tgt_ix": "6-1863_v1_61",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_61",
            "tgt_ix": "6-1863_v1_62",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_63",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_63",
            "tgt_ix": "6-1863_v1_64",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_64",
            "tgt_ix": "6-1863_v1_65",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_65",
            "tgt_ix": "6-1863_v1_66",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_66",
            "tgt_ix": "6-1863_v1_67",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_67",
            "tgt_ix": "6-1863_v1_68",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_68",
            "tgt_ix": "6-1863_v1_69",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_69",
            "tgt_ix": "6-1863_v1_70",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_70",
            "tgt_ix": "6-1863_v1_71",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_71",
            "tgt_ix": "6-1863_v1_72",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_72",
            "tgt_ix": "6-1863_v1_73",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_73",
            "tgt_ix": "6-1863_v1_74",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_74",
            "tgt_ix": "6-1863_v1_75",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_75",
            "tgt_ix": "6-1863_v1_76",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_76",
            "tgt_ix": "6-1863_v1_77",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_77",
            "tgt_ix": "6-1863_v1_78",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_4",
            "tgt_ix": "6-1863_v1_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_4",
            "tgt_ix": "6-1863_v1_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_4",
            "tgt_ix": "6-1863_v1_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_4",
            "tgt_ix": "6-1863_v1_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_4",
            "tgt_ix": "6-1863_v1_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_5",
            "tgt_ix": "6-1863_v1_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_5",
            "tgt_ix": "6-1863_v1_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_5",
            "tgt_ix": "6-1863_v1_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_6",
            "tgt_ix": "6-1863_v1_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_6",
            "tgt_ix": "6-1863_v1_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_6",
            "tgt_ix": "6-1863_v1_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_90",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_91",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_92",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_93",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_94",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_95",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_96",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_97",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_98",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_8",
            "tgt_ix": "6-1863_v1_99",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_9",
            "tgt_ix": "6-1863_v1_100",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_9",
            "tgt_ix": "6-1863_v1_101",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_10",
            "tgt_ix": "6-1863_v1_102",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_11",
            "tgt_ix": "6-1863_v1_103",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_12",
            "tgt_ix": "6-1863_v1_104",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_12",
            "tgt_ix": "6-1863_v1_105",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_19",
            "tgt_ix": "6-1863_v1_106",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_19",
            "tgt_ix": "6-1863_v1_107",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_24",
            "tgt_ix": "6-1863_v1_108",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_27",
            "tgt_ix": "6-1863_v1_109",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_31",
            "tgt_ix": "6-1863_v1_110",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_72",
            "tgt_ix": "6-1863_v1_111",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_72",
            "tgt_ix": "6-1863_v1_112",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_78",
            "tgt_ix": "6-1863_v1_113",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_12",
            "tgt_ix": "6-1863_v1_14",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_12",
            "tgt_ix": "6-1863_v1_16",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_34",
            "tgt_ix": "6-1863_v1_36",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_32",
            "tgt_ix": "6-1863_v1_38",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_32",
            "tgt_ix": "6-1863_v1_40",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_41",
            "tgt_ix": "6-1863_v1_43",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_50",
            "tgt_ix": "6-1863_v1_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-1863_v1_0",
            "tgt_ix": "6-1863_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_1",
            "tgt_ix": "6-1863_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_2",
            "tgt_ix": "6-1863_v1_2@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_3",
            "tgt_ix": "6-1863_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_4",
            "tgt_ix": "6-1863_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_4",
            "tgt_ix": "6-1863_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_4",
            "tgt_ix": "6-1863_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_4",
            "tgt_ix": "6-1863_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_5",
            "tgt_ix": "6-1863_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_5",
            "tgt_ix": "6-1863_v1_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_5",
            "tgt_ix": "6-1863_v1_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_6",
            "tgt_ix": "6-1863_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_6",
            "tgt_ix": "6-1863_v1_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_6",
            "tgt_ix": "6-1863_v1_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_6",
            "tgt_ix": "6-1863_v1_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_7@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_7",
            "tgt_ix": "6-1863_v1_7@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_8",
            "tgt_ix": "6-1863_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_8",
            "tgt_ix": "6-1863_v1_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_8",
            "tgt_ix": "6-1863_v1_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_9",
            "tgt_ix": "6-1863_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_9",
            "tgt_ix": "6-1863_v1_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_9",
            "tgt_ix": "6-1863_v1_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_10",
            "tgt_ix": "6-1863_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_10",
            "tgt_ix": "6-1863_v1_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_10",
            "tgt_ix": "6-1863_v1_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_11",
            "tgt_ix": "6-1863_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_11",
            "tgt_ix": "6-1863_v1_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_11",
            "tgt_ix": "6-1863_v1_11@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_11",
            "tgt_ix": "6-1863_v1_11@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_11",
            "tgt_ix": "6-1863_v1_11@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_12",
            "tgt_ix": "6-1863_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_12",
            "tgt_ix": "6-1863_v1_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_12",
            "tgt_ix": "6-1863_v1_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_13",
            "tgt_ix": "6-1863_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_15",
            "tgt_ix": "6-1863_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_17",
            "tgt_ix": "6-1863_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_18",
            "tgt_ix": "6-1863_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_19",
            "tgt_ix": "6-1863_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_20",
            "tgt_ix": "6-1863_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_21",
            "tgt_ix": "6-1863_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_21",
            "tgt_ix": "6-1863_v1_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_21",
            "tgt_ix": "6-1863_v1_21@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_21",
            "tgt_ix": "6-1863_v1_21@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_22",
            "tgt_ix": "6-1863_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_22",
            "tgt_ix": "6-1863_v1_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_22",
            "tgt_ix": "6-1863_v1_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_22",
            "tgt_ix": "6-1863_v1_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_23",
            "tgt_ix": "6-1863_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_24",
            "tgt_ix": "6-1863_v1_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_24",
            "tgt_ix": "6-1863_v1_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_24",
            "tgt_ix": "6-1863_v1_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_24",
            "tgt_ix": "6-1863_v1_24@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_25",
            "tgt_ix": "6-1863_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_26",
            "tgt_ix": "6-1863_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_26",
            "tgt_ix": "6-1863_v1_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_26",
            "tgt_ix": "6-1863_v1_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_26",
            "tgt_ix": "6-1863_v1_26@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_27",
            "tgt_ix": "6-1863_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_27",
            "tgt_ix": "6-1863_v1_27@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_27",
            "tgt_ix": "6-1863_v1_27@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_28",
            "tgt_ix": "6-1863_v1_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_28",
            "tgt_ix": "6-1863_v1_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_28",
            "tgt_ix": "6-1863_v1_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_28",
            "tgt_ix": "6-1863_v1_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_28",
            "tgt_ix": "6-1863_v1_28@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_29",
            "tgt_ix": "6-1863_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_29",
            "tgt_ix": "6-1863_v1_29@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_29",
            "tgt_ix": "6-1863_v1_29@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_29",
            "tgt_ix": "6-1863_v1_29@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_29",
            "tgt_ix": "6-1863_v1_29@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_30",
            "tgt_ix": "6-1863_v1_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_31",
            "tgt_ix": "6-1863_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_31",
            "tgt_ix": "6-1863_v1_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_31",
            "tgt_ix": "6-1863_v1_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_32",
            "tgt_ix": "6-1863_v1_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_32",
            "tgt_ix": "6-1863_v1_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_32",
            "tgt_ix": "6-1863_v1_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_33",
            "tgt_ix": "6-1863_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_34",
            "tgt_ix": "6-1863_v1_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_34",
            "tgt_ix": "6-1863_v1_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_35",
            "tgt_ix": "6-1863_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_37",
            "tgt_ix": "6-1863_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_39",
            "tgt_ix": "6-1863_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_41",
            "tgt_ix": "6-1863_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_41",
            "tgt_ix": "6-1863_v1_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_41",
            "tgt_ix": "6-1863_v1_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_41",
            "tgt_ix": "6-1863_v1_41@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_41",
            "tgt_ix": "6-1863_v1_41@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_41",
            "tgt_ix": "6-1863_v1_41@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_42",
            "tgt_ix": "6-1863_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_44",
            "tgt_ix": "6-1863_v1_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_45",
            "tgt_ix": "6-1863_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_45",
            "tgt_ix": "6-1863_v1_45@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_45",
            "tgt_ix": "6-1863_v1_45@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_46",
            "tgt_ix": "6-1863_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_46",
            "tgt_ix": "6-1863_v1_46@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_46",
            "tgt_ix": "6-1863_v1_46@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_47",
            "tgt_ix": "6-1863_v1_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_47",
            "tgt_ix": "6-1863_v1_47@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_47",
            "tgt_ix": "6-1863_v1_47@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_47",
            "tgt_ix": "6-1863_v1_47@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_48",
            "tgt_ix": "6-1863_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_49",
            "tgt_ix": "6-1863_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_49",
            "tgt_ix": "6-1863_v1_49@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_50",
            "tgt_ix": "6-1863_v1_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_50",
            "tgt_ix": "6-1863_v1_50@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_50",
            "tgt_ix": "6-1863_v1_50@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_51",
            "tgt_ix": "6-1863_v1_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_53",
            "tgt_ix": "6-1863_v1_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_53",
            "tgt_ix": "6-1863_v1_53@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_53",
            "tgt_ix": "6-1863_v1_53@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_53",
            "tgt_ix": "6-1863_v1_53@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_54",
            "tgt_ix": "6-1863_v1_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_55",
            "tgt_ix": "6-1863_v1_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_55",
            "tgt_ix": "6-1863_v1_55@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_55",
            "tgt_ix": "6-1863_v1_55@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_55",
            "tgt_ix": "6-1863_v1_55@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_56",
            "tgt_ix": "6-1863_v1_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_56",
            "tgt_ix": "6-1863_v1_56@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_56",
            "tgt_ix": "6-1863_v1_56@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_56",
            "tgt_ix": "6-1863_v1_56@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_56",
            "tgt_ix": "6-1863_v1_56@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_57",
            "tgt_ix": "6-1863_v1_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_57",
            "tgt_ix": "6-1863_v1_57@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_57",
            "tgt_ix": "6-1863_v1_57@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_57",
            "tgt_ix": "6-1863_v1_57@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_58",
            "tgt_ix": "6-1863_v1_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_58",
            "tgt_ix": "6-1863_v1_58@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_58",
            "tgt_ix": "6-1863_v1_58@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_59",
            "tgt_ix": "6-1863_v1_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_60",
            "tgt_ix": "6-1863_v1_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_60",
            "tgt_ix": "6-1863_v1_60@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_60",
            "tgt_ix": "6-1863_v1_60@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_61",
            "tgt_ix": "6-1863_v1_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_61",
            "tgt_ix": "6-1863_v1_61@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_61",
            "tgt_ix": "6-1863_v1_61@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_62",
            "tgt_ix": "6-1863_v1_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_63",
            "tgt_ix": "6-1863_v1_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_64",
            "tgt_ix": "6-1863_v1_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_65",
            "tgt_ix": "6-1863_v1_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_66",
            "tgt_ix": "6-1863_v1_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_67",
            "tgt_ix": "6-1863_v1_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_67",
            "tgt_ix": "6-1863_v1_67@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_68",
            "tgt_ix": "6-1863_v1_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_68",
            "tgt_ix": "6-1863_v1_68@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_69",
            "tgt_ix": "6-1863_v1_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_69",
            "tgt_ix": "6-1863_v1_69@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_69",
            "tgt_ix": "6-1863_v1_69@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_70",
            "tgt_ix": "6-1863_v1_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_70",
            "tgt_ix": "6-1863_v1_70@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_70",
            "tgt_ix": "6-1863_v1_70@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_71",
            "tgt_ix": "6-1863_v1_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_71",
            "tgt_ix": "6-1863_v1_71@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_71",
            "tgt_ix": "6-1863_v1_71@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_71",
            "tgt_ix": "6-1863_v1_71@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_71",
            "tgt_ix": "6-1863_v1_71@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_71",
            "tgt_ix": "6-1863_v1_71@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_72",
            "tgt_ix": "6-1863_v1_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_72",
            "tgt_ix": "6-1863_v1_72@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_72",
            "tgt_ix": "6-1863_v1_72@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_72",
            "tgt_ix": "6-1863_v1_72@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_72",
            "tgt_ix": "6-1863_v1_72@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_72",
            "tgt_ix": "6-1863_v1_72@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_73",
            "tgt_ix": "6-1863_v1_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_73",
            "tgt_ix": "6-1863_v1_73@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_73",
            "tgt_ix": "6-1863_v1_73@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_73",
            "tgt_ix": "6-1863_v1_73@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_73",
            "tgt_ix": "6-1863_v1_73@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_74",
            "tgt_ix": "6-1863_v1_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_74",
            "tgt_ix": "6-1863_v1_74@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_74",
            "tgt_ix": "6-1863_v1_74@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_75",
            "tgt_ix": "6-1863_v1_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_75",
            "tgt_ix": "6-1863_v1_75@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_75",
            "tgt_ix": "6-1863_v1_75@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_75",
            "tgt_ix": "6-1863_v1_75@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_76",
            "tgt_ix": "6-1863_v1_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_76",
            "tgt_ix": "6-1863_v1_76@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_77",
            "tgt_ix": "6-1863_v1_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_78",
            "tgt_ix": "6-1863_v1_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_78",
            "tgt_ix": "6-1863_v1_78@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_78",
            "tgt_ix": "6-1863_v1_78@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_78",
            "tgt_ix": "6-1863_v1_78@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_79",
            "tgt_ix": "6-1863_v1_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_80",
            "tgt_ix": "6-1863_v1_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_81",
            "tgt_ix": "6-1863_v1_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_82",
            "tgt_ix": "6-1863_v1_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_83",
            "tgt_ix": "6-1863_v1_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_84",
            "tgt_ix": "6-1863_v1_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_85",
            "tgt_ix": "6-1863_v1_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_86",
            "tgt_ix": "6-1863_v1_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_87",
            "tgt_ix": "6-1863_v1_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_88",
            "tgt_ix": "6-1863_v1_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_89",
            "tgt_ix": "6-1863_v1_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_90",
            "tgt_ix": "6-1863_v1_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_91",
            "tgt_ix": "6-1863_v1_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_92",
            "tgt_ix": "6-1863_v1_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_93",
            "tgt_ix": "6-1863_v1_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_94",
            "tgt_ix": "6-1863_v1_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_95",
            "tgt_ix": "6-1863_v1_95@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_96",
            "tgt_ix": "6-1863_v1_96@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_97",
            "tgt_ix": "6-1863_v1_97@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_98",
            "tgt_ix": "6-1863_v1_98@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_99",
            "tgt_ix": "6-1863_v1_99@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_100",
            "tgt_ix": "6-1863_v1_100@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_101",
            "tgt_ix": "6-1863_v1_101@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_102",
            "tgt_ix": "6-1863_v1_102@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_103",
            "tgt_ix": "6-1863_v1_103@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_104",
            "tgt_ix": "6-1863_v1_104@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_105",
            "tgt_ix": "6-1863_v1_105@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_106",
            "tgt_ix": "6-1863_v1_106@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_107",
            "tgt_ix": "6-1863_v1_107@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_108",
            "tgt_ix": "6-1863_v1_108@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_109",
            "tgt_ix": "6-1863_v1_109@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_110",
            "tgt_ix": "6-1863_v1_110@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_111",
            "tgt_ix": "6-1863_v1_111@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_112",
            "tgt_ix": "6-1863_v1_112@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-1863_v1_113",
            "tgt_ix": "6-1863_v1_113@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "6-1863_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.12817.1",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Evaluation of predicted Medfly (\n                     Ceratitis capitata ) quarantine length in the United States utilizing degree-day and agent-based models",
        "abstract": "Invasions by pest insects pose a significant threat to agriculture worldwide. In the case of Ceratitis capitata incursions on the US mainland, where it is not officially established, repeated detections are followed by quarantines and treatments to eliminate the invading population. However, it is difficult to accurately set quarantine duration because non-detection may not mean the pest is eliminated. Most programs extend quarantine lengths past the last fly detection by calculating the amount of time required for 3 generations to elapse under a thermal unit accumulation development model (“degree day”). A newer approach is to use an Agent-Based Simulation (ABS) to explicitly simulate population demographics and elimination. Here, predicted quarantine lengths for 11 sites in the continental United States are evaluated using both approaches. Results indicate a strong seasonality in quarantine length, with longer predictions in the second half of the year compared with the first; this pattern is more extreme in degree day predictions compared with ABS. Geographically, quarantine lengths increased with latitude, though this was less pronounced under the ABS. Variation in quarantine lengths for particular times and places was dramatically larger for degree day than ABS, generally spiking in the middle of the year for degree day and peaking in second half of the year for ABS. Analysis of 34 C. capitata quarantines from 1975 to 2017 in California shows that, for all but two, quarantines were started in the second half of the year, when degree day quarantine lengths are longest and have the highest uncertainty. For a set of hypothetical outbreaks based on these historical quarantines, the ABS produced significantly shorter quarantines than degree day calculations. Overall, ABS quarantine lengths were more consistent than degree day predictions, avoided unrealistically long values, and captured effects of rare events such as cold snaps.",
        "contributors": [
            {
                "surname": "Collier",
                "given-names": "Travis"
            },
            {
                "surname": "Manoukis",
                "given-names": "Nicholas"
            }
        ],
        "url": "https://f1000research.com/articles/6-1863/v1/",
        "doc_id": "6-1863",
        "version": 1,
        "ix_counter": 459,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}