{
    "nodes": [
        {
            "ix": "4-1521_v1_0",
            "content": "Differential analyses for RNA-seq: transcript-level estimates improve gene-level inferences",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_2",
            "content": "High-throughput sequencing of cDNA (RNA-seq) is used extensively to characterize the transcriptome of cells. Many transcriptomic studies aim at comparing either abundance levels or the transcriptome composition between given conditions, and as a first step, the sequencing reads must be used as the basis for abundance quantification of transcriptomic features of interest, such as genes or transcripts. Several different quantification approaches have been proposed, ranging from simple counting of reads that overlap given genomic regions to more complex estimation of underlying transcript abundances. In this paper, we show that gene-level abundance estimates and statistical inference offer advantages over transcript-level analyses, in terms of performance and interpretability. We also illustrate that while the presence of differential isoform usage can lead to inflated false discovery rates in differential expression analyses on simple count matrices and transcript-level abundance estimates improve the performance in simulated data, the difference is relatively minor in several real data sets. Finally, we provide an R package ( tximport ) to help users integrate transcript-level abundance estimates from common quantification pipelines into count-based statistical inference engines.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_4",
            "content": "Quantification and comparison of isoform- or gene-level expression based on high throughput sequencing reads from cDNA (RNA-seq) is arguably among the most common tasks in modern computational molecular biology. Currently, one of the most common approaches is to define a set of non-overlapping targets (typically, genes) and use the number of reads overlapping a target as a measure of its abundance, or expression level. Several software packages have been developed for performing such “simple” counting (e.g., featureCounts <REF-1> and HTSeq-count <REF-2> ). More recently, the field has seen a surge in methods aimed at quantifying the abundances of individual transcripts (e.g., Cufflinks <REF-3> , RSEM <REF-4> , BitSeq <REF-5> , kallisto <REF-6> and Salmon <REF-7> ). These methods provide higher resolution than simple counting, and by circumventing the computationally costly read alignment step, some are considerably faster. However, isoform quantification is more complex than the simple counting, due to the high degree of overlap among transcripts. Currently, there is no consensus regarding the optimal resolution or method for quantification and downstream analysis of transcriptomic output.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_5",
            "content": "Another point of debate is the unit in which abundance is given. The traditional R/FPKM <REF-8> , <REF-9> (reads/fragments per kilobase per million reads) has been largely superseded by the TPM <REF-10> (transcripts per million), since the latter is more consistent across libraries. Regardless, both of these units attempt to “correct for” sequencing depth and feature length and thus do not reflect the influence of these on quantification uncertainty. In order to account for these aspects, most statistical tools for analysis of RNA-seq data operate instead on the count scale. While these tools were designed to be applied to simple read counts, the degree to which their performance is affected by using fractional estimated counts resulting from portioning reads aligning to multiple transcripts is still an open question. The fact that the most common sequencing protocols provide reads that are much shorter than the average transcript length implies that the observed read counts depend on the transcript’s length as well as abundance; thus, simple counts are arguably less accurate measures than TPMs of the true abundance of RNA molecules from given genes. The use of gene counts as input to statistical tools typically assumes that the length of the expressed part of a gene does not change across samples and thus length can therefore be ignored for differential analysis.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_6",
            "content": "In the analysis of transcriptomic data, as for any other application, it is of utmost importance that the question of interest is precisely defined before a computational approach is selected. Often, the interest lies in comparing the transcriptional output between different conditions, and most RNA-seq studies can be classified as either: 1) differential gene expression (DGE) studies, where the overall transcriptional output of each gene is compared between conditions; 2) differential transcript/exon usage (DTU/DEU) studies, where the composition of a gene’s isoform abundance spectrum is compared between conditions, or 3) differential transcript expression (DTE) studies, where the interest lies in whether individual transcripts show differential expression between conditions. DTE analysis results can be represented on the individual transcript level, or aggregated to the gene level, e.g., by evaluating whether at least one of the isoforms shows evidence of differential abundance.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_7",
            "content": "In this report, we make and give evidence for three claims: 1) gene-level estimation is considerably more stable than transcript-level; 2) regardless of the level at which abundance estimation is done, inferences at the gene level are appealing in terms of robustness, statistical performance and interpretation; 3) the magnitude of the difference between results obtained by simple counting and transcript-level abundance estimation is generally small in real data sets. However, despite strong overall correlations among results obtained from various quantification pipelines, taking advantage of transcript-level abundance estimates when defining or analyzing gene-level abundances leads to improved differential gene expression results compared to simple counting.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_8",
            "content": "To facilitate a broad range of analysis choices, depending on the biological question of interest, we provide an R package, tximport , to import transcript lengths and abundance estimates from several popular quantification packages and export (estimated) count matrices and, optionally, average transcript length correction terms (i.e., offsets) that can be used as inputs to common statistical engines, such as DESeq2 <REF-11> , edgeR <REF-12> and limma <REF-13> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_9",
            "content": "Data",
            "ntype": "title",
            "meta": {
                "section": "2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_10",
            "content": "Throughout this manuscript, we utilize two simulated data sets and four experimental data sets (Bottomly <REF-14> [ Data set 3 ], GSE64570 <REF-15> [ Data set 4 ], GSE69244 <REF-16> [ Data set 5 ], GSE72165 <REF-17> [ Data set 6 ], see Supplementary File 1 for further details) for illustration. Details on the data generation and full records of the analyses are provided in the data sets and Supplementary File 1 . The first simulated data set (sim1; Data set 1 ) is the synthetic human data set from Soneson et al . <REF-18> , comprising 20,410 genes and 145,342 transcripts and is available from ArrayExpress (accession E-MTAB-3766). This data set has three biological replicates from each of two simulated conditions, and differential isoform usage was introduced for 1,000 genes by swapping the relative expression levels of the two most dominant isoforms. For each gene in this data set, the total transcriptional output is the same in the two conditions (i.e., no overall DGE); it is worth noting that this is an extreme situation, but provides a useful test set for contrasting DGE, DTU and DTE. The second simulated data set (sim2; Data set 2 ) is a synthetic data set comprising the 3,858 genes and 15,677 transcripts from the human chromosome 1. It is available from ArrayExpress with accession E-MTAB-4119. Also here, we simulated two conditions with three biological replicates each. For this data set, we simulated both overall DGE, where all transcripts of the affected gene showed the same fold change between the conditions (420 genes), differential transcript usage (DTU), where the total transcriptional output was kept constant but the relative contribution from the transcripts changed (420 genes) and differential transcript expression (DTE), where the expression of 10% of the transcripts of each affected gene was modified (422 genes, 528 transcripts). The three sets of modified genes were disjoint. Again, this synthetic data set represents an extreme situation compared to most real data sets, but provides a useful test case to identify underlying causes of differences between results from various analysis pipelines.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_11",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS0\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/7563/84c34455-622d-47e4-a204-2feeba067e8a_Sim_1_Quantification.html\"> <label>(html)</label> <caption> <p>Contains all the R code that was used to perform the analyses and generate the figures for the <bold>sim1</bold> data set <sup> <xref ref-type=\"bibr\" rid=\"ref-28\">28</xref> </sup>.</p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_12",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS1\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/7563/315e2602-541f-4781-ab6e-76635dab0360_Sim_2_Quantification.html\"> <label>(html)</label> <caption> <p>Contains all the R code that was used to perform the analyses and generate the figures for the <bold>sim2</bold> data set <sup> <xref ref-type=\"bibr\" rid=\"ref-29\">29</xref> </sup>.</p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_13",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS2\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/7563/6d1cc7c9-6815-4ed6-bb9b-92ccbe24d351_Bottomly_Quantification.html\"> <label>(html)</label> <caption> <p>Contains all the R code that was used to perform the analyses and generate the figures for the Bottomly data set <sup> <xref ref-type=\"bibr\" rid=\"ref-30\">30</xref> </sup>.</p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_14",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS3\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/7563/8d4f02db-99c5-4885-ac20-e800d3495388_GSE64570_quantification.html\"> <label>(html)</label> <caption> <p>Contains all the R code that was used to perform the analyses and generate the figures for the <bold>GSE64570</bold> data set <sup> <xref ref-type=\"bibr\" rid=\"ref-31\">31</xref> </sup>.</p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_15",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS4\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/7563/411fc178-52eb-42d3-b9ed-1fc6cf366e61_GSE69244_quantification.html\"> <label>(html)</label> <caption> <p>Contains all the R code that was used to perform the analyses and generate the figures for the <bold>GSE69244</bold> data set <sup> <xref ref-type=\"bibr\" rid=\"ref-32\">32</xref> </sup>.</p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_16",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS5\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/7563/3ca97d58-f9bb-48e4-9e76-85d92f21f40a_GSE72165_quantification.html\"> <label>(html)</label> <caption> <p>Contain all the R code that was used to perform the analyses and generate the figures for the <bold>GSE72165</bold> data set <sup> <xref ref-type=\"bibr\" rid=\"ref-33\">33</xref> </sup>.</p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_17",
            "content": "Gene abundance estimates are more accurate than transcript abundance estimates",
            "ntype": "title",
            "meta": {
                "section": "3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_18",
            "content": "To evaluate the accuracy of abundance estimation with transcript and gene resolution, we used Salmon <REF-7> (v0.5.1) to estimate TPM values for each transcript in each of the data sets. Gene-level TPM estimates, representing the overall transcriptional output of each gene, were obtained by summing the corresponding transcript-level TPM estimates. For the two simulated data sets, the true underlying TPM of each feature is known and we can thus evaluate the accuracy of the estimates. Unsurprisingly, gene-level estimates were more accurate than transcript-level estimates ( Figure 1A , Supplementary Figures 1,2 ). We also derived TPM estimates from gene-level counts obtained from featureCounts by dividing each of these with a reasonable measure of the length of the gene (the length of the union of its exons) and the total number of mapped reads, and scaling the estimates to sum to 1 million. The simple count estimates showed a lower correlation with the true TPMs than the Salmon estimates, in line with previous observations <REF-19> . However, simple counts tended to show a high degree of robustness against incompleteness of the annotation catalog, as evidenced from estimation errors after first removing (at random) 20% of the transcripts ( Figure 1A ); in contrast, Salmon transcript estimate accuracies deteriorated. From the bootstrap estimates generated by Salmon , we also estimated the coefficient of variation of the abundance estimates. The gene-level estimates showed considerably lower variability in both simulated and experimental data ( Figure 1B , Supplementary Figures 3,4 ). Taken together, these observations suggest that the gene-level estimates are more accurate than transcript-level estimates and therefore potentially allow a more accurate and stable statistical analysis. A further argument in favor of gene-level analysis is the unidentifiability of transcript expression that can result from uneven coverage caused by underlying technical biases ( Figure 1C ). Intermediate approaches, grouping together “indistinguishable” features are also conceiveable <REF-20> , but not yet standard practice.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_19",
            "content": "Figure 1 (sim2).",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "A : Accuracy of gene- and transcript-level TPM estimates from Salmon and scaled FPKM estimates derived from simple counts from featureCounts , in one of the simulated samples (sampleA1). Spearman correlations are indicated in the respective panels. Top row: using the complete annotation. Bottom row: using an incomplete annotation, with 20% of the transcripts randomly removed. Gene-level estimates are more accurate than transcript-level estimates. Gene-level estimates from Salmon are more accurate than those from featureCounts . B : Distribution of the coefficients of variation of gene- and transcript-level TPM estimates from Salmon , calculated across 30 bootstrap samples of one of the simulated samples (sampleA1). Gene-level TPM estimates are less variable than transcript-level estimates. C : An example of unidentifiable transcript-level estimates, as uneven coverage does not cover the critical regions that would determine the amount that each transcript is expressed, while gene-level estimation is still possible.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_20",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <p> <bold>A</bold>: Accuracy of gene- and transcript-level TPM estimates from <italic>Salmon</italic> and scaled FPKM estimates derived from simple counts from <italic>featureCounts</italic>, in one of the simulated samples (sampleA1). Spearman correlations are indicated in the respective panels. Top row: using the complete annotation. Bottom row: using an incomplete annotation, with 20% of the transcripts randomly removed. Gene-level estimates are more accurate than transcript-level estimates. Gene-level estimates from <italic>Salmon</italic> are more accurate than those from <italic>featureCounts</italic>. <bold>B</bold>: Distribution of the coefficients of variation of gene- and transcript-level TPM estimates from <italic>Salmon</italic>, calculated across 30 bootstrap samples of one of the simulated samples (sampleA1). Gene-level TPM estimates are less variable than transcript-level estimates. <bold>C</bold>: An example of unidentifiable transcript-level estimates, as uneven coverage does not cover the critical regions that would determine the amount that each transcript is expressed, while gene-level estimation is still possible.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "A : Accuracy of gene- and transcript-level TPM estimates from Salmon and scaled FPKM estimates derived from simple counts from featureCounts , in one of the simulated samples (sampleA1). Spearman correlations are indicated in the respective panels. Top row: using the complete annotation. Bottom row: using an incomplete annotation, with 20% of the transcripts randomly removed. Gene-level estimates are more accurate than transcript-level estimates. Gene-level estimates from Salmon are more accurate than those from featureCounts . B : Distribution of the coefficients of variation of gene- and transcript-level TPM estimates from Salmon , calculated across 30 bootstrap samples of one of the simulated samples (sampleA1). Gene-level TPM estimates are less variable than transcript-level estimates. C : An example of unidentifiable transcript-level estimates, as uneven coverage does not cover the critical regions that would determine the amount that each transcript is expressed, while gene-level estimation is still possible.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_21",
            "content": "DTE is more powerful and easier to interpret on gene level than for individual transcripts",
            "ntype": "title",
            "meta": {
                "section": "4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_22",
            "content": "DTE is concerned with inference of changes in abundance at transcript resolution, and thus invokes a statistical test for each transcript. We argue that this can lead to several complications: the first is conceptual, since the rows (transcripts) in the result table will in many cases not be interpreted independently, but will rather be grouping transcripts from the same gene, and the second one is more technical, since the number of transcripts is considerably larger than the number of genes, which could lead to lower power due to the portioning of the total set of reads across a larger number of features and a potentially higher multiple testing penalty. We tested for DTE on the simulated data by applying edgeR <REF-12> to the transcript counts obtained from Salmon (the application of count models to estimated counts is discussed in the next Section), and represented the results as transcript-level p-values or aggregated these to the gene level by using the perGeneQValue function from the DEXSeq <REF-21> R package. The transcript-level DTE test assesses the null hypothesis that the individual transcript does not change its expression, whereas the gene-level DTE test assesses the null hypothesis that all transcripts exhibit no change in expression. Framing the DTE question at the gene level results in higher power, without sacrificing false discovery rate control ( Figure 2A ). We note that this type of gene-level aggregation may favor genes in which one transcript shows strong changes, and that other approaches to increase power against specific alternatives are conceivable, e.g., capitalizing on the rich collection of methods for gene set analysis.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_23",
            "content": "Figure 2 (sim2).",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "A : DTE detection performance on transcript- and gene-level, using edgeR applied to transcript-level estimated counts from Salmon . The statistical analysis was performed on transcript level and aggregated for each gene using the perGeneQValue function from the DEXSeq R package; aggregated results show higher detection power. The curves trace out the observed FDR and TPR for each significance cutoff value. The three circles mark the performance at adjusted p-value cutoffs of 0.01, 0.05 and 0.1. B : Schematic illustration of different ways in which differential transcript expression (DTE) can arise, in terms of absence or presence of differential gene expression (DGE) and differential transcript usage (DTU).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_24",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <p> <bold>A</bold>: DTE detection performance on transcript- and gene-level, using <italic>edgeR</italic> applied to transcript-level estimated counts from <italic>Salmon</italic>. The statistical analysis was performed on transcript level and aggregated for each gene using the <italic>perGeneQValue</italic> function from the <italic>DEXSeq</italic> R package; aggregated results show higher detection power. The curves trace out the observed FDR and TPR for each significance cutoff value. The three circles mark the performance at adjusted p-value cutoffs of 0.01, 0.05 and 0.1. <bold>B</bold>: Schematic illustration of different ways in which differential transcript expression (DTE) can arise, in terms of absence or presence of differential gene expression (DGE) and differential transcript usage (DTU).</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "A : DTE detection performance on transcript- and gene-level, using edgeR applied to transcript-level estimated counts from Salmon . The statistical analysis was performed on transcript level and aggregated for each gene using the perGeneQValue function from the DEXSeq R package; aggregated results show higher detection power. The curves trace out the observed FDR and TPR for each significance cutoff value. The three circles mark the performance at adjusted p-value cutoffs of 0.01, 0.05 and 0.1. B : Schematic illustration of different ways in which differential transcript expression (DTE) can arise, in terms of absence or presence of differential gene expression (DGE) and differential transcript usage (DTU).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_25",
            "content": "While DTE analysis is more suitable than DGE analysis for detecting genes with changes in absolute or relative isoform expression but no or only minor change in overall output ( Supplementary Figure 5 ), we argue that even gene-level DTE results may suffer from lack of interpretability. DTE can arise in several different ways, from an overall differential expression of the gene or from differential relative usage of its transcripts, or a combination of the two ( Figure 2B ). We argue that the biological question of interest is in many cases more readily interpretable as a combination of DGE and DTU, rather than DTE. It has been our experience that results reported at the transcript level are still often cast to the gene level (i.e., given a differentially expressed transcript, researchers want to know whether other isoforms of the gene are changing), suggesting that asking two specific gene-level questions (Is the overall abundance changing? Are the isoform abundances changing proportionally?) trumps the interpretability of one broad question at the transcript-level inference (Are there changes in any of the transcript expression levels?). Despite this, there are of course also situations when a transcript-centric approach is superior, for example in targeted experiments where specific isoforms are expected to change due to an administered treatment.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_26",
            "content": "Incorporating transcript-level estimates leads to more accurate DGE results",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_27",
            "content": "DGE (i.e., testing for changes in the overall transcriptional output of a gene) is typically performed by applying a count-based inference method from statistical packages such as edgeR <REF-12> or DESeq2 <REF-11> to gene counts obtained by read counting software such as featureCounts <REF-1> , HTSeq-count <REF-2> or functions from the GenomicAlignments <REF-22> R package. A lot has been written about how simple counting approaches are prone to give erroneous results for genes with changes in relative isoform usage, due to the direct dependence of the observed read count on the transcript length <REF-23> . However, the extent of the problem in real data has not been thoroughly investigated. Here, we show that taking advantage of transcript-resolution estimates (e.g., obtained by Salmon ) can lead to improved DGE results. We propose two alternative ways of integrating transcript abundance estimates into the DGE pipeline: to define an “artificial” count matrix, or to calculate offsets that can be used in the statistical modeling of the observed gene counts from, e.g., featureCounts . Both approaches are implemented in the accompanying tximport R package (available from https://github.com/mikelove/tximport ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_28",
            "content": "We defined three different count matrices for each data set: 1) using featureCounts from the Rsubread <REF-1> R package (denoted featureCounts below), 2) summing the estimated transcript counts from Salmon within genes ( simplesum ), 3) summing the estimated transcript TPMs from Salmon within genes, and multiplying with the total library size in millions ( scaledTPM ). We note that the scaledTPM values are artificial values, transforming underlying abundance measures to the “count scale” to incorporate the information provided by the sequencing depth. We further used the Salmon transcript lengths and estimated TPMs to define average transcript lengths for each gene and each sample (normalization factors) as described in the Supplementary material , to be used as offsets for edgeR and DESeq2 when analyzing the featureCounts and simplesum count matrices ( featureCounts_avetxl and simplesum_avetxl ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_29",
            "content": "Overall, the counts obtained by all methods were highly correlated ( Supplementary Figures 6–8 ), which is not surprising since any differences are likely to affect a relatively small subset of the genes. In general, the simplesum and featureCounts matrices led to similar conclusions in all considered data sets. However, there are differences between the two approaches in terms of how multi-mapping reads and reads partly overlapping intronic regions are handled <REF-24> . The concordance between simplesum and featureCounts results also suggests that statistical methods based on the Negative Binomial assumption are applicable also to summarized, gene-level estimated counts, which is further supported by the similarity between the p-value histograms as well as the mean-variance relationships observed with the three types of count matrices ( Supplementary Figures 9–14 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_30",
            "content": "Accounting for the potentially varying average transcript length across samples when performing DGE, either in the definition of the count matrix (scaledTPM) or by defining offsets, led to considerably improved false discovery rate (FDR) control compared to using the observed featureCounts or aggregated Salmon counts (simplesum) directly ( Figure 3A , Table 1 ). It is important to note that this improvement is entirely attributable to an improved handling of genes with changes in isoform composition between the conditions ( Figure 3B , Supplementary Figure 15 ), that we purposely introduced strong signals in the simulated data set in order to pinpoint these underlying causes, and that the overall effect in a real data set will depend on the extent to which considerable DTU is present. Experiments on various real data sets ( Supplementary Figure 16 ) show only small differences in the collections of significant genes found with the simplesum and simplesum_avetxl approaches, suggesting that the extent of the problem in many real data sets is limited, and that most findings obtained with simple counting are not induced by counting artifacts. Further support for this conclusion is shown in Figure 4 (see also Supplementary Figures 17–19 and Supplementary Table 1 ), where log-fold change estimates from edgeR , based on the simplesum and scaledTPM matrices, are contrasted. For the genes with induced DTU in the sim2 data set, log-fold changes based on the simplesum matrix are overestimated, as expected. However, this effect is almost absent in all the real data sets, again highlighting the extreme nature of our simulated data and suggesting that the effect of using different count matrices is considerably smaller for many real data sets. Table 1 suggests that the lack of error control for simplesum and featureCounts matrices is more pronounced when there is a large difference in length between the differentially used isoforms. In the group with smallest length difference, where the longer differentially used isoform is less than 34% longer than the shorter one, all approaches controlled the type I error satisfactorily. It is worth noting that among all human transcript pairs in which both transcripts belong to the same gene, the median length ratio is 1.85, and for one third of such pairs the longer isoform is less than 38% longer than the shorter one (see Data set 1 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_31",
            "content": "Figure 3 (sim2).",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "A : DGE detection performance of edgeR applied to three different count matrices (simplesum, scaledTPM, featureCounts), with or without including an offset representing the average transcript length (for simplesum and featureCounts). Including the offset or using the scaledTPM count matrix leads to improved FDR control compared to using simplesum or featureCounts matrices without offset. The curves trace out the observed FDR and TPR for each significance cutoff value. The three circles mark the performance at adjusted p-value cutoffs of 0.01, 0.05 and 0.1. B : stratification of the results in A by the presence of differential isoform usage. The improvement in FDR control seen in A results from an improved treatment of genes with differential isoform usage, while all methods perform similarly for genes without differential isoform usage.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_32",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <p> <bold>A</bold>: DGE detection performance of <italic>edgeR</italic> applied to three different count matrices (simplesum, scaledTPM, featureCounts), with or without including an offset representing the average transcript length (for simplesum and featureCounts). Including the offset or using the scaledTPM count matrix leads to improved FDR control compared to using simplesum or featureCounts matrices without offset. The curves trace out the observed FDR and TPR for each significance cutoff value. The three circles mark the performance at adjusted p-value cutoffs of 0.01, 0.05 and 0.1. <bold>B</bold>: stratification of the results in <bold>A</bold> by the presence of differential isoform usage. The improvement in FDR control seen in <bold>A</bold> results from an improved treatment of genes with differential isoform usage, while all methods perform similarly for genes without differential isoform usage.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "A : DGE detection performance of edgeR applied to three different count matrices (simplesum, scaledTPM, featureCounts), with or without including an offset representing the average transcript length (for simplesum and featureCounts). Including the offset or using the scaledTPM count matrix leads to improved FDR control compared to using simplesum or featureCounts matrices without offset. The curves trace out the observed FDR and TPR for each significance cutoff value. The three circles mark the performance at adjusted p-value cutoffs of 0.01, 0.05 and 0.1. B : stratification of the results in A by the presence of differential isoform usage. The improvement in FDR control seen in A results from an improved treatment of genes with differential isoform usage, while all methods perform similarly for genes without differential isoform usage.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_33",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Comparison of log-fold change estimates from edgeR , based on simplesum and scaledTPM count matrices, in four different data sets. For the simulated data set ( sim2 ), where signals have been exaggerated to pinpoint underlying causes of various observations, genes with induced DTU (whose true overall log-fold change is 0) show a clear overestimation of log-fold changes when using simplesum counts. However, none of the real data sets contain a similar population of genes, suggesting that for many real data sets, simple gene counting leads to overall similar conclusions as accounting for underlying changes in transcript usage.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_34",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <title>Comparison of log-fold change estimates from <italic>edgeR</italic>, based on <bold>simplesum</bold> and <bold>scaledTPM</bold> count matrices, in four different data sets.</title> <p>For the simulated data set ( <bold>sim2</bold>), where signals have been exaggerated to pinpoint underlying causes of various observations, genes with induced DTU (whose true overall log-fold change is 0) show a clear overestimation of log-fold changes when using <bold>simplesum</bold> counts. However, none of the real data sets contain a similar population of genes, suggesting that for many real data sets, simple gene counting leads to overall similar conclusions as accounting for underlying changes in transcript usage.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Comparison of log-fold change estimates from edgeR , based on simplesum and scaledTPM count matrices, in four different data sets. For the simulated data set ( sim2 ), where signals have been exaggerated to pinpoint underlying causes of various observations, genes with induced DTU (whose true overall log-fold change is 0) show a clear overestimation of log-fold changes when using simplesum counts. However, none of the real data sets contain a similar population of genes, suggesting that for many real data sets, simple gene counting leads to overall similar conclusions as accounting for underlying changes in transcript usage.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/8143/fa54b4f8-fda8-465b-8db5-b544644b10ee_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_35",
            "content": "Table 1 (sim1).",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Observed false positive rates from a differential gene expression analysis using edgeR applied to various count matrices (with a nominal p-value cutoff at 0.05), limited to genes with true underlying differential isoform usage (recall that no genes are truly differentially expressed in this data set). The results are stratified by “effect size” (the difference in relative abundance between the two differentially used isoforms) and the length ratio between the longer and the shorter of the differentially used isoforms. FPRs below the nominal p-value threshold (0.05) are marked in bold. For more details, see Data set 1 .",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_36",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Observed false positive rates from a differential gene expression analysis using <italic>edgeR</italic> applied to various count matrices (with a nominal p-value cutoff at 0.05), limited to genes with true underlying differential isoform usage (recall that no genes are truly differentially expressed in this data set).</title> <p>The results are stratified by &#8220;effect size&#8221; (the difference in relative abundance between the two differentially used isoforms) and the length ratio between the longer and the shorter of the differentially used isoforms. FPRs below the nominal p-value threshold (0.05) are marked in bold. For more details, see <xref ref-type=\"other\" rid=\"DS1\">Data set 1</xref>.</p> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <td/> <th align=\"center\">simplesum</th> <th align=\"center\">featureCounts</th> <th align=\"center\">simplesum_avetxl</th> <th align=\"center\">featureCounts_avetxl</th> <th align=\"center\">scaledTPM</th> </tr> </thead> <tbody> <tr> <td>[0,0.33], [1,1.34]</td> <td align=\"center\"> <bold>0.019</bold> </td> <td align=\"center\"> <bold>0.019</bold> </td> <td align=\"center\"> <bold>0.023</bold> </td> <td align=\"center\"> <bold>0.023</bold> </td> <td align=\"center\"> <bold>0.023</bold> </td> </tr> <tr> <td>[0.33,0.67], [1,1.34]</td> <td align=\"center\">0.059</td> <td align=\"center\">0.059</td> <td align=\"center\">0.059</td> <td align=\"center\">0.059</td> <td align=\"center\">0.059</td> </tr> <tr> <td>[0.67,1], [1,1.34]</td> <td align=\"center\"> <bold>0.000</bold> </td> <td align=\"center\">0.053</td> <td align=\"center\">0.053</td> <td align=\"center\">0.053</td> <td align=\"center\">0.053</td> </tr> <tr> <td>[0,0.33], [1.34,2.57]</td> <td align=\"center\">0.075</td> <td align=\"center\">0.070</td> <td align=\"center\">0.070</td> <td align=\"center\">0.065</td> <td align=\"center\">0.065</td> </tr> <tr> <td>[0.33,0.67], [1.34,2.57]</td> <td align=\"center\">0.240</td> <td align=\"center\">0.220</td> <td align=\"center\"> <bold>0.050</bold> </td> <td align=\"center\"> <bold>0.033</bold> </td> <td align=\"center\">0.066</td> </tr> <tr> <td>[0.67,1], [1.34,2.57]</td> <td align=\"center\">0.420</td> <td align=\"center\">0.540</td> <td align=\"center\"> <bold>0.038</bold> </td> <td align=\"center\">0.077</td> <td align=\"center\"> <bold>0.038</bold> </td> </tr> <tr> <td>[0,0.33], [2.57,35.4]</td> <td align=\"center\">0.150</td> <td align=\"center\">0.140</td> <td align=\"center\"> <bold>0.037</bold> </td> <td align=\"center\"> <bold>0.043</bold> </td> <td align=\"center\"> <bold>0.037</bold> </td> </tr> <tr> <td>[0.33,0.67], [2.57,35.4]</td> <td align=\"center\">0.650</td> <td align=\"center\">0.650</td> <td align=\"center\">0.060</td> <td align=\"center\">0.060</td> <td align=\"center\"> <bold>0.034</bold> </td> </tr> <tr> <td>[0.67,1], [2.57,35.4]</td> <td align=\"center\">0.970</td> <td align=\"center\">0.970</td> <td align=\"center\"> <bold>0.034</bold> </td> <td align=\"center\"> <bold>0.034</bold> </td> <td align=\"center\"> <bold>0.034</bold> </td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Observed false positive rates from a differential gene expression analysis using edgeR applied to various count matrices (with a nominal p-value cutoff at 0.05), limited to genes with true underlying differential isoform usage (recall that no genes are truly differentially expressed in this data set). The results are stratified by “effect size” (the difference in relative abundance between the two differentially used isoforms) and the length ratio between the longer and the shorter of the differentially used isoforms. FPRs below the nominal p-value threshold (0.05) are marked in bold. For more details, see Data set 1 .",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_37",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "6",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_38",
            "content": "In this article, we have contrasted transcript- and gene-resolution abundance estimation and statistical inference, and illustrated that gene-level results are more accurate, powerful and interpretable than transcript-level results. Not surprisingly, however, accurate transcript-level estimation and inference plays an important role in deriving appropriate gene-level results, and it is therefore imperative to continue improving abundance estimation and inference methods applicable to individual transcripts, since misestimation can propagate to the gene level. We have shown that when testing for changes in overall gene expression (DGE), traditional gene counting approaches may lead to an inflated false discovery rate compared to methods aggregating transcript-level TPM values or incorporating correction factors derived from these, for genes where the relative isoform usage differs between the compared conditions. These correction factors can be calculated from the output of transcript abundance programs, using e.g., the provided R package ( tximport ). It is important to note that the average transcript length offsets must account for the differences in transcript usage between the samples and thus using (sample-independent) exon-union gene lengths will not improve performance.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_39",
            "content": "All evaluated counting approaches gave comparable results for genes where DTU was not present. Thus, the extent of the FDR inflation in experimental data depends on the extent of DTU between the compared conditions; notably, our simulation introduced rather extreme levels of DTU, hence the inflated FDR, and the difference between the approaches was considerably smaller in real data sets. Recent studies have also shown that many genes express mainly one, dominant isoform <REF-25> and for such genes, we expect that simple gene counting will work well.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_40",
            "content": "Our results highlight the importance of correctly specifying the question of interest before selecting a statistical approach. Summarization of abundance estimates at the gene level before performing the statistical testing should be the method of choice if the interest is in finding changes in the overall transcriptional output of a gene. However, it is suboptimal if the goal is to identify genes for which at least one of the transcripts show differences in transcriptional output, since it may miss genes where two transcripts change in opposite directions, or where a lowly expressed transcript changes. For gene-level detection of DTE (that is, whether any transcript showed a change in expression between the conditions), statistical testing applied to aggregated gene counts led to reduced power and slightly inflated FDR compared to performing the statistical test on the transcript level and aggregating results within genes ( Supplementary Figure 5 ). Statistical inference on aggregated transcript TPMs (scaledTPM) showed low power for detecting changes that did not affect the overall transcriptional output of the gene, as expected. An alternative to DTE analysis, for potential improved interpretability, is to perform a combination of DGE and DTU analyses, both resulting in gene-level inferences. Table 2 summarizes our results and give suggested workflows for the different types of analyses we have considered.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_41",
            "content": "Table 2.",
            "ntype": "label",
            "meta": {
                "id": "T2",
                "caption": "Summary of suitable analysis approaches for the three types of comparative analyses discussed in the manuscript (DGE, DTE and DTU).",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_42",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T2\" position=\"anchor\"> <caption> <title>Summary of suitable analysis approaches for the three types of comparative analyses discussed in the manuscript (DGE, DTE and DTU).</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">Task</th> <th align=\"left\">Input data</th> <th align=\"left\">Software (examples)</th> <th align=\"left\">Post-processing</th> </tr> </thead> <tbody> <tr> <td rowspan=\"3\" valign=\"top\">DGE</td> <td rowspan=\"3\" valign=\"top\">Aggregated transcript counts + <break/>average transcript length offsets, or <break/>simple counts + average transcript <break/>length offsets</td> <td>Salmon, kallisto, BitSeq, <break/>RSEM</td> <td rowspan=\"3\" valign=\"top\"/> </tr> <tr> <td>tximport</td> </tr> <tr> <td>DESeq2, edgeR, voom/ <break/>limma</td> </tr> <tr> <td rowspan=\"3\" valign=\"top\">DTE</td> <td rowspan=\"3\" valign=\"top\">Transcript counts</td> <td>Salmon, kallisto, BitSeq, <break/>RSEM</td> <td rowspan=\"3\" valign=\"top\">Optional gene-level <break/>aggregation</td> </tr> <tr> <td>tximport</td> </tr> <tr> <td>DESeq2, edgeR, sleuth, <break/>voom/limma</td> </tr> <tr> <td rowspan=\"2\" valign=\"top\">DTU/DEU</td> <td rowspan=\"2\" valign=\"top\">Transcript counts or bin counts, <break/>depending on interpretation potential <sup> <xref ref-type=\"bibr\" rid=\"ref-18\">18</xref> </sup> </td> <td>Salmon, kallisto, BitSeq, <break/>RSEM</td> <td rowspan=\"2\" valign=\"top\">Optional gene-level <break/>aggregation</td> </tr> <tr> <td>DEXSeq</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T2",
                "caption": "Summary of suitable analysis approaches for the three types of comparative analyses discussed in the manuscript (DGE, DTE and DTU).",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_43",
            "content": "Of course, there may be situations where a direct transcript-level analysis is appropriate. For example, in a cancer setting where a specific deleterious splice variant is of interest (e.g., AR-V7 in prostate cancer <REF-26> ), inferences directly at the transcript level may be preferred. However, while this may be preferred for individual known transcripts, transcriptome-wide differential expression analyses may not be warranted, given the associated multiple testing cost.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_44",
            "content": "Finally, we note that estimation at the gene level can reduce the problem of technical biases on expression levels and unidentifiable estimation. Current methods for transcript-level quantification (e.g., Cufflinks , RSEM , Salmon , kallisto ) do not correct for amplification bias on fragments, which can lead to many estimation errors, such as expression being attributed to the wrong isoform <REF-27> . Non-uniform coverage from amplification bias or from position bias (3’ coverage bias from poly-(A) selection) can result in unidentifiable transcript-level estimation. Such errors and estimation problems are minimized when summarizing expression to the gene level.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_45",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_46",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2015 Soneson C et al.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_47",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_48",
            "content": "F1000Research : Data set 1. 10.5256/f1000research.7563.d109328",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_49",
            "content": "F1000Research : Data set 2. 10.5256/f1000research.7563.d109329",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_50",
            "content": "F1000Research : Data set 3. 10.5256/f1000research.7563.d109330",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_51",
            "content": "F1000Research : Data set 4. 10.5256/f1000research.7563.d109331",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_52",
            "content": "F1000Research : Data set 5. 10.5256/f1000research.7563.d109332",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_53",
            "content": "F1000Research : Data set 6. 10.5256/f1000research.7563.d109333",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_54",
            "content": "Software availability",
            "ntype": "title",
            "meta": {
                "section": "8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_55",
            "content": "Software access",
            "ntype": "title",
            "meta": {
                "section": "8.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_56",
            "content": "https://github.com/mikelove/tximport",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_57",
            "content": "Source code as at the time of publication",
            "ntype": "title",
            "meta": {
                "section": "8.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_58",
            "content": "https://github.com/F1000Research/tximport",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_59",
            "content": "Archived source code as at the time of publication",
            "ntype": "title",
            "meta": {
                "section": "8.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_60",
            "content": "http://dx.doi.org/10.5281/Zenodo.35123",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_61",
            "content": "Software license",
            "ntype": "title",
            "meta": {
                "section": "8.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_62",
            "content": "tximport is released under a GNU Public License (GPL).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_63",
            "content": "<REF-1> Liao Y Smyth GK Shi W : featureCounts: an efficient general purpose program for assigning sequence reads to genomic features. Bioinformatics. 2014 ; 30 ( 7 ): 923 – 30 . 24227677 10.1093/bioinformatics/btt656",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_64",
            "content": "<REF-2> Anders S Pyl PT Huber W : HTSeq - a Python framework to work with high-throughput sequencing data. Bioinformatics. 2015 ; 31 ( 2 ): 166 – 169 . 25260700 10.1093/bioinformatics/btu638 4287950",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_65",
            "content": "<REF-3> Trapnell C Roberts A Goff L : Differential gene and transcript expression analysis of RNA-seq experiments with TopHat and Cufflinks. Nat Protoc. 2012 ; 7 ( 3 ): 562 – 78 . 22383036 10.1038/nprot.2012.016 3334321",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_66",
            "content": "<REF-4> Li B Dewey CN : RSEM: accurate transcript quantification from RNA-Seq data with or without a reference genome. BMC Bioinformatics. 2011 ; 12 : 323 . 21816040 10.1186/1471-2105-12-323 3163565",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_67",
            "content": "<REF-5> Glaus P Honkela A Rattray M : Identifying differentially expressed transcripts from RNA-seq data with biological variation. Bioinformatics. 2012 ; 28 ( 13 ): 1721 – 1728 . 22563066 10.1093/bioinformatics/bts260 3381971",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_68",
            "content": "<REF-6> Bray N Pimentel H Melsted P : Near-optimal RNA-Seq quantification. arXiv:1505.02710 . 2015 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_69",
            "content": "<REF-7> Patro R Duggal G Kingsford C : Accurate, fast, and model-aware transcript expression quantification with Salmon. bioRxiv. 2015 . 10.1101/021592",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_70",
            "content": "<REF-8> Mortazavi A Williams BA McCue K : Mapping and quantifying mammalian transcriptomes by RNA-Seq. Nat Methods. 2008 ; 5 ( 7 ): 621 – 628 . 18516045 10.1038/nmeth.1226",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_71",
            "content": "<REF-9> Trapnell C Williams BA Pertea G : Transcript assembly and quantification by RNA-Seq reveals unannotated transcripts and isoform switching during cell differentiation. Nat Biotechnol. 2010 ; 28 ( 5 ): 511 – 515 . 20436464 10.1038/nbt.1621 3146043",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_72",
            "content": "<REF-10> Wagner GP Kin K Lynch VJ : Measurement of mRNA abundance using RNA-seq data: RPKM measure is inconsistent among samples. Theory Biosci. 2012 ; 131 ( 4 ): 281 – 285 . 22872506 10.1007/s12064-012-0162-3",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_73",
            "content": "<REF-11> Love MI Huber W Anders S : Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2. Genome Biol. 2014 ; 15 ( 12 ): 550 . 25516281 10.1186/s13059-014-0550-8 4302049",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_74",
            "content": "<REF-12> Robinson MD McCarthy DJ Smyth GK : edgeR: a Bioconductor package for differential expression analysis of digital gene expression data. Bioinformatics. 2010 ; 26 ( 1 ): 139 – 40 . 19910308 10.1093/bioinformatics/btp616 2796818",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_75",
            "content": "<REF-13> Ritchie ME Phipson B Wu D : limma powers differential expression analyses for RNA-sequencing and microarray studies. Nucleic Acids Res. 2015 ; 43 ( 7 ): e47 . 25605792 10.1093/nar/gkv007 4402510",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_76",
            "content": "<REF-14> Bottomly D Walter NA Hunter JE : Evaluating gene expression in C57BL/6J and DBA/2J mouse striatum using RNA-Seq and microarrays. PLoS One. 2011 ; 6 ( 3 ): e17820 . 21455293 10.1371/journal.pone.0017820 3063777",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_77",
            "content": "<REF-15> Yang S Marín-Juez R Meijer AH : Common and specific downstream signaling targets controlled by Tlr2 and Tlr5 innate immune signaling in zebrafish. BMC Genomics. 2015 ; 16 ( 1 ): 547 . 26208853 10.1186/s12864-015-1740-9 4514945",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_78",
            "content": "<REF-16> Currais A Goldberg J Farrokhi C : A comprehensive multiomics approach toward understanding the relationship between aging and dementia. Aging (Albany. NY). 2015 ; 7 ( 11 ): 937 – 955 . 26564964",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_79",
            "content": "<REF-17> Chang AJ Ortega FE Riegler J : Oxygen regulation of breathing through an olfactory receptor activated by lactate. Nature. 2015 ; 527 ( 7577 ): 240 – 244 . 26560302 10.1038/nature15721",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_80",
            "content": "<REF-18> Soneson C Matthes KL Nowicka M : Differential transcript usage from RNA-seq data: isoform pre-filtering improves performance of count-based methods. bioRxiv. 2015 . 10.1101/025387",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_81",
            "content": "<REF-19> Kanitz A Gypas F Gruber AJ : Comparative assessment of methods for the computational inference of transcript isoform abundance from RNA-seq data. Genome Biol. 2015 ; 16 ( 1 ): 150 . 26201343 10.1186/s13059-015-0702-5 4511015",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_82",
            "content": "<REF-20> Robert C Watson M : Errors in RNA-Seq quantification affect genes of relevance to human disease. Genome Biol. 2015 ; 16 : 177 . 26335491 10.1186/s13059-015-0734-x 4558956",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_83",
            "content": "<REF-21> Anders S Reyes A Huber W : Detecting differential usage of exons from RNA-seq data. Genome Res. 2012 ; 22 ( 10 ): 2008 – 17 . 22722343 10.1101/gr.133744.111 3460195",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_84",
            "content": "<REF-22> Lawrence M Huber W Pagès H : Software for computing and annotating genomic ranges. PLoS Comput Biol. 2013 ; 9 ( 8 ): e1003118 . 23950696 10.1371/journal.pcbi.1003118 3738458",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_85",
            "content": "<REF-23> Trapnell C Hendrickson DG Sauvageau M : Differential analysis of gene regulation at transcript resolution with RNA-seq. Nat Biotechnol. 2013 ; 31 ( 1 ): 46 – 53 . 23222703 10.1038/nbt.2450 3869392",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_86",
            "content": "<REF-24> Zhao S Xi L Zhang B : Union Exon Based Approach for RNA-Seq Gene Quantification: To Be or Not to Be? PLoS One. 2015 ; 10 ( 11 ): e0141910 . 26559532 10.1371/journal.pone.0141910 4641603",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_87",
            "content": "<REF-25> Gonzàlez-Porta M Frankish A Rung J : Transcriptome analysis of human tissues and cell lines reveals one dominant transcript per gene. Genome Biol. 2013 ; 14 ( 7 ): R70 . 23815980 10.1186/gb-2013-14-7-r70 4053754",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_88",
            "content": "<REF-26> Antonarakis ES Lu C Wang H : AR-V7 and resistance to enzalutamide and abiraterone in prostate cancer. N Engl J Med. 2014 ; 371 ( 11 ): 1028 – 38 . 25184630 10.1056/NEJMoa1315815 4201502",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-1521_v1_89",
            "content": "<REF-27> Love MI Hogenesch JB Irizarry RA : Modeling of RNA-seq fragment sequence bias reduces systematic errors in transcript abundance estimation. bioRxiv. 2015 . 10.1101/025767",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "4-1521_v1_0@0",
            "content": "Differential analyses for RNA-seq: transcript-level estimates improve gene-level inferences",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_0",
            "start": 0,
            "end": 90,
            "label": {}
        },
        {
            "ix": "4-1521_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "4-1521_v1_2@0",
            "content": "High-throughput sequencing of cDNA (RNA-seq) is used extensively to characterize the transcriptome of cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_2",
            "start": 0,
            "end": 107,
            "label": {}
        },
        {
            "ix": "4-1521_v1_2@1",
            "content": "Many transcriptomic studies aim at comparing either abundance levels or the transcriptome composition between given conditions, and as a first step, the sequencing reads must be used as the basis for abundance quantification of transcriptomic features of interest, such as genes or transcripts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_2",
            "start": 109,
            "end": 402,
            "label": {}
        },
        {
            "ix": "4-1521_v1_2@2",
            "content": "Several different quantification approaches have been proposed, ranging from simple counting of reads that overlap given genomic regions to more complex estimation of underlying transcript abundances.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_2",
            "start": 404,
            "end": 603,
            "label": {}
        },
        {
            "ix": "4-1521_v1_2@3",
            "content": "In this paper, we show that gene-level abundance estimates and statistical inference offer advantages over transcript-level analyses, in terms of performance and interpretability.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_2",
            "start": 605,
            "end": 783,
            "label": {}
        },
        {
            "ix": "4-1521_v1_2@4",
            "content": "We also illustrate that while the presence of differential isoform usage can lead to inflated false discovery rates in differential expression analyses on simple count matrices and transcript-level abundance estimates improve the performance in simulated data, the difference is relatively minor in several real data sets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_2",
            "start": 785,
            "end": 1106,
            "label": {}
        },
        {
            "ix": "4-1521_v1_2@5",
            "content": "Finally, we provide an R package ( tximport ) to help users integrate transcript-level abundance estimates from common quantification pipelines into count-based statistical inference engines.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_2",
            "start": 1108,
            "end": 1298,
            "label": {}
        },
        {
            "ix": "4-1521_v1_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "4-1521_v1_4@0",
            "content": "Quantification and comparison of isoform- or gene-level expression based on high throughput sequencing reads from cDNA (RNA-seq) is arguably among the most common tasks in modern computational molecular biology.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_4",
            "start": 0,
            "end": 210,
            "label": {}
        },
        {
            "ix": "4-1521_v1_4@1",
            "content": "Currently, one of the most common approaches is to define a set of non-overlapping targets (typically, genes) and use the number of reads overlapping a target as a measure of its abundance, or expression level.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_4",
            "start": 212,
            "end": 421,
            "label": {}
        },
        {
            "ix": "4-1521_v1_4@2",
            "content": "Several software packages have been developed for performing such “simple” counting (e.g., featureCounts <REF-1> and HTSeq-count <REF-2> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_4",
            "start": 423,
            "end": 561,
            "label": {}
        },
        {
            "ix": "4-1521_v1_4@3",
            "content": "More recently, the field has seen a surge in methods aimed at quantifying the abundances of individual transcripts (e.g., Cufflinks <REF-3> , RSEM <REF-4> , BitSeq <REF-5> , kallisto <REF-6> and Salmon <REF-7> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_4",
            "start": 563,
            "end": 774,
            "label": {}
        },
        {
            "ix": "4-1521_v1_4@4",
            "content": "These methods provide higher resolution than simple counting, and by circumventing the computationally costly read alignment step, some are considerably faster.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_4",
            "start": 776,
            "end": 935,
            "label": {}
        },
        {
            "ix": "4-1521_v1_4@5",
            "content": "However, isoform quantification is more complex than the simple counting, due to the high degree of overlap among transcripts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_4",
            "start": 937,
            "end": 1062,
            "label": {}
        },
        {
            "ix": "4-1521_v1_4@6",
            "content": "Currently, there is no consensus regarding the optimal resolution or method for quantification and downstream analysis of transcriptomic output.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_4",
            "start": 1064,
            "end": 1207,
            "label": {}
        },
        {
            "ix": "4-1521_v1_5@0",
            "content": "Another point of debate is the unit in which abundance is given.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_5",
            "start": 0,
            "end": 63,
            "label": {}
        },
        {
            "ix": "4-1521_v1_5@1",
            "content": "The traditional R/FPKM <REF-8> , <REF-9> (reads/fragments per kilobase per million reads) has been largely superseded by the TPM <REF-10> (transcripts per million), since the latter is more consistent across libraries.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_5",
            "start": 65,
            "end": 282,
            "label": {}
        },
        {
            "ix": "4-1521_v1_5@2",
            "content": "Regardless, both of these units attempt to “correct for” sequencing depth and feature length and thus do not reflect the influence of these on quantification uncertainty.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_5",
            "start": 284,
            "end": 453,
            "label": {}
        },
        {
            "ix": "4-1521_v1_5@3",
            "content": "In order to account for these aspects, most statistical tools for analysis of RNA-seq data operate instead on the count scale.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_5",
            "start": 455,
            "end": 580,
            "label": {}
        },
        {
            "ix": "4-1521_v1_5@4",
            "content": "While these tools were designed to be applied to simple read counts, the degree to which their performance is affected by using fractional estimated counts resulting from portioning reads aligning to multiple transcripts is still an open question.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_5",
            "start": 582,
            "end": 828,
            "label": {}
        },
        {
            "ix": "4-1521_v1_5@5",
            "content": "The fact that the most common sequencing protocols provide reads that are much shorter than the average transcript length implies that the observed read counts depend on the transcript’s length as well as abundance; thus, simple counts are arguably less accurate measures than TPMs of the true abundance of RNA molecules from given genes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_5",
            "start": 830,
            "end": 1167,
            "label": {}
        },
        {
            "ix": "4-1521_v1_5@6",
            "content": "The use of gene counts as input to statistical tools typically assumes that the length of the expressed part of a gene does not change across samples and thus length can therefore be ignored for differential analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_5",
            "start": 1169,
            "end": 1385,
            "label": {}
        },
        {
            "ix": "4-1521_v1_6@0",
            "content": "In the analysis of transcriptomic data, as for any other application, it is of utmost importance that the question of interest is precisely defined before a computational approach is selected.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_6",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "4-1521_v1_6@1",
            "content": "Often, the interest lies in comparing the transcriptional output between different conditions, and most RNA-seq studies can be classified as either: 1) differential gene expression (DGE) studies, where the overall transcriptional output of each gene is compared between conditions; 2) differential transcript/exon usage (DTU/DEU) studies, where the composition of a gene’s isoform abundance spectrum is compared between conditions, or 3) differential transcript expression (DTE) studies, where the interest lies in whether individual transcripts show differential expression between conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_6",
            "start": 193,
            "end": 786,
            "label": {}
        },
        {
            "ix": "4-1521_v1_6@2",
            "content": "DTE analysis results can be represented on the individual transcript level, or aggregated to the gene level, e.g., by evaluating whether at least one of the isoforms shows evidence of differential abundance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_6",
            "start": 788,
            "end": 994,
            "label": {}
        },
        {
            "ix": "4-1521_v1_7@0",
            "content": "In this report, we make and give evidence for three claims: 1) gene-level estimation is considerably more stable than transcript-level; 2) regardless of the level at which abundance estimation is done, inferences at the gene level are appealing in terms of robustness, statistical performance and interpretation; 3) the magnitude of the difference between results obtained by simple counting and transcript-level abundance estimation is generally small in real data sets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_7",
            "start": 0,
            "end": 470,
            "label": {}
        },
        {
            "ix": "4-1521_v1_7@1",
            "content": "However, despite strong overall correlations among results obtained from various quantification pipelines, taking advantage of transcript-level abundance estimates when defining or analyzing gene-level abundances leads to improved differential gene expression results compared to simple counting.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_7",
            "start": 472,
            "end": 767,
            "label": {}
        },
        {
            "ix": "4-1521_v1_8@0",
            "content": "To facilitate a broad range of analysis choices, depending on the biological question of interest, we provide an R package, tximport , to import transcript lengths and abundance estimates from several popular quantification packages and export (estimated) count matrices and, optionally, average transcript length correction terms (i.e., offsets) that can be used as inputs to common statistical engines, such as DESeq2 <REF-11> , edgeR <REF-12> and limma <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_8",
            "start": 0,
            "end": 465,
            "label": {}
        },
        {
            "ix": "4-1521_v1_9@0",
            "content": "Data",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_9",
            "start": 0,
            "end": 3,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@0",
            "content": "Throughout this manuscript, we utilize two simulated data sets and four experimental data sets (Bottomly <REF-14> [ Data set 3 ], GSE64570 <REF-15> [ Data set 4 ], GSE69244 <REF-16> [ Data set 5 ], GSE72165 <REF-17> [ Data set 6 ], see Supplementary File 1 for further details) for illustration.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 0,
            "end": 294,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@1",
            "content": "Details on the data generation and full records of the analyses are provided in the data sets and Supplementary File 1 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 296,
            "end": 415,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@2",
            "content": "The first simulated data set (sim1; Data set 1 ) is the synthetic human data set from Soneson et al . <REF-18> , comprising 20,410 genes and 145,342 transcripts and is available from ArrayExpress (accession E-MTAB-3766).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 417,
            "end": 636,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@3",
            "content": "This data set has three biological replicates from each of two simulated conditions, and differential isoform usage was introduced for 1,000 genes by swapping the relative expression levels of the two most dominant isoforms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 638,
            "end": 861,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@4",
            "content": "For each gene in this data set, the total transcriptional output is the same in the two conditions (i.e., no overall DGE); it is worth noting that this is an extreme situation, but provides a useful test set for contrasting DGE, DTU and DTE.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 863,
            "end": 1103,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@5",
            "content": "The second simulated data set (sim2; Data set 2 ) is a synthetic data set comprising the 3,858 genes and 15,677 transcripts from the human chromosome 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 1105,
            "end": 1256,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@6",
            "content": "It is available from ArrayExpress with accession E-MTAB-4119.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 1258,
            "end": 1318,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@7",
            "content": "Also here, we simulated two conditions with three biological replicates each.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 1320,
            "end": 1396,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@8",
            "content": "For this data set, we simulated both overall DGE, where all transcripts of the affected gene showed the same fold change between the conditions (420 genes), differential transcript usage (DTU), where the total transcriptional output was kept constant but the relative contribution from the transcripts changed (420 genes) and differential transcript expression (DTE), where the expression of 10% of the transcripts of each affected gene was modified (422 genes, 528 transcripts).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 1398,
            "end": 1876,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@9",
            "content": "The three sets of modified genes were disjoint.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 1878,
            "end": 1924,
            "label": {}
        },
        {
            "ix": "4-1521_v1_10@10",
            "content": "Again, this synthetic data set represents an extreme situation compared to most real data sets, but provides a useful test case to identify underlying causes of differences between results from various analysis pipelines.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_10",
            "start": 1926,
            "end": 2146,
            "label": {}
        },
        {
            "ix": "4-1521_v1_17@0",
            "content": "Gene abundance estimates are more accurate than transcript abundance estimates",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_17",
            "start": 0,
            "end": 77,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@0",
            "content": "To evaluate the accuracy of abundance estimation with transcript and gene resolution, we used Salmon <REF-7> (v0.5.1) to estimate TPM values for each transcript in each of the data sets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 0,
            "end": 185,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@1",
            "content": "Gene-level TPM estimates, representing the overall transcriptional output of each gene, were obtained by summing the corresponding transcript-level TPM estimates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 187,
            "end": 348,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@2",
            "content": "For the two simulated data sets, the true underlying TPM of each feature is known and we can thus evaluate the accuracy of the estimates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 350,
            "end": 486,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@3",
            "content": "Unsurprisingly, gene-level estimates were more accurate than transcript-level estimates ( Figure 1A , Supplementary Figures 1,2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 488,
            "end": 617,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@4",
            "content": "We also derived TPM estimates from gene-level counts obtained from featureCounts by dividing each of these with a reasonable measure of the length of the gene (the length of the union of its exons) and the total number of mapped reads, and scaling the estimates to sum to 1 million.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 619,
            "end": 900,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@5",
            "content": "The simple count estimates showed a lower correlation with the true TPMs than the Salmon estimates, in line with previous observations <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 902,
            "end": 1046,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@6",
            "content": "However, simple counts tended to show a high degree of robustness against incompleteness of the annotation catalog, as evidenced from estimation errors after first removing (at random) 20% of the transcripts ( Figure 1A ); in contrast, Salmon transcript estimate accuracies deteriorated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 1048,
            "end": 1334,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@7",
            "content": "From the bootstrap estimates generated by Salmon , we also estimated the coefficient of variation of the abundance estimates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 1336,
            "end": 1460,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@8",
            "content": "The gene-level estimates showed considerably lower variability in both simulated and experimental data ( Figure 1B , Supplementary Figures 3,4 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 1462,
            "end": 1606,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@9",
            "content": "Taken together, these observations suggest that the gene-level estimates are more accurate than transcript-level estimates and therefore potentially allow a more accurate and stable statistical analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 1608,
            "end": 1810,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@10",
            "content": "A further argument in favor of gene-level analysis is the unidentifiability of transcript expression that can result from uneven coverage caused by underlying technical biases ( Figure 1C ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 1812,
            "end": 2001,
            "label": {}
        },
        {
            "ix": "4-1521_v1_18@11",
            "content": "Intermediate approaches, grouping together “indistinguishable” features are also conceiveable <REF-20> , but not yet standard practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_18",
            "start": 2003,
            "end": 2137,
            "label": {}
        },
        {
            "ix": "4-1521_v1_19@0",
            "content": "Figure 1 (sim2).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_19",
            "start": 0,
            "end": 15,
            "label": {}
        },
        {
            "ix": "4-1521_v1_21@0",
            "content": "DTE is more powerful and easier to interpret on gene level than for individual transcripts",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_21",
            "start": 0,
            "end": 89,
            "label": {}
        },
        {
            "ix": "4-1521_v1_22@0",
            "content": "DTE is concerned with inference of changes in abundance at transcript resolution, and thus invokes a statistical test for each transcript.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_22",
            "start": 0,
            "end": 137,
            "label": {}
        },
        {
            "ix": "4-1521_v1_22@1",
            "content": "We argue that this can lead to several complications: the first is conceptual, since the rows (transcripts) in the result table will in many cases not be interpreted independently, but will rather be grouping transcripts from the same gene, and the second one is more technical, since the number of transcripts is considerably larger than the number of genes, which could lead to lower power due to the portioning of the total set of reads across a larger number of features and a potentially higher multiple testing penalty.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_22",
            "start": 139,
            "end": 663,
            "label": {}
        },
        {
            "ix": "4-1521_v1_22@2",
            "content": "We tested for DTE on the simulated data by applying edgeR <REF-12> to the transcript counts obtained from Salmon (the application of count models to estimated counts is discussed in the next Section), and represented the results as transcript-level p-values or aggregated these to the gene level by using the perGeneQValue function from the DEXSeq <REF-21> R package.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_22",
            "start": 665,
            "end": 1031,
            "label": {}
        },
        {
            "ix": "4-1521_v1_22@3",
            "content": "The transcript-level DTE test assesses the null hypothesis that the individual transcript does not change its expression, whereas the gene-level DTE test assesses the null hypothesis that all transcripts exhibit no change in expression.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_22",
            "start": 1033,
            "end": 1268,
            "label": {}
        },
        {
            "ix": "4-1521_v1_22@4",
            "content": "Framing the DTE question at the gene level results in higher power, without sacrificing false discovery rate control ( Figure 2A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_22",
            "start": 1270,
            "end": 1400,
            "label": {}
        },
        {
            "ix": "4-1521_v1_22@5",
            "content": "We note that this type of gene-level aggregation may favor genes in which one transcript shows strong changes, and that other approaches to increase power against specific alternatives are conceivable, e.g., capitalizing on the rich collection of methods for gene set analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_22",
            "start": 1402,
            "end": 1678,
            "label": {}
        },
        {
            "ix": "4-1521_v1_23@0",
            "content": "Figure 2 (sim2).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_23",
            "start": 0,
            "end": 15,
            "label": {}
        },
        {
            "ix": "4-1521_v1_25@0",
            "content": "While DTE analysis is more suitable than DGE analysis for detecting genes with changes in absolute or relative isoform expression but no or only minor change in overall output ( Supplementary Figure 5 ), we argue that even gene-level DTE results may suffer from lack of interpretability.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_25",
            "start": 0,
            "end": 286,
            "label": {}
        },
        {
            "ix": "4-1521_v1_25@1",
            "content": "DTE can arise in several different ways, from an overall differential expression of the gene or from differential relative usage of its transcripts, or a combination of the two ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_25",
            "start": 288,
            "end": 478,
            "label": {}
        },
        {
            "ix": "4-1521_v1_25@2",
            "content": "We argue that the biological question of interest is in many cases more readily interpretable as a combination of DGE and DTU, rather than DTE.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_25",
            "start": 480,
            "end": 622,
            "label": {}
        },
        {
            "ix": "4-1521_v1_25@3",
            "content": "It has been our experience that results reported at the transcript level are still often cast to the gene level (i.e., given a differentially expressed transcript, researchers want to know whether other isoforms of the gene are changing), suggesting that asking two specific gene-level questions (Is the overall abundance changing? Are the isoform abundances changing proportionally?) trumps the interpretability of one broad question at the transcript-level inference (Are there changes in any of the transcript expression levels?).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_25",
            "start": 624,
            "end": 1156,
            "label": {}
        },
        {
            "ix": "4-1521_v1_25@4",
            "content": "Despite this, there are of course also situations when a transcript-centric approach is superior, for example in targeted experiments where specific isoforms are expected to change due to an administered treatment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_25",
            "start": 1158,
            "end": 1371,
            "label": {}
        },
        {
            "ix": "4-1521_v1_26@0",
            "content": "Incorporating transcript-level estimates leads to more accurate DGE results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_26",
            "start": 0,
            "end": 74,
            "label": {}
        },
        {
            "ix": "4-1521_v1_27@0",
            "content": "DGE (i.e., testing for changes in the overall transcriptional output of a gene) is typically performed by applying a count-based inference method from statistical packages such as edgeR <REF-12> or DESeq2 <REF-11> to gene counts obtained by read counting software such as featureCounts <REF-1> , HTSeq-count <REF-2> or functions from the GenomicAlignments <REF-22> R package.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_27",
            "start": 0,
            "end": 374,
            "label": {}
        },
        {
            "ix": "4-1521_v1_27@1",
            "content": "A lot has been written about how simple counting approaches are prone to give erroneous results for genes with changes in relative isoform usage, due to the direct dependence of the observed read count on the transcript length <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_27",
            "start": 376,
            "end": 612,
            "label": {}
        },
        {
            "ix": "4-1521_v1_27@2",
            "content": "However, the extent of the problem in real data has not been thoroughly investigated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_27",
            "start": 614,
            "end": 698,
            "label": {}
        },
        {
            "ix": "4-1521_v1_27@3",
            "content": "Here, we show that taking advantage of transcript-resolution estimates (e.g., obtained by Salmon ) can lead to improved DGE results.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_27",
            "start": 700,
            "end": 831,
            "label": {}
        },
        {
            "ix": "4-1521_v1_27@4",
            "content": "We propose two alternative ways of integrating transcript abundance estimates into the DGE pipeline: to define an “artificial” count matrix, or to calculate offsets that can be used in the statistical modeling of the observed gene counts from, e.g., featureCounts .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_27",
            "start": 833,
            "end": 1097,
            "label": {}
        },
        {
            "ix": "4-1521_v1_27@5",
            "content": "Both approaches are implemented in the accompanying tximport R package (available from https://github.com/mikelove/tximport ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_27",
            "start": 1099,
            "end": 1224,
            "label": {}
        },
        {
            "ix": "4-1521_v1_28@0",
            "content": "We defined three different count matrices for each data set: 1) using featureCounts from the Rsubread <REF-1> R package (denoted featureCounts below), 2) summing the estimated transcript counts from Salmon within genes ( simplesum ), 3) summing the estimated transcript TPMs from Salmon within genes, and multiplying with the total library size in millions ( scaledTPM ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_28",
            "start": 0,
            "end": 370,
            "label": {}
        },
        {
            "ix": "4-1521_v1_28@1",
            "content": "We note that the scaledTPM values are artificial values, transforming underlying abundance measures to the “count scale” to incorporate the information provided by the sequencing depth.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_28",
            "start": 372,
            "end": 556,
            "label": {}
        },
        {
            "ix": "4-1521_v1_28@2",
            "content": "We further used the Salmon transcript lengths and estimated TPMs to define average transcript lengths for each gene and each sample (normalization factors) as described in the Supplementary material , to be used as offsets for edgeR and DESeq2 when analyzing the featureCounts and simplesum count matrices ( featureCounts_avetxl and simplesum_avetxl ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_28",
            "start": 558,
            "end": 909,
            "label": {}
        },
        {
            "ix": "4-1521_v1_29@0",
            "content": "Overall, the counts obtained by all methods were highly correlated ( Supplementary Figures 6–8 ), which is not surprising since any differences are likely to affect a relatively small subset of the genes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_29",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "4-1521_v1_29@1",
            "content": "In general, the simplesum and featureCounts matrices led to similar conclusions in all considered data sets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_29",
            "start": 205,
            "end": 312,
            "label": {}
        },
        {
            "ix": "4-1521_v1_29@2",
            "content": "However, there are differences between the two approaches in terms of how multi-mapping reads and reads partly overlapping intronic regions are handled <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_29",
            "start": 314,
            "end": 475,
            "label": {}
        },
        {
            "ix": "4-1521_v1_29@3",
            "content": "The concordance between simplesum and featureCounts results also suggests that statistical methods based on the Negative Binomial assumption are applicable also to summarized, gene-level estimated counts, which is further supported by the similarity between the p-value histograms as well as the mean-variance relationships observed with the three types of count matrices ( Supplementary Figures 9–14 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_29",
            "start": 477,
            "end": 879,
            "label": {}
        },
        {
            "ix": "4-1521_v1_30@0",
            "content": "Accounting for the potentially varying average transcript length across samples when performing DGE, either in the definition of the count matrix (scaledTPM) or by defining offsets, led to considerably improved false discovery rate (FDR) control compared to using the observed featureCounts or aggregated Salmon counts (simplesum) directly ( Figure 3A , Table 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_30",
            "start": 0,
            "end": 363,
            "label": {}
        },
        {
            "ix": "4-1521_v1_30@1",
            "content": "It is important to note that this improvement is entirely attributable to an improved handling of genes with changes in isoform composition between the conditions ( Figure 3B , Supplementary Figure 15 ), that we purposely introduced strong signals in the simulated data set in order to pinpoint these underlying causes, and that the overall effect in a real data set will depend on the extent to which considerable DTU is present.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_30",
            "start": 365,
            "end": 794,
            "label": {}
        },
        {
            "ix": "4-1521_v1_30@2",
            "content": "Experiments on various real data sets ( Supplementary Figure 16 ) show only small differences in the collections of significant genes found with the simplesum and simplesum_avetxl approaches, suggesting that the extent of the problem in many real data sets is limited, and that most findings obtained with simple counting are not induced by counting artifacts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_30",
            "start": 796,
            "end": 1155,
            "label": {}
        },
        {
            "ix": "4-1521_v1_30@3",
            "content": "Further support for this conclusion is shown in Figure 4 (see also Supplementary Figures 17–19 and Supplementary Table 1 ), where log-fold change estimates from edgeR , based on the simplesum and scaledTPM matrices, are contrasted.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_30",
            "start": 1157,
            "end": 1387,
            "label": {}
        },
        {
            "ix": "4-1521_v1_30@4",
            "content": "For the genes with induced DTU in the sim2 data set, log-fold changes based on the simplesum matrix are overestimated, as expected.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_30",
            "start": 1389,
            "end": 1519,
            "label": {}
        },
        {
            "ix": "4-1521_v1_30@5",
            "content": "However, this effect is almost absent in all the real data sets, again highlighting the extreme nature of our simulated data and suggesting that the effect of using different count matrices is considerably smaller for many real data sets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_30",
            "start": 1521,
            "end": 1758,
            "label": {}
        },
        {
            "ix": "4-1521_v1_30@6",
            "content": "Table 1 suggests that the lack of error control for simplesum and featureCounts matrices is more pronounced when there is a large difference in length between the differentially used isoforms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_30",
            "start": 1760,
            "end": 1951,
            "label": {}
        },
        {
            "ix": "4-1521_v1_30@7",
            "content": "In the group with smallest length difference, where the longer differentially used isoform is less than 34% longer than the shorter one, all approaches controlled the type I error satisfactorily.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_30",
            "start": 1953,
            "end": 2147,
            "label": {}
        },
        {
            "ix": "4-1521_v1_30@8",
            "content": "It is worth noting that among all human transcript pairs in which both transcripts belong to the same gene, the median length ratio is 1.85, and for one third of such pairs the longer isoform is less than 38% longer than the shorter one (see Data set 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_30",
            "start": 2149,
            "end": 2403,
            "label": {}
        },
        {
            "ix": "4-1521_v1_31@0",
            "content": "Figure 3 (sim2).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_31",
            "start": 0,
            "end": 15,
            "label": {}
        },
        {
            "ix": "4-1521_v1_33@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_33",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "4-1521_v1_35@0",
            "content": "Table 1 (sim1).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_35",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "4-1521_v1_37@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_37",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "4-1521_v1_38@0",
            "content": "In this article, we have contrasted transcript- and gene-resolution abundance estimation and statistical inference, and illustrated that gene-level results are more accurate, powerful and interpretable than transcript-level results.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_38",
            "start": 0,
            "end": 231,
            "label": {}
        },
        {
            "ix": "4-1521_v1_38@1",
            "content": "Not surprisingly, however, accurate transcript-level estimation and inference plays an important role in deriving appropriate gene-level results, and it is therefore imperative to continue improving abundance estimation and inference methods applicable to individual transcripts, since misestimation can propagate to the gene level.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_38",
            "start": 233,
            "end": 564,
            "label": {}
        },
        {
            "ix": "4-1521_v1_38@2",
            "content": "We have shown that when testing for changes in overall gene expression (DGE), traditional gene counting approaches may lead to an inflated false discovery rate compared to methods aggregating transcript-level TPM values or incorporating correction factors derived from these, for genes where the relative isoform usage differs between the compared conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_38",
            "start": 566,
            "end": 924,
            "label": {}
        },
        {
            "ix": "4-1521_v1_38@3",
            "content": "These correction factors can be calculated from the output of transcript abundance programs, using e.g., the provided R package ( tximport ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_38",
            "start": 926,
            "end": 1066,
            "label": {}
        },
        {
            "ix": "4-1521_v1_38@4",
            "content": "It is important to note that the average transcript length offsets must account for the differences in transcript usage between the samples and thus using (sample-independent) exon-union gene lengths will not improve performance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_38",
            "start": 1068,
            "end": 1296,
            "label": {}
        },
        {
            "ix": "4-1521_v1_39@0",
            "content": "All evaluated counting approaches gave comparable results for genes where DTU was not present.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_39",
            "start": 0,
            "end": 93,
            "label": {}
        },
        {
            "ix": "4-1521_v1_39@1",
            "content": "Thus, the extent of the FDR inflation in experimental data depends on the extent of DTU between the compared conditions; notably, our simulation introduced rather extreme levels of DTU, hence the inflated FDR, and the difference between the approaches was considerably smaller in real data sets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_39",
            "start": 95,
            "end": 389,
            "label": {}
        },
        {
            "ix": "4-1521_v1_39@2",
            "content": "Recent studies have also shown that many genes express mainly one, dominant isoform <REF-25> and for such genes, we expect that simple gene counting will work well.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_39",
            "start": 391,
            "end": 554,
            "label": {}
        },
        {
            "ix": "4-1521_v1_40@0",
            "content": "Our results highlight the importance of correctly specifying the question of interest before selecting a statistical approach.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_40",
            "start": 0,
            "end": 125,
            "label": {}
        },
        {
            "ix": "4-1521_v1_40@1",
            "content": "Summarization of abundance estimates at the gene level before performing the statistical testing should be the method of choice if the interest is in finding changes in the overall transcriptional output of a gene.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_40",
            "start": 127,
            "end": 340,
            "label": {}
        },
        {
            "ix": "4-1521_v1_40@2",
            "content": "However, it is suboptimal if the goal is to identify genes for which at least one of the transcripts show differences in transcriptional output, since it may miss genes where two transcripts change in opposite directions, or where a lowly expressed transcript changes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_40",
            "start": 342,
            "end": 609,
            "label": {}
        },
        {
            "ix": "4-1521_v1_40@3",
            "content": "For gene-level detection of DTE (that is, whether any transcript showed a change in expression between the conditions), statistical testing applied to aggregated gene counts led to reduced power and slightly inflated FDR compared to performing the statistical test on the transcript level and aggregating results within genes ( Supplementary Figure 5 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_40",
            "start": 611,
            "end": 963,
            "label": {}
        },
        {
            "ix": "4-1521_v1_40@4",
            "content": "Statistical inference on aggregated transcript TPMs (scaledTPM) showed low power for detecting changes that did not affect the overall transcriptional output of the gene, as expected.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_40",
            "start": 965,
            "end": 1147,
            "label": {}
        },
        {
            "ix": "4-1521_v1_40@5",
            "content": "An alternative to DTE analysis, for potential improved interpretability, is to perform a combination of DGE and DTU analyses, both resulting in gene-level inferences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_40",
            "start": 1149,
            "end": 1314,
            "label": {}
        },
        {
            "ix": "4-1521_v1_40@6",
            "content": "Table 2 summarizes our results and give suggested workflows for the different types of analyses we have considered.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_40",
            "start": 1316,
            "end": 1430,
            "label": {}
        },
        {
            "ix": "4-1521_v1_41@0",
            "content": "Table 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_41",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "4-1521_v1_43@0",
            "content": "Of course, there may be situations where a direct transcript-level analysis is appropriate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_43",
            "start": 0,
            "end": 90,
            "label": {}
        },
        {
            "ix": "4-1521_v1_43@1",
            "content": "For example, in a cancer setting where a specific deleterious splice variant is of interest (e.g., AR-V7 in prostate cancer <REF-26> ), inferences directly at the transcript level may be preferred.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_43",
            "start": 92,
            "end": 288,
            "label": {}
        },
        {
            "ix": "4-1521_v1_43@2",
            "content": "However, while this may be preferred for individual known transcripts, transcriptome-wide differential expression analyses may not be warranted, given the associated multiple testing cost.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_43",
            "start": 290,
            "end": 477,
            "label": {}
        },
        {
            "ix": "4-1521_v1_44@0",
            "content": "Finally, we note that estimation at the gene level can reduce the problem of technical biases on expression levels and unidentifiable estimation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_44",
            "start": 0,
            "end": 144,
            "label": {}
        },
        {
            "ix": "4-1521_v1_44@1",
            "content": "Current methods for transcript-level quantification (e.g., Cufflinks , RSEM , Salmon , kallisto ) do not correct for amplification bias on fragments, which can lead to many estimation errors, such as expression being attributed to the wrong isoform <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_44",
            "start": 146,
            "end": 404,
            "label": {}
        },
        {
            "ix": "4-1521_v1_44@2",
            "content": "Non-uniform coverage from amplification bias or from position bias (3’ coverage bias from poly-(A) selection) can result in unidentifiable transcript-level estimation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_44",
            "start": 406,
            "end": 572,
            "label": {}
        },
        {
            "ix": "4-1521_v1_44@3",
            "content": "Such errors and estimation problems are minimized when summarizing expression to the gene level.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_44",
            "start": 574,
            "end": 669,
            "label": {}
        },
        {
            "ix": "4-1521_v1_45@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_45",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "4-1521_v1_46@0",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2015 Soneson C et al.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_46",
            "start": 0,
            "end": 131,
            "label": {}
        },
        {
            "ix": "4-1521_v1_47@0",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_47",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "4-1521_v1_48@0",
            "content": "F1000Research : Data set 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_48",
            "start": 0,
            "end": 26,
            "label": {}
        },
        {
            "ix": "4-1521_v1_48@1",
            "content": "10.5256/f1000research.7563.d109328",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_48",
            "start": 28,
            "end": 61,
            "label": {}
        },
        {
            "ix": "4-1521_v1_49@0",
            "content": "F1000Research : Data set 2. 10.5256/f1000research.7563.d109329",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_49",
            "start": 0,
            "end": 61,
            "label": {}
        },
        {
            "ix": "4-1521_v1_50@0",
            "content": "F1000Research : Data set 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_50",
            "start": 0,
            "end": 26,
            "label": {}
        },
        {
            "ix": "4-1521_v1_50@1",
            "content": "10.5256/f1000research.7563.d109330",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_50",
            "start": 28,
            "end": 61,
            "label": {}
        },
        {
            "ix": "4-1521_v1_51@0",
            "content": "F1000Research : Data set 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_51",
            "start": 0,
            "end": 26,
            "label": {}
        },
        {
            "ix": "4-1521_v1_51@1",
            "content": "10.5256/f1000research.7563.d109331",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_51",
            "start": 28,
            "end": 61,
            "label": {}
        },
        {
            "ix": "4-1521_v1_52@0",
            "content": "F1000Research : Data set 5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_52",
            "start": 0,
            "end": 26,
            "label": {}
        },
        {
            "ix": "4-1521_v1_52@1",
            "content": "10.5256/f1000research.7563.d109332",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_52",
            "start": 28,
            "end": 61,
            "label": {}
        },
        {
            "ix": "4-1521_v1_53@0",
            "content": "F1000Research : Data set 6.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_53",
            "start": 0,
            "end": 26,
            "label": {}
        },
        {
            "ix": "4-1521_v1_53@1",
            "content": "10.5256/f1000research.7563.d109333",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_53",
            "start": 28,
            "end": 61,
            "label": {}
        },
        {
            "ix": "4-1521_v1_54@0",
            "content": "Software availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_54",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "4-1521_v1_55@0",
            "content": "Software access",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_55",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "4-1521_v1_56@0",
            "content": "https://github.com/mikelove/tximport",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_56",
            "start": 0,
            "end": 35,
            "label": {}
        },
        {
            "ix": "4-1521_v1_57@0",
            "content": "Source code as at the time of publication",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_57",
            "start": 0,
            "end": 40,
            "label": {}
        },
        {
            "ix": "4-1521_v1_58@0",
            "content": "https://github.com/F1000Research/tximport",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_58",
            "start": 0,
            "end": 40,
            "label": {}
        },
        {
            "ix": "4-1521_v1_59@0",
            "content": "Archived source code as at the time of publication",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_59",
            "start": 0,
            "end": 49,
            "label": {}
        },
        {
            "ix": "4-1521_v1_60@0",
            "content": "http://dx.doi.org/10.5281/Zenodo.35123",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_60",
            "start": 0,
            "end": 37,
            "label": {}
        },
        {
            "ix": "4-1521_v1_61@0",
            "content": "Software license",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_61",
            "start": 0,
            "end": 15,
            "label": {}
        },
        {
            "ix": "4-1521_v1_62@0",
            "content": "tximport is released under a GNU Public License (GPL).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_62",
            "start": 0,
            "end": 53,
            "label": {}
        },
        {
            "ix": "4-1521_v1_63@0",
            "content": "<REF-1> Liao Y Smyth GK Shi W : featureCounts: an efficient general purpose program for assigning sequence reads to genomic features. Bioinformatics. 2014 ; 30 ( 7 ): 923 – 30 . 24227677 10.1093/bioinformatics/btt656",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_63",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "4-1521_v1_64@0",
            "content": "<REF-2> Anders S Pyl PT Huber W : HTSeq - a Python framework to work with high-throughput sequencing data. Bioinformatics. 2015 ; 31 ( 2 ): 166 – 169 . 25260700 10.1093/bioinformatics/btu638 4287950",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_64",
            "start": 0,
            "end": 197,
            "label": {}
        },
        {
            "ix": "4-1521_v1_65@0",
            "content": "<REF-3> Trapnell C Roberts A Goff L : Differential gene and transcript expression analysis of RNA-seq experiments with TopHat and Cufflinks. Nat Protoc. 2012 ; 7 ( 3 ): 562 – 78 . 22383036 10.1038/nprot.2012.016 3334321",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_65",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "4-1521_v1_66@0",
            "content": "<REF-4> Li B Dewey CN : RSEM: accurate transcript quantification from RNA-Seq data with or without a reference genome. BMC Bioinformatics. 2011 ; 12 : 323 . 21816040 10.1186/1471-2105-12-323 3163565",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_66",
            "start": 0,
            "end": 197,
            "label": {}
        },
        {
            "ix": "4-1521_v1_67@0",
            "content": "<REF-5> Glaus P Honkela A Rattray M : Identifying differentially expressed transcripts from RNA-seq data with biological variation. Bioinformatics. 2012 ; 28 ( 13 ): 1721 – 1728 . 22563066 10.1093/bioinformatics/bts260 3381971",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_67",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "4-1521_v1_68@0",
            "content": "<REF-6> Bray N Pimentel H Melsted P : Near-optimal RNA-Seq quantification. arXiv:1505.02710 . 2015 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_68",
            "start": 0,
            "end": 116,
            "label": {}
        },
        {
            "ix": "4-1521_v1_69@0",
            "content": "<REF-7> Patro R Duggal G Kingsford C : Accurate, fast, and model-aware transcript expression quantification with Salmon. bioRxiv. 2015 . 10.1101/021592",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_69",
            "start": 0,
            "end": 150,
            "label": {}
        },
        {
            "ix": "4-1521_v1_70@0",
            "content": "<REF-8> Mortazavi A Williams BA McCue K : Mapping and quantifying mammalian transcriptomes by RNA-Seq. Nat Methods. 2008 ; 5 ( 7 ): 621 – 628 . 18516045 10.1038/nmeth.1226",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_70",
            "start": 0,
            "end": 170,
            "label": {}
        },
        {
            "ix": "4-1521_v1_71@0",
            "content": "<REF-9> Trapnell C Williams BA Pertea G : Transcript assembly and quantification by RNA-Seq reveals unannotated transcripts and isoform switching during cell differentiation. Nat Biotechnol. 2010 ; 28 ( 5 ): 511 – 515 . 20436464 10.1038/nbt.1621 3146043",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_71",
            "start": 0,
            "end": 252,
            "label": {}
        },
        {
            "ix": "4-1521_v1_72@0",
            "content": "<REF-10> Wagner GP Kin K Lynch VJ : Measurement of mRNA abundance using RNA-seq data: RPKM measure is inconsistent among samples. Theory Biosci. 2012 ; 131 ( 4 ): 281 – 285 . 22872506 10.1007/s12064-012-0162-3",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_72",
            "start": 0,
            "end": 208,
            "label": {}
        },
        {
            "ix": "4-1521_v1_73@0",
            "content": "<REF-11> Love MI Huber W Anders S : Moderated estimation of fold change and dispersion for RNA-seq data with DESeq2. Genome Biol. 2014 ; 15 ( 12 ): 550 . 25516281 10.1186/s13059-014-0550-8 4302049",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_73",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "4-1521_v1_74@0",
            "content": "<REF-12> Robinson MD McCarthy DJ Smyth GK : edgeR: a Bioconductor package for differential expression analysis of digital gene expression data. Bioinformatics. 2010 ; 26 ( 1 ): 139 – 40 . 19910308 10.1093/bioinformatics/btp616 2796818",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_74",
            "start": 0,
            "end": 233,
            "label": {}
        },
        {
            "ix": "4-1521_v1_75@0",
            "content": "<REF-13> Ritchie ME Phipson B Wu D : limma powers differential expression analyses for RNA-sequencing and microarray studies. Nucleic Acids Res. 2015 ; 43 ( 7 ): e47 . 25605792 10.1093/nar/gkv007 4402510",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_75",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "4-1521_v1_76@0",
            "content": "<REF-14> Bottomly D Walter NA Hunter JE : Evaluating gene expression in C57BL/6J and DBA/2J mouse striatum using RNA-Seq and microarrays. PLoS One. 2011 ; 6 ( 3 ): e17820 . 21455293 10.1371/journal.pone.0017820 3063777",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_76",
            "start": 0,
            "end": 217,
            "label": {}
        },
        {
            "ix": "4-1521_v1_77@0",
            "content": "<REF-15> Yang S Marín-Juez R Meijer AH : Common and specific downstream signaling targets controlled by Tlr2 and Tlr5 innate immune signaling in zebrafish. BMC Genomics. 2015 ; 16 ( 1 ): 547 . 26208853 10.1186/s12864-015-1740-9 4514945",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_77",
            "start": 0,
            "end": 234,
            "label": {}
        },
        {
            "ix": "4-1521_v1_78@0",
            "content": "<REF-16> Currais A Goldberg J Farrokhi C : A comprehensive multiomics approach toward understanding the relationship between aging and dementia. Aging (Albany. NY). 2015 ; 7 ( 11 ): 937 – 955 . 26564964",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_78",
            "start": 0,
            "end": 201,
            "label": {}
        },
        {
            "ix": "4-1521_v1_79@0",
            "content": "<REF-17> Chang AJ Ortega FE Riegler J : Oxygen regulation of breathing through an olfactory receptor activated by lactate. Nature. 2015 ; 527 ( 7577 ): 240 – 244 . 26560302 10.1038/nature15721",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_79",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "4-1521_v1_80@0",
            "content": "<REF-18> Soneson C Matthes KL Nowicka M : Differential transcript usage from RNA-seq data: isoform pre-filtering improves performance of count-based methods. bioRxiv. 2015 . 10.1101/025387",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_80",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "4-1521_v1_81@0",
            "content": "<REF-19> Kanitz A Gypas F Gruber AJ : Comparative assessment of methods for the computational inference of transcript isoform abundance from RNA-seq data. Genome Biol. 2015 ; 16 ( 1 ): 150 . 26201343 10.1186/s13059-015-0702-5 4511015",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_81",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "4-1521_v1_82@0",
            "content": "<REF-20> Robert C Watson M : Errors in RNA-Seq quantification affect genes of relevance to human disease. Genome Biol. 2015 ; 16 : 177 . 26335491 10.1186/s13059-015-0734-x 4558956",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_82",
            "start": 0,
            "end": 178,
            "label": {}
        },
        {
            "ix": "4-1521_v1_83@0",
            "content": "<REF-21> Anders S Reyes A Huber W : Detecting differential usage of exons from RNA-seq data. Genome Res. 2012 ; 22 ( 10 ): 2008 – 17 . 22722343 10.1101/gr.133744.111 3460195",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_83",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "4-1521_v1_84@0",
            "content": "<REF-22> Lawrence M Huber W Pagès H : Software for computing and annotating genomic ranges. PLoS Comput Biol. 2013 ; 9 ( 8 ): e1003118 . 23950696 10.1371/journal.pcbi.1003118 3738458",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_84",
            "start": 0,
            "end": 181,
            "label": {}
        },
        {
            "ix": "4-1521_v1_85@0",
            "content": "<REF-23> Trapnell C Hendrickson DG Sauvageau M : Differential analysis of gene regulation at transcript resolution with RNA-seq. Nat Biotechnol. 2013 ; 31 ( 1 ): 46 – 53 . 23222703 10.1038/nbt.2450 3869392",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_85",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "4-1521_v1_86@0",
            "content": "<REF-24> Zhao S Xi L Zhang B : Union Exon Based Approach for RNA-Seq Gene Quantification: To Be or Not to Be? PLoS One. 2015 ; 10 ( 11 ): e0141910 . 26559532 10.1371/journal.pone.0141910 4641603",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_86",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "4-1521_v1_87@0",
            "content": "<REF-25> Gonzàlez-Porta M Frankish A Rung J : Transcriptome analysis of human tissues and cell lines reveals one dominant transcript per gene. Genome Biol. 2013 ; 14 ( 7 ): R70 . 23815980 10.1186/gb-2013-14-7-r70 4053754",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_87",
            "start": 0,
            "end": 219,
            "label": {}
        },
        {
            "ix": "4-1521_v1_88@0",
            "content": "<REF-26> Antonarakis ES Lu C Wang H : AR-V7 and resistance to enzalutamide and abiraterone in prostate cancer. N Engl J Med. 2014 ; 371 ( 11 ): 1028 – 38 . 25184630 10.1056/NEJMoa1315815 4201502",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_88",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "4-1521_v1_89@0",
            "content": "<REF-27> Love MI Hogenesch JB Irizarry RA : Modeling of RNA-seq fragment sequence bias reduces systematic errors in transcript abundance estimation. bioRxiv. 2015 . 10.1101/025767",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-1521_v1_89",
            "start": 0,
            "end": 178,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_1",
            "tgt_ix": "4-1521_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_3",
            "tgt_ix": "4-1521_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_3",
            "tgt_ix": "4-1521_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_3",
            "tgt_ix": "4-1521_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_3",
            "tgt_ix": "4-1521_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_3",
            "tgt_ix": "4-1521_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_9",
            "tgt_ix": "4-1521_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_9",
            "tgt_ix": "4-1521_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_9",
            "tgt_ix": "4-1521_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_9",
            "tgt_ix": "4-1521_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_9",
            "tgt_ix": "4-1521_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_9",
            "tgt_ix": "4-1521_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_9",
            "tgt_ix": "4-1521_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_17",
            "tgt_ix": "4-1521_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_17",
            "tgt_ix": "4-1521_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_19",
            "tgt_ix": "4-1521_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_21",
            "tgt_ix": "4-1521_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_21",
            "tgt_ix": "4-1521_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_23",
            "tgt_ix": "4-1521_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_21",
            "tgt_ix": "4-1521_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_26",
            "tgt_ix": "4-1521_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_26",
            "tgt_ix": "4-1521_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_26",
            "tgt_ix": "4-1521_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_26",
            "tgt_ix": "4-1521_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_26",
            "tgt_ix": "4-1521_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_31",
            "tgt_ix": "4-1521_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_26",
            "tgt_ix": "4-1521_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_33",
            "tgt_ix": "4-1521_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_26",
            "tgt_ix": "4-1521_v1_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_35",
            "tgt_ix": "4-1521_v1_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_37",
            "tgt_ix": "4-1521_v1_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_37",
            "tgt_ix": "4-1521_v1_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_37",
            "tgt_ix": "4-1521_v1_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_37",
            "tgt_ix": "4-1521_v1_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_41",
            "tgt_ix": "4-1521_v1_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_37",
            "tgt_ix": "4-1521_v1_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_37",
            "tgt_ix": "4-1521_v1_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_45",
            "tgt_ix": "4-1521_v1_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_45",
            "tgt_ix": "4-1521_v1_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_45",
            "tgt_ix": "4-1521_v1_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_45",
            "tgt_ix": "4-1521_v1_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_45",
            "tgt_ix": "4-1521_v1_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_45",
            "tgt_ix": "4-1521_v1_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_45",
            "tgt_ix": "4-1521_v1_52",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_45",
            "tgt_ix": "4-1521_v1_53",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_54",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_54",
            "tgt_ix": "4-1521_v1_55",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_55",
            "tgt_ix": "4-1521_v1_56",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_54",
            "tgt_ix": "4-1521_v1_57",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_57",
            "tgt_ix": "4-1521_v1_58",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_54",
            "tgt_ix": "4-1521_v1_59",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_59",
            "tgt_ix": "4-1521_v1_60",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_54",
            "tgt_ix": "4-1521_v1_61",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_61",
            "tgt_ix": "4-1521_v1_62",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_1",
            "tgt_ix": "4-1521_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_2",
            "tgt_ix": "4-1521_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_3",
            "tgt_ix": "4-1521_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_6",
            "tgt_ix": "4-1521_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_7",
            "tgt_ix": "4-1521_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_8",
            "tgt_ix": "4-1521_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_9",
            "tgt_ix": "4-1521_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_11",
            "tgt_ix": "4-1521_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_12",
            "tgt_ix": "4-1521_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_13",
            "tgt_ix": "4-1521_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_14",
            "tgt_ix": "4-1521_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_15",
            "tgt_ix": "4-1521_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_16",
            "tgt_ix": "4-1521_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_17",
            "tgt_ix": "4-1521_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_19",
            "tgt_ix": "4-1521_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_20",
            "tgt_ix": "4-1521_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_21",
            "tgt_ix": "4-1521_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_22",
            "tgt_ix": "4-1521_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_23",
            "tgt_ix": "4-1521_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_24",
            "tgt_ix": "4-1521_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_25",
            "tgt_ix": "4-1521_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_26",
            "tgt_ix": "4-1521_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_27",
            "tgt_ix": "4-1521_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_28",
            "tgt_ix": "4-1521_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_29",
            "tgt_ix": "4-1521_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_31",
            "tgt_ix": "4-1521_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_32",
            "tgt_ix": "4-1521_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_33",
            "tgt_ix": "4-1521_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_34",
            "tgt_ix": "4-1521_v1_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_35",
            "tgt_ix": "4-1521_v1_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_36",
            "tgt_ix": "4-1521_v1_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_37",
            "tgt_ix": "4-1521_v1_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_38",
            "tgt_ix": "4-1521_v1_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_39",
            "tgt_ix": "4-1521_v1_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_40",
            "tgt_ix": "4-1521_v1_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_41",
            "tgt_ix": "4-1521_v1_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_42",
            "tgt_ix": "4-1521_v1_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_43",
            "tgt_ix": "4-1521_v1_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_44",
            "tgt_ix": "4-1521_v1_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_45",
            "tgt_ix": "4-1521_v1_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_46",
            "tgt_ix": "4-1521_v1_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_47",
            "tgt_ix": "4-1521_v1_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_48",
            "tgt_ix": "4-1521_v1_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_49",
            "tgt_ix": "4-1521_v1_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_50",
            "tgt_ix": "4-1521_v1_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_51",
            "tgt_ix": "4-1521_v1_52",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_52",
            "tgt_ix": "4-1521_v1_53",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_53",
            "tgt_ix": "4-1521_v1_54",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_54",
            "tgt_ix": "4-1521_v1_55",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_55",
            "tgt_ix": "4-1521_v1_56",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_56",
            "tgt_ix": "4-1521_v1_57",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_57",
            "tgt_ix": "4-1521_v1_58",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_58",
            "tgt_ix": "4-1521_v1_59",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_59",
            "tgt_ix": "4-1521_v1_60",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_60",
            "tgt_ix": "4-1521_v1_61",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_61",
            "tgt_ix": "4-1521_v1_62",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_8",
            "tgt_ix": "4-1521_v1_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_8",
            "tgt_ix": "4-1521_v1_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_8",
            "tgt_ix": "4-1521_v1_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_22",
            "tgt_ix": "4-1521_v1_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_27",
            "tgt_ix": "4-1521_v1_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_27",
            "tgt_ix": "4-1521_v1_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_29",
            "tgt_ix": "4-1521_v1_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_39",
            "tgt_ix": "4-1521_v1_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_43",
            "tgt_ix": "4-1521_v1_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_44",
            "tgt_ix": "4-1521_v1_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_20",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_22",
            "tgt_ix": "4-1521_v1_24",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_32",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_34",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_36",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_40",
            "tgt_ix": "4-1521_v1_42",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-1521_v1_0",
            "tgt_ix": "4-1521_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_1",
            "tgt_ix": "4-1521_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_2",
            "tgt_ix": "4-1521_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_2",
            "tgt_ix": "4-1521_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_2",
            "tgt_ix": "4-1521_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_2",
            "tgt_ix": "4-1521_v1_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_2",
            "tgt_ix": "4-1521_v1_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_2",
            "tgt_ix": "4-1521_v1_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_3",
            "tgt_ix": "4-1521_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_4",
            "tgt_ix": "4-1521_v1_4@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_5@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_5@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_5",
            "tgt_ix": "4-1521_v1_5@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_6",
            "tgt_ix": "4-1521_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_6",
            "tgt_ix": "4-1521_v1_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_6",
            "tgt_ix": "4-1521_v1_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_7",
            "tgt_ix": "4-1521_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_7",
            "tgt_ix": "4-1521_v1_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_8",
            "tgt_ix": "4-1521_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_9",
            "tgt_ix": "4-1521_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_10",
            "tgt_ix": "4-1521_v1_10@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_17",
            "tgt_ix": "4-1521_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_18",
            "tgt_ix": "4-1521_v1_18@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_19",
            "tgt_ix": "4-1521_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_21",
            "tgt_ix": "4-1521_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_22",
            "tgt_ix": "4-1521_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_22",
            "tgt_ix": "4-1521_v1_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_22",
            "tgt_ix": "4-1521_v1_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_22",
            "tgt_ix": "4-1521_v1_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_22",
            "tgt_ix": "4-1521_v1_22@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_22",
            "tgt_ix": "4-1521_v1_22@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_23",
            "tgt_ix": "4-1521_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_25",
            "tgt_ix": "4-1521_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_25",
            "tgt_ix": "4-1521_v1_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_25",
            "tgt_ix": "4-1521_v1_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_25",
            "tgt_ix": "4-1521_v1_25@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_25",
            "tgt_ix": "4-1521_v1_25@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_26",
            "tgt_ix": "4-1521_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_27",
            "tgt_ix": "4-1521_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_27",
            "tgt_ix": "4-1521_v1_27@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_27",
            "tgt_ix": "4-1521_v1_27@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_27",
            "tgt_ix": "4-1521_v1_27@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_27",
            "tgt_ix": "4-1521_v1_27@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_27",
            "tgt_ix": "4-1521_v1_27@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_28",
            "tgt_ix": "4-1521_v1_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_28",
            "tgt_ix": "4-1521_v1_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_28",
            "tgt_ix": "4-1521_v1_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_29",
            "tgt_ix": "4-1521_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_29",
            "tgt_ix": "4-1521_v1_29@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_29",
            "tgt_ix": "4-1521_v1_29@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_29",
            "tgt_ix": "4-1521_v1_29@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_30@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_30@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_30@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_30@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_30@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_30@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_30",
            "tgt_ix": "4-1521_v1_30@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_31",
            "tgt_ix": "4-1521_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_33",
            "tgt_ix": "4-1521_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_35",
            "tgt_ix": "4-1521_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_37",
            "tgt_ix": "4-1521_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_38",
            "tgt_ix": "4-1521_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_38",
            "tgt_ix": "4-1521_v1_38@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_38",
            "tgt_ix": "4-1521_v1_38@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_38",
            "tgt_ix": "4-1521_v1_38@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_38",
            "tgt_ix": "4-1521_v1_38@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_39",
            "tgt_ix": "4-1521_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_39",
            "tgt_ix": "4-1521_v1_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_39",
            "tgt_ix": "4-1521_v1_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_40",
            "tgt_ix": "4-1521_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_40",
            "tgt_ix": "4-1521_v1_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_40",
            "tgt_ix": "4-1521_v1_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_40",
            "tgt_ix": "4-1521_v1_40@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_40",
            "tgt_ix": "4-1521_v1_40@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_40",
            "tgt_ix": "4-1521_v1_40@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_40",
            "tgt_ix": "4-1521_v1_40@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_41",
            "tgt_ix": "4-1521_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_43",
            "tgt_ix": "4-1521_v1_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_43",
            "tgt_ix": "4-1521_v1_43@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_43",
            "tgt_ix": "4-1521_v1_43@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_44",
            "tgt_ix": "4-1521_v1_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_44",
            "tgt_ix": "4-1521_v1_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_44",
            "tgt_ix": "4-1521_v1_44@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_44",
            "tgt_ix": "4-1521_v1_44@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_45",
            "tgt_ix": "4-1521_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_46",
            "tgt_ix": "4-1521_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_47",
            "tgt_ix": "4-1521_v1_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_48",
            "tgt_ix": "4-1521_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_48",
            "tgt_ix": "4-1521_v1_48@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_49",
            "tgt_ix": "4-1521_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_50",
            "tgt_ix": "4-1521_v1_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_50",
            "tgt_ix": "4-1521_v1_50@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_51",
            "tgt_ix": "4-1521_v1_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_51",
            "tgt_ix": "4-1521_v1_51@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_52",
            "tgt_ix": "4-1521_v1_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_52",
            "tgt_ix": "4-1521_v1_52@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_53",
            "tgt_ix": "4-1521_v1_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_53",
            "tgt_ix": "4-1521_v1_53@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_54",
            "tgt_ix": "4-1521_v1_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_55",
            "tgt_ix": "4-1521_v1_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_56",
            "tgt_ix": "4-1521_v1_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_57",
            "tgt_ix": "4-1521_v1_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_58",
            "tgt_ix": "4-1521_v1_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_59",
            "tgt_ix": "4-1521_v1_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_60",
            "tgt_ix": "4-1521_v1_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_61",
            "tgt_ix": "4-1521_v1_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_62",
            "tgt_ix": "4-1521_v1_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_63",
            "tgt_ix": "4-1521_v1_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_64",
            "tgt_ix": "4-1521_v1_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_65",
            "tgt_ix": "4-1521_v1_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_66",
            "tgt_ix": "4-1521_v1_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_67",
            "tgt_ix": "4-1521_v1_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_68",
            "tgt_ix": "4-1521_v1_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_69",
            "tgt_ix": "4-1521_v1_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_70",
            "tgt_ix": "4-1521_v1_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_71",
            "tgt_ix": "4-1521_v1_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_72",
            "tgt_ix": "4-1521_v1_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_73",
            "tgt_ix": "4-1521_v1_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_74",
            "tgt_ix": "4-1521_v1_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_75",
            "tgt_ix": "4-1521_v1_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_76",
            "tgt_ix": "4-1521_v1_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_77",
            "tgt_ix": "4-1521_v1_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_78",
            "tgt_ix": "4-1521_v1_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_79",
            "tgt_ix": "4-1521_v1_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_80",
            "tgt_ix": "4-1521_v1_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_81",
            "tgt_ix": "4-1521_v1_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_82",
            "tgt_ix": "4-1521_v1_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_83",
            "tgt_ix": "4-1521_v1_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_84",
            "tgt_ix": "4-1521_v1_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_85",
            "tgt_ix": "4-1521_v1_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_86",
            "tgt_ix": "4-1521_v1_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_87",
            "tgt_ix": "4-1521_v1_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_88",
            "tgt_ix": "4-1521_v1_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-1521_v1_89",
            "tgt_ix": "4-1521_v1_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "4-1521_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.7563.1",
        "atype": "method-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Differential analyses for RNA-seq: transcript-level estimates improve gene-level inferences",
        "abstract": "High-throughput sequencing of cDNA (RNA-seq) is used extensively to characterize the transcriptome of cells. Many transcriptomic studies aim at comparing either abundance levels or the transcriptome composition between given conditions, and as a first step, the sequencing reads must be used as the basis for abundance quantification of transcriptomic features of interest, such as genes or transcripts. Several different quantification approaches have been proposed, ranging from simple counting of reads that overlap given genomic regions to more complex estimation of underlying transcript abundances. In this paper, we show that gene-level abundance estimates and statistical inference offer advantages over transcript-level analyses, in terms of performance and interpretability. We also illustrate that while the presence of differential isoform usage can lead to inflated false discovery rates in differential expression analyses on simple count matrices and transcript-level abundance estimates improve the performance in simulated data, the difference is relatively minor in several real data sets. Finally, we provide an R package ( tximport ) to help users integrate transcript-level abundance estimates from common quantification pipelines into count-based statistical inference engines.",
        "contributors": [
            {
                "surname": "Soneson",
                "given-names": "Charlotte"
            },
            {
                "surname": "Love",
                "given-names": "Michael I."
            },
            {
                "surname": "Robinson",
                "given-names": "Mark D."
            }
        ],
        "url": "https://f1000research.com/articles/4-1521/v1/",
        "doc_id": "4-1521",
        "version": 1,
        "ix_counter": 347,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}