{
    "nodes": [
        {
            "ix": "2-180_v1_0",
            "content": "Long term delivery of pulsed magnetic fields does not improve learning or alter dendritic spine density in the mouse hippocampus",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_2",
            "content": "Repetitive transcranial magnetic stimulation (rTMS) is thought to facilitate brain plasticity. However, few studies address anatomical changes following rTMS in relation to behaviour. We delivered 5 weeks of daily pulsed rTMS stimulation to ephrin-A2 -/- and wildtype mice (n=10 per genotype) undergoing a visual learning task and analysed learning performance, as well as spine density, in the dentate gyrus molecular and CA1 pyramidal cell layers in Golgi-stained brain sections. We found that neither learning behaviour, nor hippocampal spine density was affected by long term rTMS. Our negative results highlight the lack of deleterious side effects in normal subjects and are consistent with previous studies suggesting that rTMS has a bigger effect on abnormal or injured brain substrates than on normal/control structures.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_4",
            "content": "Repetitive transcranial stimulation (rTMS) generates electrical currents in the brain by electromagnetic induction and has been shown to induce synaptic plasticity in human and animal models <REF-1> . Importantly, rTMS induces long term potentiation (LTP) in rodent hippocampus in vitro <REF-2> and several sessions of high-frequency rTMS increases the capacity to induce LTP (metaplasticity) compared to untreated controls <REF-3> , <REF-4> . Because rTMS acts on the same plasticity mechanisms as learning and memory, it has been hypothesised that rTMS may serve as a \"priming\" mechanism to facilitate long-term synaptic and structural modifications <REF-5> , <REF-6> . The implication is that repeated rTMS stimulation sets up a \"plastic\" brain state that is conducive to long term functional and structural changes <REF-5> . For this reason, rTMS is being explored in combination with behavioural training tasks to see whether it can be used to prime or improve learning and cognitive performance in humans <REF-7> , <REF-8> . However, the potential mechanisms whereby rTMS might accelerate learning remain unknown.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_5",
            "content": "Declarative and spatial learning tasks are strongly associated with the hippocampus. More specifically, hippocampal dendritic spines have been identified as the likely loci of activity-dependent synaptic plasticity and possible structural correlates of memory and learning <REF-9> , <REF-10> . High dendritic spine density in hippocampal neurons is associated with learning ability and higher performance on cognitive tasks <REF-11> – <REF-14> . Furthermore, LTP and LTD induce structural changes in dendritic spines, with LTP induced electrically or via learning increasing dendritic length and spine density <REF-15> , <REF-16> . Because higher spine density is associated with higher spine mobility and turnover rates <REF-15> , <REF-16> , this measure is thought to reflect a greater capacity for synaptic reorganisation.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_6",
            "content": "To date, the only study to examine changes in dendritic spines after rTMS did so following a single stimulation and showed no change in spine density, although the size of the smallest spines was increased <REF-2> . Therefore, very little has been done to investigate the impact of long term rTMS on spine density in the hippocampus, or how it might interact with the learning process. Given the significant structural changes induced in the mouse visual system following repeated stimulation sessions, we hypothesised that a similar long-term rTMS regime in combination with a hippocampal learning task, would rescue impaired learning strategies previously found in ephrin-A2 -/- mice <REF-17> and alter spine density in the hippocampus.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_7",
            "content": "We delivered 5 weeks of daily pulsed rTMS stimulation to ephrin-A2 -/- and wildtype mice undergoing a visual learning task and analysed learning performance, as well as spine density in the dentate gyrus molecular and CA1 pyramidal cell layers in Golgi-stained material. Although the mice learned the task, their performance remained suboptimal due to lack of motivation to obtain food rewards through insufficient food restriction <REF-18> and neither learning behaviour, nor hippocampal spine density were affected by long term rTMS. Our negative results are consistent with previous data showing that rTMS has a selective effect on abnormal or injured brain circuitry <REF-19> , and the lack of deleterious side effects observed in normal human subjects <REF-8> , <REF-20> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_8",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_9",
            "content": "Animals",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_10",
            "content": "This experiment used 10 wildtype (C57Bl/6J) and 10 ephrin-A2 -/- knockout mice, with equal number of males and females. Wildtype mice were purchased from Animal Research Centre (Canning Vale, WA, Australia). Ephrin-A2 -/- mice were a generous gift from David Feldheim <REF-21> and carry a homozygous null mutation of the ephrin-A2 gene. Ephrin-A2 -/- mice were bred from heterozygous parents at the Biomedical Research Facility (The University of Western Australia) and backcrossed for >10 generations on a C57Bl/6J background. Mice were genotyped at weaning, as described previously <REF-21> . Mice were age matched, aged 8–10 weeks old when commencing the experiment. For the duration of the study, mice were kept in standard caging in a controlled environment (12/12 light/dark cycle; temperature 22°C±2°C, separated into cages with clear plastic walls (17 cm x 19 cm base, 16 cm high) based on sex and genotype (2–4 per cage)). Food restriction began two days prior to commencing training. This aimed to reduce mice to 90% of their free-feeding body weight. Mice were weighed daily and food intake adjusted using a daily-based controlled diet to reach and maintain target body weights and ensure animals remained healthy. Water was available ad libitum throughout the experiment. All procedures in this study were conducted in accordance with US NIH guidelines and approved by The University of Western Australia Animal Ethics Committee.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_11",
            "content": "Apparatus and procedure",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_12",
            "content": "Mice completed a visual discrimination task in two phases. Mice were initially rewarded for one stimulus (‘learning phase’). After mice learned the task (defined as 75% correct responses for three consecutive days), the rewarded stimulus was switched to the opposite, previously incorrect stimulus (‘reverse phase’). rTMS was applied (as described below) for 10 minutes daily immediately following the task during the reverse phase. Because most mice in the study failed to learn the reverse task, we decided to focus on the relationship between rTMS and dendritic spine density, therefore, mice were terminally anesthetised with pentobarbitone (Lethabarb, Virbac Australia, 160 mg/kg, i.p.) 24 hours after 35 days of rTMS so that all mice received the same amount of stimulation.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_13",
            "content": "Visual discrimination task",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_14",
            "content": "The visual discrimination task was carried out using a Y-maze fitted into a 50 cm 2 box, with visual stimuli at each end of the Y maze arms (25 cm long) <REF-18> . Stimuli consisted of two 5 cm 2 laminated black and white striped cards at 0.37 cycles per degree oriented horizontally or vertically. Both genotypes are capable of distinguishing this spatial frequency <REF-22> . The position of the horizontal and vertical stimuli (left vs. right maze arm) was randomly altered across 30 trials with the constraint of equal number of trials in right and left arms. The 30 trial schedule changed each day, repeating every seven days. Random allocation determined which stimulus was rewarded in the learning phase, with the constraint that half the mice in each genotype received rewards for the horizontal and half for vertical. The rewarded stimulus was also counter-balanced across cage groups (i.e. mice housed together were rewarded for opposite stimuli) and sex. Inferential statistics confirmed no significant performance differences between sexes or stripe orientation first rewarded ( Data File ). Mice were placed at the start of the Y-maze, and received a peanut butter reward immediately after approaching the correct stimulus. If mice did not approach a stimulus after 30 seconds, the trial was deemed a non-response (included in analyses as an incorrect response). Each mouse completed 30 trials per day, in a single session. The reverse phase commenced the day after mice reached criterion performance (75% correct for three consecutive days). In the reverse phase the opposite, previously incorrect stimulus was rewarded. All other aspects of the reverse task were identical to the initial learning phase.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_15",
            "content": "rTMS application",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_16",
            "content": "To deliver rTMS, we built a small coil created for mice (0.25 mm copper wire (Jaycar, Australia) 300 windings, 16 Ω, outer diameter 8 mm) <REF-19> . The coil was designed to ensure a similar coil-to brain ratio as is used for induction of focal electric fields in humans <REF-23> and was driven by an electromagnetic pulse generator (Global Energy Medicine, Australia) that delivered a magnetic field of 10 mT. This relatively low intensity was imposed by the constraints of the coil’s size but had the benefit of allowing us to evaluate the effects of stimulation without the confounding factors of stimulation-induced movement or the use of anaesthetic or restraint, with their associated changes to neuronal excitability and circulating stress hormones <REF-24> . Furthermore, low intensity magnetic fields are clinically relevant for two reasons. Firstly, in humans, fields in the millitesla range delivered to the brain induce analgesia <REF-25> – <REF-27> , and alleviate depression <REF-28> . Secondly, even though traditional rTMS is considered to be focal, magnetic fields of lower intensity are delivered outside of the focal area, raising the possibility that low intensity stimulation may be contributing to therapeutic effects by acting on interconnected brain regions.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_17",
            "content": "We chose a complex pattern of stimulation because it has been shown to induce structural changes in mice <REF-19> (59.9-ms trains of 20 pulses at 3 different frequencies as follows: 1 min warm-up at 6.71 Hz, 8 min treatment at 10.1 Hz, and 1 min cool down at 6.26 Hz. The pulse duration was 200 µs, which is within the range used in human rTMS. A Hall device probe (Jaycar, Australia inserted into different brain regions of a euthanized mouse estimated that the dorsal hippocampus received roughly 6 mT. The surface temperature of the coil was measured after 10 min of stimulation and did not exceed 35°C.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_18",
            "content": "As mice had completed the initial learning phase of the visual discrimination task before commencing rTMS they were accustomed to handling and remained relatively still without restraint. This allowed the stimulation coil to be held by the experimenter above, but not in contact with, the top of the animal’s head for reproducible rTMS delivery in the alert animal (as for cat studies <REF-29> ). Consistent with the low intensity of the magnetic field, mice did not display any head-eye or gross motor movements, nor altered behaviour in response to the stimulation. Sham stimulation involved the same procedure but with the stimulator switched off. This control was chosen as our coil did not produce any audible sound <REF-19> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_19",
            "content": "Golgi staining",
            "ntype": "title",
            "meta": {
                "section": "2.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_20",
            "content": "Terminally anesthetised mice were transcardially perfused with 4% paraformaldehyde (Sigma Aldrich; Montana USA); Right hemispheres of brains underwent a silver impregnation staining protocol, and a Golgi stain (according to manufacturer’s instructions: FD NeuroTechnologies, Maryland, USA), which allows the visualisation of morphology on a subset of neurons <REF-30> . Briefly, hemispheres were incubated in the dark in solutions A+B for 8 days with a change into fresh solution after the first 24 hours. Hemispheres were then incubated in solution C for 4 days with a change into fresh solution after 2 days. The impregnated hemispheres were then cryosectioned at 100 µm on a Leica Cryostat CM1900 at -19°C, mounted onto glass slides (Thermo Fisher Scientific, Australia) subbed with 0.5% gelatin (Sigma Aldrich, Montana USA). Sections were dried in the dark for 2–7 days, washed in distilled water and developed in solution D+E for 10 minutes. Sections were dehydrated in increasing concentrations of ethanol and mounted in Entilin (Merck, Darmastadt Germany).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_21",
            "content": "Imaging and analysis",
            "ntype": "title",
            "meta": {
                "section": "2.6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_22",
            "content": "Slides were analysed by a researcher blinded to stimulation condition and genotype. Sections were photographed by an Olympus DP70 digital camera at a 4× objective zoom, which encompassed the entire section. We analysed dendrites that could definitively be attributed to cells in the CA1 pyramidal and the molecular dentate layer of the hippocampus because dendritic spines on these cells have previously shown changes in dendritic spine density in response to various interventions <REF-31> . Dendrites were deemed suitable for analysis if they had a relatively flat orientation and were uniformly and strongly stained. Photographs of the dendritic arbour were taken throughout multiple planes ensuring the entire arbour was photographed in focus for later image analysis. Between 2 and 12 cells were analysed per animal and values averaged within animals for statistical analysis. Due to variability in Golgi staining, the number of dendrites counted varied between regions (CA1 pyramidal layer number of cells, Mean = 5; dentate molecular layer, Mean = 4.4).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_23",
            "content": "The images for each dendritic arbour were combined into a single image, using the Image J plug-in \"Stack Focuser\" and dendrite length and number of dendritic spines counted using the Image J (\"Cell counter\" plug-in). The number of spines and the dendrite length data were then used to calculate a dendritic spine density value, defined as the number of spines per unit length (10 µm).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_24",
            "content": "Statistical analysis",
            "ntype": "title",
            "meta": {
                "section": "2.7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_25",
            "content": "We examined the effect of long-term rTMS on reverse learning performance in ephrin-A2 -/- and wildtype mice. Inferential statistics confirmed no pre-existing differences between groups in the learning phase, before commencing rTMS (data not shown). The first day of reverse phase training was excluded from analyses as rTMS commenced after this training session. Two mice reached the learning criterion in the reverse phase and were terminally anesthetised before 35 days (one wildtype and one ephrin-A2 -/- , both received sham stimulation (negative/handling controls)) thus there was non-random reduction in sample size over time, precluding use of daily performance measures in statistical analyses. To overcome this problem, data were divided into three blocks for each subject, with one third of total days training included in each block, reflecting early, middle, and late stages of the reverse learning phase. Mean percentage correct was analysed by a two-way mixed ANOVA to assess differences between stimulation conditions (rTMS vs. sham) and between genotypes (ephrin-A2 -/- vs. wildtype) and changes over time (changes between early, middle and late blocks). As circuitry abnormalities and connections between measured hippocampal regions have not been characterised in ephrin-A2 -/- mice, it is unknown whether these measures should be considered independent for statistical analyses. Accordingly, a MANOVA was conducted to assess effects of stimulation condition (rTMS vs. sham) and genotype (wildtype vs. ephrin-A2 -/- ) on dendritic spine densities in both regions. Pillai’s Trace ( V ) was used as the multivariate test statistic. Follow-up ANOVAs were conducted separately for each region, testing the same factors as used in the MANOVA. The F-test statistic ( F ) and probability ( p ) values are reported for each ANOVA. When the assumption of sphericity was violated degrees of freedom were adjusted with Greenhouse-Geisser correction. Data were analysed using SPSS statistics software (IBM Corporation, New York, USA, v.20).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_26",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_27",
            "content": "rTMS had no significant effect on reverse learning performance",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_28",
            "content": "As shown in Figure 1 , groups had similar means in each block, with no significant difference between rTMS and sham, F (1, 16) = 0.28, p = 0.60, nor between genotypes, F (1, 16) = 0.86, p = 0.37, and no significant interactions across blocks (all p values >0.05). Within groups, the percentage correct increased significantly across blocks, indicating that mice adjusted to the rule reversal and successfully learned the task although this was not to the desired criterion ( F (1.43, 22.87) = 71.80, p < 0.001 (Greenhouse-Geisser corrected)).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_29",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Mean percentage correct in a reverse-learning task for wildtype and ephrin-A2 -/- mice receiving daily rTMS. Early, middle (mid) and late blocks were delineated by the first, second and final third of total number of days training in the reverse-learning task. Within groups, scores increased significantly between blocks ( p <0.001), but there were no significant differences between rTMS and sham or between genotypes ( p values >0.05; ANOVA). Error bars = SEM.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/2167/700213a4-6660-44e4-b944-4d2a9696b899_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_30",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Mean percentage correct in a reverse-learning task for wildtype and ephrin-A2 <sup>-/-</sup> mice receiving daily rTMS.</title> <p>Early, middle (mid) and late blocks were delineated by the first, second and final third of total number of days training in the reverse-learning task. Within groups, scores increased significantly between blocks ( <italic>p</italic> &lt;0.001), but there were no significant differences between rTMS and sham or between genotypes ( <italic>p</italic> values &gt;0.05; ANOVA). Error bars = SEM.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/2167/700213a4-6660-44e4-b944-4d2a9696b899_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Mean percentage correct in a reverse-learning task for wildtype and ephrin-A2 -/- mice receiving daily rTMS. Early, middle (mid) and late blocks were delineated by the first, second and final third of total number of days training in the reverse-learning task. Within groups, scores increased significantly between blocks ( p <0.001), but there were no significant differences between rTMS and sham or between genotypes ( p values >0.05; ANOVA). Error bars = SEM.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/2167/700213a4-6660-44e4-b944-4d2a9696b899_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_31",
            "content": "rTMS did not significantly affect hippocampal dendritic spine density",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_32",
            "content": "Spine density (spine number/10 µm) measures were obtained for each dendrite and averaged within mice. Figure 2 presents mean dendritic spine density in CA1 pyramidal layer and dentate molecular layer for ephrin-A2 -/- and wildtype mice, contrasting rTMS to sham. There was a slight (non-significant) trend towards rTMS increasing spine density in ephrin-A2 -/- mice in both regions. In wildtypes rTMS appeared to have no effect on spine densities in CA1 pyramidal cells, as means were almost identical. However, wildtypes showed a similar (non-significant) trend to ephrin-A2 -/- mice in the dentate molecular layer.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_33",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Assessment of rTMS effects on dendritic spine density in wildtype and ephrin-A2 -/- knockout mice. ( A ) Mean dendritic spine density (number of spines per 10 μm) for hippocampal regions: CA1 pyramidal layer and dentate gyrus molecular layer (DG Molecular). There were no significant effects of rTMS nor genotype on spine densities in either region ( p values >0.05; ANOVA). Error bars = SEM. ( B ) Right hemisphere Golgi stained section of dorsal hippocampus representative of those used in analyses. Scale bar represents 500 μm. ( C ) Dendrite representative of those selected for analysis, with spines visible. Scale bar represents 10 μm.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/2167/700213a4-6660-44e4-b944-4d2a9696b899_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_34",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Assessment of rTMS effects on dendritic spine density in wildtype and ephrin-A2 <sup>-/-</sup> knockout mice.</title> <p> ( <bold>A</bold>) Mean dendritic spine density (number of spines per 10 &#956;m) for hippocampal regions: CA1 pyramidal layer and dentate gyrus molecular layer (DG Molecular). There were no significant effects of rTMS nor genotype on spine densities in either region ( <italic>p</italic> values &gt;0.05; ANOVA). Error bars = SEM. ( <bold>B</bold>) Right hemisphere Golgi stained section of dorsal hippocampus representative of those used in analyses. Scale bar represents 500 &#956;m. ( <bold>C</bold>) Dendrite representative of those selected for analysis, with spines visible. Scale bar represents 10 &#956;m.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/2167/700213a4-6660-44e4-b944-4d2a9696b899_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Assessment of rTMS effects on dendritic spine density in wildtype and ephrin-A2 -/- knockout mice. ( A ) Mean dendritic spine density (number of spines per 10 μm) for hippocampal regions: CA1 pyramidal layer and dentate gyrus molecular layer (DG Molecular). There were no significant effects of rTMS nor genotype on spine densities in either region ( p values >0.05; ANOVA). Error bars = SEM. ( B ) Right hemisphere Golgi stained section of dorsal hippocampus representative of those used in analyses. Scale bar represents 500 μm. ( C ) Dendrite representative of those selected for analysis, with spines visible. Scale bar represents 10 μm.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/2167/700213a4-6660-44e4-b944-4d2a9696b899_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_35",
            "content": "MANOVA, using Pillai’s trace showed there was no significant effect of stimulation condition, V = 0.13, F (2, 9) = 0.67, p = 0.54, nor genotype, V = 0.08, F (2, 9) = 0.39, p = 0.69, on spine densities. Follow up two-way ANOVAs were also performed separately for each region, with no significant differences between stimulation conditions or between genotypes in either region, all p values were >0.05 (CA1 pyramidal layer: stimulation condition, F (1, 10) = 0.03, p = 0.86; genotype, F (1, 10) = 0.86, p = 0.38. Dentate molecular layer: stimulation condition, F (1, 10) = 1.03, p = 0.34; genotype, F (1, 10) = 0.42, p = 0.53).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_36",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_37",
            "content": "We investigated the effects of long-term daily rTMS on learning and hippocampal dendritic spine density using ephrin-A2 -/- mice and wildtype controls. We show that rTMS had no significant effect on learning and no significant effect on hippocampal dendritic spine densities. Although ephrin-A2 -/- mice have abnormal brain circuitry and associated abnormal behaviours, in the present study, the previously reported learning deficit <REF-17> was not observed due to low levels of food deprivation <REF-18> . The absence of observed behavioural and structural change is consistent with previously reported rTMS specificity for abnormal systems 8 , <REF-19> . Furthermore, the lack of adverse effects in our long term study contributes evidence that rTMS is safe to use in healthy control participants <REF-20> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_38",
            "content": "Long-term rTMS does not adversely affect learning in normal subjects",
            "ntype": "title",
            "meta": {
                "section": "4.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_39",
            "content": "We originally hypothesized that rTMS would rescue the learning strategy deficit in ephrin-A2 -/- mice <REF-17> with minimal or no effect on wildtype mice. However, both genotypes failed to demonstrate the strategy deficit, due to insufficient food restriction <REF-18> . Our results nonetheless indicate that rTMS does not adversely affect performance, but nor does it improve motivation or accelerate learning when deficits are absent. This is consistent with previous reports that long-term rTMS effects are specific to abnormal brain circuitry: two weeks of rTMS improved visual tracking, visual electrophysiological function and topographical accuracy in mice with abnormal circuitry but produced no lasting effects in wildtype mice <REF-19> . Human studies also support specificity of rTMS for abnormal brain circuits, as a meta-analysis of rTMS effects on cognitive performance found patients tend to improve more than healthy participants <REF-8> . Although some human studies using healthy participants show a single-session of rTMS enhances cognitive task performance, such as analogous reasoning <REF-32> and reaction time <REF-7> , results are mixed, with other studies showing no effect of rTMS on knowledge acquisition <REF-33> or accuracy in a go/no-go task <REF-34> . To our knowledge, there have been no studies assessing cognitive effects of long-term rTMS in patients and healthy controls, which presents a large gap in knowledge. Although more research is needed, our results support that rTMS is safe to use in healthy control participants, invaluable in assessment of rTMS effects clinically.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_40",
            "content": "Long-term rTMS and hippocampal spine density",
            "ntype": "title",
            "meta": {
                "section": "4.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_41",
            "content": "Each mouse received a controlled amount of daily rTMS, allowing us to investigate how long-term rTMS combined with daily training influences spine density. Importantly, we found similar spine densities in sham wildtype and ephrin-A2 -/- mice, suggesting that if present, deficits in spines are subtle in ephrin-A2 -/- mice. Although ephrin-A2 is expressed in the mouse hippocampus throughout life and has been implicated in its topographic organisation <REF-35> , <REF-36> , to our knowledge, there is no evidence that ephrin-A2 is involved in synaptic plasticity or spine dynamics. Rather, these processes involve ephrin-A3, ephrin-A5 and members of the ephrin-B family <REF-37> . As such, the null effect of rTMS on dendritic spine density is in line with our behavioural results and may be attributed to the absence of a specific spine deficit for rTMS to correct in both wildtype and ephrin-A2 -/- mice. It will be important to examine other brain regions to determine whether the selectivity of rTMS for normal and abnormal brain circuits is also observed.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_42",
            "content": "Our result that spine density was not significantly altered is in agreement with a previous study, showing no change in spine density in CA1 pyramidal neurons following a single rTMS stimulation <REF-2> . However, it is surprising that dendritic spine density remains unaffected after long-term stimulation, given our previous results using the same stimulation parameters, demonstrating structural reorganisation in abnormal axon terminals following multiple, but not single rTMS stimulation sessions <REF-19> . As neither long-term nor short-term rTMS results in dendritic spine density changes, these negative results may suggest different susceptibility of axons and dendrites to rTMS. The functional characteristics of these neuronal compartments require different expression of ion channels and growth factor receptors <REF-38> , which could provide a molecular basis for differential rTMS effects on excitability and spatially localised structural and functional change.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_43",
            "content": "An alternative interpretation of our null finding is that our rTMS treatment changes spine dynamics without affecting their final density, a result that would not be possible to detect in our fixed post-mortem tissue. Hence, these results highlight the limitations in Golgi staining of fixed tissue, a technique still commonly used in examining dendritic spine density. Sensory manipulation (either enrichment or withdrawal) strongly alters spine dynamics in vivo in various areas of the cortex of adult mice <REF-39> . As a rule, established spines are pruned during the initial experience of the new stimulus, while new ones are established, which may result in some studies of fixed tissue showing no net change in spine density <REF-40> , <REF-41> . Consistent with the change in spine dynamics initiated by enrichment, a recent imaging study in the hippocampus identified two phases in spine dynamics following repeated induction of LTP. Initially both generation and retraction of spines increased, followed by a cessation of spine retraction <REF-42> . This is consistent with post-mortem studies showing an initial period of apparent spine stability, followed by a detectable increase in density. The possibility that rTMS changes spine dynamics, as opposed to density, is further supported by an increase in the size of small spines following a single stimulation, which the authors suggested may indicate the activation of silent synapses by membrane recruitment of AMPA receptors, precluding the need for de novo synapse generation <REF-2> . Future live imaging studies of spine dynamics in animals that have received single or multiple rTMS stimulation, potentially in combination with learning tasks will provide much needed insight into the mechanisms underpinning the plastic changes elicited by rTMS in humans.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_44",
            "content": "<REF-1> Pell GS Roth Y Zangen A : Modulation of cortical excitability induced by repetitive transcranial magnetic stimulation: Influence of timing and geometrical parameters and underlying mechanisms. Prog Neurobiol. 2011 ; 93 ( 1 ): 59 – 98 . 21056619 10.1016/j.pneurobio.2010.10.003",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_45",
            "content": "<REF-2> Vlachos A Muller-Dahlhaus F Rosskopp J : Repetitive magnetic stimulation induces functional and structural plasticity of excitatory postsynapses in mouse organotypic hippocampal slice cultures. J Neurosci. 2012 ; 32 ( 48 ): 17514 – 23 . 23197741 10.1523/JNEUROSCI.0409-12.2012",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_46",
            "content": "<REF-3> Ogiue-Ikeda M Kawato S Ueno S : The effect of repetitive transcranial magnetic stimulation on long-term potentiation in rat hippocampus depends on stimulus intensity. Brain Res. 2003 ; 993 ( 1–2 ): 222 – 6 . 14642850 10.1016/j.brainres.2003.09.009",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_47",
            "content": "<REF-4> Tokay T Holl N Kirschstein T : High-frequency magnetic stimulation induces long-term potentiation in rat hippocampal slices. Neurosci Lett. 2009 ; 461 ( 2 ): 150 – 4 . 19539714 10.1016/j.neulet.2009.06.032",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_48",
            "content": "<REF-5> Mozzachiodi R Byrne JH : More than synaptic plasticity: role of nonsynaptic plasticity in learning and memory. Trends Neurosci. 2010 ; 33 ( 1 ): 17 – 26 . 19889466 10.1016/j.tins.2009.10.001 2815214",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_49",
            "content": "<REF-6> Lisman J : A mechanism for the Hebb and the anti-Hebb processes underlying learning and memory. Proc Natl Acad Sci U S A. 1989 ; 86 ( 23 ): 9574 – 8 . 2556718 10.1073/pnas.86.23.9574 298540",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_50",
            "content": "<REF-7> Evers S Bockermann I Nyhuis PW : The impact of transcranial magnetic stimulation on cognitive processing: an event-related potential study. Neuroreport. 2001 ; 12 ( 13 ): 2915 – 8 . 11588602 10.1097/00001756-200109170-00032",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_51",
            "content": "<REF-8> Guse B Falkai P Wobrock T : Cognitive effects of high-frequency repetitive transcranial magnetic stimulation: a systematic review. J Neural Transm. 2010 ; 117 ( 1 ): 105 – 22 . 19859782 10.1007/s00702-009-0333-7 3085788",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_52",
            "content": "<REF-9> Harms KJ Dunaevsky A : Dendritic spine plasticity: looking beyond development. Brain Res. 2007 ; 1184 : 65 – 71 . 16600191 10.1016/j.brainres.2006.02.094",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_53",
            "content": "<REF-10> Calverley RK Jones DG : Contributions of dendritic spines and perforated synapses to synaptic plasticity. Brain Res Brain Res Rev. 1990 ; 15 ( 3 ): 215 – 49 . 2289086 10.1016/0165-0173(90)90002-6",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_54",
            "content": "<REF-11> Moser MB Trommald M Egeland T : Spatial training in a complex environment and isolation alter the spine distribution differently in rat CA1 pyramidal cells. J Comp Neurol. 1997 ; 380 ( 3 ): 373 – 81 . 9087519 10.1002/(SICI)1096-9861(19970414)380:3<373::AID-CNE6>3.0.CO;2-#",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_55",
            "content": "<REF-14> Wallace M Luine V Arellanos A : Ovariectomized rats show decreased recognition memory and spine density in the hippocampus and prefrontal cortex. Brain Res. 2006 ; 1126 ( 1 ): 176 – 82 . 16934233 10.1016/j.brainres.2006.07.064",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_56",
            "content": "<REF-15> McKinney R Thompson S : Glutamate Regulation of Dendritic Spine Form and Function . In: Larry R editor. Encyclopedia of Neuroscience. Oxford: Academic Press; 2009 ; 905 – 11 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_57",
            "content": "<REF-16> Dur-e-Ahmad M Imran M Gul A : Calcium dynamics in dendritic spines: a link to structural plasticity. Math Biosci. 2011 ; 230 ( 2 ): 55 – 66 . 21295598 10.1016/j.mbs.2011.01.002",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_58",
            "content": "<REF-17> Arnall S Cheam LY Smart C : Abnormal Strategies During Visual Discrimination Reversal Learning in ephrin-A2-/- Mice. Behav Brain Res. 2010 ; 209 ( 1 ): 109 – 13 . 20100519 10.1016/j.bbr.2010.01.023",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_59",
            "content": "<REF-18> Makowiecki K Hammond G Rodger J : Different levels of food restriction reveal genotype-specific differences in learning a visual discrimination task. PLoS ONE. 2012 ; 7 ( 11 ): e48703 . 23144936 10.1371/journal.pone.0048703 3492417",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_60",
            "content": "<REF-19> Rodger J Mo C Wilks T : Transcranial pulsed magnetic field stimulation facilitates reorganization of abnormal neural circuits and corrects behavioral deficits without disrupting normal connectivity. Faseb J. 2012 ; 26 ( 4 ): 1593 – 606 . 22223750 10.1096/fj.11-194878",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_61",
            "content": "<REF-20> Rossi S Hallett M Rossini PM : Safety, ethical considerations, and application guidelines for the use of transcranial magnetic stimulation in clinical practice and research. Clin Neurophysiol. 2009 ; 120 ( 12 ): 2008 – 39 . 19833552 10.1016/j.clinph.2009.08.016 3260536",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_62",
            "content": "<REF-21> Feldheim DA Kim Y-I, Bergemann AD : Genetic analysis of ephrin-A2 and ephrin-A5 shows their requirement in multiple aspects of retinocollicular mapping. Neuron. 2000 ; 25 ( 3 ): 563 – 74 . 10774725 10.1016/S0896-6273(00)81060-0",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_63",
            "content": "<REF-22> Haustead DJ Lukehurst SS Clutton GT : Functional topography and integration of the contralateral and ipsilateral retinocollicular projections of ephrin-A-/- mice. J Neurosci. 2008 ; 28 ( 29 ): 7376 – 86 . 18632942 10.1523/JNEUROSCI.1135-08.2008",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_64",
            "content": "<REF-23> Weissman JD Epstein CM Davey KR : Magnetic brain stimulation and brain size: relevance to animal studies. Electroencephalogr Clin Neurophysiol. 1992 ; 85 ( 3 ): 215 – 9 . 1376680 10.1016/0168-5597(92)90135-X",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_65",
            "content": "<REF-24> Gersner R Kravetz E Feil J : Long-term effects of repetitive transcranial magnetic stimulation on markers for neuroplasticity: differential outcomes in anesthetized and awake animals. J Neurosci. 2011 ; 31 ( 20 ): 7521 – 6 . 21593336 10.1523/JNEUROSCI.6751-10.2011",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_66",
            "content": "<REF-25> Shupak NM Prato FS Thomas AW : Human exposure to a specific pulsed magnetic field: effects on thermal sensory and pain thresholds. Neurosci Lett. 2004 ; 363 ( 2 ): 157 – 62 . 15172106 10.1016/j.neulet.2004.03.069",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_67",
            "content": "<REF-27> Cook CM Thomas AW Keenliside L : Resting EEG effects during exposure to a pulsed ELF magnetic field. Bioelectromagnetics. 2005 ; 26 ( 5 ): 367 – 76 . 15887255 10.1002/bem.20113",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_68",
            "content": "<REF-28> Martiny K Lunde M Bech P : Transcranial low voltage pulsed electromagnetic fields in patients with treatment-resistant depression. Biol Psychiatry. 2010 ; 68 ( 2 ): 163 – 9 . 20385376 10.1016/j.biopsych.2010.02.017",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_69",
            "content": "<REF-29> Valero-Cabre A Pascual-Leone A Rushmore RJ : Cumulative sessions of repetitive transcranial magnetic stimulation (rTMS) build up facilitation to subsequent TMS-mediated behavioural disruptions. Eur J Neurosci. 2008 ; 27 ( 3 ): 765 – 74 . 18279329 10.1111/j.1460-9568.2008.06045.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_70",
            "content": "<REF-30> Seress L Pokorny J : Structure of the granular layer of the rat dentate gyrus. A light microscopic and Golgi study. J Anat. 1981 ; 133 ( Pt 2 ): 181 – 95 . 7333948 1167662",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_71",
            "content": "<REF-31> von Bohlen Und Halbach O : Structure and function of dendritic spines within the hippocampus. Ann Anat. 2009 ; 191 ( 6 ): 518 – 31 . 19783417 10.1016/j.aanat.2009.08.006",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_72",
            "content": "<REF-32> Boroojerdi B Phipps M Kopylev L : Enhancing analogic reasoning with rTMS over the left prefrontal cortex. Neurology. 2001 ; 56 ( 4 ): 526 – 8 . 11222799 10.1212/WNL.56.4.526",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_73",
            "content": "<REF-33> Roth HL Nadeau SE Triggs WJ : Effect of repetitive transcranial magnetic stimulation on rate of memory acquisition. Neurology. 2004 ; 63 ( 8 ): 1530 – 1 . 15505185 10.1212/01.WNL.0000142081.71440.6B",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_74",
            "content": "<REF-34> Huang CC Su TP Shan IK : Effect of 5 Hz repetitive transcranial magnetic stimulation on cognition during a Go/NoGo task. J Psychiatr Res. 2004 ; 38 ( 5 ): 513 – 20 . 15380402 10.1016/j.jpsychires.2004.01.006",
            "ntype": "ref",
            "meta": {
                "id": "ref-34",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_75",
            "content": "<REF-35> Zhou R : Regulation of topographic projection by the Eph family receptor Bsk (EphA5) and its ligands. Cell Tissue Res. 1997 ; 290 ( 2 ): 251 – 9 . 9321686 10.1007/s004410050929",
            "ntype": "ref",
            "meta": {
                "id": "ref-35",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_76",
            "content": "<REF-36> Gerlai R Shinsky N Shih A : Regulation of learning by EphA receptors: a protein targeting study. J Neurosci. 1999 ; 19 ( 21 ): 9538 – 49 . 10531456",
            "ntype": "ref",
            "meta": {
                "id": "ref-36",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_77",
            "content": "<REF-37> Hruska M Dalva MB : Ephrin regulation of synapse formation, function and plasticity. Mol Cell Neurosci. 2012 ; 50 ( 1 ): 35 – 44 . 22449939 10.1016/j.mcn.2012.03.004 3631567",
            "ntype": "ref",
            "meta": {
                "id": "ref-37",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_78",
            "content": "<REF-38> Arnold DB : Polarized targeting of ion channels in neurons. Pflugers Arch. 2007 ; 453 ( 6 ): 763 – 9 . 17091311 10.1007/s00424-006-0155-5",
            "ntype": "ref",
            "meta": {
                "id": "ref-38",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_79",
            "content": "<REF-39> Fu M Zuo Y : Experience-dependent structural plasticity in the cortex. Trends Neurosci. 2011 ; 34 ( 4 ): 177 – 87 . 21397343 10.1016/j.tins.2011.02.001 3073830",
            "ntype": "ref",
            "meta": {
                "id": "ref-39",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_80",
            "content": "<REF-40> Jung CK Herms J : Structural Dynamics of Dendritic Spines are Influenced by an Environmental Enrichment: An In Vivo Imaging Study. Cereb Cortex. 2012 . 23081882 10.1093/cercor/bhs317",
            "ntype": "ref",
            "meta": {
                "id": "ref-40",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_81",
            "content": "<REF-41> Xu T Yu X Perlik AJ : Rapid formation and selective stabilization of synapses for enduring motor memories. Nature. 2009 ; 462 ( 7275 ): 915 – 9 . 19946267 10.1038/nature08389 2844762",
            "ntype": "ref",
            "meta": {
                "id": "ref-41",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_82",
            "content": "<REF-42> Oe Y Tominaga-Yoshino K Hasegawa S : Dendritic spine dynamics in synaptogenesis after repeated LTP inductions: Dependence on pre-existing spine density. Sci Rep. 2013 ; 3 : 1957 . 23739837 10.1038/srep01957 3674431",
            "ntype": "ref",
            "meta": {
                "id": "ref-42",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "2-180_v1_0@0",
            "content": "Long term delivery of pulsed magnetic fields does not improve learning or alter dendritic spine density in the mouse hippocampus",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_0",
            "start": 0,
            "end": 127,
            "label": {}
        },
        {
            "ix": "2-180_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-180_v1_2@0",
            "content": "Repetitive transcranial magnetic stimulation (rTMS) is thought to facilitate brain plasticity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_2",
            "start": 0,
            "end": 93,
            "label": {}
        },
        {
            "ix": "2-180_v1_2@1",
            "content": "However, few studies address anatomical changes following rTMS in relation to behaviour.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_2",
            "start": 95,
            "end": 182,
            "label": {}
        },
        {
            "ix": "2-180_v1_2@2",
            "content": "We delivered 5 weeks of daily pulsed rTMS stimulation to ephrin-A2 -/- and wildtype mice (n=10 per genotype) undergoing a visual learning task and analysed learning performance, as well as spine density, in the dentate gyrus molecular and CA1 pyramidal cell layers in Golgi-stained brain sections.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_2",
            "start": 184,
            "end": 480,
            "label": {}
        },
        {
            "ix": "2-180_v1_2@3",
            "content": "We found that neither learning behaviour, nor hippocampal spine density was affected by long term rTMS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_2",
            "start": 482,
            "end": 584,
            "label": {}
        },
        {
            "ix": "2-180_v1_2@4",
            "content": "Our negative results highlight the lack of deleterious side effects in normal subjects and are consistent with previous studies suggesting that rTMS has a bigger effect on abnormal or injured brain substrates than on normal/control structures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_2",
            "start": 586,
            "end": 828,
            "label": {}
        },
        {
            "ix": "2-180_v1_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-180_v1_4@0",
            "content": "Repetitive transcranial stimulation (rTMS) generates electrical currents in the brain by electromagnetic induction and has been shown to induce synaptic plasticity in human and animal models <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_4",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "2-180_v1_4@1",
            "content": "Importantly, rTMS induces long term potentiation (LTP) in rodent hippocampus in vitro <REF-2> and several sessions of high-frequency rTMS increases the capacity to induce LTP (metaplasticity) compared to untreated controls <REF-3> , <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_4",
            "start": 201,
            "end": 442,
            "label": {}
        },
        {
            "ix": "2-180_v1_4@2",
            "content": "Because rTMS acts on the same plasticity mechanisms as learning and memory, it has been hypothesised that rTMS may serve as a \"priming\" mechanism to facilitate long-term synaptic and structural modifications <REF-5> , <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_4",
            "start": 444,
            "end": 670,
            "label": {}
        },
        {
            "ix": "2-180_v1_4@3",
            "content": "The implication is that repeated rTMS stimulation sets up a \"plastic\" brain state that is conducive to long term functional and structural changes <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_4",
            "start": 672,
            "end": 827,
            "label": {}
        },
        {
            "ix": "2-180_v1_4@4",
            "content": "For this reason, rTMS is being explored in combination with behavioural training tasks to see whether it can be used to prime or improve learning and cognitive performance in humans <REF-7> , <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_4",
            "start": 829,
            "end": 1029,
            "label": {}
        },
        {
            "ix": "2-180_v1_4@5",
            "content": "However, the potential mechanisms whereby rTMS might accelerate learning remain unknown.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_4",
            "start": 1031,
            "end": 1118,
            "label": {}
        },
        {
            "ix": "2-180_v1_5@0",
            "content": "Declarative and spatial learning tasks are strongly associated with the hippocampus.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_5",
            "start": 0,
            "end": 83,
            "label": {}
        },
        {
            "ix": "2-180_v1_5@1",
            "content": "More specifically, hippocampal dendritic spines have been identified as the likely loci of activity-dependent synaptic plasticity and possible structural correlates of memory and learning <REF-9> , <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_5",
            "start": 85,
            "end": 292,
            "label": {}
        },
        {
            "ix": "2-180_v1_5@2",
            "content": "High dendritic spine density in hippocampal neurons is associated with learning ability and higher performance on cognitive tasks <REF-11> – <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_5",
            "start": 294,
            "end": 444,
            "label": {}
        },
        {
            "ix": "2-180_v1_5@3",
            "content": "Furthermore, LTP and LTD induce structural changes in dendritic spines, with LTP induced electrically or via learning increasing dendritic length and spine density <REF-15> , <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_5",
            "start": 446,
            "end": 630,
            "label": {}
        },
        {
            "ix": "2-180_v1_5@4",
            "content": "Because higher spine density is associated with higher spine mobility and turnover rates <REF-15> , <REF-16> , this measure is thought to reflect a greater capacity for synaptic reorganisation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_5",
            "start": 632,
            "end": 824,
            "label": {}
        },
        {
            "ix": "2-180_v1_6@0",
            "content": "To date, the only study to examine changes in dendritic spines after rTMS did so following a single stimulation and showed no change in spine density, although the size of the smallest spines was increased <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_6",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "2-180_v1_6@1",
            "content": "Therefore, very little has been done to investigate the impact of long term rTMS on spine density in the hippocampus, or how it might interact with the learning process.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_6",
            "start": 216,
            "end": 384,
            "label": {}
        },
        {
            "ix": "2-180_v1_6@2",
            "content": "Given the significant structural changes induced in the mouse visual system following repeated stimulation sessions, we hypothesised that a similar long-term rTMS regime in combination with a hippocampal learning task, would rescue impaired learning strategies previously found in ephrin-A2 -/- mice <REF-17> and alter spine density in the hippocampus.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_6",
            "start": 386,
            "end": 737,
            "label": {}
        },
        {
            "ix": "2-180_v1_7@0",
            "content": "We delivered 5 weeks of daily pulsed rTMS stimulation to ephrin-A2 -/- and wildtype mice undergoing a visual learning task and analysed learning performance, as well as spine density in the dentate gyrus molecular and CA1 pyramidal cell layers in Golgi-stained material.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_7",
            "start": 0,
            "end": 269,
            "label": {}
        },
        {
            "ix": "2-180_v1_7@1",
            "content": "Although the mice learned the task, their performance remained suboptimal due to lack of motivation to obtain food rewards through insufficient food restriction <REF-18> and neither learning behaviour, nor hippocampal spine density were affected by long term rTMS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_7",
            "start": 271,
            "end": 534,
            "label": {}
        },
        {
            "ix": "2-180_v1_7@2",
            "content": "Our negative results are consistent with previous data showing that rTMS has a selective effect on abnormal or injured brain circuitry <REF-19> , and the lack of deleterious side effects observed in normal human subjects <REF-8> , <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_7",
            "start": 536,
            "end": 776,
            "label": {}
        },
        {
            "ix": "2-180_v1_8@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_8",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-180_v1_9@0",
            "content": "Animals",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_9",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@0",
            "content": "This experiment used 10 wildtype (C57Bl/6J) and 10 ephrin-A2 -/- knockout mice, with equal number of males and females.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 0,
            "end": 118,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@1",
            "content": "Wildtype mice were purchased from Animal Research Centre (Canning Vale, WA, Australia).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 120,
            "end": 206,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@2",
            "content": "Ephrin-A2 -/- mice were a generous gift from David Feldheim <REF-21> and carry a homozygous null mutation of the ephrin-A2 gene.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 208,
            "end": 335,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@3",
            "content": "Ephrin-A2 -/- mice were bred from heterozygous parents at the Biomedical Research Facility (The University of Western Australia) and backcrossed for >10 generations on a C57Bl/6J background.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 337,
            "end": 526,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@4",
            "content": "Mice were genotyped at weaning, as described previously <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 528,
            "end": 593,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@5",
            "content": "Mice were age matched, aged 8–10 weeks old when commencing the experiment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 595,
            "end": 668,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@6",
            "content": "For the duration of the study, mice were kept in standard caging in a controlled environment (12/12 light/dark cycle; temperature 22°C±2°C, separated into cages with clear plastic walls (17 cm x 19 cm base, 16 cm high) based on sex and genotype (2–4 per cage)).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 670,
            "end": 930,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@7",
            "content": "Food restriction began two days prior to commencing training.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 932,
            "end": 992,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@8",
            "content": "This aimed to reduce mice to 90% of their free-feeding body weight.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 994,
            "end": 1060,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@9",
            "content": "Mice were weighed daily and food intake adjusted using a daily-based controlled diet to reach and maintain target body weights and ensure animals remained healthy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 1062,
            "end": 1224,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@10",
            "content": "Water was available ad libitum throughout the experiment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 1226,
            "end": 1282,
            "label": {}
        },
        {
            "ix": "2-180_v1_10@11",
            "content": "All procedures in this study were conducted in accordance with US NIH guidelines and approved by The University of Western Australia Animal Ethics Committee.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_10",
            "start": 1284,
            "end": 1440,
            "label": {}
        },
        {
            "ix": "2-180_v1_11@0",
            "content": "Apparatus and procedure",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_11",
            "start": 0,
            "end": 22,
            "label": {}
        },
        {
            "ix": "2-180_v1_12@0",
            "content": "Mice completed a visual discrimination task in two phases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_12",
            "start": 0,
            "end": 57,
            "label": {}
        },
        {
            "ix": "2-180_v1_12@1",
            "content": "Mice were initially rewarded for one stimulus (‘learning phase’).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_12",
            "start": 59,
            "end": 123,
            "label": {}
        },
        {
            "ix": "2-180_v1_12@2",
            "content": "After mice learned the task (defined as 75% correct responses for three consecutive days), the rewarded stimulus was switched to the opposite, previously incorrect stimulus (‘reverse phase’).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_12",
            "start": 125,
            "end": 315,
            "label": {}
        },
        {
            "ix": "2-180_v1_12@3",
            "content": "rTMS was applied (as described below) for 10 minutes daily immediately following the task during the reverse phase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_12",
            "start": 317,
            "end": 431,
            "label": {}
        },
        {
            "ix": "2-180_v1_12@4",
            "content": "Because most mice in the study failed to learn the reverse task, we decided to focus on the relationship between rTMS and dendritic spine density, therefore, mice were terminally anesthetised with pentobarbitone (Lethabarb, Virbac Australia, 160 mg/kg, i.p.) 24 hours after 35 days of rTMS so that all mice received the same amount of stimulation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_12",
            "start": 433,
            "end": 779,
            "label": {}
        },
        {
            "ix": "2-180_v1_13@0",
            "content": "Visual discrimination task",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_13",
            "start": 0,
            "end": 25,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@0",
            "content": "The visual discrimination task was carried out using a Y-maze fitted into a 50 cm 2 box, with visual stimuli at each end of the Y maze arms (25 cm long) <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@1",
            "content": "Stimuli consisted of two 5 cm 2 laminated black and white striped cards at 0.37 cycles per degree oriented horizontally or vertically.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 164,
            "end": 297,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@2",
            "content": "Both genotypes are capable of distinguishing this spatial frequency <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 299,
            "end": 376,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@3",
            "content": "The position of the horizontal and vertical stimuli (left vs. right maze arm) was randomly altered across 30 trials with the constraint of equal number of trials in right and left arms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 378,
            "end": 562,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@4",
            "content": "The 30 trial schedule changed each day, repeating every seven days.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 564,
            "end": 630,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@5",
            "content": "Random allocation determined which stimulus was rewarded in the learning phase, with the constraint that half the mice in each genotype received rewards for the horizontal and half for vertical.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 632,
            "end": 825,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@6",
            "content": "The rewarded stimulus was also counter-balanced across cage groups (i.e. mice housed together were rewarded for opposite stimuli) and sex.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 827,
            "end": 964,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@7",
            "content": "Inferential statistics confirmed no significant performance differences between sexes or stripe orientation first rewarded ( Data File ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 966,
            "end": 1102,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@8",
            "content": "Mice were placed at the start of the Y-maze, and received a peanut butter reward immediately after approaching the correct stimulus.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 1104,
            "end": 1235,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@9",
            "content": "If mice did not approach a stimulus after 30 seconds, the trial was deemed a non-response (included in analyses as an incorrect response).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 1237,
            "end": 1374,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@10",
            "content": "Each mouse completed 30 trials per day, in a single session.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 1376,
            "end": 1435,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@11",
            "content": "The reverse phase commenced the day after mice reached criterion performance (75% correct for three consecutive days).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 1437,
            "end": 1554,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@12",
            "content": "In the reverse phase the opposite, previously incorrect stimulus was rewarded.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 1556,
            "end": 1633,
            "label": {}
        },
        {
            "ix": "2-180_v1_14@13",
            "content": "All other aspects of the reverse task were identical to the initial learning phase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_14",
            "start": 1635,
            "end": 1717,
            "label": {}
        },
        {
            "ix": "2-180_v1_15@0",
            "content": "rTMS application",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_15",
            "start": 0,
            "end": 15,
            "label": {}
        },
        {
            "ix": "2-180_v1_16@0",
            "content": "To deliver rTMS, we built a small coil created for mice (0.25 mm copper wire (Jaycar, Australia) 300 windings, 16 Ω, outer diameter 8 mm) <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_16",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "2-180_v1_16@1",
            "content": "The coil was designed to ensure a similar coil-to brain ratio as is used for induction of focal electric fields in humans <REF-23> and was driven by an electromagnetic pulse generator (Global Energy Medicine, Australia) that delivered a magnetic field of 10 mT. This relatively low intensity was imposed by the constraints of the coil’s size but had the benefit of allowing us to evaluate the effects of stimulation without the confounding factors of stimulation-induced movement or the use of anaesthetic or restraint, with their associated changes to neuronal excitability and circulating stress hormones <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_16",
            "start": 149,
            "end": 765,
            "label": {}
        },
        {
            "ix": "2-180_v1_16@2",
            "content": "Furthermore, low intensity magnetic fields are clinically relevant for two reasons.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_16",
            "start": 767,
            "end": 849,
            "label": {}
        },
        {
            "ix": "2-180_v1_16@3",
            "content": "Firstly, in humans, fields in the millitesla range delivered to the brain induce analgesia <REF-25> – <REF-27> , and alleviate depression <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_16",
            "start": 851,
            "end": 998,
            "label": {}
        },
        {
            "ix": "2-180_v1_16@4",
            "content": "Secondly, even though traditional rTMS is considered to be focal, magnetic fields of lower intensity are delivered outside of the focal area, raising the possibility that low intensity stimulation may be contributing to therapeutic effects by acting on interconnected brain regions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_16",
            "start": 1000,
            "end": 1281,
            "label": {}
        },
        {
            "ix": "2-180_v1_17@0",
            "content": "We chose a complex pattern of stimulation because it has been shown to induce structural changes in mice <REF-19> (59.9-ms trains of 20 pulses at 3 different frequencies as follows: 1 min warm-up at 6.71 Hz, 8 min treatment at 10.1 Hz, and 1 min cool down at 6.26 Hz.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_17",
            "start": 0,
            "end": 266,
            "label": {}
        },
        {
            "ix": "2-180_v1_17@1",
            "content": "The pulse duration was 200 µs, which is within the range used in human rTMS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_17",
            "start": 268,
            "end": 343,
            "label": {}
        },
        {
            "ix": "2-180_v1_17@2",
            "content": "A Hall device probe (Jaycar, Australia inserted into different brain regions of a euthanized mouse estimated that the dorsal hippocampus received roughly 6 mT. The surface temperature of the coil was measured after 10 min of stimulation and did not exceed 35°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_17",
            "start": 345,
            "end": 605,
            "label": {}
        },
        {
            "ix": "2-180_v1_18@0",
            "content": "As mice had completed the initial learning phase of the visual discrimination task before commencing rTMS they were accustomed to handling and remained relatively still without restraint.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_18",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "2-180_v1_18@1",
            "content": "This allowed the stimulation coil to be held by the experimenter above, but not in contact with, the top of the animal’s head for reproducible rTMS delivery in the alert animal (as for cat studies <REF-29> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_18",
            "start": 188,
            "end": 395,
            "label": {}
        },
        {
            "ix": "2-180_v1_18@2",
            "content": "Consistent with the low intensity of the magnetic field, mice did not display any head-eye or gross motor movements, nor altered behaviour in response to the stimulation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_18",
            "start": 397,
            "end": 566,
            "label": {}
        },
        {
            "ix": "2-180_v1_18@3",
            "content": "Sham stimulation involved the same procedure but with the stimulator switched off.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_18",
            "start": 568,
            "end": 649,
            "label": {}
        },
        {
            "ix": "2-180_v1_18@4",
            "content": "This control was chosen as our coil did not produce any audible sound <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_18",
            "start": 651,
            "end": 730,
            "label": {}
        },
        {
            "ix": "2-180_v1_19@0",
            "content": "Golgi staining",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_19",
            "start": 0,
            "end": 13,
            "label": {}
        },
        {
            "ix": "2-180_v1_20@0",
            "content": "Terminally anesthetised mice were transcardially perfused with 4% paraformaldehyde (Sigma Aldrich; Montana USA); Right hemispheres of brains underwent a silver impregnation staining protocol, and a Golgi stain (according to manufacturer’s instructions: FD NeuroTechnologies, Maryland, USA), which allows the visualisation of morphology on a subset of neurons <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_20",
            "start": 0,
            "end": 368,
            "label": {}
        },
        {
            "ix": "2-180_v1_20@1",
            "content": "Briefly, hemispheres were incubated in the dark in solutions A+B for 8 days with a change into fresh solution after the first 24 hours.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_20",
            "start": 370,
            "end": 504,
            "label": {}
        },
        {
            "ix": "2-180_v1_20@2",
            "content": "Hemispheres were then incubated in solution C for 4 days with a change into fresh solution after 2 days.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_20",
            "start": 506,
            "end": 609,
            "label": {}
        },
        {
            "ix": "2-180_v1_20@3",
            "content": "The impregnated hemispheres were then cryosectioned at 100 µm on a Leica Cryostat CM1900 at -19°C, mounted onto glass slides (Thermo Fisher Scientific, Australia) subbed with 0.5% gelatin (Sigma Aldrich, Montana USA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_20",
            "start": 611,
            "end": 827,
            "label": {}
        },
        {
            "ix": "2-180_v1_20@4",
            "content": "Sections were dried in the dark for 2–7 days, washed in distilled water and developed in solution D+E for 10 minutes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_20",
            "start": 829,
            "end": 945,
            "label": {}
        },
        {
            "ix": "2-180_v1_20@5",
            "content": "Sections were dehydrated in increasing concentrations of ethanol and mounted in Entilin (Merck, Darmastadt Germany).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_20",
            "start": 947,
            "end": 1062,
            "label": {}
        },
        {
            "ix": "2-180_v1_21@0",
            "content": "Imaging and analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_21",
            "start": 0,
            "end": 19,
            "label": {}
        },
        {
            "ix": "2-180_v1_22@0",
            "content": "Slides were analysed by a researcher blinded to stimulation condition and genotype.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_22",
            "start": 0,
            "end": 82,
            "label": {}
        },
        {
            "ix": "2-180_v1_22@1",
            "content": "Sections were photographed by an Olympus DP70 digital camera at a 4× objective zoom, which encompassed the entire section.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_22",
            "start": 84,
            "end": 205,
            "label": {}
        },
        {
            "ix": "2-180_v1_22@2",
            "content": "We analysed dendrites that could definitively be attributed to cells in the CA1 pyramidal and the molecular dentate layer of the hippocampus because dendritic spines on these cells have previously shown changes in dendritic spine density in response to various interventions <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_22",
            "start": 207,
            "end": 491,
            "label": {}
        },
        {
            "ix": "2-180_v1_22@3",
            "content": "Dendrites were deemed suitable for analysis if they had a relatively flat orientation and were uniformly and strongly stained.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_22",
            "start": 493,
            "end": 618,
            "label": {}
        },
        {
            "ix": "2-180_v1_22@4",
            "content": "Photographs of the dendritic arbour were taken throughout multiple planes ensuring the entire arbour was photographed in focus for later image analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_22",
            "start": 620,
            "end": 771,
            "label": {}
        },
        {
            "ix": "2-180_v1_22@5",
            "content": "Between 2 and 12 cells were analysed per animal and values averaged within animals for statistical analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_22",
            "start": 773,
            "end": 880,
            "label": {}
        },
        {
            "ix": "2-180_v1_22@6",
            "content": "Due to variability in Golgi staining, the number of dendrites counted varied between regions (CA1 pyramidal layer number of cells, Mean = 5; dentate molecular layer, Mean = 4.4).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_22",
            "start": 882,
            "end": 1059,
            "label": {}
        },
        {
            "ix": "2-180_v1_23@0",
            "content": "The images for each dendritic arbour were combined into a single image, using the Image J plug-in \"Stack Focuser\" and dendrite length and number of dendritic spines counted using the Image J (\"Cell counter\" plug-in).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_23",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "2-180_v1_23@1",
            "content": "The number of spines and the dendrite length data were then used to calculate a dendritic spine density value, defined as the number of spines per unit length (10 µm).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_23",
            "start": 217,
            "end": 383,
            "label": {}
        },
        {
            "ix": "2-180_v1_24@0",
            "content": "Statistical analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_24",
            "start": 0,
            "end": 19,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@0",
            "content": "We examined the effect of long-term rTMS on reverse learning performance in ephrin-A2 -/- and wildtype mice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 0,
            "end": 107,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@1",
            "content": "Inferential statistics confirmed no pre-existing differences between groups in the learning phase, before commencing rTMS (data not shown).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 109,
            "end": 247,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@2",
            "content": "The first day of reverse phase training was excluded from analyses as rTMS commenced after this training session.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 249,
            "end": 361,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@3",
            "content": "Two mice reached the learning criterion in the reverse phase and were terminally anesthetised before 35 days (one wildtype and one ephrin-A2 -/- , both received sham stimulation (negative/handling controls)) thus there was non-random reduction in sample size over time, precluding use of daily performance measures in statistical analyses.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 363,
            "end": 701,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@4",
            "content": "To overcome this problem, data were divided into three blocks for each subject, with one third of total days training included in each block, reflecting early, middle, and late stages of the reverse learning phase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 703,
            "end": 916,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@5",
            "content": "Mean percentage correct was analysed by a two-way mixed ANOVA to assess differences between stimulation conditions (rTMS vs. sham) and between genotypes (ephrin-A2 -/- vs. wildtype) and changes over time (changes between early, middle and late blocks).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 918,
            "end": 1169,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@6",
            "content": "As circuitry abnormalities and connections between measured hippocampal regions have not been characterised in ephrin-A2 -/- mice, it is unknown whether these measures should be considered independent for statistical analyses.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 1171,
            "end": 1396,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@7",
            "content": "Accordingly, a MANOVA was conducted to assess effects of stimulation condition (rTMS vs. sham) and genotype (wildtype vs. ephrin-A2 -/- ) on dendritic spine densities in both regions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 1398,
            "end": 1580,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@8",
            "content": "Pillai’s Trace ( V ) was used as the multivariate test statistic.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 1582,
            "end": 1646,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@9",
            "content": "Follow-up ANOVAs were conducted separately for each region, testing the same factors as used in the MANOVA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 1648,
            "end": 1754,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@10",
            "content": "The F-test statistic ( F ) and probability ( p ) values are reported for each ANOVA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 1756,
            "end": 1839,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@11",
            "content": "When the assumption of sphericity was violated degrees of freedom were adjusted with Greenhouse-Geisser correction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 1841,
            "end": 1955,
            "label": {}
        },
        {
            "ix": "2-180_v1_25@12",
            "content": "Data were analysed using SPSS statistics software (IBM Corporation, New York, USA, v.20).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_25",
            "start": 1957,
            "end": 2045,
            "label": {}
        },
        {
            "ix": "2-180_v1_26@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_26",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-180_v1_27@0",
            "content": "rTMS had no significant effect on reverse learning performance",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_27",
            "start": 0,
            "end": 61,
            "label": {}
        },
        {
            "ix": "2-180_v1_28@0",
            "content": "As shown in Figure 1 , groups had similar means in each block, with no significant difference between rTMS and sham, F (1, 16) = 0.28, p = 0.60, nor between genotypes, F (1, 16) = 0.86, p = 0.37, and no significant interactions across blocks (all p values >0.05).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_28",
            "start": 0,
            "end": 262,
            "label": {}
        },
        {
            "ix": "2-180_v1_28@1",
            "content": "Within groups, the percentage correct increased significantly across blocks, indicating that mice adjusted to the rule reversal and successfully learned the task although this was not to the desired criterion ( F (1.43, 22.87) = 71.80, p < 0.001 (Greenhouse-Geisser corrected)).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_28",
            "start": 264,
            "end": 541,
            "label": {}
        },
        {
            "ix": "2-180_v1_29@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_29",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-180_v1_31@0",
            "content": "rTMS did not significantly affect hippocampal dendritic spine density",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_31",
            "start": 0,
            "end": 68,
            "label": {}
        },
        {
            "ix": "2-180_v1_32@0",
            "content": "Spine density (spine number/10 µm) measures were obtained for each dendrite and averaged within mice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_32",
            "start": 0,
            "end": 100,
            "label": {}
        },
        {
            "ix": "2-180_v1_32@1",
            "content": "Figure 2 presents mean dendritic spine density in CA1 pyramidal layer and dentate molecular layer for ephrin-A2 -/- and wildtype mice, contrasting rTMS to sham.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_32",
            "start": 102,
            "end": 261,
            "label": {}
        },
        {
            "ix": "2-180_v1_32@2",
            "content": "There was a slight (non-significant) trend towards rTMS increasing spine density in ephrin-A2 -/- mice in both regions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_32",
            "start": 263,
            "end": 381,
            "label": {}
        },
        {
            "ix": "2-180_v1_32@3",
            "content": "In wildtypes rTMS appeared to have no effect on spine densities in CA1 pyramidal cells, as means were almost identical.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_32",
            "start": 383,
            "end": 501,
            "label": {}
        },
        {
            "ix": "2-180_v1_32@4",
            "content": "However, wildtypes showed a similar (non-significant) trend to ephrin-A2 -/- mice in the dentate molecular layer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_32",
            "start": 503,
            "end": 615,
            "label": {}
        },
        {
            "ix": "2-180_v1_33@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_33",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-180_v1_35@0",
            "content": "MANOVA, using Pillai’s trace showed there was no significant effect of stimulation condition, V = 0.13, F (2, 9) = 0.67, p = 0.54, nor genotype, V = 0.08, F (2, 9) = 0.39, p = 0.69, on spine densities.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_35",
            "start": 0,
            "end": 200,
            "label": {}
        },
        {
            "ix": "2-180_v1_35@1",
            "content": "Follow up two-way ANOVAs were also performed separately for each region, with no significant differences between stimulation conditions or between genotypes in either region, all p values were >0.05 (CA1 pyramidal layer: stimulation condition, F (1, 10) = 0.03, p = 0.86; genotype, F (1, 10) = 0.86, p = 0.38.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_35",
            "start": 202,
            "end": 510,
            "label": {}
        },
        {
            "ix": "2-180_v1_35@2",
            "content": "Dentate molecular layer: stimulation condition, F (1, 10) = 1.03, p = 0.34; genotype, F (1, 10) = 0.42, p = 0.53).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_35",
            "start": 512,
            "end": 625,
            "label": {}
        },
        {
            "ix": "2-180_v1_36@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_36",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "2-180_v1_37@0",
            "content": "We investigated the effects of long-term daily rTMS on learning and hippocampal dendritic spine density using ephrin-A2 -/- mice and wildtype controls.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_37",
            "start": 0,
            "end": 150,
            "label": {}
        },
        {
            "ix": "2-180_v1_37@1",
            "content": "We show that rTMS had no significant effect on learning and no significant effect on hippocampal dendritic spine densities.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_37",
            "start": 152,
            "end": 274,
            "label": {}
        },
        {
            "ix": "2-180_v1_37@2",
            "content": "Although ephrin-A2 -/- mice have abnormal brain circuitry and associated abnormal behaviours, in the present study, the previously reported learning deficit <REF-17> was not observed due to low levels of food deprivation <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_37",
            "start": 276,
            "end": 506,
            "label": {}
        },
        {
            "ix": "2-180_v1_37@3",
            "content": "The absence of observed behavioural and structural change is consistent with previously reported rTMS specificity for abnormal systems 8 , <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_37",
            "start": 508,
            "end": 656,
            "label": {}
        },
        {
            "ix": "2-180_v1_37@4",
            "content": "Furthermore, the lack of adverse effects in our long term study contributes evidence that rTMS is safe to use in healthy control participants <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_37",
            "start": 658,
            "end": 809,
            "label": {}
        },
        {
            "ix": "2-180_v1_38@0",
            "content": "Long-term rTMS does not adversely affect learning in normal subjects",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_38",
            "start": 0,
            "end": 67,
            "label": {}
        },
        {
            "ix": "2-180_v1_39@0",
            "content": "We originally hypothesized that rTMS would rescue the learning strategy deficit in ephrin-A2 -/- mice <REF-17> with minimal or no effect on wildtype mice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_39",
            "start": 0,
            "end": 153,
            "label": {}
        },
        {
            "ix": "2-180_v1_39@1",
            "content": "However, both genotypes failed to demonstrate the strategy deficit, due to insufficient food restriction <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_39",
            "start": 155,
            "end": 269,
            "label": {}
        },
        {
            "ix": "2-180_v1_39@2",
            "content": "Our results nonetheless indicate that rTMS does not adversely affect performance, but nor does it improve motivation or accelerate learning when deficits are absent.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_39",
            "start": 271,
            "end": 435,
            "label": {}
        },
        {
            "ix": "2-180_v1_39@3",
            "content": "This is consistent with previous reports that long-term rTMS effects are specific to abnormal brain circuitry: two weeks of rTMS improved visual tracking, visual electrophysiological function and topographical accuracy in mice with abnormal circuitry but produced no lasting effects in wildtype mice <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_39",
            "start": 437,
            "end": 746,
            "label": {}
        },
        {
            "ix": "2-180_v1_39@4",
            "content": "Human studies also support specificity of rTMS for abnormal brain circuits, as a meta-analysis of rTMS effects on cognitive performance found patients tend to improve more than healthy participants <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_39",
            "start": 748,
            "end": 954,
            "label": {}
        },
        {
            "ix": "2-180_v1_39@5",
            "content": "Although some human studies using healthy participants show a single-session of rTMS enhances cognitive task performance, such as analogous reasoning <REF-32> and reaction time <REF-7> , results are mixed, with other studies showing no effect of rTMS on knowledge acquisition <REF-33> or accuracy in a go/no-go task <REF-34> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_39",
            "start": 956,
            "end": 1281,
            "label": {}
        },
        {
            "ix": "2-180_v1_39@6",
            "content": "To our knowledge, there have been no studies assessing cognitive effects of long-term rTMS in patients and healthy controls, which presents a large gap in knowledge.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_39",
            "start": 1283,
            "end": 1447,
            "label": {}
        },
        {
            "ix": "2-180_v1_39@7",
            "content": "Although more research is needed, our results support that rTMS is safe to use in healthy control participants, invaluable in assessment of rTMS effects clinically.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_39",
            "start": 1449,
            "end": 1612,
            "label": {}
        },
        {
            "ix": "2-180_v1_40@0",
            "content": "Long-term rTMS and hippocampal spine density",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_40",
            "start": 0,
            "end": 43,
            "label": {}
        },
        {
            "ix": "2-180_v1_41@0",
            "content": "Each mouse received a controlled amount of daily rTMS, allowing us to investigate how long-term rTMS combined with daily training influences spine density.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_41",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "2-180_v1_41@1",
            "content": "Importantly, we found similar spine densities in sham wildtype and ephrin-A2 -/- mice, suggesting that if present, deficits in spines are subtle in ephrin-A2 -/- mice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_41",
            "start": 156,
            "end": 322,
            "label": {}
        },
        {
            "ix": "2-180_v1_41@2",
            "content": "Although ephrin-A2 is expressed in the mouse hippocampus throughout life and has been implicated in its topographic organisation <REF-35> , <REF-36> , to our knowledge, there is no evidence that ephrin-A2 is involved in synaptic plasticity or spine dynamics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_41",
            "start": 324,
            "end": 581,
            "label": {}
        },
        {
            "ix": "2-180_v1_41@3",
            "content": "Rather, these processes involve ephrin-A3, ephrin-A5 and members of the ephrin-B family <REF-37> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_41",
            "start": 583,
            "end": 680,
            "label": {}
        },
        {
            "ix": "2-180_v1_41@4",
            "content": "As such, the null effect of rTMS on dendritic spine density is in line with our behavioural results and may be attributed to the absence of a specific spine deficit for rTMS to correct in both wildtype and ephrin-A2 -/- mice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_41",
            "start": 682,
            "end": 906,
            "label": {}
        },
        {
            "ix": "2-180_v1_41@5",
            "content": "It will be important to examine other brain regions to determine whether the selectivity of rTMS for normal and abnormal brain circuits is also observed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_41",
            "start": 908,
            "end": 1060,
            "label": {}
        },
        {
            "ix": "2-180_v1_42@0",
            "content": "Our result that spine density was not significantly altered is in agreement with a previous study, showing no change in spine density in CA1 pyramidal neurons following a single rTMS stimulation <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_42",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "2-180_v1_42@1",
            "content": "However, it is surprising that dendritic spine density remains unaffected after long-term stimulation, given our previous results using the same stimulation parameters, demonstrating structural reorganisation in abnormal axon terminals following multiple, but not single rTMS stimulation sessions <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_42",
            "start": 205,
            "end": 511,
            "label": {}
        },
        {
            "ix": "2-180_v1_42@2",
            "content": "As neither long-term nor short-term rTMS results in dendritic spine density changes, these negative results may suggest different susceptibility of axons and dendrites to rTMS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_42",
            "start": 513,
            "end": 688,
            "label": {}
        },
        {
            "ix": "2-180_v1_42@3",
            "content": "The functional characteristics of these neuronal compartments require different expression of ion channels and growth factor receptors <REF-38> , which could provide a molecular basis for differential rTMS effects on excitability and spatially localised structural and functional change.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_42",
            "start": 690,
            "end": 976,
            "label": {}
        },
        {
            "ix": "2-180_v1_43@0",
            "content": "An alternative interpretation of our null finding is that our rTMS treatment changes spine dynamics without affecting their final density, a result that would not be possible to detect in our fixed post-mortem tissue.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_43",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "2-180_v1_43@1",
            "content": "Hence, these results highlight the limitations in Golgi staining of fixed tissue, a technique still commonly used in examining dendritic spine density.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_43",
            "start": 218,
            "end": 368,
            "label": {}
        },
        {
            "ix": "2-180_v1_43@2",
            "content": "Sensory manipulation (either enrichment or withdrawal) strongly alters spine dynamics in vivo in various areas of the cortex of adult mice <REF-39> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_43",
            "start": 370,
            "end": 518,
            "label": {}
        },
        {
            "ix": "2-180_v1_43@3",
            "content": "As a rule, established spines are pruned during the initial experience of the new stimulus, while new ones are established, which may result in some studies of fixed tissue showing no net change in spine density <REF-40> , <REF-41> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_43",
            "start": 520,
            "end": 752,
            "label": {}
        },
        {
            "ix": "2-180_v1_43@4",
            "content": "Consistent with the change in spine dynamics initiated by enrichment, a recent imaging study in the hippocampus identified two phases in spine dynamics following repeated induction of LTP.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_43",
            "start": 754,
            "end": 941,
            "label": {}
        },
        {
            "ix": "2-180_v1_43@5",
            "content": "Initially both generation and retraction of spines increased, followed by a cessation of spine retraction <REF-42> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_43",
            "start": 943,
            "end": 1058,
            "label": {}
        },
        {
            "ix": "2-180_v1_43@6",
            "content": "This is consistent with post-mortem studies showing an initial period of apparent spine stability, followed by a detectable increase in density.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_43",
            "start": 1060,
            "end": 1203,
            "label": {}
        },
        {
            "ix": "2-180_v1_43@7",
            "content": "The possibility that rTMS changes spine dynamics, as opposed to density, is further supported by an increase in the size of small spines following a single stimulation, which the authors suggested may indicate the activation of silent synapses by membrane recruitment of AMPA receptors, precluding the need for de novo synapse generation <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_43",
            "start": 1205,
            "end": 1551,
            "label": {}
        },
        {
            "ix": "2-180_v1_43@8",
            "content": "Future live imaging studies of spine dynamics in animals that have received single or multiple rTMS stimulation, potentially in combination with learning tasks will provide much needed insight into the mechanisms underpinning the plastic changes elicited by rTMS in humans.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_43",
            "start": 1553,
            "end": 1825,
            "label": {}
        },
        {
            "ix": "2-180_v1_44@0",
            "content": "<REF-1> Pell GS Roth Y Zangen A : Modulation of cortical excitability induced by repetitive transcranial magnetic stimulation: Influence of timing and geometrical parameters and underlying mechanisms. Prog Neurobiol. 2011 ; 93 ( 1 ): 59 – 98 . 21056619 10.1016/j.pneurobio.2010.10.003",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_44",
            "start": 0,
            "end": 283,
            "label": {}
        },
        {
            "ix": "2-180_v1_45@0",
            "content": "<REF-2> Vlachos A Muller-Dahlhaus F Rosskopp J : Repetitive magnetic stimulation induces functional and structural plasticity of excitatory postsynapses in mouse organotypic hippocampal slice cultures. J Neurosci. 2012 ; 32 ( 48 ): 17514 – 23 . 23197741 10.1523/JNEUROSCI.0409-12.2012",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_45",
            "start": 0,
            "end": 283,
            "label": {}
        },
        {
            "ix": "2-180_v1_46@0",
            "content": "<REF-3> Ogiue-Ikeda M Kawato S Ueno S : The effect of repetitive transcranial magnetic stimulation on long-term potentiation in rat hippocampus depends on stimulus intensity. Brain Res. 2003 ; 993 ( 1–2 ): 222 – 6 . 14642850 10.1016/j.brainres.2003.09.009",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_46",
            "start": 0,
            "end": 254,
            "label": {}
        },
        {
            "ix": "2-180_v1_47@0",
            "content": "<REF-4> Tokay T Holl N Kirschstein T : High-frequency magnetic stimulation induces long-term potentiation in rat hippocampal slices. Neurosci Lett. 2009 ; 461 ( 2 ): 150 – 4 . 19539714 10.1016/j.neulet.2009.06.032",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_47",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "2-180_v1_48@0",
            "content": "<REF-5> Mozzachiodi R Byrne JH : More than synaptic plasticity: role of nonsynaptic plasticity in learning and memory. Trends Neurosci. 2010 ; 33 ( 1 ): 17 – 26 . 19889466 10.1016/j.tins.2009.10.001 2815214",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_48",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "2-180_v1_49@0",
            "content": "<REF-6> Lisman J : A mechanism for the Hebb and the anti-Hebb processes underlying learning and memory. Proc Natl Acad Sci U S A. 1989 ; 86 ( 23 ): 9574 – 8 . 2556718 10.1073/pnas.86.23.9574 298540",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_49",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "2-180_v1_50@0",
            "content": "<REF-7> Evers S Bockermann I Nyhuis PW : The impact of transcranial magnetic stimulation on cognitive processing: an event-related potential study. Neuroreport. 2001 ; 12 ( 13 ): 2915 – 8 . 11588602 10.1097/00001756-200109170-00032",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_50",
            "start": 0,
            "end": 230,
            "label": {}
        },
        {
            "ix": "2-180_v1_51@0",
            "content": "<REF-8> Guse B Falkai P Wobrock T : Cognitive effects of high-frequency repetitive transcranial magnetic stimulation: a systematic review. J Neural Transm. 2010 ; 117 ( 1 ): 105 – 22 . 19859782 10.1007/s00702-009-0333-7 3085788",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_51",
            "start": 0,
            "end": 226,
            "label": {}
        },
        {
            "ix": "2-180_v1_52@0",
            "content": "<REF-9> Harms KJ Dunaevsky A : Dendritic spine plasticity: looking beyond development. Brain Res. 2007 ; 1184 : 65 – 71 . 16600191 10.1016/j.brainres.2006.02.094",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_52",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "2-180_v1_53@0",
            "content": "<REF-10> Calverley RK Jones DG : Contributions of dendritic spines and perforated synapses to synaptic plasticity. Brain Res Brain Res Rev. 1990 ; 15 ( 3 ): 215 – 49 . 2289086 10.1016/0165-0173(90)90002-6",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_53",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "2-180_v1_54@0",
            "content": "<REF-11> Moser MB Trommald M Egeland T : Spatial training in a complex environment and isolation alter the spine distribution differently in rat CA1 pyramidal cells. J Comp Neurol. 1997 ; 380 ( 3 ): 373 – 81 . 9087519 10.1002/(SICI)1096-9861(19970414)380:3<373::AID-CNE6>3.0.CO;2-#",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_54",
            "start": 0,
            "end": 280,
            "label": {}
        },
        {
            "ix": "2-180_v1_55@0",
            "content": "<REF-14> Wallace M Luine V Arellanos A : Ovariectomized rats show decreased recognition memory and spine density in the hippocampus and prefrontal cortex. Brain Res. 2006 ; 1126 ( 1 ): 176 – 82 . 16934233 10.1016/j.brainres.2006.07.064",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_55",
            "start": 0,
            "end": 234,
            "label": {}
        },
        {
            "ix": "2-180_v1_56@0",
            "content": "<REF-15> McKinney R Thompson S : Glutamate Regulation of Dendritic Spine Form and Function . In: Larry R editor. Encyclopedia of Neuroscience. Oxford: Academic Press; 2009 ; 905 – 11 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_56",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "2-180_v1_57@0",
            "content": "<REF-16> Dur-e-Ahmad M Imran M Gul A : Calcium dynamics in dendritic spines: a link to structural plasticity. Math Biosci. 2011 ; 230 ( 2 ): 55 – 66 . 21295598 10.1016/j.mbs.2011.01.002",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_57",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "2-180_v1_58@0",
            "content": "<REF-17> Arnall S Cheam LY Smart C : Abnormal Strategies During Visual Discrimination Reversal Learning in ephrin-A2-/- Mice. Behav Brain Res. 2010 ; 209 ( 1 ): 109 – 13 . 20100519 10.1016/j.bbr.2010.01.023",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_58",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "2-180_v1_59@0",
            "content": "<REF-18> Makowiecki K Hammond G Rodger J : Different levels of food restriction reveal genotype-specific differences in learning a visual discrimination task. PLoS ONE. 2012 ; 7 ( 11 ): e48703 . 23144936 10.1371/journal.pone.0048703 3492417",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_59",
            "start": 0,
            "end": 239,
            "label": {}
        },
        {
            "ix": "2-180_v1_60@0",
            "content": "<REF-19> Rodger J Mo C Wilks T : Transcranial pulsed magnetic field stimulation facilitates reorganization of abnormal neural circuits and corrects behavioral deficits without disrupting normal connectivity. Faseb J. 2012 ; 26 ( 4 ): 1593 – 606 . 22223750 10.1096/fj.11-194878",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_60",
            "start": 0,
            "end": 275,
            "label": {}
        },
        {
            "ix": "2-180_v1_61@0",
            "content": "<REF-20> Rossi S Hallett M Rossini PM : Safety, ethical considerations, and application guidelines for the use of transcranial magnetic stimulation in clinical practice and research. Clin Neurophysiol. 2009 ; 120 ( 12 ): 2008 – 39 . 19833552 10.1016/j.clinph.2009.08.016 3260536",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_61",
            "start": 0,
            "end": 277,
            "label": {}
        },
        {
            "ix": "2-180_v1_62@0",
            "content": "<REF-21> Feldheim DA Kim Y-I, Bergemann AD : Genetic analysis of ephrin-A2 and ephrin-A5 shows their requirement in multiple aspects of retinocollicular mapping. Neuron. 2000 ; 25 ( 3 ): 563 – 74 . 10774725 10.1016/S0896-6273(00)81060-0",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_62",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "2-180_v1_63@0",
            "content": "<REF-22> Haustead DJ Lukehurst SS Clutton GT : Functional topography and integration of the contralateral and ipsilateral retinocollicular projections of ephrin-A-/- mice. J Neurosci. 2008 ; 28 ( 29 ): 7376 – 86 . 18632942 10.1523/JNEUROSCI.1135-08.2008",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_63",
            "start": 0,
            "end": 252,
            "label": {}
        },
        {
            "ix": "2-180_v1_64@0",
            "content": "<REF-23> Weissman JD Epstein CM Davey KR : Magnetic brain stimulation and brain size: relevance to animal studies. Electroencephalogr Clin Neurophysiol. 1992 ; 85 ( 3 ): 215 – 9 . 1376680 10.1016/0168-5597(92)90135-X",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_64",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "2-180_v1_65@0",
            "content": "<REF-24> Gersner R Kravetz E Feil J : Long-term effects of repetitive transcranial magnetic stimulation on markers for neuroplasticity: differential outcomes in anesthetized and awake animals. J Neurosci. 2011 ; 31 ( 20 ): 7521 – 6 . 21593336 10.1523/JNEUROSCI.6751-10.2011",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_65",
            "start": 0,
            "end": 272,
            "label": {}
        },
        {
            "ix": "2-180_v1_66@0",
            "content": "<REF-25> Shupak NM Prato FS Thomas AW : Human exposure to a specific pulsed magnetic field: effects on thermal sensory and pain thresholds. Neurosci Lett. 2004 ; 363 ( 2 ): 157 – 62 . 15172106 10.1016/j.neulet.2004.03.069",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_66",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "2-180_v1_67@0",
            "content": "<REF-27> Cook CM Thomas AW Keenliside L : Resting EEG effects during exposure to a pulsed ELF magnetic field. Bioelectromagnetics. 2005 ; 26 ( 5 ): 367 – 76 . 15887255 10.1002/bem.20113",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_67",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "2-180_v1_68@0",
            "content": "<REF-28> Martiny K Lunde M Bech P : Transcranial low voltage pulsed electromagnetic fields in patients with treatment-resistant depression. Biol Psychiatry. 2010 ; 68 ( 2 ): 163 – 9 . 20385376 10.1016/j.biopsych.2010.02.017",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_68",
            "start": 0,
            "end": 222,
            "label": {}
        },
        {
            "ix": "2-180_v1_69@0",
            "content": "<REF-29> Valero-Cabre A Pascual-Leone A Rushmore RJ : Cumulative sessions of repetitive transcranial magnetic stimulation (rTMS) build up facilitation to subsequent TMS-mediated behavioural disruptions. Eur J Neurosci. 2008 ; 27 ( 3 ): 765 – 74 . 18279329 10.1111/j.1460-9568.2008.06045.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_69",
            "start": 0,
            "end": 287,
            "label": {}
        },
        {
            "ix": "2-180_v1_70@0",
            "content": "<REF-30> Seress L Pokorny J : Structure of the granular layer of the rat dentate gyrus. A light microscopic and Golgi study. J Anat. 1981 ; 133 ( Pt 2 ): 181 – 95 . 7333948 1167662",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_70",
            "start": 0,
            "end": 179,
            "label": {}
        },
        {
            "ix": "2-180_v1_71@0",
            "content": "<REF-31> von Bohlen Und Halbach O : Structure and function of dendritic spines within the hippocampus. Ann Anat. 2009 ; 191 ( 6 ): 518 – 31 . 19783417 10.1016/j.aanat.2009.08.006",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_71",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "2-180_v1_72@0",
            "content": "<REF-32> Boroojerdi B Phipps M Kopylev L : Enhancing analogic reasoning with rTMS over the left prefrontal cortex. Neurology. 2001 ; 56 ( 4 ): 526 – 8 . 11222799 10.1212/WNL.56.4.526",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_72",
            "start": 0,
            "end": 181,
            "label": {}
        },
        {
            "ix": "2-180_v1_73@0",
            "content": "<REF-33> Roth HL Nadeau SE Triggs WJ : Effect of repetitive transcranial magnetic stimulation on rate of memory acquisition. Neurology. 2004 ; 63 ( 8 ): 1530 – 1 . 15505185 10.1212/01.WNL.0000142081.71440.6B",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_73",
            "start": 0,
            "end": 206,
            "label": {}
        },
        {
            "ix": "2-180_v1_74@0",
            "content": "<REF-34> Huang CC Su TP Shan IK : Effect of 5 Hz repetitive transcranial magnetic stimulation on cognition during a Go/NoGo task. J Psychiatr Res. 2004 ; 38 ( 5 ): 513 – 20 . 15380402 10.1016/j.jpsychires.2004.01.006",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_74",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "2-180_v1_75@0",
            "content": "<REF-35> Zhou R : Regulation of topographic projection by the Eph family receptor Bsk (EphA5) and its ligands. Cell Tissue Res. 1997 ; 290 ( 2 ): 251 – 9 . 9321686 10.1007/s004410050929",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_75",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "2-180_v1_76@0",
            "content": "<REF-36> Gerlai R Shinsky N Shih A : Regulation of learning by EphA receptors: a protein targeting study. J Neurosci. 1999 ; 19 ( 21 ): 9538 – 49 . 10531456",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_76",
            "start": 0,
            "end": 155,
            "label": {}
        },
        {
            "ix": "2-180_v1_77@0",
            "content": "<REF-37> Hruska M Dalva MB : Ephrin regulation of synapse formation, function and plasticity. Mol Cell Neurosci. 2012 ; 50 ( 1 ): 35 – 44 . 22449939 10.1016/j.mcn.2012.03.004 3631567",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_77",
            "start": 0,
            "end": 181,
            "label": {}
        },
        {
            "ix": "2-180_v1_78@0",
            "content": "<REF-38> Arnold DB : Polarized targeting of ion channels in neurons. Pflugers Arch. 2007 ; 453 ( 6 ): 763 – 9 . 17091311 10.1007/s00424-006-0155-5",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_78",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "2-180_v1_79@0",
            "content": "<REF-39> Fu M Zuo Y : Experience-dependent structural plasticity in the cortex. Trends Neurosci. 2011 ; 34 ( 4 ): 177 – 87 . 21397343 10.1016/j.tins.2011.02.001 3073830",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_79",
            "start": 0,
            "end": 167,
            "label": {}
        },
        {
            "ix": "2-180_v1_80@0",
            "content": "<REF-40> Jung CK Herms J : Structural Dynamics of Dendritic Spines are Influenced by an Environmental Enrichment: An In Vivo Imaging Study. Cereb Cortex. 2012 . 23081882 10.1093/cercor/bhs317",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_80",
            "start": 0,
            "end": 190,
            "label": {}
        },
        {
            "ix": "2-180_v1_81@0",
            "content": "<REF-41> Xu T Yu X Perlik AJ : Rapid formation and selective stabilization of synapses for enduring motor memories. Nature. 2009 ; 462 ( 7275 ): 915 – 9 . 19946267 10.1038/nature08389 2844762",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_81",
            "start": 0,
            "end": 190,
            "label": {}
        },
        {
            "ix": "2-180_v1_82@0",
            "content": "<REF-42> Oe Y Tominaga-Yoshino K Hasegawa S : Dendritic spine dynamics in synaptogenesis after repeated LTP inductions: Dependence on pre-existing spine density. Sci Rep. 2013 ; 3 : 1957 . 23739837 10.1038/srep01957 3674431",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_82",
            "start": 0,
            "end": 222,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "2-180_v1_0",
            "tgt_ix": "2-180_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_1",
            "tgt_ix": "2-180_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_0",
            "tgt_ix": "2-180_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_3",
            "tgt_ix": "2-180_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_3",
            "tgt_ix": "2-180_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_3",
            "tgt_ix": "2-180_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_3",
            "tgt_ix": "2-180_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_0",
            "tgt_ix": "2-180_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_8",
            "tgt_ix": "2-180_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_9",
            "tgt_ix": "2-180_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_8",
            "tgt_ix": "2-180_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_11",
            "tgt_ix": "2-180_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_8",
            "tgt_ix": "2-180_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_13",
            "tgt_ix": "2-180_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_8",
            "tgt_ix": "2-180_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_15",
            "tgt_ix": "2-180_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_15",
            "tgt_ix": "2-180_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_15",
            "tgt_ix": "2-180_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_8",
            "tgt_ix": "2-180_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_19",
            "tgt_ix": "2-180_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_8",
            "tgt_ix": "2-180_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_21",
            "tgt_ix": "2-180_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_21",
            "tgt_ix": "2-180_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_8",
            "tgt_ix": "2-180_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_24",
            "tgt_ix": "2-180_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_0",
            "tgt_ix": "2-180_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_26",
            "tgt_ix": "2-180_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_27",
            "tgt_ix": "2-180_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_27",
            "tgt_ix": "2-180_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_29",
            "tgt_ix": "2-180_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_26",
            "tgt_ix": "2-180_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_31",
            "tgt_ix": "2-180_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_31",
            "tgt_ix": "2-180_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_33",
            "tgt_ix": "2-180_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_31",
            "tgt_ix": "2-180_v1_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_0",
            "tgt_ix": "2-180_v1_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_36",
            "tgt_ix": "2-180_v1_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_36",
            "tgt_ix": "2-180_v1_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_38",
            "tgt_ix": "2-180_v1_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_36",
            "tgt_ix": "2-180_v1_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_40",
            "tgt_ix": "2-180_v1_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_40",
            "tgt_ix": "2-180_v1_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_40",
            "tgt_ix": "2-180_v1_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_0",
            "tgt_ix": "2-180_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_1",
            "tgt_ix": "2-180_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_2",
            "tgt_ix": "2-180_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_3",
            "tgt_ix": "2-180_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_6",
            "tgt_ix": "2-180_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_7",
            "tgt_ix": "2-180_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_8",
            "tgt_ix": "2-180_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_9",
            "tgt_ix": "2-180_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_11",
            "tgt_ix": "2-180_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_12",
            "tgt_ix": "2-180_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_13",
            "tgt_ix": "2-180_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_15",
            "tgt_ix": "2-180_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_17",
            "tgt_ix": "2-180_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_18",
            "tgt_ix": "2-180_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_19",
            "tgt_ix": "2-180_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_20",
            "tgt_ix": "2-180_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_21",
            "tgt_ix": "2-180_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_22",
            "tgt_ix": "2-180_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_23",
            "tgt_ix": "2-180_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_24",
            "tgt_ix": "2-180_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_26",
            "tgt_ix": "2-180_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_27",
            "tgt_ix": "2-180_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_28",
            "tgt_ix": "2-180_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_29",
            "tgt_ix": "2-180_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_30",
            "tgt_ix": "2-180_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_31",
            "tgt_ix": "2-180_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_32",
            "tgt_ix": "2-180_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_33",
            "tgt_ix": "2-180_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_34",
            "tgt_ix": "2-180_v1_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_35",
            "tgt_ix": "2-180_v1_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_36",
            "tgt_ix": "2-180_v1_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_37",
            "tgt_ix": "2-180_v1_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_38",
            "tgt_ix": "2-180_v1_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_40",
            "tgt_ix": "2-180_v1_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_41",
            "tgt_ix": "2-180_v1_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_42",
            "tgt_ix": "2-180_v1_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_44",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_45",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_46",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_48",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_6",
            "tgt_ix": "2-180_v1_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_7",
            "tgt_ix": "2-180_v1_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_7",
            "tgt_ix": "2-180_v1_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_7",
            "tgt_ix": "2-180_v1_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_18",
            "tgt_ix": "2-180_v1_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_20",
            "tgt_ix": "2-180_v1_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_22",
            "tgt_ix": "2-180_v1_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_41",
            "tgt_ix": "2-180_v1_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_41",
            "tgt_ix": "2-180_v1_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_41",
            "tgt_ix": "2-180_v1_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_42",
            "tgt_ix": "2-180_v1_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_28",
            "tgt_ix": "2-180_v1_30",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_32",
            "tgt_ix": "2-180_v1_34",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_0",
            "tgt_ix": "2-180_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_1",
            "tgt_ix": "2-180_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_2",
            "tgt_ix": "2-180_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_2",
            "tgt_ix": "2-180_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_2",
            "tgt_ix": "2-180_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_2",
            "tgt_ix": "2-180_v1_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_2",
            "tgt_ix": "2-180_v1_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_3",
            "tgt_ix": "2-180_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_4",
            "tgt_ix": "2-180_v1_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_5",
            "tgt_ix": "2-180_v1_5@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_6",
            "tgt_ix": "2-180_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_6",
            "tgt_ix": "2-180_v1_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_6",
            "tgt_ix": "2-180_v1_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_7",
            "tgt_ix": "2-180_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_7",
            "tgt_ix": "2-180_v1_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_7",
            "tgt_ix": "2-180_v1_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_8",
            "tgt_ix": "2-180_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_9",
            "tgt_ix": "2-180_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_10",
            "tgt_ix": "2-180_v1_10@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_11",
            "tgt_ix": "2-180_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_12",
            "tgt_ix": "2-180_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_12",
            "tgt_ix": "2-180_v1_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_12",
            "tgt_ix": "2-180_v1_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_12",
            "tgt_ix": "2-180_v1_12@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_12",
            "tgt_ix": "2-180_v1_12@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_13",
            "tgt_ix": "2-180_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_14",
            "tgt_ix": "2-180_v1_14@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_15",
            "tgt_ix": "2-180_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_16@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_16",
            "tgt_ix": "2-180_v1_16@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_17",
            "tgt_ix": "2-180_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_17",
            "tgt_ix": "2-180_v1_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_17",
            "tgt_ix": "2-180_v1_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_18",
            "tgt_ix": "2-180_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_18",
            "tgt_ix": "2-180_v1_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_18",
            "tgt_ix": "2-180_v1_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_18",
            "tgt_ix": "2-180_v1_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_18",
            "tgt_ix": "2-180_v1_18@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_19",
            "tgt_ix": "2-180_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_20",
            "tgt_ix": "2-180_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_20",
            "tgt_ix": "2-180_v1_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_20",
            "tgt_ix": "2-180_v1_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_20",
            "tgt_ix": "2-180_v1_20@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_20",
            "tgt_ix": "2-180_v1_20@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_20",
            "tgt_ix": "2-180_v1_20@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_21",
            "tgt_ix": "2-180_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_22",
            "tgt_ix": "2-180_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_22",
            "tgt_ix": "2-180_v1_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_22",
            "tgt_ix": "2-180_v1_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_22",
            "tgt_ix": "2-180_v1_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_22",
            "tgt_ix": "2-180_v1_22@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_22",
            "tgt_ix": "2-180_v1_22@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_22",
            "tgt_ix": "2-180_v1_22@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_23",
            "tgt_ix": "2-180_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_23",
            "tgt_ix": "2-180_v1_23@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_24",
            "tgt_ix": "2-180_v1_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_25",
            "tgt_ix": "2-180_v1_25@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_26",
            "tgt_ix": "2-180_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_27",
            "tgt_ix": "2-180_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_28",
            "tgt_ix": "2-180_v1_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_28",
            "tgt_ix": "2-180_v1_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_29",
            "tgt_ix": "2-180_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_31",
            "tgt_ix": "2-180_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_32",
            "tgt_ix": "2-180_v1_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_32",
            "tgt_ix": "2-180_v1_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_32",
            "tgt_ix": "2-180_v1_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_32",
            "tgt_ix": "2-180_v1_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_32",
            "tgt_ix": "2-180_v1_32@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_33",
            "tgt_ix": "2-180_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_35",
            "tgt_ix": "2-180_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_35",
            "tgt_ix": "2-180_v1_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_35",
            "tgt_ix": "2-180_v1_35@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_36",
            "tgt_ix": "2-180_v1_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_37",
            "tgt_ix": "2-180_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_37",
            "tgt_ix": "2-180_v1_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_37",
            "tgt_ix": "2-180_v1_37@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_37",
            "tgt_ix": "2-180_v1_37@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_37",
            "tgt_ix": "2-180_v1_37@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_38",
            "tgt_ix": "2-180_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_39@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_39@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_39@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_39@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_39",
            "tgt_ix": "2-180_v1_39@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_40",
            "tgt_ix": "2-180_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_41",
            "tgt_ix": "2-180_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_41",
            "tgt_ix": "2-180_v1_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_41",
            "tgt_ix": "2-180_v1_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_41",
            "tgt_ix": "2-180_v1_41@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_41",
            "tgt_ix": "2-180_v1_41@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_41",
            "tgt_ix": "2-180_v1_41@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_42",
            "tgt_ix": "2-180_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_42",
            "tgt_ix": "2-180_v1_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_42",
            "tgt_ix": "2-180_v1_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_42",
            "tgt_ix": "2-180_v1_42@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_43@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_43@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_43@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_43@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_43@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_43@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_43@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_43",
            "tgt_ix": "2-180_v1_43@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_44",
            "tgt_ix": "2-180_v1_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_45",
            "tgt_ix": "2-180_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_46",
            "tgt_ix": "2-180_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_47",
            "tgt_ix": "2-180_v1_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_48",
            "tgt_ix": "2-180_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_49",
            "tgt_ix": "2-180_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_50",
            "tgt_ix": "2-180_v1_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_51",
            "tgt_ix": "2-180_v1_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_52",
            "tgt_ix": "2-180_v1_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_53",
            "tgt_ix": "2-180_v1_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_54",
            "tgt_ix": "2-180_v1_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_55",
            "tgt_ix": "2-180_v1_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_56",
            "tgt_ix": "2-180_v1_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_57",
            "tgt_ix": "2-180_v1_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_58",
            "tgt_ix": "2-180_v1_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_59",
            "tgt_ix": "2-180_v1_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_60",
            "tgt_ix": "2-180_v1_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_61",
            "tgt_ix": "2-180_v1_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_62",
            "tgt_ix": "2-180_v1_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_63",
            "tgt_ix": "2-180_v1_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_64",
            "tgt_ix": "2-180_v1_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_65",
            "tgt_ix": "2-180_v1_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_66",
            "tgt_ix": "2-180_v1_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_67",
            "tgt_ix": "2-180_v1_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_68",
            "tgt_ix": "2-180_v1_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_69",
            "tgt_ix": "2-180_v1_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_70",
            "tgt_ix": "2-180_v1_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_71",
            "tgt_ix": "2-180_v1_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_72",
            "tgt_ix": "2-180_v1_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_73",
            "tgt_ix": "2-180_v1_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_74",
            "tgt_ix": "2-180_v1_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_75",
            "tgt_ix": "2-180_v1_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_76",
            "tgt_ix": "2-180_v1_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_77",
            "tgt_ix": "2-180_v1_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_78",
            "tgt_ix": "2-180_v1_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_79",
            "tgt_ix": "2-180_v1_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_80",
            "tgt_ix": "2-180_v1_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_81",
            "tgt_ix": "2-180_v1_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_82",
            "tgt_ix": "2-180_v1_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "2-180_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.2-180.v1",
        "atype": "short-research-article",
        "license": "http://creativecommons.org/licenses/by/3.0/",
        "title": "Long term delivery of pulsed magnetic fields does not improve learning or alter dendritic spine density in the mouse hippocampus",
        "abstract": "Repetitive transcranial magnetic stimulation (rTMS) is thought to facilitate brain plasticity. However, few studies address anatomical changes following rTMS in relation to behaviour. We delivered 5 weeks of daily pulsed rTMS stimulation to ephrin-A2 -/- and wildtype mice (n=10 per genotype) undergoing a visual learning task and analysed learning performance, as well as spine density, in the dentate gyrus molecular and CA1 pyramidal cell layers in Golgi-stained brain sections. We found that neither learning behaviour, nor hippocampal spine density was affected by long term rTMS. Our negative results highlight the lack of deleterious side effects in normal subjects and are consistent with previous studies suggesting that rTMS has a bigger effect on abnormal or injured brain substrates than on normal/control structures.",
        "contributors": [
            {
                "surname": "Sykes",
                "given-names": "Matthew"
            },
            {
                "surname": "Makowiecki",
                "given-names": "Kalina"
            },
            {
                "surname": "Rodger",
                "given-names": "Jennifer"
            }
        ],
        "url": "https://f1000research.com/articles/2-180/v1/",
        "doc_id": "2-180",
        "version": 1,
        "ix_counter": 359,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}