{
    "nodes": [
        {
            "ix": "246-ARR_v2_0",
            "content": "Re-Examining System-Level Correlations of Automatic Summarization Evaluation Metrics",
            "ntype": "article-title",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_2",
            "content": "How reliably an automatic summarization evaluation metric replicates human judgments of summary quality is quantified by systemlevel correlations. We identify two ways in which the definition of the system-level correlation is inconsistent with how metrics are used to evaluate systems in practice and propose changes to rectify this disconnect. First, we calculate the system score for an automatic metric using the full test set instead of the subset of summaries judged by humans, which is currently standard practice. We demonstrate how this small change leads to more precise estimates of system-level correlations. Second, we propose to calculate correlations only on pairs of systems that are separated by small differences in automatic scores which are commonly observed in practice. This allows us to demonstrate that our best estimate of the correlation of ROUGE to human judgments is near 0 in realistic scenarios. The results from the analyses point to the need to collect more high-quality human judgments and to improve automatic metrics when differences in system scores are small. 1",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1"
            }
        },
        {
            "ix": "246-ARR_v2_4",
            "content": "Automatic evaluation metrics are the most common method that researchers use to quickly and cheaply approximate how humans would rate the quality of a summarization system (Lin, 2004;Louis and Nenkova, 2013;Zhao et al., 2019;Zhang et al., 2020;Deutsch et al., 2021a, among others). The quality of a metric -how similarly it replicates human judgments of systems -is quantified by calculating the correlation between the metric's scores and human judgments on a set of systems, known as the system-level correlation (Louis and Nenkova, 2013;Deutsch et al., 2021b).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_5",
            "content": "Accurately estimating system-level correlations is critically important. Summarization researchers use automatic metrics during system development to make decisions about which ideas work and which do not, and systems from different research groups are ranked by automatic metrics to define which system is the \"state-of-the-art.\" If we do not have precise estimates of metric quality, it is not clear how much trust the community should put in such evaluation methodologies.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_6",
            "content": "At present, there are disconnects between how automatic metrics are evaluated and how they are used to evaluate systems. First, the metrics' scores which are used in practice are not the ones which are evaluated in system-level correlations; researchers compare systems based on metric scores calculated on the entire test set but calculate scores for system-level correlations when evaluating metrics on a much smaller subset of judged summaries. Second, metrics are evaluated in a setting that is much easier than how they are actually used. Metric correlations are calculated using systems that vary greatly in quality, whereas researchers compare new systems to recent work, which are likely to be very close in quality. Discriminating between two systems of similar quality is much harder than doing so between low and high quality systems.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_7",
            "content": "In this work, we re-examine how system-level correlations are calculated and propose two independent changes to make the evaluation of metrics better aligned to how they are actually used to evaluate systems.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_8",
            "content": "First, we propose to modify the system-level correlation definition to use the entire test set to calculate the system scores for automatic metrics instead of only the subset of summaries judged by humans ( §3). With this change, the scores which are used to compare systems are directly evaluated, and we further demonstrate how the precision of our estimate of system-level correlations improves as a result. Calculating system scores over a larger number of instances reduces the variance of the scores, which results in confidence intervals (CIs) for the correlations that are 16-51% more narrow on average ( §3.2).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_9",
            "content": "Second, we redefine a high quality metric to be one for which a small difference in score reliably indicates a difference in quality ( §4). Then, instead of calculating the correlation with all available system pairs, we only evaluate with pairs of systems whose automatic metric scores differ by some threshold. This allows us to show, for example, that a ROUGE-1 score difference of less than 0.5 between systems has almost no correlation to how humans would rank the same two systems according to our best estimates ( §4.2). For two other metrics, BERTScore (Zhang et al., 2020) and QAEval (Deutsch et al., 2021a), we show their correlations calculated on system pairs of similar quality are much worse than under the standard correlation definition. These results cast doubt on how reliable automatic evaluation metrics are for measuring summarization system quality in realistic scenarios.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_10",
            "content": "Our analyses point to the need to collect more high-quality human judgments of summaries in order to have more accurate estimates of metric correlations as well as the need to improve the ability of automatic metrics to discriminate between similarly performing systems.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_11",
            "content": "Background",
            "ntype": "title",
            "meta": {
                "section": "2"
            }
        },
        {
            "ix": "246-ARR_v2_12",
            "content": "Automatic evaluation metrics are most commonly used to argue that one summarization system is better than another, typically by showing that the value of a metric improves with the \"better\" system. How similarly automatic metrics replicate human judgments of system quality is quantified by system-level correlations as follows.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_13",
            "content": "The summaries from N systems on M jud input documents are judged by humans Z and scored with an automatic metric X . Then, the systemlevel correlation between X and Z is calculated as",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_14",
            "content": "r SYS = CORR         1 M jud M jud j x j i , 1 M jud M jud j z j i      N i=1   ",
            "ntype": "formula",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_15",
            "content": "where x j i and z j i are the scores of X and Z for the summary produced by the i-th system on the j-th input document and CORR is some correlation function. See Fig. 1 for an illustration of this calculation.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_16",
            "content": "Figure 1: The system-level correlation is calculated between the average X and Z scores on a set of summarization systems. x j i and z j i are the scores for the summary produced by system i (represented by rows) on input document j (represented by columns).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_17",
            "content": "In this work, we use Kendall's τ (the \"b\" variant 2 ) as the correlation function because we are most concerned with a metric's ability to correctly determine whether one system is better than another since that is how metrics are used in practice. Kendall's τ is computed based on the number of system pairs out of N 2 which are ranked the same by X and Z. It is defined as",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_18",
            "content": "τ = P − Q (P + Q + T ) • (P + Q + U )(1)",
            "ntype": "formula",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_19",
            "content": "where P and Q are the number of pairs ranked the same or different by X and Z, respectively, and T and U are the number of ties only in X or Z, respectively.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_20",
            "content": "Because the computation of r SYS involves randomness -its value depends on which M jud input documents (and even which N systems) were used -it is only an approximation of the true correlation between X and Z. As such, Deutsch et al. (2021b) proposed various methods for calculating confidence intervals for r SYS . For instance, their BOOT-INPUTS method uses bootstrapping to repeatedly resample the M jud input documents used to calculate r SYS , thereby calculating a confidence interval for the true r SYS value for X and Z.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_21",
            "content": "The datasets that are used in this paper's analyses are SummEval (Fabbri et al., 2021) and REALSumm (Bhandari et al., 2020), two recently collected datasets with human annotations for summary quality collected from the CNN/DailyMail dataset (Nallapati et al., 2016). SummEval has M jud = 100 summaries annotated with a summary relevance score for N = 16 systems. REALSumm has M jud = 100 summaries annotated with a Lightweight Pyramid score (Shapira et al., 2019) for N = 25 systems. We correlate the scores of the automatic metrics to these annotations. The CNN/DailyMail test split has 11, 490 instances.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_22",
            "content": "Our experiments will analyze three different reference-based automatic evaluation metrics which were chosen because they were demonstrated to have the best correlations with human judgments on the SummEval and REALSumm datasets (Deutsch et al., 2021b). ROUGE-n (Lin, 2004) evaluates a generated summary by calculating an F 1 score on the number of ngrams it has in common with a human-written reference summary. BERTScore (Zhang et al., 2020) aligns the generated and reference summaries' tokens based on their BERT embeddings (Devlin et al., 2019) and calculates a score based on the similarity of the aligned tokens' embeddings. QA-Eval (Deutsch et al., 2021a) compares the two summaries by automatically generating questions from the reference and calculating what proportion of those questions are answered correctly by the generated summary.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_23",
            "content": "Evaluating with All Available Instances",
            "ntype": "title",
            "meta": {
                "section": "3"
            }
        },
        {
            "ix": "246-ARR_v2_24",
            "content": "Although the above definition of the system-level correlation has been used by recent meta-evaluation studies of metrics (Bhandari et al., 2020;Fabbri et al., 2021;Deutsch et al., 2021b), there is a disconnect between how the automatic metrics are evaluated and how they are used in practice.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_25",
            "content": "Researchers who develop summarization systems evaluate those systems with automatic metrics on all M test test instances, not just the subset of M jud instances which were judged by humans. Evaluating a system on a larger number of summaries may end up changing the system's score, which could potentially alter the overall ranking of a set of systems. Therefore, the rankings that are used by practitioners to determine system quality are not the ones which are being evaluated in the standard definition of system-level correlation. To that end, we propose to modify the correlation definition to use all M test instances to calculate the system scores for the automatic metrics. That is (differences in bold):",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_26",
            "content": "r SYS = CORR         1 M test Mtest j x j i , 1 M jud M jud j z j i      N i=1   ",
            "ntype": "formula",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_27",
            "content": "In practice with modern, large-scale datasets, this minor change could mean estimating system quality based on ≈10k inputs instead of around 100. This new definition now properly evaluates the way metrics are actually used by researchers. We expect that scoring systems with M test inputs instead of M jud should lead to a better estimate of the true automatic metric score, which would in turn result in a lower-variance estimate of the correlation between X and Z in the form of smaller confidence intervals for r SYS . In the next sections, we carry out analyses to demonstrate that this is true.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_28",
            "content": "Reducing Automatic Metric Variance",
            "ntype": "title",
            "meta": {
                "section": "3.1"
            }
        },
        {
            "ix": "246-ARR_v2_29",
            "content": "First, we empirically show that scoring systems with M test instances instead of M jud does indeed reduce the variance of the estimate of the automatic metric scores and subsequently increases the stabilities of the system rankings.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_30",
            "content": "Ideally, the X score for a system would be its \"oracle\" X score, equal to the expected value of X for a document sampled from the latent distribution over documents defined by the dataset (e.g., a system's ROUGE score on an infinite number of examples from a dataset). Since this cannot be calculated, it is approximated by averaging the X score on a sample (i.e., either the M jud or M test input documents). Because M test M jud , we expect that the variance of this estimate using M test inputs should be lower than when using M jud .",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_31",
            "content": "Figure 3: Bootstrapped estimates of the stabilities of the system rankings for automatic metrics and human annotations on SummEval (left) and REALSumm (right). The τ value quantifies how similar two system rankings would be if they were computed with two random sets of M input documents. When all M test test instances are used, the automatic metrics' rankings become near constant. The error regions represent ±1 standard deviation.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_32",
            "content": "To quantify this, we calculated the variance of estimating the oracle X score using both M jud and M test input documents via bootstrapping. We randomly sampled M input documents with replacement, recomputed the system scores, and calculated the variance of those scores over 1k iterations. For all three metrics on both datasets, we found around a 99% reduction in the variance when M test inputs were used instead of M jud , clearly demonstrating that evaluating systems with M test inputs results in a better estimate of the system scores. In Fig. 2, this is visualized for BERTScore on the REALSumm dataset.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_33",
            "content": "However, because we are interested in evaluating the metrics' rankings, we also quantify how much of an effect this reduction in variance has on the stability of the system rankings induced by X . Similarly to the system scores, there is an oracle ranking of systems for X , equal to the ordering of systems by their respective oracle X scores (e.g., systems sorted by their ROUGE scores calculated on an infinite number of examples from a dataset). As the variance of the system score estimates decreases, the computed ranking of systems should begin to converge to the oracle X ranking. We aim to understand to what extent this happens if M test instances are used for evaluation instead of M jud .",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_34",
            "content": "To quantify this notion, we calculate the Kendall's τ between two system rankings for X that were based on two sets of M input documents, each sampled with replacement from the set of available documents. This simulates how much the system rankings would change if the evaluation procedure was run twice, each time with M random input documents. This quantity is calculated 1k times for various values of M and plotted in Fig. 3.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_35",
            "content": "As M approaches M test , the automatic metrics' τ values approach 1, which is much higher than the respective values at M jud , typically around 0.6-0.8. A value near 1 means that the rankings calculated using M test inputs are almost constant, implying the rankings have converged to the oracle ranking. Therefore, the reduction in variance from evaluating on M test instances does indeed greatly stabilize the system rankings.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_36",
            "content": "Fig. 3 also contains the same analysis performed for the human judgments Z in both datasets, although it is limited to a maximum of M jud input documents. We see that on both datasets the judgments' rankings are still quite variable, reaching a maximum τ of around 0.8-0.85.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_37",
            "content": "Confidence Interval Analysis",
            "ntype": "title",
            "meta": {
                "section": "3.2"
            }
        },
        {
            "ix": "246-ARR_v2_38",
            "content": "Next, we show that the improved estimate of system scores leads to a more precise estimate of r SYS by demonstrating the widths of the confidence intervals for r SYS decrease.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_39",
            "content": "The confidence intervals for r SYS calculated using bootstrapping methods proposed by Deutsch et al. (2021b) are rather wide. For instance, the 95% CI for ROUGE-2 on SummEval is [−.09, .84], demonstrating a rather high level of uncertainty in its value. This is problematic because it means we do not have a good picture of how reliable automatic evaluation metrics are. Reducing the width of the CIs will help us better understand the true metric quality.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_40",
            "content": "We suspect that the large width of the confidence interval is due to the variance of the system rankings of the automatic metrics and human judgments. The more unstable the rankings are with respect to the M inputs, the larger the variance of the estimate of r SYS should be since very different system rankings would be compared on each bootstrapping iteration. Deutsch et al. (2021b) used M jud input documents to calculate their CIs. Therefore, we expect the improved stability of the automatic metric system rankings from evaluating on M test instances should result in a more narrow confidence interval for r SYS since some noise has been removed from this computation.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_41",
            "content": "To demonstrate this, we calculated 95% CIs for r SYS using the BOOT-INPUT method on SummEval and REALSumm using both M jud and M test input documents, shown in Fig. 4. We find that the widths of the CIs shrank on average by 51% on SummEval and 16% on REALSumm. The largest decrease in width is in the ROUGE family of metrics on SummEval, potentially because that metric and dataset combination saw the biggest improvement in ranking stability (see Fig. 3). Thus, the improved estimate of the system scores did result in more precise estimates of r SYS . We repeated this analysis using the other bootstrapping methods proposed by Deutsch et al. (2021b), and the results are discussed in Appendix A.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_42",
            "content": "Conclusions & Recommendations",
            "ntype": "title",
            "meta": {
                "section": "3.3"
            }
        },
        {
            "ix": "246-ARR_v2_43",
            "content": "By estimating system quality using automatic metrics on all available instances instead of only those which were judged, we showed that the variances of the system scores and subsequent rankings reduce significantly, resulting in better estimates of r SYS . Because this methodology additionally directly evaluates the system scores used by researchers, we recommend future work do the same.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_44",
            "content": "In order to continue to improve the estimate of r SYS , as much variance as possible needs to be removed from the system rankings. Evaluating systems using M test instances removed a large amount of variance from the automatic metric rankings, but as demonstrated in Fig. 3, the human judgments still have a large amount of variance.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_45",
            "content": "The human rankings' variances can either be reduced by judging more summaries per system or making the judgments more consistent. Since the human rankings' stabilities in Fig. 3 are mostly beginning to plateau -especially for SummEval -it may be prohibitively expensive to collect a sufficient number of judgments to better stabilize the rankings (Wei and Jia, 2021). Therefore, we expect the more feasible solution is to improve the consistency of the human judgments, for example by better training the annotators or improving the annotation protocol.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_46",
            "content": "Evaluating with Realistic System Pairs",
            "ntype": "title",
            "meta": {
                "section": "4"
            }
        },
        {
            "ix": "246-ARR_v2_47",
            "content": "Next, we argue that the set of systems used to evaluate metrics is not reflective of how metrics are used in practice and propose a new system-level correlation variant to address this problem.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_48",
            "content": "Evaluating with All System Pairs",
            "ntype": "title",
            "meta": {
                "section": "4.1"
            }
        },
        {
            "ix": "246-ARR_v2_49",
            "content": "The N systems which are used for calculating system-level correlations are typically those which participated in a shared task, as in DUC/TAC (Dang and Owczarzak, 2008, among others), or those which have been published in the previous 3-4 years (Bhandari et al., 2020;Fabbri et al., 2021). As such, they are typically rather diverse in terms of their qualities, both as rated by human annotators and automatic metrics.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_50",
            "content": "The system scores of all of the systems in the REALSumm dataset as evaluated by humans and automatic metrics are shown in Fig. 5. Clearly, the scores are rather diverse. For example, the systems cluster into low, medium, and high quality groups (with an additional outlier) as evaluated by ROUGE. A difference of around 5 ROUGE points between them is a rather large gap for ROUGE scores.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_51",
            "content": "The standard definition for a high quality evaluation metric is one which correctly ranks a set of systems with respect to human judgments. As such, the implementation of the system-level correlation calculated with Kendall's τ will rank all N systems according to the human judgments and an automatic metric, then count how many pairs were ranked the same out of all N 2 pairs (see §2). As a consequence, even pairs of systems which are separated by a large margin according to the automatic metric -likely systems with a clear difference in quality -are included in the evaluation. Therefore, automatic metrics are rewarded for correctly ranking such \"easy\" system pairs.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_52",
            "content": "Evaluating with Realistic Pairs",
            "ntype": "title",
            "meta": {
                "section": "4.2"
            }
        },
        {
            "ix": "246-ARR_v2_53",
            "content": "This standard evaluation setting does not reflect how summarization metrics are actually used by researchers. New systems are typically only slightly better than previous work. Based on a survey of recent summarization papers in *ACL conferences (see Appendix C), we found that the average improvement over baseline/state-of-the-art models that was reported on the CNN/Dailymail dataset was on average 0.5 ROUGE-1. It is rarely the case that the improvement in automatic metrics is very large. Therefore, evaluating metrics using pairs of systems which are separated by a large margin does not reflect the reality that metrics are very frequently used to compare those separated by a small margin. Including \"easy\" system pairs in the system-level correlation likely overestimates the quality of the metrics in settings which occur in practice.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_54",
            "content": "To that end, we redefine a high quality evaluation metric to be one for which a small difference in scores reliably indicates a difference in quality. We quantify this by proposing a variant of the system-level τ which is calculated between system pairs which are separated by a pre-defined automatic metric score margin. Instead of using all N 2 system pairs, only pairs whose difference in scores falls within the margin are used to calculate the system-level correlation. We denote this correlation variant as r SYS ∆( , u) where and u are the lower-and upper-bounds of the allowable differences in automatic metrics' scores. This would enable, for example, evaluating how well ROUGE correlates to human judgments on system pairs that are separated by 0.0-0.5 ROUGE points, thereby directly evaluating the scenario in which ROUGE is used to make decisions about system quality.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_55",
            "content": "In Fig. 6 we report the r SYS ∆( , u) correlations for = 0.0 and various values of u on both the SummEval and REALSumm datasets (more combinations of and u are included in Appendix B). That is, we evaluate r SYS only on system pairs which are separated by at most an automatic score of u. The values of u were selected by picking the minimum u which would result in evaluating on 10%, 20%, . . . , 100% of the N 2 possible system pairs closest in score to be consistent across all three metrics.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_56",
            "content": "The correlations for each metric on the system pairs closest in score are far lower than the correlations evaluated on all of the system pairs. For instance, the correlation of BERTScore on Summ-Eval with the closest 20% of system pairs (u ≈ 0.2) is only 0.42 compared to 0.77 under the standard definition of r SYS . Thus, it is clear that the metrics are much less reliable approximations of human judgments when the system scores are close than was previously known. Evaluating on all possible system pairs leads to an overly optimistic view of automatic metric quality.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_57",
            "content": "The r SYS ∆( , u) correlation of ROUGE for = 0.0 and u = 0.5 -a typical improvement reported by researchers -is 0.08 and 0.0 on the Summ-Eval and REALSumm datasets. Therefore, these results suggest the most popular summarization evaluation metric agrees with human judgments of system quality in realistic scenarios only slightly better than or equal to random chance. For instance, 20% of the N 2 system pairs on SummEval are separated by < 0.5 ROUGE-1, and the system-level correlation on those pairs is around 0.08. As more systems are used in the correlation calculation, the allowable gap in scores between system pairs increases, and are therefore likely easier to rank, resulting in higher correlations.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_58",
            "content": "This result also offers an explanation for why a naive metric such as ROUGE achieves moderately strong correlations under the standard definition of the system-level correlation (0.45 and 0.73 on SummEval and REALSumm) despite well known flaws and criticisms (Passonneau et al., 2005;Conroy and Dang, 2008;Deutsch and Roth, 2020, among others): it has benefited from an easy evaluation protocol. Despite its simplicity, it is not too surprising that a large gap of 5-10 ROUGE points actually does correctly rank system pairs. Most of its positive correlation comes from such easy examples.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_59",
            "content": "Conclusions & Recommendations",
            "ntype": "title",
            "meta": {
                "section": "4.3"
            }
        },
        {
            "ix": "246-ARR_v2_60",
            "content": "If it is assumed that we have enough high-quality judgments to accurately discriminate between two similarly performing systems, then the results in Fig. 6 show that the correlations in realistic settings are trending very low, meaning automatic metrics are not nearly sensitive enough to distinguish between systems with only minor differences in quality. This is problematic because this is the scenario in which metrics are most frequently used, and therefore they are not very reliable methods of evaluating summarization systems. However, it is not all bad news. Because the standard systemlevel τ values are moderately positive, consistent improvements in automatic metrics over time will likely result in better quality systems. Similarly to stochastic gradient descent, not every reported improvement is real, but on average over time, the quality does improve. Nonetheless, future work should focus on improving the quality of evaluation metrics when the differences in system performance are small, and researchers who compare systems should invest more effort into their human evaluations since automatic evaluations are not very reliable.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_61",
            "content": "However, because the available number of system pairs to calculate the correlations in Fig. 6 is rather small -especially when evaluating on the closest system pairs -and recent work suggests we may not have enough human judgments to accurately distinguish between similarly performing systems (Wei and Jia, 2021), it could be difficult to reach any definitive conclusions about the metrics' correlations. That being said, these are our best estimates of the correlations with the available data. Not knowing how much we can trust automatic metrics is not a good outcome. In this scenario, future work should focus on collecting more, high-quality human judgments so that we can better meta-evaluate automatic metrics. Since we argue that it is important to distinguish between similarly performing systems, new data collection efforts should consider using targeted pairwise judgments between those systems instead of direct assessments across a variety of systems of diverse quality.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_62",
            "content": "We recommend that proposals of new evaluation metrics also report correlations on system pairs with various differences in scores in addition to the standard system-level correlation definition. Reporting this information would better inform users of metrics about how likely humans would agree their observed improvement is real based on its value.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_63",
            "content": "Related Work",
            "ntype": "title",
            "meta": {
                "section": "5"
            }
        },
        {
            "ix": "246-ARR_v2_64",
            "content": "The methodology behind meta-evaluating summarization evaluation metrics was established during the DUC/TAC shared tasks (Dang and Owczarzak, 2008, among others). In addition to competitions for developing high-quality summarization systems, there were also shared tasks for creating automatic metrics that correlated well with human judgments. The benchmark datasets created during DUC/TAC were small in size by today's standards because they were manually collected multi-document summarization datasets, which are hard to create at scale. As such, all of the model-generated summaries on the full test set were judged (so M jud = M test ; §3), unlike for current datasets which are too large to fully judge.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_65",
            "content": "Recently, there has been growing interest in revisiting the meta-evaluation of automatic evaluation metrics for summarization, in part due to the large differences between currently popular summarization datasets and those used in DUC/TAC. We view our work as continuing this direction of research, described next.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_66",
            "content": "Peyrard (2019) argues that current evaluation metrics do not work as well when they are used to evaluate high-performing systems compared to those which were evaluated in DUC/TAC.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_67",
            "content": "Both Fabbri et al. (2021) and Bhandari et al. (2020) re-evaluated how well existing evaluation metrics work on the popular CNN/DailyMail dataset (Nallapati et al., 2016) by collecting judgments of summary quality using recent state-ofthe-art systems. These datasets were used in our analyses. While the goal of these works was to identify which metrics correlated best with human judgments, our goal is to point out the ways in which the current methodology of meta-evaluating metrics is inconsistent with how they are used.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_68",
            "content": "Then, the work of Deutsch et al. (2021b) proposed statistical methods for estimating and comparing correlation values. In contrast to our work, they provide statistical tools for analyzing correlations, whereas we propose new definitions of correlations.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_69",
            "content": "Finally, Wei and Jia (2021) provided a theoretical analysis of the bias and variance of automatic and human evaluations of machine translations and summaries. Among their conclusions, they argue for evaluating metrics with pairwise accuracy (Kendall's τ ) and that it may be prohibitively expensive to collect enough human judgments to distinguish between two systems with very similar quality. Our work further argues that metrics should be evaluated with a variant of Kendall's τ calculated using realistic system pairs ( §4). Unfortunately, their results suggest that collecting enough human judgments to accurately measure how well automatic metrics perform in this setting may be very difficult.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_70",
            "content": "Related studies to ours have examined how the choice of which systems to include in metric evaluations impacts the correlation values. Both Mathur et al. ( 2020) and Bhandari et al. (2020) identify that metrics perform worse when scoring only the top-k systems in machine translation and summarization, respectively, and examine the use of pairwise comparisons for metric evaluation. Further, Mathur et al. ( 2020) demonstrate that outlier systems have an out-sized influence on the correlation values and recommend removing them from the metric evaluations. In contrast, our work proposes to change the evaluation methodology for metrics so that it more closely resembles how they are used in practice. This results in evaluating only on system pairs which are realistically compared by researchers, that is, those separated by small margins in automatic metric scores. We believe that this is a more principled approach to how to select which system pairs to evaluate on compared to previous work.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_71",
            "content": "Conclusion",
            "ntype": "title",
            "meta": {
                "section": "6"
            }
        },
        {
            "ix": "246-ARR_v2_72",
            "content": "In this work, we proposed two independent changes to how the system-level correlation of metrics is calculated to better align with how they are used to evaluate systems. Our analyses showed that these modifications led to lower-variance estimates of correlations and that commonly reported improvements in metric scores may not reliably predict how humans would judge system quality. The results from the analyses point to the need for future data collection efforts of high-quality human judgments and improving automatic evaluation metrics when differences in system performance are small.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_73",
            "content": "In addition to the BOOT-INPUTS CI method proposed by Deutsch et al. (2021b), the authors also proposed BOOT-SYSTEMS and BOOT-BOTH. Each of the three methods makes assumptions about whether the set of N systems and M input documents are fixed or variable during the bootstrapping calculation. For instance, BOOT-INPUTS assumes the N systems are always the same and the M input documents are random, then subsequently resamples M input documents on each bootstrapping iteration to calculate the confidence interval. BOOT-SYSTEMS does the opposite by resampling which N systems are used while holding the original M input documents fixed. BOOT-BOTH assumes both the systems and inputs are variable. of the paper, Fig. 4). The widths of the BOOT-BOTH CIs decreased by 14% and 12%, whereas the BOOT-SYSTEMS CIs only decreased by 1% and 6%.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_74",
            "content": "The BOOT-SYSTEMS widths likely decreased less because its estimation of r SYS is not dependent on the variance of the system score estimates. Since the set of M input documents is fixed, the system scores do not change at all during bootstrapping, so increasing the number of summaries used to estimate those scores should not have a major effect on the estimation of r SYS .",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_75",
            "content": "Fig. 9 contains the r SYS ∆( , u) correlations for when = 0 for ROUGE-1, ROUGE-2, and ROUGE-L, equivalent to those shown in Fig. 6 in the main body of the paper (ROUGE-1 is shown in both). The ROUGE-2 and ROUGE-L results are largely consistent with those of ROUGE-1. The metrics' correlations to human annotations are low (or even negative) when the differences between system scores are small. As more pairs are added that differ by larger margins, the correlations increase.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_76",
            "content": "Figs. 10 and 11 contain the r SYS ∆( , u) correlations for ROUGE, BERTScore, and QAEval for various combinations of and u on both the Summ-Eval and REALSumm datasets. The first rows of each heatmap are plotted in Figs. 6 and 9. We see that as the allowed score gap between system pairs is allowed to increase (i.e., adding \"easier\" pairs to rank), the correlation increases by a large margin over the correlation on pairs close in score. All of the metrics have nearly perfect correlation when the system pairs are separated by large margins.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_77",
            "content": "To estimate the difference in ROUGE-1 score that is commonly reported in papers, we performed a survey of recently published summarization papers. We selected papers from 2020 and 2021 that were published in a *ACL conference (including Findings), had \"summary\" or \"summarization\" in the title, proposed a new system, and compared systems on the CNN/DailyMail dataset with ROUGE. We selected the differences between the best two models that were compared with ROUGE on the test set. We did not include ablation experiments for which the differences are likely smaller than the differences between the top two performing systems. The results are shown in Table 1. The average reported difference was found to be 0.49 ROUGE-1. 1.6 3.9 6.4 9.0 18.8 1.0 1.9 2.9 4.5 9.1 1.8 3.5 5. The values of and u were chosen so that each value in the heatmaps evaluates on 10% more system pairs than the value to its left. For instance, the first row evaluates on 10%, 20%, . . . , 100% of the system pairs. The second row evaluates on 10%, 20%, . . . , 90% of the system pairs, never including the 10% of pairs which are closest in score. The first row of each of the heatmaps is plotted in Fig. 6. The correlations on realistic score differences between systems are in the upper left portion of the heatmaps and contain the lowest correlations overall. Evaluating on all pairs is the top-rightmost entry, and the \"easiest\" pairs (those separated by a large score margin) are in the bottom right.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "246-ARR_v2_78",
            "content": "Balach, Artidoro Vidhisha Ran, Jay Pagnoni, Dheeraj Lee, Jaime Rajagopal, Yulia Carbonell,  Tsvetkov, StructSum: Summarization via Structured Representations, 2021, Proceedings of the 16th Conference of the European Chapter of the Association for Computational Linguistics: Main Volume, Online. Association for Computational Linguistics.",
            "ntype": "ref",
            "meta": {
                "xid": "b0",
                "authors": [
                    " Balach",
                    "Artidoro Vidhisha Ran",
                    "Jay Pagnoni",
                    "Dheeraj Lee",
                    "Jaime Rajagopal",
                    "Yulia Carbonell",
                    " Tsvetkov"
                ],
                "title": "StructSum: Summarization via Structured Representations",
                "pub_date": "2021",
                "pub_title": "Proceedings of the 16th Conference of the European Chapter of the Association for Computational Linguistics: Main Volume",
                "pub": "Online. Association for Computational Linguistics"
            }
        },
        {
            "ix": "246-ARR_v2_79",
            "content": "Manik Bhandari, Pranav Narayan Gour, Atabak Ashfaq, Pengfei Liu, Graham Neubig, Reevaluating Evaluation in Text Summarization, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), .",
            "ntype": "ref",
            "meta": {
                "xid": "b1",
                "authors": [
                    "Manik Bhandari",
                    "Pranav Narayan Gour",
                    "Atabak Ashfaq",
                    "Pengfei Liu",
                    "Graham Neubig"
                ],
                "title": "Reevaluating Evaluation in Text Summarization",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP)",
                "pub": null
            }
        },
        {
            "ix": "246-ARR_v2_80",
            "content": "Jiaao Chen, Diyi Yang, Structure-Aware Abstractive Conversation Summarization via Discourse and Action Graphs, 2021, Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, .",
            "ntype": "ref",
            "meta": {
                "xid": "b2",
                "authors": [
                    "Jiaao Chen",
                    "Diyi Yang"
                ],
                "title": "Structure-Aware Abstractive Conversation Summarization via Discourse and Action Graphs",
                "pub_date": "2021",
                "pub_title": "Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies",
                "pub": null
            }
        },
        {
            "ix": "246-ARR_v2_81",
            "content": "John Conroy, Hoa Dang, Mind the Gap: Dangers of Divorcing Evaluations of Summary Content from Linguistic Quality, 2008, Proceedings of the 22nd International Conference on Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b3",
                "authors": [
                    "John Conroy",
                    "Hoa Dang"
                ],
                "title": "Mind the Gap: Dangers of Divorcing Evaluations of Summary Content from Linguistic Quality",
                "pub_date": "2008",
                "pub_title": "Proceedings of the 22nd International Conference on Computational Linguistics",
                "pub": null
            }
        },
        {
            "ix": "246-ARR_v2_82",
            "content": "Trang Hoa, Karolina Dang,  Owczarzak, Overview of the TAC 2008 Update Summarization Task, 2008, Proc. of the Text Analysis Conference, TAC.",
            "ntype": "ref",
            "meta": {
                "xid": "b4",
                "authors": [
                    "Trang Hoa",
                    "Karolina Dang",
                    " Owczarzak"
                ],
                "title": "Overview of the TAC 2008 Update Summarization Task",
                "pub_date": "2008",
                "pub_title": "Proc. of the Text Analysis Conference",
                "pub": "TAC"
            }
        },
        {
            "ix": "246-ARR_v2_83",
            "content": "Shrey Desai, Jiacheng Xu, Greg Durrett, Compressive Summarization with Plausibility and Salience Modeling, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), .",
            "ntype": "ref",
            "meta": {
                "xid": "b5",
                "authors": [
                    "Shrey Desai",
                    "Jiacheng Xu",
                    "Greg Durrett"
                ],
                "title": "Compressive Summarization with Plausibility and Salience Modeling",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP)",
                "pub": null
            }
        },
        {
            "ix": "246-ARR_v2_84",
            "content": "Daniel Deutsch, Tania Bedrax-Weiss, Dan Roth, Towards Question-Answering as an Automatic Metric for Evaluating the Content Quality of a Summary, 2021, Transactions of the Association for Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b6",
                "authors": [
                    "Daniel Deutsch",
                    "Tania Bedrax-Weiss",
                    "Dan Roth"
                ],
                "title": "Towards Question-Answering as an Automatic Metric for Evaluating the Content Quality of a Summary",
                "pub_date": "2021",
                "pub_title": "Transactions of the Association for Computational Linguistics",
                "pub": null
            }
        },
        {
            "ix": "246-ARR_v2_85",
            "content": "Daniel Deutsch, Rotem Dror, Dan Roth, A Statistical Analysis of Summarization Evaluation Metrics Using Resampling Methods, 2021, Transactions of the Association for Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b7",
                "authors": [
                    "Daniel Deutsch",
                    "Rotem Dror",
                    "Dan Roth"
                ],
                "title": "A Statistical Analysis of Summarization Evaluation Metrics Using Resampling Methods",
                "pub_date": "2021",
                "pub_title": "Transactions of the Association for Computational Linguistics",
                "pub": null
            }
        },
        {
            "ix": "246-ARR_v2_86",
            "content": "Daniel Deutsch, Dan Roth, Understanding the Extent to which Summarization Evaluation Metrics Measure the Information Quality of Summaries, 2020, ArXiv, .",
            "ntype": "ref",
            "meta": {
                "xid": "b8",
                "authors": [
                    "Daniel Deutsch",
                    "Dan Roth"
                ],
                "title": "Understanding the Extent to which Summarization Evaluation Metrics Measure the Information Quality of Summaries",
                "pub_date": "2020",
                "pub_title": "ArXiv",
                "pub": null
            }
        },
        {
            "ix": "246-ARR_v2_87",
            "content": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, Kristina Toutanova, BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding, 2019, Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Long and Short Papers.",
            "ntype": "ref",
            "meta": {
                "xid": "b9",
                "authors": [
                    "Jacob Devlin",
                    "Ming-Wei Chang",
                    "Kenton Lee",
                    "Kristina Toutanova"
                ],
                "title": "BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding",
                "pub_date": "2019",
                "pub_title": "Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies",
                "pub": "Long and Short Papers"
            }
        },
        {
            "ix": "246-ARR_v2_88",
            "content": "Zi-Yi Dou, Pengfei Liu, Hiroaki Hayashi, Zhengbao Jiang, Graham Neubig, GSum: A General Framework for Guided Neural Abstractive Summarization, 2021, Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Online. Association for Computational Linguistics.",
            "ntype": "ref",
            "meta": {
                "xid": "b10",
                "authors": [
                    "Zi-Yi Dou",
                    "Pengfei Liu",
                    "Hiroaki Hayashi",
                    "Zhengbao Jiang",
                    "Graham Neubig"
                ],
                "title": "GSum: A General Framework for Guided Neural Abstractive Summarization",
                "pub_date": "2021",
                "pub_title": "Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies",
                "pub": "Online. Association for Computational Linguistics"
            }
        },
        {
            "ix": "246-ARR_v2_89",
            "content": "Alexander Fabbri, Wojciech Kryscinski, Bryan Mc-Cann, R Socher, Dragomir Radev, Sum-mEval: Re-evaluating Summarization Evaluation, 2021, Transactions of the Association for Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b11",
                "authors": [
                    "Alexander Fabbri",
                    "Wojciech Kryscinski",
                    "Bryan Mc-Cann",
                    "R Socher",
                    "Dragomir Radev"
                ],
                "title": "Sum-mEval: Re-evaluating Summarization Evaluation",
                "pub_date": "2021",
                "pub_title": "Transactions of the Association for Computational Linguistics",
                "pub": null
            }
        },
        {
            "ix": "246-ARR_v2_90",
            "content": "Luyang Huang, Lingfei Wu, Lu Wang, Knowledge Graph-Augmented Abstractive Summarization with Semantic-Driven Cloze Reward, 2020, Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b12",
                "authors": [
                    "Luyang Huang",
                    "Lingfei Wu",
                    "Lu Wang"
                ],
                "title": "Knowledge Graph-Augmented Abstractive Summarization with Semantic-Driven Cloze Reward",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
                "pub": null
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "246-ARR_v2_0@0",
            "content": "Re-Examining System-Level Correlations of Automatic Summarization Evaluation Metrics",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_0",
            "start": 0,
            "end": 83,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_2@0",
            "content": "How reliably an automatic summarization evaluation metric replicates human judgments of summary quality is quantified by systemlevel correlations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_2",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_2@1",
            "content": "We identify two ways in which the definition of the system-level correlation is inconsistent with how metrics are used to evaluate systems in practice and propose changes to rectify this disconnect.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_2",
            "start": 147,
            "end": 344,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_2@2",
            "content": "First, we calculate the system score for an automatic metric using the full test set instead of the subset of summaries judged by humans, which is currently standard practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_2",
            "start": 346,
            "end": 520,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_2@3",
            "content": "We demonstrate how this small change leads to more precise estimates of system-level correlations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_2",
            "start": 522,
            "end": 619,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_2@4",
            "content": "Second, we propose to calculate correlations only on pairs of systems that are separated by small differences in automatic scores which are commonly observed in practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_2",
            "start": 621,
            "end": 790,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_2@5",
            "content": "This allows us to demonstrate that our best estimate of the correlation of ROUGE to human judgments is near 0 in realistic scenarios.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_2",
            "start": 792,
            "end": 924,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_2@6",
            "content": "The results from the analyses point to the need to collect more high-quality human judgments and to improve automatic metrics when differences in system scores are small.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_2",
            "start": 926,
            "end": 1095,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_2@7",
            "content": "1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_2",
            "start": 1097,
            "end": 1097,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_4@0",
            "content": "Automatic evaluation metrics are the most common method that researchers use to quickly and cheaply approximate how humans would rate the quality of a summarization system (Lin, 2004;Louis and Nenkova, 2013;Zhao et al., 2019;Zhang et al., 2020;Deutsch et al., 2021a, among others).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_4",
            "start": 0,
            "end": 280,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_4@1",
            "content": "The quality of a metric -how similarly it replicates human judgments of systems -is quantified by calculating the correlation between the metric's scores and human judgments on a set of systems, known as the system-level correlation (Louis and Nenkova, 2013;Deutsch et al., 2021b).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_4",
            "start": 282,
            "end": 562,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_5@0",
            "content": "Accurately estimating system-level correlations is critically important.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_5",
            "start": 0,
            "end": 71,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_5@1",
            "content": "Summarization researchers use automatic metrics during system development to make decisions about which ideas work and which do not, and systems from different research groups are ranked by automatic metrics to define which system is the \"state-of-the-art.\" If we do not have precise estimates of metric quality, it is not clear how much trust the community should put in such evaluation methodologies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_5",
            "start": 73,
            "end": 474,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_6@0",
            "content": "At present, there are disconnects between how automatic metrics are evaluated and how they are used to evaluate systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_6",
            "start": 0,
            "end": 119,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_6@1",
            "content": "First, the metrics' scores which are used in practice are not the ones which are evaluated in system-level correlations; researchers compare systems based on metric scores calculated on the entire test set but calculate scores for system-level correlations when evaluating metrics on a much smaller subset of judged summaries.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_6",
            "start": 121,
            "end": 446,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_6@2",
            "content": "Second, metrics are evaluated in a setting that is much easier than how they are actually used.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_6",
            "start": 448,
            "end": 542,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_6@3",
            "content": "Metric correlations are calculated using systems that vary greatly in quality, whereas researchers compare new systems to recent work, which are likely to be very close in quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_6",
            "start": 544,
            "end": 723,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_6@4",
            "content": "Discriminating between two systems of similar quality is much harder than doing so between low and high quality systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_6",
            "start": 725,
            "end": 844,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_7@0",
            "content": "In this work, we re-examine how system-level correlations are calculated and propose two independent changes to make the evaluation of metrics better aligned to how they are actually used to evaluate systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_7",
            "start": 0,
            "end": 207,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_8@0",
            "content": "First, we propose to modify the system-level correlation definition to use the entire test set to calculate the system scores for automatic metrics instead of only the subset of summaries judged by humans ( §3).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_8",
            "start": 0,
            "end": 210,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_8@1",
            "content": "With this change, the scores which are used to compare systems are directly evaluated, and we further demonstrate how the precision of our estimate of system-level correlations improves as a result.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_8",
            "start": 212,
            "end": 409,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_8@2",
            "content": "Calculating system scores over a larger number of instances reduces the variance of the scores, which results in confidence intervals (CIs) for the correlations that are 16-51% more narrow on average ( §3.2).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_8",
            "start": 411,
            "end": 618,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_9@0",
            "content": "Second, we redefine a high quality metric to be one for which a small difference in score reliably indicates a difference in quality ( §4).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_9",
            "start": 0,
            "end": 138,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_9@1",
            "content": "Then, instead of calculating the correlation with all available system pairs, we only evaluate with pairs of systems whose automatic metric scores differ by some threshold.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_9",
            "start": 140,
            "end": 311,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_9@2",
            "content": "This allows us to show, for example, that a ROUGE-1 score difference of less than 0.5 between systems has almost no correlation to how humans would rank the same two systems according to our best estimates ( §4.2).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_9",
            "start": 313,
            "end": 526,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_9@3",
            "content": "For two other metrics, BERTScore (Zhang et al., 2020) and QAEval (Deutsch et al., 2021a), we show their correlations calculated on system pairs of similar quality are much worse than under the standard correlation definition.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_9",
            "start": 528,
            "end": 752,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_9@4",
            "content": "These results cast doubt on how reliable automatic evaluation metrics are for measuring summarization system quality in realistic scenarios.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_9",
            "start": 754,
            "end": 893,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_10@0",
            "content": "Our analyses point to the need to collect more high-quality human judgments of summaries in order to have more accurate estimates of metric correlations as well as the need to improve the ability of automatic metrics to discriminate between similarly performing systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_10",
            "start": 0,
            "end": 269,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_11@0",
            "content": "Background",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_11",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_12@0",
            "content": "Automatic evaluation metrics are most commonly used to argue that one summarization system is better than another, typically by showing that the value of a metric improves with the \"better\" system.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_12",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_12@1",
            "content": "How similarly automatic metrics replicate human judgments of system quality is quantified by system-level correlations as follows.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_12",
            "start": 198,
            "end": 327,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_13@0",
            "content": "The summaries from N systems on M jud input documents are judged by humans Z and scored with an automatic metric X .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_13",
            "start": 0,
            "end": 115,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_13@1",
            "content": "Then, the systemlevel correlation between X and Z is calculated as",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_13",
            "start": 117,
            "end": 182,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_14@0",
            "content": "r SYS = CORR         1 M jud M jud j x j i , 1 M jud M jud j z j i      N i=1   ",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_14",
            "start": 0,
            "end": 95,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_15@0",
            "content": "where x j i and z j i are the scores of X and Z for the summary produced by the i-th system on the j-th input document and CORR is some correlation function.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_15",
            "start": 0,
            "end": 156,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_15@1",
            "content": "See Fig. 1 for an illustration of this calculation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_15",
            "start": 158,
            "end": 208,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_16@0",
            "content": "Figure 1: The system-level correlation is calculated between the average X and Z scores on a set of summarization systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_16",
            "start": 0,
            "end": 121,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_16@1",
            "content": "x j i and z j i are the scores for the summary produced by system i (represented by rows) on input document j (represented by columns).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_16",
            "start": 123,
            "end": 257,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_17@0",
            "content": "In this work, we use Kendall's τ (the \"b\" variant 2 ) as the correlation function because we are most concerned with a metric's ability to correctly determine whether one system is better than another since that is how metrics are used in practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_17",
            "start": 0,
            "end": 247,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_17@1",
            "content": "Kendall's τ is computed based on the number of system pairs out of N 2 which are ranked the same by X and Z. It is defined as",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_17",
            "start": 249,
            "end": 373,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_18@0",
            "content": "τ = P − Q (P + Q + T ) • (P + Q + U )(1)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_18",
            "start": 0,
            "end": 39,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_19@0",
            "content": "where P and Q are the number of pairs ranked the same or different by X and Z, respectively, and T and U are the number of ties only in X or Z, respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_19",
            "start": 0,
            "end": 156,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_20@0",
            "content": "Because the computation of r SYS involves randomness -its value depends on which M jud input documents (and even which N systems) were used -it is only an approximation of the true correlation between X and Z. As such, Deutsch et al. (2021b) proposed various methods for calculating confidence intervals for r SYS .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_20",
            "start": 0,
            "end": 314,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_20@1",
            "content": "For instance, their BOOT-INPUTS method uses bootstrapping to repeatedly resample the M jud input documents used to calculate r SYS , thereby calculating a confidence interval for the true r SYS value for X and Z.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_20",
            "start": 316,
            "end": 527,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_21@0",
            "content": "The datasets that are used in this paper's analyses are SummEval (Fabbri et al., 2021) and REALSumm (Bhandari et al., 2020), two recently collected datasets with human annotations for summary quality collected from the CNN/DailyMail dataset (Nallapati et al., 2016).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_21",
            "start": 0,
            "end": 265,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_21@1",
            "content": "SummEval has M jud = 100 summaries annotated with a summary relevance score for N = 16 systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_21",
            "start": 267,
            "end": 361,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_21@2",
            "content": "REALSumm has M jud = 100 summaries annotated with a Lightweight Pyramid score (Shapira et al., 2019) for N = 25 systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_21",
            "start": 363,
            "end": 482,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_21@3",
            "content": "We correlate the scores of the automatic metrics to these annotations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_21",
            "start": 484,
            "end": 553,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_21@4",
            "content": "The CNN/DailyMail test split has 11, 490 instances.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_21",
            "start": 555,
            "end": 605,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_22@0",
            "content": "Our experiments will analyze three different reference-based automatic evaluation metrics which were chosen because they were demonstrated to have the best correlations with human judgments on the SummEval and REALSumm datasets (Deutsch et al., 2021b).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_22",
            "start": 0,
            "end": 251,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_22@1",
            "content": "ROUGE-n (Lin, 2004) evaluates a generated summary by calculating an F 1 score on the number of ngrams it has in common with a human-written reference summary.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_22",
            "start": 253,
            "end": 410,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_22@2",
            "content": "BERTScore (Zhang et al., 2020) aligns the generated and reference summaries' tokens based on their BERT embeddings (Devlin et al., 2019) and calculates a score based on the similarity of the aligned tokens' embeddings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_22",
            "start": 412,
            "end": 629,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_22@3",
            "content": "QA-Eval (Deutsch et al., 2021a) compares the two summaries by automatically generating questions from the reference and calculating what proportion of those questions are answered correctly by the generated summary.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_22",
            "start": 631,
            "end": 845,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_23@0",
            "content": "Evaluating with All Available Instances",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_23",
            "start": 0,
            "end": 38,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_24@0",
            "content": "Although the above definition of the system-level correlation has been used by recent meta-evaluation studies of metrics (Bhandari et al., 2020;Fabbri et al., 2021;Deutsch et al., 2021b), there is a disconnect between how the automatic metrics are evaluated and how they are used in practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_24",
            "start": 0,
            "end": 291,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_25@0",
            "content": "Researchers who develop summarization systems evaluate those systems with automatic metrics on all M test test instances, not just the subset of M jud instances which were judged by humans.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_25",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_25@1",
            "content": "Evaluating a system on a larger number of summaries may end up changing the system's score, which could potentially alter the overall ranking of a set of systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_25",
            "start": 190,
            "end": 351,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_25@2",
            "content": "Therefore, the rankings that are used by practitioners to determine system quality are not the ones which are being evaluated in the standard definition of system-level correlation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_25",
            "start": 353,
            "end": 533,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_25@3",
            "content": "To that end, we propose to modify the correlation definition to use all M test instances to calculate the system scores for the automatic metrics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_25",
            "start": 535,
            "end": 680,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_25@4",
            "content": "That is (differences in bold):",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_25",
            "start": 682,
            "end": 711,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_26@0",
            "content": "r SYS = CORR         1 M test Mtest j x j i , 1 M jud M jud j z j i      N i=1   ",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_26",
            "start": 0,
            "end": 96,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_27@0",
            "content": "In practice with modern, large-scale datasets, this minor change could mean estimating system quality based on ≈10k inputs instead of around 100.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_27",
            "start": 0,
            "end": 144,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_27@1",
            "content": "This new definition now properly evaluates the way metrics are actually used by researchers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_27",
            "start": 146,
            "end": 237,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_27@2",
            "content": "We expect that scoring systems with M test inputs instead of M jud should lead to a better estimate of the true automatic metric score, which would in turn result in a lower-variance estimate of the correlation between X and Z in the form of smaller confidence intervals for r SYS .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_27",
            "start": 239,
            "end": 520,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_27@3",
            "content": "In the next sections, we carry out analyses to demonstrate that this is true.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_27",
            "start": 522,
            "end": 598,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_28@0",
            "content": "Reducing Automatic Metric Variance",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_28",
            "start": 0,
            "end": 33,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_29@0",
            "content": "First, we empirically show that scoring systems with M test instances instead of M jud does indeed reduce the variance of the estimate of the automatic metric scores and subsequently increases the stabilities of the system rankings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_29",
            "start": 0,
            "end": 231,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_30@0",
            "content": "Ideally, the X score for a system would be its \"oracle\" X score, equal to the expected value of X for a document sampled from the latent distribution over documents defined by the dataset (e.g., a system's ROUGE score on an infinite number of examples from a dataset).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_30",
            "start": 0,
            "end": 267,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_30@1",
            "content": "Since this cannot be calculated, it is approximated by averaging the X score on a sample (i.e., either the M jud or M test input documents).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_30",
            "start": 269,
            "end": 408,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_30@2",
            "content": "Because M test M jud , we expect that the variance of this estimate using M test inputs should be lower than when using M jud .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_30",
            "start": 410,
            "end": 536,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_31@0",
            "content": "Figure 3: Bootstrapped estimates of the stabilities of the system rankings for automatic metrics and human annotations on SummEval (left) and REALSumm (right).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_31",
            "start": 0,
            "end": 158,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_31@1",
            "content": "The τ value quantifies how similar two system rankings would be if they were computed with two random sets of M input documents.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_31",
            "start": 160,
            "end": 287,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_31@2",
            "content": "When all M test test instances are used, the automatic metrics' rankings become near constant.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_31",
            "start": 289,
            "end": 382,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_31@3",
            "content": "The error regions represent ±1 standard deviation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_31",
            "start": 384,
            "end": 433,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_32@0",
            "content": "To quantify this, we calculated the variance of estimating the oracle X score using both M jud and M test input documents via bootstrapping.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_32",
            "start": 0,
            "end": 139,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_32@1",
            "content": "We randomly sampled M input documents with replacement, recomputed the system scores, and calculated the variance of those scores over 1k iterations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_32",
            "start": 141,
            "end": 289,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_32@2",
            "content": "For all three metrics on both datasets, we found around a 99% reduction in the variance when M test inputs were used instead of M jud , clearly demonstrating that evaluating systems with M test inputs results in a better estimate of the system scores.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_32",
            "start": 291,
            "end": 541,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_32@3",
            "content": "In Fig. 2, this is visualized for BERTScore on the REALSumm dataset.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_32",
            "start": 543,
            "end": 610,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_33@0",
            "content": "However, because we are interested in evaluating the metrics' rankings, we also quantify how much of an effect this reduction in variance has on the stability of the system rankings induced by X .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_33",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_33@1",
            "content": "Similarly to the system scores, there is an oracle ranking of systems for X , equal to the ordering of systems by their respective oracle X scores (e.g., systems sorted by their ROUGE scores calculated on an infinite number of examples from a dataset).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_33",
            "start": 197,
            "end": 448,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_33@2",
            "content": "As the variance of the system score estimates decreases, the computed ranking of systems should begin to converge to the oracle X ranking.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_33",
            "start": 450,
            "end": 587,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_33@3",
            "content": "We aim to understand to what extent this happens if M test instances are used for evaluation instead of M jud .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_33",
            "start": 589,
            "end": 699,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_34@0",
            "content": "To quantify this notion, we calculate the Kendall's τ between two system rankings for X that were based on two sets of M input documents, each sampled with replacement from the set of available documents.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_34",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_34@1",
            "content": "This simulates how much the system rankings would change if the evaluation procedure was run twice, each time with M random input documents.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_34",
            "start": 205,
            "end": 344,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_34@2",
            "content": "This quantity is calculated 1k times for various values of M and plotted in Fig. 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_34",
            "start": 346,
            "end": 428,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_35@0",
            "content": "As M approaches M test , the automatic metrics' τ values approach 1, which is much higher than the respective values at M jud , typically around 0.6-0.8.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_35",
            "start": 0,
            "end": 152,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_35@1",
            "content": "A value near 1 means that the rankings calculated using M test inputs are almost constant, implying the rankings have converged to the oracle ranking.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_35",
            "start": 154,
            "end": 303,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_35@2",
            "content": "Therefore, the reduction in variance from evaluating on M test instances does indeed greatly stabilize the system rankings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_35",
            "start": 305,
            "end": 427,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_36@0",
            "content": "Fig. 3 also contains the same analysis performed for the human judgments Z in both datasets, although it is limited to a maximum of M jud input documents.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_36",
            "start": 0,
            "end": 153,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_36@1",
            "content": "We see that on both datasets the judgments' rankings are still quite variable, reaching a maximum τ of around 0.8-0.85.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_36",
            "start": 155,
            "end": 273,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_37@0",
            "content": "Confidence Interval Analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_37",
            "start": 0,
            "end": 27,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_38@0",
            "content": "Next, we show that the improved estimate of system scores leads to a more precise estimate of r SYS by demonstrating the widths of the confidence intervals for r SYS decrease.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_38",
            "start": 0,
            "end": 174,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_39@0",
            "content": "The confidence intervals for r SYS calculated using bootstrapping methods proposed by Deutsch et al. (2021b) are rather wide.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_39",
            "start": 0,
            "end": 124,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_39@1",
            "content": "For instance, the 95% CI for ROUGE-2 on SummEval is [−.09, .84], demonstrating a rather high level of uncertainty in its value.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_39",
            "start": 126,
            "end": 252,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_39@2",
            "content": "This is problematic because it means we do not have a good picture of how reliable automatic evaluation metrics are.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_39",
            "start": 254,
            "end": 369,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_39@3",
            "content": "Reducing the width of the CIs will help us better understand the true metric quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_39",
            "start": 371,
            "end": 455,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_40@0",
            "content": "We suspect that the large width of the confidence interval is due to the variance of the system rankings of the automatic metrics and human judgments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_40",
            "start": 0,
            "end": 149,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_40@1",
            "content": "The more unstable the rankings are with respect to the M inputs, the larger the variance of the estimate of r SYS should be since very different system rankings would be compared on each bootstrapping iteration.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_40",
            "start": 151,
            "end": 361,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_40@2",
            "content": "Deutsch et al. (2021b) used M jud input documents to calculate their CIs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_40",
            "start": 363,
            "end": 435,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_40@3",
            "content": "Therefore, we expect the improved stability of the automatic metric system rankings from evaluating on M test instances should result in a more narrow confidence interval for r SYS since some noise has been removed from this computation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_40",
            "start": 437,
            "end": 673,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_41@0",
            "content": "To demonstrate this, we calculated 95% CIs for r SYS using the BOOT-INPUT method on SummEval and REALSumm using both M jud and M test input documents, shown in Fig. 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_41",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_41@1",
            "content": "We find that the widths of the CIs shrank on average by 51% on SummEval and 16% on REALSumm.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_41",
            "start": 168,
            "end": 259,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_41@2",
            "content": "The largest decrease in width is in the ROUGE family of metrics on SummEval, potentially because that metric and dataset combination saw the biggest improvement in ranking stability (see Fig. 3).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_41",
            "start": 261,
            "end": 455,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_41@3",
            "content": "Thus, the improved estimate of the system scores did result in more precise estimates of r SYS .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_41",
            "start": 457,
            "end": 552,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_41@4",
            "content": "We repeated this analysis using the other bootstrapping methods proposed by Deutsch et al. (2021b), and the results are discussed in Appendix A.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_41",
            "start": 554,
            "end": 697,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_42@0",
            "content": "Conclusions & Recommendations",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_42",
            "start": 0,
            "end": 28,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_43@0",
            "content": "By estimating system quality using automatic metrics on all available instances instead of only those which were judged, we showed that the variances of the system scores and subsequent rankings reduce significantly, resulting in better estimates of r SYS . Because this methodology additionally directly evaluates the system scores used by researchers, we recommend future work do the same.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_43",
            "start": 0,
            "end": 390,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_44@0",
            "content": "In order to continue to improve the estimate of r SYS , as much variance as possible needs to be removed from the system rankings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_44",
            "start": 0,
            "end": 129,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_44@1",
            "content": "Evaluating systems using M test instances removed a large amount of variance from the automatic metric rankings, but as demonstrated in Fig. 3, the human judgments still have a large amount of variance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_44",
            "start": 131,
            "end": 332,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_45@0",
            "content": "The human rankings' variances can either be reduced by judging more summaries per system or making the judgments more consistent.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_45",
            "start": 0,
            "end": 128,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_45@1",
            "content": "Since the human rankings' stabilities in Fig. 3 are mostly beginning to plateau -especially for SummEval -it may be prohibitively expensive to collect a sufficient number of judgments to better stabilize the rankings (Wei and Jia, 2021).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_45",
            "start": 130,
            "end": 366,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_45@2",
            "content": "Therefore, we expect the more feasible solution is to improve the consistency of the human judgments, for example by better training the annotators or improving the annotation protocol.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_45",
            "start": 368,
            "end": 552,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_46@0",
            "content": "Evaluating with Realistic System Pairs",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_46",
            "start": 0,
            "end": 37,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_47@0",
            "content": "Next, we argue that the set of systems used to evaluate metrics is not reflective of how metrics are used in practice and propose a new system-level correlation variant to address this problem.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_47",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_48@0",
            "content": "Evaluating with All System Pairs",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_48",
            "start": 0,
            "end": 31,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_49@0",
            "content": "The N systems which are used for calculating system-level correlations are typically those which participated in a shared task, as in DUC/TAC (Dang and Owczarzak, 2008, among others), or those which have been published in the previous 3-4 years (Bhandari et al., 2020;Fabbri et al., 2021).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_49",
            "start": 0,
            "end": 288,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_49@1",
            "content": "As such, they are typically rather diverse in terms of their qualities, both as rated by human annotators and automatic metrics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_49",
            "start": 290,
            "end": 417,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_50@0",
            "content": "The system scores of all of the systems in the REALSumm dataset as evaluated by humans and automatic metrics are shown in Fig. 5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_50",
            "start": 0,
            "end": 128,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_50@1",
            "content": "Clearly, the scores are rather diverse.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_50",
            "start": 130,
            "end": 168,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_50@2",
            "content": "For example, the systems cluster into low, medium, and high quality groups (with an additional outlier) as evaluated by ROUGE.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_50",
            "start": 170,
            "end": 295,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_50@3",
            "content": "A difference of around 5 ROUGE points between them is a rather large gap for ROUGE scores.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_50",
            "start": 297,
            "end": 386,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_51@0",
            "content": "The standard definition for a high quality evaluation metric is one which correctly ranks a set of systems with respect to human judgments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_51",
            "start": 0,
            "end": 138,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_51@1",
            "content": "As such, the implementation of the system-level correlation calculated with Kendall's τ will rank all N systems according to the human judgments and an automatic metric, then count how many pairs were ranked the same out of all N 2 pairs (see §2).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_51",
            "start": 140,
            "end": 386,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_51@2",
            "content": "As a consequence, even pairs of systems which are separated by a large margin according to the automatic metric -likely systems with a clear difference in quality -are included in the evaluation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_51",
            "start": 388,
            "end": 582,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_51@3",
            "content": "Therefore, automatic metrics are rewarded for correctly ranking such \"easy\" system pairs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_51",
            "start": 584,
            "end": 672,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_52@0",
            "content": "Evaluating with Realistic Pairs",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_52",
            "start": 0,
            "end": 30,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_53@0",
            "content": "This standard evaluation setting does not reflect how summarization metrics are actually used by researchers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_53",
            "start": 0,
            "end": 108,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_53@1",
            "content": "New systems are typically only slightly better than previous work.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_53",
            "start": 110,
            "end": 175,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_53@2",
            "content": "Based on a survey of recent summarization papers in *ACL conferences (see Appendix C), we found that the average improvement over baseline/state-of-the-art models that was reported on the CNN/Dailymail dataset was on average 0.5 ROUGE-1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_53",
            "start": 177,
            "end": 413,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_53@3",
            "content": "It is rarely the case that the improvement in automatic metrics is very large.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_53",
            "start": 415,
            "end": 492,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_53@4",
            "content": "Therefore, evaluating metrics using pairs of systems which are separated by a large margin does not reflect the reality that metrics are very frequently used to compare those separated by a small margin.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_53",
            "start": 494,
            "end": 696,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_53@5",
            "content": "Including \"easy\" system pairs in the system-level correlation likely overestimates the quality of the metrics in settings which occur in practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_53",
            "start": 698,
            "end": 843,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_54@0",
            "content": "To that end, we redefine a high quality evaluation metric to be one for which a small difference in scores reliably indicates a difference in quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_54",
            "start": 0,
            "end": 149,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_54@1",
            "content": "We quantify this by proposing a variant of the system-level τ which is calculated between system pairs which are separated by a pre-defined automatic metric score margin.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_54",
            "start": 151,
            "end": 320,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_54@2",
            "content": "Instead of using all N 2 system pairs, only pairs whose difference in scores falls within the margin are used to calculate the system-level correlation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_54",
            "start": 322,
            "end": 473,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_54@3",
            "content": "We denote this correlation variant as r SYS ∆( , u) where and u are the lower-and upper-bounds of the allowable differences in automatic metrics' scores.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_54",
            "start": 475,
            "end": 627,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_54@4",
            "content": "This would enable, for example, evaluating how well ROUGE correlates to human judgments on system pairs that are separated by 0.0-0.5 ROUGE points, thereby directly evaluating the scenario in which ROUGE is used to make decisions about system quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_54",
            "start": 629,
            "end": 879,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_55@0",
            "content": "In Fig. 6 we report the r SYS ∆( , u) correlations for = 0.0 and various values of u on both the SummEval and REALSumm datasets (more combinations of and u are included in Appendix B).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_55",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_55@1",
            "content": "That is, we evaluate r SYS only on system pairs which are separated by at most an automatic score of u. The values of u were selected by picking the minimum u which would result in evaluating on 10%, 20%, . . . , 100% of the N 2 possible system pairs closest in score to be consistent across all three metrics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_55",
            "start": 185,
            "end": 494,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_56@0",
            "content": "The correlations for each metric on the system pairs closest in score are far lower than the correlations evaluated on all of the system pairs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_56",
            "start": 0,
            "end": 142,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_56@1",
            "content": "For instance, the correlation of BERTScore on Summ-Eval with the closest 20% of system pairs (u ≈ 0.2) is only 0.42 compared to 0.77 under the standard definition of r SYS .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_56",
            "start": 144,
            "end": 316,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_56@2",
            "content": "Thus, it is clear that the metrics are much less reliable approximations of human judgments when the system scores are close than was previously known.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_56",
            "start": 318,
            "end": 468,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_56@3",
            "content": "Evaluating on all possible system pairs leads to an overly optimistic view of automatic metric quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_56",
            "start": 470,
            "end": 572,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_57@0",
            "content": "The r SYS ∆( , u) correlation of ROUGE for = 0.0 and u = 0.5 -a typical improvement reported by researchers -is 0.08 and 0.0 on the Summ-Eval and REALSumm datasets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_57",
            "start": 0,
            "end": 163,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_57@1",
            "content": "Therefore, these results suggest the most popular summarization evaluation metric agrees with human judgments of system quality in realistic scenarios only slightly better than or equal to random chance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_57",
            "start": 165,
            "end": 367,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_57@2",
            "content": "For instance, 20% of the N 2 system pairs on SummEval are separated by < 0.5 ROUGE-1, and the system-level correlation on those pairs is around 0.08.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_57",
            "start": 369,
            "end": 517,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_57@3",
            "content": "As more systems are used in the correlation calculation, the allowable gap in scores between system pairs increases, and are therefore likely easier to rank, resulting in higher correlations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_57",
            "start": 519,
            "end": 709,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_58@0",
            "content": "This result also offers an explanation for why a naive metric such as ROUGE achieves moderately strong correlations under the standard definition of the system-level correlation (0.45 and 0.73 on SummEval and REALSumm) despite well known flaws and criticisms (Passonneau et al., 2005;Conroy and Dang, 2008;Deutsch and Roth, 2020, among others): it has benefited from an easy evaluation protocol.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_58",
            "start": 0,
            "end": 394,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_58@1",
            "content": "Despite its simplicity, it is not too surprising that a large gap of 5-10 ROUGE points actually does correctly rank system pairs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_58",
            "start": 396,
            "end": 524,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_58@2",
            "content": "Most of its positive correlation comes from such easy examples.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_58",
            "start": 526,
            "end": 588,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_59@0",
            "content": "Conclusions & Recommendations",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_59",
            "start": 0,
            "end": 28,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_60@0",
            "content": "If it is assumed that we have enough high-quality judgments to accurately discriminate between two similarly performing systems, then the results in Fig. 6 show that the correlations in realistic settings are trending very low, meaning automatic metrics are not nearly sensitive enough to distinguish between systems with only minor differences in quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_60",
            "start": 0,
            "end": 355,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_60@1",
            "content": "This is problematic because this is the scenario in which metrics are most frequently used, and therefore they are not very reliable methods of evaluating summarization systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_60",
            "start": 357,
            "end": 533,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_60@2",
            "content": "However, it is not all bad news.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_60",
            "start": 535,
            "end": 566,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_60@3",
            "content": "Because the standard systemlevel τ values are moderately positive, consistent improvements in automatic metrics over time will likely result in better quality systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_60",
            "start": 568,
            "end": 734,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_60@4",
            "content": "Similarly to stochastic gradient descent, not every reported improvement is real, but on average over time, the quality does improve.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_60",
            "start": 736,
            "end": 868,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_60@5",
            "content": "Nonetheless, future work should focus on improving the quality of evaluation metrics when the differences in system performance are small, and researchers who compare systems should invest more effort into their human evaluations since automatic evaluations are not very reliable.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_60",
            "start": 870,
            "end": 1149,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_61@0",
            "content": "However, because the available number of system pairs to calculate the correlations in Fig. 6 is rather small -especially when evaluating on the closest system pairs -and recent work suggests we may not have enough human judgments to accurately distinguish between similarly performing systems (Wei and Jia, 2021), it could be difficult to reach any definitive conclusions about the metrics' correlations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_61",
            "start": 0,
            "end": 404,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_61@1",
            "content": "That being said, these are our best estimates of the correlations with the available data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_61",
            "start": 406,
            "end": 495,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_61@2",
            "content": "Not knowing how much we can trust automatic metrics is not a good outcome.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_61",
            "start": 497,
            "end": 570,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_61@3",
            "content": "In this scenario, future work should focus on collecting more, high-quality human judgments so that we can better meta-evaluate automatic metrics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_61",
            "start": 572,
            "end": 717,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_61@4",
            "content": "Since we argue that it is important to distinguish between similarly performing systems, new data collection efforts should consider using targeted pairwise judgments between those systems instead of direct assessments across a variety of systems of diverse quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_61",
            "start": 719,
            "end": 984,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_62@0",
            "content": "We recommend that proposals of new evaluation metrics also report correlations on system pairs with various differences in scores in addition to the standard system-level correlation definition.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_62",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_62@1",
            "content": "Reporting this information would better inform users of metrics about how likely humans would agree their observed improvement is real based on its value.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_62",
            "start": 195,
            "end": 348,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_63@0",
            "content": "Related Work",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_63",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_64@0",
            "content": "The methodology behind meta-evaluating summarization evaluation metrics was established during the DUC/TAC shared tasks (Dang and Owczarzak, 2008, among others).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_64",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_64@1",
            "content": "In addition to competitions for developing high-quality summarization systems, there were also shared tasks for creating automatic metrics that correlated well with human judgments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_64",
            "start": 162,
            "end": 342,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_64@2",
            "content": "The benchmark datasets created during DUC/TAC were small in size by today's standards because they were manually collected multi-document summarization datasets, which are hard to create at scale.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_64",
            "start": 344,
            "end": 539,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_64@3",
            "content": "As such, all of the model-generated summaries on the full test set were judged (so M jud = M test ; §3), unlike for current datasets which are too large to fully judge.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_64",
            "start": 541,
            "end": 708,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_65@0",
            "content": "Recently, there has been growing interest in revisiting the meta-evaluation of automatic evaluation metrics for summarization, in part due to the large differences between currently popular summarization datasets and those used in DUC/TAC.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_65",
            "start": 0,
            "end": 238,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_65@1",
            "content": "We view our work as continuing this direction of research, described next.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_65",
            "start": 240,
            "end": 313,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_66@0",
            "content": "Peyrard (2019) argues that current evaluation metrics do not work as well when they are used to evaluate high-performing systems compared to those which were evaluated in DUC/TAC.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_66",
            "start": 0,
            "end": 178,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_67@0",
            "content": "Both Fabbri et al. (2021) and Bhandari et al. (2020) re-evaluated how well existing evaluation metrics work on the popular CNN/DailyMail dataset (Nallapati et al., 2016) by collecting judgments of summary quality using recent state-ofthe-art systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_67",
            "start": 0,
            "end": 249,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_67@1",
            "content": "These datasets were used in our analyses.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_67",
            "start": 251,
            "end": 291,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_67@2",
            "content": "While the goal of these works was to identify which metrics correlated best with human judgments, our goal is to point out the ways in which the current methodology of meta-evaluating metrics is inconsistent with how they are used.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_67",
            "start": 293,
            "end": 523,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_68@0",
            "content": "Then, the work of Deutsch et al. (2021b) proposed statistical methods for estimating and comparing correlation values.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_68",
            "start": 0,
            "end": 117,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_68@1",
            "content": "In contrast to our work, they provide statistical tools for analyzing correlations, whereas we propose new definitions of correlations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_68",
            "start": 119,
            "end": 253,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_69@0",
            "content": "Finally, Wei and Jia (2021) provided a theoretical analysis of the bias and variance of automatic and human evaluations of machine translations and summaries.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_69",
            "start": 0,
            "end": 157,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_69@1",
            "content": "Among their conclusions, they argue for evaluating metrics with pairwise accuracy (Kendall's τ ) and that it may be prohibitively expensive to collect enough human judgments to distinguish between two systems with very similar quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_69",
            "start": 159,
            "end": 393,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_69@2",
            "content": "Our work further argues that metrics should be evaluated with a variant of Kendall's τ calculated using realistic system pairs ( §4).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_69",
            "start": 395,
            "end": 527,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_69@3",
            "content": "Unfortunately, their results suggest that collecting enough human judgments to accurately measure how well automatic metrics perform in this setting may be very difficult.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_69",
            "start": 529,
            "end": 699,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_70@0",
            "content": "Related studies to ours have examined how the choice of which systems to include in metric evaluations impacts the correlation values.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_70",
            "start": 0,
            "end": 133,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_70@1",
            "content": "Both Mathur et al. ( 2020) and Bhandari et al. (2020) identify that metrics perform worse when scoring only the top-k systems in machine translation and summarization, respectively, and examine the use of pairwise comparisons for metric evaluation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_70",
            "start": 135,
            "end": 382,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_70@2",
            "content": "Further, Mathur et al. ( 2020) demonstrate that outlier systems have an out-sized influence on the correlation values and recommend removing them from the metric evaluations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_70",
            "start": 384,
            "end": 557,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_70@3",
            "content": "In contrast, our work proposes to change the evaluation methodology for metrics so that it more closely resembles how they are used in practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_70",
            "start": 559,
            "end": 702,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_70@4",
            "content": "This results in evaluating only on system pairs which are realistically compared by researchers, that is, those separated by small margins in automatic metric scores.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_70",
            "start": 704,
            "end": 869,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_70@5",
            "content": "We believe that this is a more principled approach to how to select which system pairs to evaluate on compared to previous work.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_70",
            "start": 871,
            "end": 998,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_71@0",
            "content": "Conclusion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_71",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_72@0",
            "content": "In this work, we proposed two independent changes to how the system-level correlation of metrics is calculated to better align with how they are used to evaluate systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_72",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_72@1",
            "content": "Our analyses showed that these modifications led to lower-variance estimates of correlations and that commonly reported improvements in metric scores may not reliably predict how humans would judge system quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_72",
            "start": 171,
            "end": 383,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_72@2",
            "content": "The results from the analyses point to the need for future data collection efforts of high-quality human judgments and improving automatic evaluation metrics when differences in system performance are small.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_72",
            "start": 385,
            "end": 591,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_73@0",
            "content": "In addition to the BOOT-INPUTS CI method proposed by Deutsch et al. (2021b), the authors also proposed BOOT-SYSTEMS and BOOT-BOTH.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_73",
            "start": 0,
            "end": 129,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_73@1",
            "content": "Each of the three methods makes assumptions about whether the set of N systems and M input documents are fixed or variable during the bootstrapping calculation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_73",
            "start": 131,
            "end": 290,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_73@2",
            "content": "For instance, BOOT-INPUTS assumes the N systems are always the same and the M input documents are random, then subsequently resamples M input documents on each bootstrapping iteration to calculate the confidence interval.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_73",
            "start": 292,
            "end": 512,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_73@3",
            "content": "BOOT-SYSTEMS does the opposite by resampling which N systems are used while holding the original M input documents fixed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_73",
            "start": 514,
            "end": 634,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_73@4",
            "content": "BOOT-BOTH assumes both the systems and inputs are variable.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_73",
            "start": 636,
            "end": 694,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_73@5",
            "content": "of the paper, Fig. 4).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_73",
            "start": 696,
            "end": 717,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_73@6",
            "content": "The widths of the BOOT-BOTH CIs decreased by 14% and 12%, whereas the BOOT-SYSTEMS CIs only decreased by 1% and 6%.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_73",
            "start": 719,
            "end": 833,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_74@0",
            "content": "The BOOT-SYSTEMS widths likely decreased less because its estimation of r SYS is not dependent on the variance of the system score estimates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_74",
            "start": 0,
            "end": 140,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_74@1",
            "content": "Since the set of M input documents is fixed, the system scores do not change at all during bootstrapping, so increasing the number of summaries used to estimate those scores should not have a major effect on the estimation of r SYS .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_74",
            "start": 142,
            "end": 374,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_75@0",
            "content": "Fig. 9 contains the r SYS ∆( , u) correlations for when = 0 for ROUGE-1, ROUGE-2, and ROUGE-L, equivalent to those shown in Fig. 6 in the main body of the paper (ROUGE-1 is shown in both).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_75",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_75@1",
            "content": "The ROUGE-2 and ROUGE-L results are largely consistent with those of ROUGE-1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_75",
            "start": 189,
            "end": 265,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_75@2",
            "content": "The metrics' correlations to human annotations are low (or even negative) when the differences between system scores are small.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_75",
            "start": 267,
            "end": 393,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_75@3",
            "content": "As more pairs are added that differ by larger margins, the correlations increase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_75",
            "start": 395,
            "end": 475,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_76@0",
            "content": "Figs. 10 and 11 contain the r SYS ∆( , u) correlations for ROUGE, BERTScore, and QAEval for various combinations of and u on both the Summ-Eval and REALSumm datasets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_76",
            "start": 0,
            "end": 165,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_76@1",
            "content": "The first rows of each heatmap are plotted in Figs. 6 and 9.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_76",
            "start": 167,
            "end": 226,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_76@2",
            "content": "We see that as the allowed score gap between system pairs is allowed to increase (i.e., adding \"easier\" pairs to rank), the correlation increases by a large margin over the correlation on pairs close in score.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_76",
            "start": 228,
            "end": 436,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_76@3",
            "content": "All of the metrics have nearly perfect correlation when the system pairs are separated by large margins.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_76",
            "start": 438,
            "end": 541,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@0",
            "content": "To estimate the difference in ROUGE-1 score that is commonly reported in papers, we performed a survey of recently published summarization papers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@1",
            "content": "We selected papers from 2020 and 2021 that were published in a *ACL conference (including Findings), had \"summary\" or \"summarization\" in the title, proposed a new system, and compared systems on the CNN/DailyMail dataset with ROUGE.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 147,
            "end": 378,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@2",
            "content": "We selected the differences between the best two models that were compared with ROUGE on the test set.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 380,
            "end": 481,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@3",
            "content": "We did not include ablation experiments for which the differences are likely smaller than the differences between the top two performing systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 483,
            "end": 627,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@4",
            "content": "The results are shown in Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 629,
            "end": 661,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@5",
            "content": "The average reported difference was found to be 0.49 ROUGE-1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 663,
            "end": 723,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@6",
            "content": "1.6 3.9 6.4 9.0 18.8 1.0 1.9 2.9 4.5 9.1 1.8 3.5",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 725,
            "end": 772,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@7",
            "content": "5. The values of and u were chosen so that each value in the heatmaps evaluates on 10% more system pairs than the value to its left.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 774,
            "end": 905,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@8",
            "content": "For instance, the first row evaluates on 10%, 20%, . . . , 100% of the system pairs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 907,
            "end": 990,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@9",
            "content": "The second row evaluates on 10%, 20%, . . . , 90% of the system pairs, never including the 10% of pairs which are closest in score.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 992,
            "end": 1122,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@10",
            "content": "The first row of each of the heatmaps is plotted in Fig. 6. The correlations on realistic score differences between systems are in the upper left portion of the heatmaps and contain the lowest correlations overall.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 1124,
            "end": 1337,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_77@11",
            "content": "Evaluating on all pairs is the top-rightmost entry, and the \"easiest\" pairs (those separated by a large score margin) are in the bottom right.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_77",
            "start": 1339,
            "end": 1480,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_78@0",
            "content": "Balach, Artidoro Vidhisha Ran, Jay Pagnoni, Dheeraj Lee, Jaime Rajagopal, Yulia Carbonell,  Tsvetkov, StructSum: Summarization via Structured Representations, 2021, Proceedings of the 16th Conference of the European Chapter of the Association for Computational Linguistics: Main Volume, Online. Association for Computational Linguistics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_78",
            "start": 0,
            "end": 336,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_79@0",
            "content": "Manik Bhandari, Pranav Narayan Gour, Atabak Ashfaq, Pengfei Liu, Graham Neubig, Reevaluating Evaluation in Text Summarization, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_79",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_80@0",
            "content": "Jiaao Chen, Diyi Yang, Structure-Aware Abstractive Conversation Summarization via Discourse and Action Graphs, 2021, Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_80",
            "start": 0,
            "end": 261,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_81@0",
            "content": "John Conroy, Hoa Dang, Mind the Gap: Dangers of Divorcing Evaluations of Summary Content from Linguistic Quality, 2008, Proceedings of the 22nd International Conference on Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_81",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_82@0",
            "content": "Trang Hoa, Karolina Dang,  Owczarzak, Overview of the TAC 2008 Update Summarization Task, 2008, Proc. of the Text Analysis Conference, TAC.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_82",
            "start": 0,
            "end": 138,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_83@0",
            "content": "Shrey Desai, Jiacheng Xu, Greg Durrett, Compressive Summarization with Plausibility and Salience Modeling, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_83",
            "start": 0,
            "end": 209,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_84@0",
            "content": "Daniel Deutsch, Tania Bedrax-Weiss, Dan Roth, Towards Question-Answering as an Automatic Metric for Evaluating the Content Quality of a Summary, 2021, Transactions of the Association for Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_84",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_85@0",
            "content": "Daniel Deutsch, Rotem Dror, Dan Roth, A Statistical Analysis of Summarization Evaluation Metrics Using Resampling Methods, 2021, Transactions of the Association for Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_85",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_86@0",
            "content": "Daniel Deutsch, Dan Roth, Understanding the Extent to which Summarization Evaluation Metrics Measure the Information Quality of Summaries, 2020, ArXiv, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_86",
            "start": 0,
            "end": 152,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_87@0",
            "content": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, Kristina Toutanova, BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding, 2019, Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Long and Short Papers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_87",
            "start": 0,
            "end": 315,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_88@0",
            "content": "Zi-Yi Dou, Pengfei Liu, Hiroaki Hayashi, Zhengbao Jiang, Graham Neubig, GSum: A General Framework for Guided Neural Abstractive Summarization, 2021, Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Online. Association for Computational Linguistics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_88",
            "start": 0,
            "end": 342,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_89@0",
            "content": "Alexander Fabbri, Wojciech Kryscinski, Bryan Mc-Cann, R Socher, Dragomir Radev, Sum-mEval: Re-evaluating Summarization Evaluation, 2021, Transactions of the Association for Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_89",
            "start": 0,
            "end": 200,
            "label": {}
        },
        {
            "ix": "246-ARR_v2_90@0",
            "content": "Luyang Huang, Lingfei Wu, Lu Wang, Knowledge Graph-Augmented Abstractive Summarization with Semantic-Driven Cloze Reward, 2020, Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "246-ARR_v2_90",
            "start": 0,
            "end": 217,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "246-ARR_v2_0",
            "tgt_ix": "246-ARR_v2_1",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_0",
            "tgt_ix": "246-ARR_v2_1",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_1",
            "tgt_ix": "246-ARR_v2_2",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_1",
            "tgt_ix": "246-ARR_v2_2",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_0",
            "tgt_ix": "246-ARR_v2_3",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_2",
            "tgt_ix": "246-ARR_v2_3",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_4",
            "tgt_ix": "246-ARR_v2_5",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_5",
            "tgt_ix": "246-ARR_v2_6",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_6",
            "tgt_ix": "246-ARR_v2_7",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_7",
            "tgt_ix": "246-ARR_v2_8",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_8",
            "tgt_ix": "246-ARR_v2_9",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_9",
            "tgt_ix": "246-ARR_v2_10",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_3",
            "tgt_ix": "246-ARR_v2_4",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_3",
            "tgt_ix": "246-ARR_v2_5",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_3",
            "tgt_ix": "246-ARR_v2_6",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_3",
            "tgt_ix": "246-ARR_v2_7",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_3",
            "tgt_ix": "246-ARR_v2_8",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_3",
            "tgt_ix": "246-ARR_v2_9",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_3",
            "tgt_ix": "246-ARR_v2_10",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_3",
            "tgt_ix": "246-ARR_v2_4",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_0",
            "tgt_ix": "246-ARR_v2_11",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_10",
            "tgt_ix": "246-ARR_v2_11",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_12",
            "tgt_ix": "246-ARR_v2_13",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_13",
            "tgt_ix": "246-ARR_v2_14",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_14",
            "tgt_ix": "246-ARR_v2_15",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_15",
            "tgt_ix": "246-ARR_v2_16",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_16",
            "tgt_ix": "246-ARR_v2_17",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_17",
            "tgt_ix": "246-ARR_v2_18",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_18",
            "tgt_ix": "246-ARR_v2_19",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_19",
            "tgt_ix": "246-ARR_v2_20",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_12",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_13",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_14",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_15",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_16",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_17",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_18",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_19",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_20",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_12",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_21",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_20",
            "tgt_ix": "246-ARR_v2_21",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_22",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_21",
            "tgt_ix": "246-ARR_v2_22",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_0",
            "tgt_ix": "246-ARR_v2_23",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_22",
            "tgt_ix": "246-ARR_v2_23",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_24",
            "tgt_ix": "246-ARR_v2_25",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_25",
            "tgt_ix": "246-ARR_v2_26",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_26",
            "tgt_ix": "246-ARR_v2_27",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_23",
            "tgt_ix": "246-ARR_v2_24",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_23",
            "tgt_ix": "246-ARR_v2_25",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_23",
            "tgt_ix": "246-ARR_v2_26",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_23",
            "tgt_ix": "246-ARR_v2_27",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_23",
            "tgt_ix": "246-ARR_v2_24",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_23",
            "tgt_ix": "246-ARR_v2_28",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_27",
            "tgt_ix": "246-ARR_v2_28",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_29",
            "tgt_ix": "246-ARR_v2_30",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_30",
            "tgt_ix": "246-ARR_v2_31",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_31",
            "tgt_ix": "246-ARR_v2_32",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_32",
            "tgt_ix": "246-ARR_v2_33",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_33",
            "tgt_ix": "246-ARR_v2_34",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_34",
            "tgt_ix": "246-ARR_v2_35",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_35",
            "tgt_ix": "246-ARR_v2_36",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_28",
            "tgt_ix": "246-ARR_v2_29",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_28",
            "tgt_ix": "246-ARR_v2_30",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_28",
            "tgt_ix": "246-ARR_v2_31",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_28",
            "tgt_ix": "246-ARR_v2_32",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_28",
            "tgt_ix": "246-ARR_v2_33",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_28",
            "tgt_ix": "246-ARR_v2_34",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_28",
            "tgt_ix": "246-ARR_v2_35",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_28",
            "tgt_ix": "246-ARR_v2_36",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_28",
            "tgt_ix": "246-ARR_v2_29",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_23",
            "tgt_ix": "246-ARR_v2_37",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_36",
            "tgt_ix": "246-ARR_v2_37",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_38",
            "tgt_ix": "246-ARR_v2_39",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_39",
            "tgt_ix": "246-ARR_v2_40",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_40",
            "tgt_ix": "246-ARR_v2_41",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_37",
            "tgt_ix": "246-ARR_v2_38",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_37",
            "tgt_ix": "246-ARR_v2_39",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_37",
            "tgt_ix": "246-ARR_v2_40",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_37",
            "tgt_ix": "246-ARR_v2_41",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_37",
            "tgt_ix": "246-ARR_v2_38",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_23",
            "tgt_ix": "246-ARR_v2_42",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_41",
            "tgt_ix": "246-ARR_v2_42",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_43",
            "tgt_ix": "246-ARR_v2_44",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_44",
            "tgt_ix": "246-ARR_v2_45",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_42",
            "tgt_ix": "246-ARR_v2_43",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_42",
            "tgt_ix": "246-ARR_v2_44",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_42",
            "tgt_ix": "246-ARR_v2_45",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_42",
            "tgt_ix": "246-ARR_v2_43",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_0",
            "tgt_ix": "246-ARR_v2_46",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_45",
            "tgt_ix": "246-ARR_v2_46",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_46",
            "tgt_ix": "246-ARR_v2_47",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_46",
            "tgt_ix": "246-ARR_v2_47",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_46",
            "tgt_ix": "246-ARR_v2_48",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_47",
            "tgt_ix": "246-ARR_v2_48",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_49",
            "tgt_ix": "246-ARR_v2_50",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_50",
            "tgt_ix": "246-ARR_v2_51",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_48",
            "tgt_ix": "246-ARR_v2_49",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_48",
            "tgt_ix": "246-ARR_v2_50",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_48",
            "tgt_ix": "246-ARR_v2_51",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_48",
            "tgt_ix": "246-ARR_v2_49",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_46",
            "tgt_ix": "246-ARR_v2_52",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_51",
            "tgt_ix": "246-ARR_v2_52",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_53",
            "tgt_ix": "246-ARR_v2_54",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_54",
            "tgt_ix": "246-ARR_v2_55",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_55",
            "tgt_ix": "246-ARR_v2_56",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_56",
            "tgt_ix": "246-ARR_v2_57",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_57",
            "tgt_ix": "246-ARR_v2_58",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_52",
            "tgt_ix": "246-ARR_v2_53",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_52",
            "tgt_ix": "246-ARR_v2_54",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_52",
            "tgt_ix": "246-ARR_v2_55",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_52",
            "tgt_ix": "246-ARR_v2_56",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_52",
            "tgt_ix": "246-ARR_v2_57",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_52",
            "tgt_ix": "246-ARR_v2_58",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_52",
            "tgt_ix": "246-ARR_v2_53",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_46",
            "tgt_ix": "246-ARR_v2_59",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_58",
            "tgt_ix": "246-ARR_v2_59",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_60",
            "tgt_ix": "246-ARR_v2_61",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_61",
            "tgt_ix": "246-ARR_v2_62",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_59",
            "tgt_ix": "246-ARR_v2_60",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_59",
            "tgt_ix": "246-ARR_v2_61",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_59",
            "tgt_ix": "246-ARR_v2_62",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_59",
            "tgt_ix": "246-ARR_v2_60",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_0",
            "tgt_ix": "246-ARR_v2_63",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_62",
            "tgt_ix": "246-ARR_v2_63",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_64",
            "tgt_ix": "246-ARR_v2_65",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_65",
            "tgt_ix": "246-ARR_v2_66",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_66",
            "tgt_ix": "246-ARR_v2_67",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_67",
            "tgt_ix": "246-ARR_v2_68",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_68",
            "tgt_ix": "246-ARR_v2_69",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_69",
            "tgt_ix": "246-ARR_v2_70",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_63",
            "tgt_ix": "246-ARR_v2_64",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_63",
            "tgt_ix": "246-ARR_v2_65",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_63",
            "tgt_ix": "246-ARR_v2_66",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_63",
            "tgt_ix": "246-ARR_v2_67",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_63",
            "tgt_ix": "246-ARR_v2_68",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_63",
            "tgt_ix": "246-ARR_v2_69",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_63",
            "tgt_ix": "246-ARR_v2_70",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_63",
            "tgt_ix": "246-ARR_v2_64",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_0",
            "tgt_ix": "246-ARR_v2_71",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_70",
            "tgt_ix": "246-ARR_v2_71",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_71",
            "tgt_ix": "246-ARR_v2_72",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_71",
            "tgt_ix": "246-ARR_v2_72",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_73",
            "tgt_ix": "246-ARR_v2_74",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_71",
            "tgt_ix": "246-ARR_v2_73",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_71",
            "tgt_ix": "246-ARR_v2_74",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_72",
            "tgt_ix": "246-ARR_v2_73",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_75",
            "tgt_ix": "246-ARR_v2_76",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_71",
            "tgt_ix": "246-ARR_v2_75",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_71",
            "tgt_ix": "246-ARR_v2_76",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_74",
            "tgt_ix": "246-ARR_v2_75",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_71",
            "tgt_ix": "246-ARR_v2_77",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_76",
            "tgt_ix": "246-ARR_v2_77",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "246-ARR_v2_0",
            "tgt_ix": "246-ARR_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_1",
            "tgt_ix": "246-ARR_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_2",
            "tgt_ix": "246-ARR_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_2",
            "tgt_ix": "246-ARR_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_2",
            "tgt_ix": "246-ARR_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_2",
            "tgt_ix": "246-ARR_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_2",
            "tgt_ix": "246-ARR_v2_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_2",
            "tgt_ix": "246-ARR_v2_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_2",
            "tgt_ix": "246-ARR_v2_2@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_2",
            "tgt_ix": "246-ARR_v2_2@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_3",
            "tgt_ix": "246-ARR_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_4",
            "tgt_ix": "246-ARR_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_4",
            "tgt_ix": "246-ARR_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_5",
            "tgt_ix": "246-ARR_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_5",
            "tgt_ix": "246-ARR_v2_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_6",
            "tgt_ix": "246-ARR_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_6",
            "tgt_ix": "246-ARR_v2_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_6",
            "tgt_ix": "246-ARR_v2_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_6",
            "tgt_ix": "246-ARR_v2_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_6",
            "tgt_ix": "246-ARR_v2_6@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_7",
            "tgt_ix": "246-ARR_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_8",
            "tgt_ix": "246-ARR_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_8",
            "tgt_ix": "246-ARR_v2_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_8",
            "tgt_ix": "246-ARR_v2_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_9",
            "tgt_ix": "246-ARR_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_9",
            "tgt_ix": "246-ARR_v2_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_9",
            "tgt_ix": "246-ARR_v2_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_9",
            "tgt_ix": "246-ARR_v2_9@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_9",
            "tgt_ix": "246-ARR_v2_9@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_10",
            "tgt_ix": "246-ARR_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_11",
            "tgt_ix": "246-ARR_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_12",
            "tgt_ix": "246-ARR_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_12",
            "tgt_ix": "246-ARR_v2_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_13",
            "tgt_ix": "246-ARR_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_13",
            "tgt_ix": "246-ARR_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_14",
            "tgt_ix": "246-ARR_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_15",
            "tgt_ix": "246-ARR_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_15",
            "tgt_ix": "246-ARR_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_16",
            "tgt_ix": "246-ARR_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_16",
            "tgt_ix": "246-ARR_v2_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_17",
            "tgt_ix": "246-ARR_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_17",
            "tgt_ix": "246-ARR_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_18",
            "tgt_ix": "246-ARR_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_19",
            "tgt_ix": "246-ARR_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_20",
            "tgt_ix": "246-ARR_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_20",
            "tgt_ix": "246-ARR_v2_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_21",
            "tgt_ix": "246-ARR_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_21",
            "tgt_ix": "246-ARR_v2_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_21",
            "tgt_ix": "246-ARR_v2_21@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_21",
            "tgt_ix": "246-ARR_v2_21@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_21",
            "tgt_ix": "246-ARR_v2_21@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_22",
            "tgt_ix": "246-ARR_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_22",
            "tgt_ix": "246-ARR_v2_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_22",
            "tgt_ix": "246-ARR_v2_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_22",
            "tgt_ix": "246-ARR_v2_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_23",
            "tgt_ix": "246-ARR_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_24",
            "tgt_ix": "246-ARR_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_25",
            "tgt_ix": "246-ARR_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_25",
            "tgt_ix": "246-ARR_v2_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_25",
            "tgt_ix": "246-ARR_v2_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_25",
            "tgt_ix": "246-ARR_v2_25@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_25",
            "tgt_ix": "246-ARR_v2_25@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_26",
            "tgt_ix": "246-ARR_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_27",
            "tgt_ix": "246-ARR_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_27",
            "tgt_ix": "246-ARR_v2_27@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_27",
            "tgt_ix": "246-ARR_v2_27@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_27",
            "tgt_ix": "246-ARR_v2_27@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_28",
            "tgt_ix": "246-ARR_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_29",
            "tgt_ix": "246-ARR_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_30",
            "tgt_ix": "246-ARR_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_30",
            "tgt_ix": "246-ARR_v2_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_30",
            "tgt_ix": "246-ARR_v2_30@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_31",
            "tgt_ix": "246-ARR_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_31",
            "tgt_ix": "246-ARR_v2_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_31",
            "tgt_ix": "246-ARR_v2_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_31",
            "tgt_ix": "246-ARR_v2_31@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_32",
            "tgt_ix": "246-ARR_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_32",
            "tgt_ix": "246-ARR_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_32",
            "tgt_ix": "246-ARR_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_32",
            "tgt_ix": "246-ARR_v2_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_33",
            "tgt_ix": "246-ARR_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_33",
            "tgt_ix": "246-ARR_v2_33@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_33",
            "tgt_ix": "246-ARR_v2_33@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_33",
            "tgt_ix": "246-ARR_v2_33@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_34",
            "tgt_ix": "246-ARR_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_34",
            "tgt_ix": "246-ARR_v2_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_34",
            "tgt_ix": "246-ARR_v2_34@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_35",
            "tgt_ix": "246-ARR_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_35",
            "tgt_ix": "246-ARR_v2_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_35",
            "tgt_ix": "246-ARR_v2_35@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_36",
            "tgt_ix": "246-ARR_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_36",
            "tgt_ix": "246-ARR_v2_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_37",
            "tgt_ix": "246-ARR_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_38",
            "tgt_ix": "246-ARR_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_39",
            "tgt_ix": "246-ARR_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_39",
            "tgt_ix": "246-ARR_v2_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_39",
            "tgt_ix": "246-ARR_v2_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_39",
            "tgt_ix": "246-ARR_v2_39@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_40",
            "tgt_ix": "246-ARR_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_40",
            "tgt_ix": "246-ARR_v2_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_40",
            "tgt_ix": "246-ARR_v2_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_40",
            "tgt_ix": "246-ARR_v2_40@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_41",
            "tgt_ix": "246-ARR_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_41",
            "tgt_ix": "246-ARR_v2_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_41",
            "tgt_ix": "246-ARR_v2_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_41",
            "tgt_ix": "246-ARR_v2_41@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_41",
            "tgt_ix": "246-ARR_v2_41@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_42",
            "tgt_ix": "246-ARR_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_43",
            "tgt_ix": "246-ARR_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_44",
            "tgt_ix": "246-ARR_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_44",
            "tgt_ix": "246-ARR_v2_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_45",
            "tgt_ix": "246-ARR_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_45",
            "tgt_ix": "246-ARR_v2_45@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_45",
            "tgt_ix": "246-ARR_v2_45@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_46",
            "tgt_ix": "246-ARR_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_47",
            "tgt_ix": "246-ARR_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_48",
            "tgt_ix": "246-ARR_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_49",
            "tgt_ix": "246-ARR_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_49",
            "tgt_ix": "246-ARR_v2_49@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_50",
            "tgt_ix": "246-ARR_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_50",
            "tgt_ix": "246-ARR_v2_50@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_50",
            "tgt_ix": "246-ARR_v2_50@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_50",
            "tgt_ix": "246-ARR_v2_50@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_51",
            "tgt_ix": "246-ARR_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_51",
            "tgt_ix": "246-ARR_v2_51@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_51",
            "tgt_ix": "246-ARR_v2_51@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_51",
            "tgt_ix": "246-ARR_v2_51@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_52",
            "tgt_ix": "246-ARR_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_53",
            "tgt_ix": "246-ARR_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_53",
            "tgt_ix": "246-ARR_v2_53@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_53",
            "tgt_ix": "246-ARR_v2_53@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_53",
            "tgt_ix": "246-ARR_v2_53@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_53",
            "tgt_ix": "246-ARR_v2_53@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_53",
            "tgt_ix": "246-ARR_v2_53@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_54",
            "tgt_ix": "246-ARR_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_54",
            "tgt_ix": "246-ARR_v2_54@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_54",
            "tgt_ix": "246-ARR_v2_54@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_54",
            "tgt_ix": "246-ARR_v2_54@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_54",
            "tgt_ix": "246-ARR_v2_54@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_55",
            "tgt_ix": "246-ARR_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_55",
            "tgt_ix": "246-ARR_v2_55@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_56",
            "tgt_ix": "246-ARR_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_56",
            "tgt_ix": "246-ARR_v2_56@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_56",
            "tgt_ix": "246-ARR_v2_56@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_56",
            "tgt_ix": "246-ARR_v2_56@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_57",
            "tgt_ix": "246-ARR_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_57",
            "tgt_ix": "246-ARR_v2_57@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_57",
            "tgt_ix": "246-ARR_v2_57@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_57",
            "tgt_ix": "246-ARR_v2_57@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_58",
            "tgt_ix": "246-ARR_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_58",
            "tgt_ix": "246-ARR_v2_58@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_58",
            "tgt_ix": "246-ARR_v2_58@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_59",
            "tgt_ix": "246-ARR_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_60",
            "tgt_ix": "246-ARR_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_60",
            "tgt_ix": "246-ARR_v2_60@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_60",
            "tgt_ix": "246-ARR_v2_60@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_60",
            "tgt_ix": "246-ARR_v2_60@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_60",
            "tgt_ix": "246-ARR_v2_60@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_60",
            "tgt_ix": "246-ARR_v2_60@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_61",
            "tgt_ix": "246-ARR_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_61",
            "tgt_ix": "246-ARR_v2_61@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_61",
            "tgt_ix": "246-ARR_v2_61@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_61",
            "tgt_ix": "246-ARR_v2_61@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_61",
            "tgt_ix": "246-ARR_v2_61@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_62",
            "tgt_ix": "246-ARR_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_62",
            "tgt_ix": "246-ARR_v2_62@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_63",
            "tgt_ix": "246-ARR_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_64",
            "tgt_ix": "246-ARR_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_64",
            "tgt_ix": "246-ARR_v2_64@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_64",
            "tgt_ix": "246-ARR_v2_64@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_64",
            "tgt_ix": "246-ARR_v2_64@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_65",
            "tgt_ix": "246-ARR_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_65",
            "tgt_ix": "246-ARR_v2_65@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_66",
            "tgt_ix": "246-ARR_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_67",
            "tgt_ix": "246-ARR_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_67",
            "tgt_ix": "246-ARR_v2_67@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_67",
            "tgt_ix": "246-ARR_v2_67@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_68",
            "tgt_ix": "246-ARR_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_68",
            "tgt_ix": "246-ARR_v2_68@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_69",
            "tgt_ix": "246-ARR_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_69",
            "tgt_ix": "246-ARR_v2_69@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_69",
            "tgt_ix": "246-ARR_v2_69@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_69",
            "tgt_ix": "246-ARR_v2_69@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_70",
            "tgt_ix": "246-ARR_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_70",
            "tgt_ix": "246-ARR_v2_70@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_70",
            "tgt_ix": "246-ARR_v2_70@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_70",
            "tgt_ix": "246-ARR_v2_70@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_70",
            "tgt_ix": "246-ARR_v2_70@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_70",
            "tgt_ix": "246-ARR_v2_70@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_71",
            "tgt_ix": "246-ARR_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_72",
            "tgt_ix": "246-ARR_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_72",
            "tgt_ix": "246-ARR_v2_72@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_72",
            "tgt_ix": "246-ARR_v2_72@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_73",
            "tgt_ix": "246-ARR_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_73",
            "tgt_ix": "246-ARR_v2_73@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_73",
            "tgt_ix": "246-ARR_v2_73@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_73",
            "tgt_ix": "246-ARR_v2_73@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_73",
            "tgt_ix": "246-ARR_v2_73@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_73",
            "tgt_ix": "246-ARR_v2_73@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_73",
            "tgt_ix": "246-ARR_v2_73@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_74",
            "tgt_ix": "246-ARR_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_74",
            "tgt_ix": "246-ARR_v2_74@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_75",
            "tgt_ix": "246-ARR_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_75",
            "tgt_ix": "246-ARR_v2_75@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_75",
            "tgt_ix": "246-ARR_v2_75@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_75",
            "tgt_ix": "246-ARR_v2_75@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_76",
            "tgt_ix": "246-ARR_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_76",
            "tgt_ix": "246-ARR_v2_76@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_76",
            "tgt_ix": "246-ARR_v2_76@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_76",
            "tgt_ix": "246-ARR_v2_76@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_77",
            "tgt_ix": "246-ARR_v2_77@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_78",
            "tgt_ix": "246-ARR_v2_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_79",
            "tgt_ix": "246-ARR_v2_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_80",
            "tgt_ix": "246-ARR_v2_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_81",
            "tgt_ix": "246-ARR_v2_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_82",
            "tgt_ix": "246-ARR_v2_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_83",
            "tgt_ix": "246-ARR_v2_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_84",
            "tgt_ix": "246-ARR_v2_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_85",
            "tgt_ix": "246-ARR_v2_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_86",
            "tgt_ix": "246-ARR_v2_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_87",
            "tgt_ix": "246-ARR_v2_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_88",
            "tgt_ix": "246-ARR_v2_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_89",
            "tgt_ix": "246-ARR_v2_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "246-ARR_v2_90",
            "tgt_ix": "246-ARR_v2_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "paper.tei",
    "meta": {
        "ix_counter": 713,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy",
        "doc_id": "246-ARR",
        "version": 2
    }
}