{
    "nodes": [
        {
            "ix": "8-1204_v1_0",
            "content": "An audit of electron microscopy in the diagnosis of focal segmental glomerulosclerosis: are current pathological techniques missing important abnormalities in the glomerular basement membrane?",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_2",
            "content": "Background: There is an increasing appreciation that variants of the collagen IV genes may be associated with the development of focal segmental glomerulosclerosis (FSGS). On electron microscopy, such variants may produce characteristic changes within the glomerular basement membrane (GBM). These changes may be missed if glomerular lesions histologically diagnosed as FSGS on light microscopy are not subjected to electron microscopy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_3",
            "content": "Methods: We conducted a retrospective cohort analysis of all patients presenting to two hospitals who received a primary histological diagnosis of FSGS to see if these samples underwent subsequent electron microscopy. Each such sample was also scrutinised for the presence of characteristic changes of an underlying collagen IV disorder",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_4",
            "content": "Results: A total of 43 patients were identified. Of these, only 30 underwent electron microscopy. In two samples there were histological changes detected that might have suggested the underlying presence of a collagen IV disorder. Around one in three biopsy samples that had a histological diagnosis of FSGS were not subjected to electron microscopy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_5",
            "content": "Conclusion: Renal biopsy samples that have a histological diagnosis of primary FSGS not subjected to subsequent electron microscopy may potentially miss ultrastructural changes in the GBM that could signify an underlying collagen IV disorder as the patient’s underlying disease process. This could potentially affect both them and their families’ investigative and management decisions given potential for implications for transplant, heritability and different disease pathogenesis. This represents a gap in care which should be reflected upon and rectified via iterative standard care and unit-level quality assurance initiatives.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_6",
            "content": "Abbreviations",
            "ntype": "title",
            "meta": {
                "section": "1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_7",
            "content": "Chronic kidney disease (CKD); end stage kidney disease (ESKD); focal segmental glomerulosclerosis (FSGS); glomerular basement membrane (GBM); not otherwise specified (NOS); thin basement membrane nephropathy (TBMN).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_8",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_9",
            "content": "Focal segmental glomerulosclerosis (FSGS) is a pathological diagnosis which underpins a variety of progressive renal diseases that commonly result in proteinuria, chronic kidney disease (CKD) and potential end stage kidney disease (ESKD) requiring renal replacement therapy <REF-1> . FSGS occurs in either a primary. secondary, or genetic form. Primary FSGS is thought to be largely immunological in nature perhaps driven by an elusive permeability factor and secondary FSGS caused by compensatory hyperfiltration due to a previous glomerular injury <REF-2> . In recent years there has been a greater appreciation of the contribution of underlying genetic causes of this histological pattern. Many of these genetic aetiologies for FSGS have potential clinical significance for at-risk family members, subsequent genetic counselling, future living related kidney transplantation and therapeutics including potential avoidance of immunosuppressive therapies otherwise used for primary immunologically-mediated FSGS. Although initial focus has been on genes that are involved in the maintenance of podocyte structure and function it has become apparent that abnormalities in genes responsible for the structural integrity of the glomerular basement membrane (GBM) may underpin a significant minority of cases of adult-onset FSGS <REF-3> . Variants in COL4A3, COL4A4 and COL4A5 , which encode the α3, α4 and α5 chains of collagen IV, respectively, the major constituent of the GBM, previously linked to both Alport syndrome and thin basement membrane nephropathy (TBMN), may also underlie cases of FSGS <REF-4> . This suggestion has biological plausibility. Podocytes, the glomerular epithelial cells responsible for maintenance of the filtration barrier of the glomerulus through which plasma is ultrafiltrated, are not only a source for the α-chains secreted to form the GBM but also are required to be anchored to this structure in order to maintain the aforementioned filtration barrier <REF-2> , <REF-5> . It is not inconceivable then that inherited structural abnormalities of the GBM may lead to subsequent podocyte dysfunction and ultimately the lesion histologically characterised as FSGS.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_10",
            "content": "The relationship between the three renal conditions intertwined around variants in the collagen IV genes, Alport syndrome, TBMN, and FSGS is complex and incompletely understood. Whilst previously it was believed that patients heterozygous for variants in COL4A3 and COL4A4 would develop TBMN with persistent microscopic haematuria and an otherwise benign prognosis, this traditional thinking has been overturned by the discovery that some pedigrees with these variants will go on to develop significant proteinuria, FSGS lesions and the potential for progressive CKD or ESRD <REF-6> , <REF-7> . More recently, targeted gene sequencing of adults thought to have primary FSGS or steroid resistant nephrotic syndrome (the paediatric equivalent) found that pathogenic or likely pathogenic variants in collagen IV genes were present in up to 38% of families with familial FSGS, and 3% of those with sporadic FSGS <REF-3> , <REF-8> . These findings highlight the importance of considering variants in these genes in the diagnosis and subsequent management of patients found to have FSGS histologically.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_11",
            "content": "FSGS is a clinicopathological diagnosis that is made on the review of renal tissue obtained by percutaneous biopsy. This tissue is processed and subjected to several different staining techniques and methods of microscopy, including light, immunofluorescence and electron microscopy <REF-9> . FSGS, suggested on light microscopy by the finding of focal, segmental lesions with sclerosis, and an increase in the glomerular matrix with obliteration of the capillary lumens only requires this finding in one glomerulus and light microscopy to diagnose <REF-2> . As such, some specimens may previously have not been sent for further processing and review with other techniques such as electron microscopy even though this histopathology has heterogenous causative aetiologies. The other potential renal lesions that may be caused by collagen IV gene variants, Alport syndrome and TBMN, cause thinning, lamellation and fraying of the GBM and may also be associated with podocyte foot process effacement, all of which require electron microscopy to visualise <REF-4> . It should be noted that for Alport syndrome there are other techniques aside from electron microscopy available for identifying the diagnosis. Immunostaining of a renal biopsy specimen for type IV collagen may demonstrate the absence of alpha 3,4 or 5 chains in up to two thirds of patients, or a skin biopsy may show an absence of an alpha 5 chain <REF-10> , <REF-11> , in addition to the aforementioned genetic testing. Such absence by immunostaining does not appear be present in FSGS <REF-12> . Given that the pathological diagnosis of FSGS does not routinely require electron microscopy it is therefore conceivable that GBM lesions potentially associated with an underlying collagen 4 variant may have been missed. This represents an opportunity to audit our prior clinical behaviour to see if our multidisciplinary diagnostic practice may require improvement. We conducted a retrospective audit of prior renal biopsy results in two tertiary centres to see how many of those that had been given a histological diagnosis of FSGS were sent for subsequent electron microscopy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_12",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_13",
            "content": "Study background",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_14",
            "content": "Our study was a retrospective cohort analysis across two tertiary hospital sites involving the review of prior renal biopsy results that had been given the histological diagnosis of FSGS on light microscopy and how many of these samples subsequently went on to be processed for electron microscopy. In addition, of those samples that were subjected to electron microscopy, we reviewed how many displayed evidence of a potential collagen IV disorder. This project had ethics approval through Barwon Health’s Research Ethics Governance and Integrity unit and the Royal Brisbane and Women’s Hospital Human Research and Ethics Committee (HREC 18/131 and HREC/18/QRBW/258, respectively). Participants consent was waived by both ethics committees due to the negligible risk nature of data acquisition via retrospective datasets already maintained on electronic health records at both institutions.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_15",
            "content": "Eligibility criteria",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_16",
            "content": "Patients aged over the age of 18 who received a histological diagnosis of FSGS on native kidney biopsy during the time period of January 1 st 2008 until July 31 st 2018 at the first participating hospital and from the 1 st of October 2013 until the 29 th of December 2018 at the second were eligible to be included in the retrospective audit. Participants were excluded from the audit if they were less than 18 years of age, underwent kidney transplant biopsy, were defined clinically to have secondary FSGS as opposed to primary disease, received their diagnosis of FSGS or underwent a renal biopsy and pathological review outside of the prespecified time period for each institution.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_17",
            "content": "Sample treatment",
            "ntype": "title",
            "meta": {
                "section": "3.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_18",
            "content": "Samples for biopsy were placed in the following fixatives for processing; formalin for light microscopy, saline soaked gauze with freezing for immunofluorescence, and glutaraldehyde for electron microscopy. Samples for light microscopy are embedded and sectioned at 2- to 3-µm thickness with hematoxylin-eosin, Jones silver, periodic acid-schiff and trichrome staining performed. Immunofluorescence samples are sectioned within a cryostat and placed on prelabelled air-dried slides of the antigen in question. Electron microscopy tissue is processed into plastic, trimmed, cut into a 1-µm section and stained with toludine blue. The images are reviewed in a digital medium <REF-13> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_19",
            "content": "Identification of participants and data analysis",
            "ntype": "title",
            "meta": {
                "section": "3.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_20",
            "content": "A search strategy was developed for this retrospective cohort study to identify appropriate patients through local electronic medical record systems using the search term ‘focal segmental glomerulosclerosis’ with the AND operator to combine with ‘glomerulonephritis’ or ‘hereditary nephritis’. These patient results were subsequently reviewed for evidence of a previous percutaneous renal biopsy and report. The data were independently extracted from the included patients by the primary reviewer and collated in a Microsoft Excel document that included information on age, primary diagnosis, included use of electron microscopy and any changes that may be consistent with an underlying collagen disorder including thinning, lamellation and fraying of the GBM. The data extracted was verified by the other three co-authors with all discrepancies resolved through discussion and consensus.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_21",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_22",
            "content": "Participant information and diagnoses",
            "ntype": "title",
            "meta": {
                "section": "4.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_23",
            "content": "From January 2008 through to July 2018 at the first centre and October 2013 until December 2018 at the second, a total of 43 patients were identified as having primary FSGS. The baseline characteristics of the study cohort are provided in Table 1 . The median age was 49 years and the patients were predominantly male (55%). The most common underlying histological diagnosis reported in the renal biopsy clinical pathology reports was FSGS not otherwise specified (NOS), followed by familial FSGS with no underlying genetic disorder ascertained. There were small numbers of the cellular, collapsing, perihilar and tip FSGS variants noted. The two most common stages of CKD at the time of presentation were I and III. The results extracted and analyses in this study are available as Underlying data <REF-14> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_24",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Demographic and clinical characteristics of the patients at baseline.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_25",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Demographic and clinical characteristics of the patients at baseline.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" valign=\"top\">CHARACTERISTIC</th> <th align=\"left\" valign=\"top\">Value, n (%) (unless indicated)</th> </tr> </thead> <tbody> <tr> <td align=\"left\" valign=\"top\">Age, years <xref ref-type=\"other\" rid=\"FN1\">*</xref> </td> <td align=\"left\" valign=\"top\">Median (range) 49.95 (23&#8211;88)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Sex </td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;Male</td> <td align=\"left\" valign=\"top\">24 (55.81)</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;Female</td> <td align=\"left\" valign=\"top\">19 (44.18)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Underlying diagnosis</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;FSGS NOS</td> <td align=\"left\" valign=\"top\">31 (72.09)</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;FSGS cellular variant</td> <td align=\"left\" valign=\"top\">2 (4.65)</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;FSGS collapsing variant</td> <td align=\"left\" valign=\"top\">1 (2.32)</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;FSGS Familial</td> <td align=\"left\" valign=\"top\">3 (6.97)</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;FSGS Perihilar</td> <td align=\"left\" valign=\"top\">3 (6.97)</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;FSGS Tip</td> <td align=\"left\" valign=\"top\">3 (6.97)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Electron microscopy report available for biopsy?</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;Yes</td> <td align=\"left\" valign=\"top\">30 (69.76)</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;No</td> <td align=\"left\" valign=\"top\">13 (30.23)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Collagen disorder suggested </td> <td align=\"left\" valign=\"top\">2 (2.81)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Stage at diagnosis </td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;I</td> <td align=\"left\" valign=\"top\">12</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;II</td> <td align=\"left\" valign=\"top\">9</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;III</td> <td align=\"left\" valign=\"top\">12</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;IV</td> <td align=\"left\" valign=\"top\">8</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;V</td> <td align=\"left\" valign=\"top\">2</td> </tr> <tr> <td align=\"left\" valign=\"top\">&#160;&#160;&#160;Unknown</td> <td align=\"left\" valign=\"top\">0</td> </tr> </tbody> </table> <table-wrap-foot> <fn> <p id=\"FN1\">*Values given as median (range).</p> </fn> </table-wrap-foot> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Demographic and clinical characteristics of the patients at baseline.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_26",
            "content": "Use of electron microscopy",
            "ntype": "title",
            "meta": {
                "section": "4.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_27",
            "content": "Of the 43 patients identified, samples from 30 underwent electron microscopy after initial light microscopy and immunofluorescence. Two of these samples showed signs on electron microscopy that might be consistent with an underlying collagen IV glomerular basement membrane disorder. Microscopic haematuria was not noted in either of these two patients. Of the 13 samples that did not undergo electron microscopy, four had no glomeruli present within the processed core. The remaining nine samples had no documented reason.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_28",
            "content": "The overall percentage of biopsy samples for which data were available that were not subjected to electron microscopy was 30%, of which close to 21% had no documented reason for not undergoing electron microscopy. The annualised rate of biopsy samples that were not subjected to electron microscopy varied with time ( Figure 1 ). The number of biopsy reports available for analysis prior to 2013 was only one per year at most; however, from 2013 onwards the rate progressively increased to between 3 and 11 cases of FSGS diagnosed at histopathology between the two institutions per year. The annualised rate of electron microscopy from 2013 onwards varied each year, ranging from 50 to 87%. Overall 30% of biopsy samples did not receive electron microscopy. The overall rate of electron microscopy did not significantly change across the study period between the two centres.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_29",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Annualised rate of biopsy samples subjected to electron microscopy.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/21949/ebf09325-d591-4531-9029-45f923fe0165_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_30",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Annualised rate of biopsy samples subjected to electron microscopy.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/21949/ebf09325-d591-4531-9029-45f923fe0165_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Annualised rate of biopsy samples subjected to electron microscopy.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/21949/ebf09325-d591-4531-9029-45f923fe0165_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_31",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "5",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_32",
            "content": "This retrospective cohort analysis demonstrated that about two-thirds of native kidney biopsy samples across two institutions that were deemed to have primary FSGS underwent subsequent electron microscopy. Of those that did, two were reported to have characteristics that might be consistent with an underlying collagen IV disorder. In both samples, electron microscopy revealed a diffusely thin GBM, with the second additionally identifying early focal splitting of the GBM. The first sample was suggested to be consistent with TBMN whereas there was no pathological comment made about the second. FSGS (NOS) was the most common lesion described in this study, which is consistent with prior reports <REF-2> . Notably, close to one in three cases of primary FSGS were not proceeding to electron microscopy despite an indication to do so and 1 in 20 cases within our cohort had structural changes that were consistent with an underlying collagen IV variant. Whilst some samples were unable to undergo electron microscopy due to a lack of glomeruli in the biopsy core, in the majority of the others it is unclear why subsequent electron microscopy did not occur. The annualised rate of biopsy samples not subjected to electron microscopy varied by year, but on average around one in three samples were not subjected to electron microscopy despite receiving a histological diagnosis of FSGS.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_33",
            "content": "Curiously, neither of the two patients in whom electron microscopy was suggestive of an underlying collagen IV disorder was noted to have haematuria on their urinalysis at the time of presentation. Both of these samples were noted to have a thin basement membrane on electron microscopy, with focal splitting noted in one with an average thickness of 230.72 nm given. Unfortunately, due to the retrospective nature of this study we were unable to send any samples for immunostaining of collagen IV.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_34",
            "content": "There is an increasing body of evidence indicating that inheritable variants in collagen IV genes may underlie a proportion of cases of FSGS, with up to 12.5% cases of autosomal dominant FSGS attributable to COL4A3 in some cohorts <REF-15> . Not subjecting these renal biopsy samples to electron microscopy represents a potential gap in the investigation and subsequent management of such patients given they are much less likely to respond to immunosuppressive therapy <REF-16> which has otherwise been classically indicated.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_35",
            "content": "This study was designed as a retrospective cohort study looking at the number of samples sent for electron microscopy, as well as any potential changes which might be consistent with a collagen IV glomerular basement membrane disorder. It is important to recognise that not all groups have found the characteristic changes associated with the collagen IV disorders such as Alport’s Syndrome or TBMN on electron microscopy. One study described the typical pathological changes of FSGS but not the glomerular basement membrane abnormalities characterising Alport syndrome or TBMN in patients known to have variants in either COL4A3 or COL4A4 <REF-7> . It is thus possible that a lack of classical findings for a collagen IV glomerular basement membrane disorder may have accounted for the low number of those with GBM features on electron microscopy consistent with a collagen 4 disorder noted within our study. Indicating against this, however, another study suggested that biopsy samples from patients with the classical features of Alport Syndrome or TBMN showed podocyte detachment which might be expected and subsequently cause FSGS-type lesions <REF-4> . Other studies which have looked at electron microscopy in FSGS cases have similarly found low numbers of abnormalities that may be consistent with an underlying collagen 4 disorder <REF-3> , <REF-8> , which suggests the overall number of abnormalities to be found via electron microscopy may be low.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_36",
            "content": "The process by which variants within the collagen IV genes might cause FSGS remains unclear, particularly given their clear association with Alport Syndrome and TBMN. One proposal is that the ultrastructural changes induced by the collagen IV variants, perhaps under the influence of modifier genes such as laminin, result in impaired podocyte attachment to the glomerular basement membrane which leads to accelerated podocyte detachment, subsequent foot process effacement as a response to the increased shear stress induced by the denuded basement membrane and at a critical level of podocyte loss collapse of the capillary network with the appearance of the classical segmental sclerotic lesion <REF-2> , <REF-4> , <REF-17> . It also remains unclear as to whether the changes of FSGS are a secondary process occurring in those with TBMN or whether the collagen 4 variants are capable of causing primary FSGS <REF-7> , <REF-18> . FSGS occurring as a secondary process to other basement membrane abnormalities may explain why immunosuppressive therapy has traditionally been less effective in inherited forms of FSGS, although there are case reports of the successful use of the calcineurin inhibitor cyclosporine for some patients harbouring inheritable collagen 4 disorders <REF-6> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_37",
            "content": "In summary, this study has found that not all biopsy samples that had primary FSGS as a histological diagnosis were subjected to subsequent electron microscopy. This may have potentially led to inadvertently overlooking characteristic basement membrane abnormalities, which may suggest an underlying and heritable collagen IV disorder. These findings reflect an opportunity to change practice in order to better investigate, counsel and provide clinical management to these and future patients.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_38",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_39",
            "content": "Underlying data",
            "ntype": "title",
            "meta": {
                "section": "6.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_40",
            "content": "Figshare: Davis et al . FSGS biopsy audit.xlsx. https://doi.org/10.6084/m9.figshare.8949032.v1 <REF-14> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_41",
            "content": "This project contains the variables extracted for each individual retrospectively assessed in this study.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_42",
            "content": "Data are available under the terms of the Creative Commons Attribution 4.0 International license (CC-BY 4.0).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_43",
            "content": "<REF-1> Hines SL Agarwal A Ghandour M : Novel variants in COL4A4 and COL4A5 are rare causes of FSGS in two unrelated families. Hum Genome Var. 2018 ; 5 : 15 . 30002862 10.1038/s41439-018-0016-8 6039481",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_44",
            "content": "<REF-2> De Vriese AS Sethi S Nath KA : Differentiating Primary, Genetic, and Secondary FSGS in Adults: A Clinicopathologic Approach. J Am Soc Nephrol. 2018 ; 29 ( 3 ): 759 – 74 . 29321142 10.1681/ASN.2017090958 5827609",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_45",
            "content": "<REF-3> Gast C Pengelly RJ Lyon M : Collagen ( COL4A ) mutations are the most frequent mutations underlying adult focal segmental glomerulosclerosis. Nephrol Dial Transplant. 2016 ; 31 ( 6 ): 961 – 70 . 26346198 10.1093/ndt/gfv325",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_46",
            "content": "<REF-4> Wickman L Hodgin JB Wang SQ : Podocyte Depletion in Thin GBM and Alport Syndrome. PLoS One. 2016 ; 11 ( 5 ): e0155255 . 27192434 10.1371/journal.pone.0155255 4871445",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_47",
            "content": "<REF-5> Korstanje R Caputo CR Doty RA : A mouse Col4a4 mutation causing Alport glomerulosclerosis with abnormal collagen α3α4α5(IV) trimers. Kidney Int. 2014 ; 85 ( 6 ): 1461 – 8 . 24522496 10.1038/ki.2013.493 4040157",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_48",
            "content": "<REF-6> Pierides A Voskarides K Athanasiou Y : Clinico-pathological correlations in 127 patients in 11 large pedigrees, segregating one of three heterozygous mutations in the COL4A3/ COL4A4 genes associated with familial haematuria and significant late progression to proteinuria and chronic kidney disease from focal segmental glomerulosclerosis. Nephrol Dial Transplant. 2009 ; 24 ( 9 ): 2721 – 9 . 19357112 10.1093/ndt/gfp158",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_49",
            "content": "<REF-7> Malone AF Phelan PJ Hall G : Rare hereditary COL4A3/COL4A4 variants may be mistaken for familial focal segmental glomerulosclerosis. Kidney Int. 2014 ; 86 ( 6 ): 1253 – 9 . 25229338 10.1038/ki.2014.305 4245465",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_50",
            "content": "<REF-8> Yao T Udwan K John R : Integration of Genetic Testing and Pathology for the Diagnosis of Adults with FSGS. Clin J Am Soc Nephrol. 2019 ; 14 ( 2 ): 213 – 223 , pii: CJN.08750718. 30647093 10.2215/CJN.08750718 6390925",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_51",
            "content": "<REF-9> Hogan JJ Mocanu M Berns JS : The Native Kidney Biopsy: Update and Evidence for Best Practice. Clin J Am Soc Nephrol. 2016 ; 11 ( 2 ): 354 – 62 . 26339068 10.2215/CJN.05750515 4741037",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_52",
            "content": "<REF-10> Kashtan CE : Alport syndrome. An inherited disorder of renal, ocular, and cochlear basement membranes. Medicine (Baltimore). 1999 ; 78 ( 5 ): 338 – 60 . 10499074 10.1097/00005792-199909000-00005",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_53",
            "content": "<REF-11> Massella L Onetti Muda A Faraggiana T : Epidermal basement membrane alpha 5(IV) expression in females with Alport syndrome and severity of renal disease. Kidney Int. 2003 ; 64 ( 5 ): 1787 – 91 . 14531812 10.1046/j.1523-1755.2003.00251.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_54",
            "content": "<REF-12> Cai YI Sich M Beziau A : Collagen distribution in focal and segmental glomerulosclerosis: an immunofluorescence and ultrastructural immunogold study. J Pathol. 1996 ; 179 ( 2 ): 188 – 96 . 8758212 10.1002/(SICI)1096-9896(199606)179:2<188::AID-PATH551>3.0.CO;2-#",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_55",
            "content": "<REF-13> Walker PD : The renal biopsy. Arch Pathol Lab Med. 2009 ; 133 ( 2 ): 181 – 8 . 19195962",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_56",
            "content": "<REF-14> Davis J : Davis et al FSGS biopsy audit.xlsx. figshare. Dataset. 2019 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_57",
            "content": "<REF-15> Xie J Wu X Ren H : COL4A3 mutations cause focal segmental glomerulosclerosis. J Mol Cell Biol. 2014 ; 6 ( 6 ): 498 – 505 . 25596306 10.1093/jmcb/mju040",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_58",
            "content": "<REF-16> Papazachariou L Papagregoriou G Hadjipanagi D : Frequent COL4 mutations in familial microhematuria accompanied by later-onset Alport nephropathy due to focal segmental glomerulosclerosis. Clin Genet. 2017 ; 92 ( 5 ): 517 – 27 . 28632965 10.1111/cge.13077",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_59",
            "content": "<REF-17> Voskarides K Pierides A Deltas C : COL4A3/COL4A4 mutations link familial hematuria and focal segmental glomerulosclerosis. glomerular epithelium destruction via basement membrane thinning? Connect Tissue Res. 2008 ; 49 ( 3 ): 283 – 8 . 18661361 10.1080/03008200802148280",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1204_v1_60",
            "content": "<REF-18> Braunisch MC Buttner-Herold M Gunthner R : Heterozygous COL4A3 Variants in Histologically Diagnosed Focal Segmental Glomerulosclerosis. Front Pediatr. 2018 ; 6 : 171 . 29946535 10.3389/fped.2018.00171 6007128",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "8-1204_v1_0@0",
            "content": "An audit of electron microscopy in the diagnosis of focal segmental glomerulosclerosis: are current pathological techniques missing important abnormalities in the glomerular basement membrane?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_0",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "8-1204_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "8-1204_v1_2@0",
            "content": "Background: There is an increasing appreciation that variants of the collagen IV genes may be associated with the development of focal segmental glomerulosclerosis (FSGS).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_2",
            "start": 0,
            "end": 170,
            "label": {}
        },
        {
            "ix": "8-1204_v1_2@1",
            "content": "On electron microscopy, such variants may produce characteristic changes within the glomerular basement membrane (GBM).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_2",
            "start": 172,
            "end": 290,
            "label": {}
        },
        {
            "ix": "8-1204_v1_2@2",
            "content": "These changes may be missed if glomerular lesions histologically diagnosed as FSGS on light microscopy are not subjected to electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_2",
            "start": 292,
            "end": 435,
            "label": {}
        },
        {
            "ix": "8-1204_v1_3@0",
            "content": "Methods: We conducted a retrospective cohort analysis of all patients presenting to two hospitals who received a primary histological diagnosis of FSGS to see if these samples underwent subsequent electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_3",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "8-1204_v1_3@1",
            "content": "Each such sample was also scrutinised for the presence of characteristic changes of an underlying collagen IV disorder",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_3",
            "start": 218,
            "end": 335,
            "label": {}
        },
        {
            "ix": "8-1204_v1_4@0",
            "content": "Results: A total of 43 patients were identified.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_4",
            "start": 0,
            "end": 47,
            "label": {}
        },
        {
            "ix": "8-1204_v1_4@1",
            "content": "Of these, only 30 underwent electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_4",
            "start": 49,
            "end": 96,
            "label": {}
        },
        {
            "ix": "8-1204_v1_4@2",
            "content": "In two samples there were histological changes detected that might have suggested the underlying presence of a collagen IV disorder.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_4",
            "start": 98,
            "end": 229,
            "label": {}
        },
        {
            "ix": "8-1204_v1_4@3",
            "content": "Around one in three biopsy samples that had a histological diagnosis of FSGS were not subjected to electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_4",
            "start": 231,
            "end": 349,
            "label": {}
        },
        {
            "ix": "8-1204_v1_5@0",
            "content": "Conclusion: Renal biopsy samples that have a histological diagnosis of primary FSGS not subjected to subsequent electron microscopy may potentially miss ultrastructural changes in the GBM that could signify an underlying collagen IV disorder as the patient’s underlying disease process.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_5",
            "start": 0,
            "end": 285,
            "label": {}
        },
        {
            "ix": "8-1204_v1_5@1",
            "content": "This could potentially affect both them and their families’ investigative and management decisions given potential for implications for transplant, heritability and different disease pathogenesis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_5",
            "start": 287,
            "end": 482,
            "label": {}
        },
        {
            "ix": "8-1204_v1_5@2",
            "content": "This represents a gap in care which should be reflected upon and rectified via iterative standard care and unit-level quality assurance initiatives.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_5",
            "start": 484,
            "end": 631,
            "label": {}
        },
        {
            "ix": "8-1204_v1_6@0",
            "content": "Abbreviations",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_6",
            "start": 0,
            "end": 12,
            "label": {}
        },
        {
            "ix": "8-1204_v1_7@0",
            "content": "Chronic kidney disease (CKD); end stage kidney disease (ESKD); focal segmental glomerulosclerosis (FSGS); glomerular basement membrane (GBM); not otherwise specified (NOS); thin basement membrane nephropathy (TBMN).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_7",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "8-1204_v1_8@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_8",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@0",
            "content": "Focal segmental glomerulosclerosis (FSGS) is a pathological diagnosis which underpins a variety of progressive renal diseases that commonly result in proteinuria, chronic kidney disease (CKD) and potential end stage kidney disease (ESKD) requiring renal replacement therapy <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 0,
            "end": 282,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@1",
            "content": "FSGS occurs in either a primary.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 284,
            "end": 315,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@2",
            "content": "secondary, or genetic form.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 317,
            "end": 343,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@3",
            "content": "Primary FSGS is thought to be largely immunological in nature perhaps driven by an elusive permeability factor and secondary FSGS caused by compensatory hyperfiltration due to a previous glomerular injury <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 345,
            "end": 558,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@4",
            "content": "In recent years there has been a greater appreciation of the contribution of underlying genetic causes of this histological pattern.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 560,
            "end": 691,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@5",
            "content": "Many of these genetic aetiologies for FSGS have potential clinical significance for at-risk family members, subsequent genetic counselling, future living related kidney transplantation and therapeutics including potential avoidance of immunosuppressive therapies otherwise used for primary immunologically-mediated FSGS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 693,
            "end": 1012,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@6",
            "content": "Although initial focus has been on genes that are involved in the maintenance of podocyte structure and function it has become apparent that abnormalities in genes responsible for the structural integrity of the glomerular basement membrane (GBM) may underpin a significant minority of cases of adult-onset FSGS <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 1014,
            "end": 1334,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@7",
            "content": "Variants in COL4A3, COL4A4 and COL4A5 , which encode the α3, α4 and α5 chains of collagen IV, respectively, the major constituent of the GBM, previously linked to both Alport syndrome and thin basement membrane nephropathy (TBMN), may also underlie cases of FSGS <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 1336,
            "end": 1607,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@8",
            "content": "This suggestion has biological plausibility.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 1609,
            "end": 1652,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@9",
            "content": "Podocytes, the glomerular epithelial cells responsible for maintenance of the filtration barrier of the glomerulus through which plasma is ultrafiltrated, are not only a source for the α-chains secreted to form the GBM but also are required to be anchored to this structure in order to maintain the aforementioned filtration barrier <REF-2> , <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 1654,
            "end": 2005,
            "label": {}
        },
        {
            "ix": "8-1204_v1_9@10",
            "content": "It is not inconceivable then that inherited structural abnormalities of the GBM may lead to subsequent podocyte dysfunction and ultimately the lesion histologically characterised as FSGS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_9",
            "start": 2007,
            "end": 2193,
            "label": {}
        },
        {
            "ix": "8-1204_v1_10@0",
            "content": "The relationship between the three renal conditions intertwined around variants in the collagen IV genes, Alport syndrome, TBMN, and FSGS is complex and incompletely understood.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_10",
            "start": 0,
            "end": 176,
            "label": {}
        },
        {
            "ix": "8-1204_v1_10@1",
            "content": "Whilst previously it was believed that patients heterozygous for variants in COL4A3 and COL4A4 would develop TBMN with persistent microscopic haematuria and an otherwise benign prognosis, this traditional thinking has been overturned by the discovery that some pedigrees with these variants will go on to develop significant proteinuria, FSGS lesions and the potential for progressive CKD or ESRD <REF-6> , <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_10",
            "start": 178,
            "end": 593,
            "label": {}
        },
        {
            "ix": "8-1204_v1_10@2",
            "content": "More recently, targeted gene sequencing of adults thought to have primary FSGS or steroid resistant nephrotic syndrome (the paediatric equivalent) found that pathogenic or likely pathogenic variants in collagen IV genes were present in up to 38% of families with familial FSGS, and 3% of those with sporadic FSGS <REF-3> , <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_10",
            "start": 595,
            "end": 926,
            "label": {}
        },
        {
            "ix": "8-1204_v1_10@3",
            "content": "These findings highlight the importance of considering variants in these genes in the diagnosis and subsequent management of patients found to have FSGS histologically.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_10",
            "start": 928,
            "end": 1095,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@0",
            "content": "FSGS is a clinicopathological diagnosis that is made on the review of renal tissue obtained by percutaneous biopsy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 0,
            "end": 114,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@1",
            "content": "This tissue is processed and subjected to several different staining techniques and methods of microscopy, including light, immunofluorescence and electron microscopy <REF-9> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 116,
            "end": 291,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@2",
            "content": "FSGS, suggested on light microscopy by the finding of focal, segmental lesions with sclerosis, and an increase in the glomerular matrix with obliteration of the capillary lumens only requires this finding in one glomerulus and light microscopy to diagnose <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 293,
            "end": 557,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@3",
            "content": "As such, some specimens may previously have not been sent for further processing and review with other techniques such as electron microscopy even though this histopathology has heterogenous causative aetiologies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 559,
            "end": 771,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@4",
            "content": "The other potential renal lesions that may be caused by collagen IV gene variants, Alport syndrome and TBMN, cause thinning, lamellation and fraying of the GBM and may also be associated with podocyte foot process effacement, all of which require electron microscopy to visualise <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 773,
            "end": 1061,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@5",
            "content": "It should be noted that for Alport syndrome there are other techniques aside from electron microscopy available for identifying the diagnosis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 1063,
            "end": 1204,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@6",
            "content": "Immunostaining of a renal biopsy specimen for type IV collagen may demonstrate the absence of alpha 3,4 or 5 chains in up to two thirds of patients, or a skin biopsy may show an absence of an alpha 5 chain <REF-10> , <REF-11> , in addition to the aforementioned genetic testing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 1206,
            "end": 1483,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@7",
            "content": "Such absence by immunostaining does not appear be present in FSGS <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 1485,
            "end": 1560,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@8",
            "content": "Given that the pathological diagnosis of FSGS does not routinely require electron microscopy it is therefore conceivable that GBM lesions potentially associated with an underlying collagen 4 variant may have been missed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 1562,
            "end": 1781,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@9",
            "content": "This represents an opportunity to audit our prior clinical behaviour to see if our multidisciplinary diagnostic practice may require improvement.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 1783,
            "end": 1927,
            "label": {}
        },
        {
            "ix": "8-1204_v1_11@10",
            "content": "We conducted a retrospective audit of prior renal biopsy results in two tertiary centres to see how many of those that had been given a histological diagnosis of FSGS were sent for subsequent electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_11",
            "start": 1929,
            "end": 2140,
            "label": {}
        },
        {
            "ix": "8-1204_v1_12@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_12",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "8-1204_v1_13@0",
            "content": "Study background",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_13",
            "start": 0,
            "end": 15,
            "label": {}
        },
        {
            "ix": "8-1204_v1_14@0",
            "content": "Our study was a retrospective cohort analysis across two tertiary hospital sites involving the review of prior renal biopsy results that had been given the histological diagnosis of FSGS on light microscopy and how many of these samples subsequently went on to be processed for electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_14",
            "start": 0,
            "end": 297,
            "label": {}
        },
        {
            "ix": "8-1204_v1_14@1",
            "content": "In addition, of those samples that were subjected to electron microscopy, we reviewed how many displayed evidence of a potential collagen IV disorder.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_14",
            "start": 299,
            "end": 448,
            "label": {}
        },
        {
            "ix": "8-1204_v1_14@2",
            "content": "This project had ethics approval through Barwon Health’s Research Ethics Governance and Integrity unit and the Royal Brisbane and Women’s Hospital Human Research and Ethics Committee (HREC 18/131 and HREC/18/QRBW/258, respectively).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_14",
            "start": 450,
            "end": 681,
            "label": {}
        },
        {
            "ix": "8-1204_v1_14@3",
            "content": "Participants consent was waived by both ethics committees due to the negligible risk nature of data acquisition via retrospective datasets already maintained on electronic health records at both institutions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_14",
            "start": 683,
            "end": 890,
            "label": {}
        },
        {
            "ix": "8-1204_v1_15@0",
            "content": "Eligibility criteria",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_15",
            "start": 0,
            "end": 19,
            "label": {}
        },
        {
            "ix": "8-1204_v1_16@0",
            "content": "Patients aged over the age of 18 who received a histological diagnosis of FSGS on native kidney biopsy during the time period of January 1 st 2008 until July 31 st 2018 at the first participating hospital and from the 1 st of October 2013 until the 29 th of December 2018 at the second were eligible to be included in the retrospective audit.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_16",
            "start": 0,
            "end": 341,
            "label": {}
        },
        {
            "ix": "8-1204_v1_16@1",
            "content": "Participants were excluded from the audit if they were less than 18 years of age, underwent kidney transplant biopsy, were defined clinically to have secondary FSGS as opposed to primary disease, received their diagnosis of FSGS or underwent a renal biopsy and pathological review outside of the prespecified time period for each institution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_16",
            "start": 343,
            "end": 684,
            "label": {}
        },
        {
            "ix": "8-1204_v1_17@0",
            "content": "Sample treatment",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_17",
            "start": 0,
            "end": 15,
            "label": {}
        },
        {
            "ix": "8-1204_v1_18@0",
            "content": "Samples for biopsy were placed in the following fixatives for processing; formalin for light microscopy, saline soaked gauze with freezing for immunofluorescence, and glutaraldehyde for electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_18",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "8-1204_v1_18@1",
            "content": "Samples for light microscopy are embedded and sectioned at 2- to 3-µm thickness with hematoxylin-eosin, Jones silver, periodic acid-schiff and trichrome staining performed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_18",
            "start": 207,
            "end": 378,
            "label": {}
        },
        {
            "ix": "8-1204_v1_18@2",
            "content": "Immunofluorescence samples are sectioned within a cryostat and placed on prelabelled air-dried slides of the antigen in question.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_18",
            "start": 380,
            "end": 508,
            "label": {}
        },
        {
            "ix": "8-1204_v1_18@3",
            "content": "Electron microscopy tissue is processed into plastic, trimmed, cut into a 1-µm section and stained with toludine blue.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_18",
            "start": 510,
            "end": 627,
            "label": {}
        },
        {
            "ix": "8-1204_v1_18@4",
            "content": "The images are reviewed in a digital medium <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_18",
            "start": 629,
            "end": 682,
            "label": {}
        },
        {
            "ix": "8-1204_v1_19@0",
            "content": "Identification of participants and data analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_19",
            "start": 0,
            "end": 47,
            "label": {}
        },
        {
            "ix": "8-1204_v1_20@0",
            "content": "A search strategy was developed for this retrospective cohort study to identify appropriate patients through local electronic medical record systems using the search term ‘focal segmental glomerulosclerosis’ with the AND operator to combine with ‘glomerulonephritis’ or ‘hereditary nephritis’.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_20",
            "start": 0,
            "end": 292,
            "label": {}
        },
        {
            "ix": "8-1204_v1_20@1",
            "content": "These patient results were subsequently reviewed for evidence of a previous percutaneous renal biopsy and report.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_20",
            "start": 294,
            "end": 406,
            "label": {}
        },
        {
            "ix": "8-1204_v1_20@2",
            "content": "The data were independently extracted from the included patients by the primary reviewer and collated in a Microsoft Excel document that included information on age, primary diagnosis, included use of electron microscopy and any changes that may be consistent with an underlying collagen disorder including thinning, lamellation and fraying of the GBM.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_20",
            "start": 408,
            "end": 759,
            "label": {}
        },
        {
            "ix": "8-1204_v1_20@3",
            "content": "The data extracted was verified by the other three co-authors with all discrepancies resolved through discussion and consensus.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_20",
            "start": 761,
            "end": 887,
            "label": {}
        },
        {
            "ix": "8-1204_v1_21@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_21",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "8-1204_v1_22@0",
            "content": "Participant information and diagnoses",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_22",
            "start": 0,
            "end": 36,
            "label": {}
        },
        {
            "ix": "8-1204_v1_23@0",
            "content": "From January 2008 through to July 2018 at the first centre and October 2013 until December 2018 at the second, a total of 43 patients were identified as having primary FSGS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_23",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "8-1204_v1_23@1",
            "content": "The baseline characteristics of the study cohort are provided in Table 1 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_23",
            "start": 174,
            "end": 247,
            "label": {}
        },
        {
            "ix": "8-1204_v1_23@2",
            "content": "The median age was 49 years and the patients were predominantly male (55%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_23",
            "start": 249,
            "end": 323,
            "label": {}
        },
        {
            "ix": "8-1204_v1_23@3",
            "content": "The most common underlying histological diagnosis reported in the renal biopsy clinical pathology reports was FSGS not otherwise specified (NOS), followed by familial FSGS with no underlying genetic disorder ascertained.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_23",
            "start": 325,
            "end": 544,
            "label": {}
        },
        {
            "ix": "8-1204_v1_23@4",
            "content": "There were small numbers of the cellular, collapsing, perihilar and tip FSGS variants noted.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_23",
            "start": 546,
            "end": 637,
            "label": {}
        },
        {
            "ix": "8-1204_v1_23@5",
            "content": "The two most common stages of CKD at the time of presentation were I and III.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_23",
            "start": 639,
            "end": 715,
            "label": {}
        },
        {
            "ix": "8-1204_v1_23@6",
            "content": "The results extracted and analyses in this study are available as Underlying data <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_23",
            "start": 717,
            "end": 808,
            "label": {}
        },
        {
            "ix": "8-1204_v1_24@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_24",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "8-1204_v1_26@0",
            "content": "Use of electron microscopy",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_26",
            "start": 0,
            "end": 25,
            "label": {}
        },
        {
            "ix": "8-1204_v1_27@0",
            "content": "Of the 43 patients identified, samples from 30 underwent electron microscopy after initial light microscopy and immunofluorescence.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_27",
            "start": 0,
            "end": 130,
            "label": {}
        },
        {
            "ix": "8-1204_v1_27@1",
            "content": "Two of these samples showed signs on electron microscopy that might be consistent with an underlying collagen IV glomerular basement membrane disorder.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_27",
            "start": 132,
            "end": 282,
            "label": {}
        },
        {
            "ix": "8-1204_v1_27@2",
            "content": "Microscopic haematuria was not noted in either of these two patients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_27",
            "start": 284,
            "end": 352,
            "label": {}
        },
        {
            "ix": "8-1204_v1_27@3",
            "content": "Of the 13 samples that did not undergo electron microscopy, four had no glomeruli present within the processed core.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_27",
            "start": 354,
            "end": 469,
            "label": {}
        },
        {
            "ix": "8-1204_v1_27@4",
            "content": "The remaining nine samples had no documented reason.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_27",
            "start": 471,
            "end": 522,
            "label": {}
        },
        {
            "ix": "8-1204_v1_28@0",
            "content": "The overall percentage of biopsy samples for which data were available that were not subjected to electron microscopy was 30%, of which close to 21% had no documented reason for not undergoing electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_28",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "8-1204_v1_28@1",
            "content": "The annualised rate of biopsy samples that were not subjected to electron microscopy varied with time ( Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_28",
            "start": 214,
            "end": 328,
            "label": {}
        },
        {
            "ix": "8-1204_v1_28@2",
            "content": "The number of biopsy reports available for analysis prior to 2013 was only one per year at most; however, from 2013 onwards the rate progressively increased to between 3 and 11 cases of FSGS diagnosed at histopathology between the two institutions per year.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_28",
            "start": 330,
            "end": 586,
            "label": {}
        },
        {
            "ix": "8-1204_v1_28@3",
            "content": "The annualised rate of electron microscopy from 2013 onwards varied each year, ranging from 50 to 87%.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_28",
            "start": 588,
            "end": 689,
            "label": {}
        },
        {
            "ix": "8-1204_v1_28@4",
            "content": "Overall 30% of biopsy samples did not receive electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_28",
            "start": 691,
            "end": 756,
            "label": {}
        },
        {
            "ix": "8-1204_v1_28@5",
            "content": "The overall rate of electron microscopy did not significantly change across the study period between the two centres.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_28",
            "start": 758,
            "end": 874,
            "label": {}
        },
        {
            "ix": "8-1204_v1_29@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_29",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "8-1204_v1_31@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_31",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "8-1204_v1_32@0",
            "content": "This retrospective cohort analysis demonstrated that about two-thirds of native kidney biopsy samples across two institutions that were deemed to have primary FSGS underwent subsequent electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_32",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "8-1204_v1_32@1",
            "content": "Of those that did, two were reported to have characteristics that might be consistent with an underlying collagen IV disorder.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_32",
            "start": 206,
            "end": 331,
            "label": {}
        },
        {
            "ix": "8-1204_v1_32@2",
            "content": "In both samples, electron microscopy revealed a diffusely thin GBM, with the second additionally identifying early focal splitting of the GBM.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_32",
            "start": 333,
            "end": 474,
            "label": {}
        },
        {
            "ix": "8-1204_v1_32@3",
            "content": "The first sample was suggested to be consistent with TBMN whereas there was no pathological comment made about the second.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_32",
            "start": 476,
            "end": 597,
            "label": {}
        },
        {
            "ix": "8-1204_v1_32@4",
            "content": "FSGS (NOS) was the most common lesion described in this study, which is consistent with prior reports <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_32",
            "start": 599,
            "end": 709,
            "label": {}
        },
        {
            "ix": "8-1204_v1_32@5",
            "content": "Notably, close to one in three cases of primary FSGS were not proceeding to electron microscopy despite an indication to do so and 1 in 20 cases within our cohort had structural changes that were consistent with an underlying collagen IV variant.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_32",
            "start": 711,
            "end": 956,
            "label": {}
        },
        {
            "ix": "8-1204_v1_32@6",
            "content": "Whilst some samples were unable to undergo electron microscopy due to a lack of glomeruli in the biopsy core, in the majority of the others it is unclear why subsequent electron microscopy did not occur.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_32",
            "start": 958,
            "end": 1160,
            "label": {}
        },
        {
            "ix": "8-1204_v1_32@7",
            "content": "The annualised rate of biopsy samples not subjected to electron microscopy varied by year, but on average around one in three samples were not subjected to electron microscopy despite receiving a histological diagnosis of FSGS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_32",
            "start": 1162,
            "end": 1388,
            "label": {}
        },
        {
            "ix": "8-1204_v1_33@0",
            "content": "Curiously, neither of the two patients in whom electron microscopy was suggestive of an underlying collagen IV disorder was noted to have haematuria on their urinalysis at the time of presentation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_33",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "8-1204_v1_33@1",
            "content": "Both of these samples were noted to have a thin basement membrane on electron microscopy, with focal splitting noted in one with an average thickness of 230.72 nm given.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_33",
            "start": 198,
            "end": 366,
            "label": {}
        },
        {
            "ix": "8-1204_v1_33@2",
            "content": "Unfortunately, due to the retrospective nature of this study we were unable to send any samples for immunostaining of collagen IV.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_33",
            "start": 368,
            "end": 497,
            "label": {}
        },
        {
            "ix": "8-1204_v1_34@0",
            "content": "There is an increasing body of evidence indicating that inheritable variants in collagen IV genes may underlie a proportion of cases of FSGS, with up to 12.5% cases of autosomal dominant FSGS attributable to COL4A3 in some cohorts <REF-15> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_34",
            "start": 0,
            "end": 240,
            "label": {}
        },
        {
            "ix": "8-1204_v1_34@1",
            "content": "Not subjecting these renal biopsy samples to electron microscopy represents a potential gap in the investigation and subsequent management of such patients given they are much less likely to respond to immunosuppressive therapy <REF-16> which has otherwise been classically indicated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_34",
            "start": 242,
            "end": 525,
            "label": {}
        },
        {
            "ix": "8-1204_v1_35@0",
            "content": "This study was designed as a retrospective cohort study looking at the number of samples sent for electron microscopy, as well as any potential changes which might be consistent with a collagen IV glomerular basement membrane disorder.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_35",
            "start": 0,
            "end": 234,
            "label": {}
        },
        {
            "ix": "8-1204_v1_35@1",
            "content": "It is important to recognise that not all groups have found the characteristic changes associated with the collagen IV disorders such as Alport’s Syndrome or TBMN on electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_35",
            "start": 236,
            "end": 421,
            "label": {}
        },
        {
            "ix": "8-1204_v1_35@2",
            "content": "One study described the typical pathological changes of FSGS but not the glomerular basement membrane abnormalities characterising Alport syndrome or TBMN in patients known to have variants in either COL4A3 or COL4A4 <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_35",
            "start": 423,
            "end": 648,
            "label": {}
        },
        {
            "ix": "8-1204_v1_35@3",
            "content": "It is thus possible that a lack of classical findings for a collagen IV glomerular basement membrane disorder may have accounted for the low number of those with GBM features on electron microscopy consistent with a collagen 4 disorder noted within our study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_35",
            "start": 650,
            "end": 908,
            "label": {}
        },
        {
            "ix": "8-1204_v1_35@4",
            "content": "Indicating against this, however, another study suggested that biopsy samples from patients with the classical features of Alport Syndrome or TBMN showed podocyte detachment which might be expected and subsequently cause FSGS-type lesions <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_35",
            "start": 910,
            "end": 1157,
            "label": {}
        },
        {
            "ix": "8-1204_v1_35@5",
            "content": "Other studies which have looked at electron microscopy in FSGS cases have similarly found low numbers of abnormalities that may be consistent with an underlying collagen 4 disorder <REF-3> , <REF-8> , which suggests the overall number of abnormalities to be found via electron microscopy may be low.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_35",
            "start": 1159,
            "end": 1457,
            "label": {}
        },
        {
            "ix": "8-1204_v1_36@0",
            "content": "The process by which variants within the collagen IV genes might cause FSGS remains unclear, particularly given their clear association with Alport Syndrome and TBMN.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_36",
            "start": 0,
            "end": 165,
            "label": {}
        },
        {
            "ix": "8-1204_v1_36@1",
            "content": "One proposal is that the ultrastructural changes induced by the collagen IV variants, perhaps under the influence of modifier genes such as laminin, result in impaired podocyte attachment to the glomerular basement membrane which leads to accelerated podocyte detachment, subsequent foot process effacement as a response to the increased shear stress induced by the denuded basement membrane and at a critical level of podocyte loss collapse of the capillary network with the appearance of the classical segmental sclerotic lesion <REF-2> , <REF-4> , <REF-17> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_36",
            "start": 167,
            "end": 727,
            "label": {}
        },
        {
            "ix": "8-1204_v1_36@2",
            "content": "It also remains unclear as to whether the changes of FSGS are a secondary process occurring in those with TBMN or whether the collagen 4 variants are capable of causing primary FSGS <REF-7> , <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_36",
            "start": 729,
            "end": 930,
            "label": {}
        },
        {
            "ix": "8-1204_v1_36@3",
            "content": "FSGS occurring as a secondary process to other basement membrane abnormalities may explain why immunosuppressive therapy has traditionally been less effective in inherited forms of FSGS, although there are case reports of the successful use of the calcineurin inhibitor cyclosporine for some patients harbouring inheritable collagen 4 disorders <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_36",
            "start": 932,
            "end": 1285,
            "label": {}
        },
        {
            "ix": "8-1204_v1_37@0",
            "content": "In summary, this study has found that not all biopsy samples that had primary FSGS as a histological diagnosis were subjected to subsequent electron microscopy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_37",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "8-1204_v1_37@1",
            "content": "This may have potentially led to inadvertently overlooking characteristic basement membrane abnormalities, which may suggest an underlying and heritable collagen IV disorder.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_37",
            "start": 161,
            "end": 334,
            "label": {}
        },
        {
            "ix": "8-1204_v1_37@2",
            "content": "These findings reflect an opportunity to change practice in order to better investigate, counsel and provide clinical management to these and future patients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_37",
            "start": 336,
            "end": 493,
            "label": {}
        },
        {
            "ix": "8-1204_v1_38@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_38",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "8-1204_v1_39@0",
            "content": "Underlying data",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_39",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "8-1204_v1_40@0",
            "content": "Figshare: Davis et al .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_40",
            "start": 0,
            "end": 22,
            "label": {}
        },
        {
            "ix": "8-1204_v1_40@1",
            "content": "FSGS biopsy audit.xlsx.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_40",
            "start": 24,
            "end": 46,
            "label": {}
        },
        {
            "ix": "8-1204_v1_40@2",
            "content": "https://doi.org/10.6084/m9.figshare.8949032.v1 <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_40",
            "start": 48,
            "end": 104,
            "label": {}
        },
        {
            "ix": "8-1204_v1_41@0",
            "content": "This project contains the variables extracted for each individual retrospectively assessed in this study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_41",
            "start": 0,
            "end": 104,
            "label": {}
        },
        {
            "ix": "8-1204_v1_42@0",
            "content": "Data are available under the terms of the Creative Commons Attribution 4.0 International license (CC-BY 4.0).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_42",
            "start": 0,
            "end": 108,
            "label": {}
        },
        {
            "ix": "8-1204_v1_43@0",
            "content": "<REF-1> Hines SL Agarwal A Ghandour M : Novel variants in COL4A4 and COL4A5 are rare causes of FSGS in two unrelated families. Hum Genome Var. 2018 ; 5 : 15 . 30002862 10.1038/s41439-018-0016-8 6039481",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_43",
            "start": 0,
            "end": 200,
            "label": {}
        },
        {
            "ix": "8-1204_v1_44@0",
            "content": "<REF-2> De Vriese AS Sethi S Nath KA : Differentiating Primary, Genetic, and Secondary FSGS in Adults: A Clinicopathologic Approach. J Am Soc Nephrol. 2018 ; 29 ( 3 ): 759 – 74 . 29321142 10.1681/ASN.2017090958 5827609",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_44",
            "start": 0,
            "end": 217,
            "label": {}
        },
        {
            "ix": "8-1204_v1_45@0",
            "content": "<REF-3> Gast C Pengelly RJ Lyon M : Collagen ( COL4A ) mutations are the most frequent mutations underlying adult focal segmental glomerulosclerosis. Nephrol Dial Transplant. 2016 ; 31 ( 6 ): 961 – 70 . 26346198 10.1093/ndt/gfv325",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_45",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "8-1204_v1_46@0",
            "content": "<REF-4> Wickman L Hodgin JB Wang SQ : Podocyte Depletion in Thin GBM and Alport Syndrome. PLoS One. 2016 ; 11 ( 5 ): e0155255 . 27192434 10.1371/journal.pone.0155255 4871445",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_46",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "8-1204_v1_47@0",
            "content": "<REF-5> Korstanje R Caputo CR Doty RA : A mouse Col4a4 mutation causing Alport glomerulosclerosis with abnormal collagen α3α4α5(IV) trimers. Kidney Int. 2014 ; 85 ( 6 ): 1461 – 8 . 24522496 10.1038/ki.2013.493 4040157",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_47",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "8-1204_v1_48@0",
            "content": "<REF-6> Pierides A Voskarides K Athanasiou Y : Clinico-pathological correlations in 127 patients in 11 large pedigrees, segregating one of three heterozygous mutations in the COL4A3/ COL4A4 genes associated with familial haematuria and significant late progression to proteinuria and chronic kidney disease from focal segmental glomerulosclerosis. Nephrol Dial Transplant. 2009 ; 24 ( 9 ): 2721 – 9 . 19357112 10.1093/ndt/gfp158",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_48",
            "start": 0,
            "end": 427,
            "label": {}
        },
        {
            "ix": "8-1204_v1_49@0",
            "content": "<REF-7> Malone AF Phelan PJ Hall G : Rare hereditary COL4A3/COL4A4 variants may be mistaken for familial focal segmental glomerulosclerosis. Kidney Int. 2014 ; 86 ( 6 ): 1253 – 9 . 25229338 10.1038/ki.2014.305 4245465",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_49",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "8-1204_v1_50@0",
            "content": "<REF-8> Yao T Udwan K John R : Integration of Genetic Testing and Pathology for the Diagnosis of Adults with FSGS. Clin J Am Soc Nephrol. 2019 ; 14 ( 2 ): 213 – 223 , pii: CJN.08750718. 30647093 10.2215/CJN.08750718 6390925",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_50",
            "start": 0,
            "end": 222,
            "label": {}
        },
        {
            "ix": "8-1204_v1_51@0",
            "content": "<REF-9> Hogan JJ Mocanu M Berns JS : The Native Kidney Biopsy: Update and Evidence for Best Practice. Clin J Am Soc Nephrol. 2016 ; 11 ( 2 ): 354 – 62 . 26339068 10.2215/CJN.05750515 4741037",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_51",
            "start": 0,
            "end": 189,
            "label": {}
        },
        {
            "ix": "8-1204_v1_52@0",
            "content": "<REF-10> Kashtan CE : Alport syndrome. An inherited disorder of renal, ocular, and cochlear basement membranes. Medicine (Baltimore). 1999 ; 78 ( 5 ): 338 – 60 . 10499074 10.1097/00005792-199909000-00005",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_52",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "8-1204_v1_53@0",
            "content": "<REF-11> Massella L Onetti Muda A Faraggiana T : Epidermal basement membrane alpha 5(IV) expression in females with Alport syndrome and severity of renal disease. Kidney Int. 2003 ; 64 ( 5 ): 1787 – 91 . 14531812 10.1046/j.1523-1755.2003.00251.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_53",
            "start": 0,
            "end": 244,
            "label": {}
        },
        {
            "ix": "8-1204_v1_54@0",
            "content": "<REF-12> Cai YI Sich M Beziau A : Collagen distribution in focal and segmental glomerulosclerosis: an immunofluorescence and ultrastructural immunogold study. J Pathol. 1996 ; 179 ( 2 ): 188 – 96 . 8758212 10.1002/(SICI)1096-9896(199606)179:2<188::AID-PATH551>3.0.CO;2-#",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_54",
            "start": 0,
            "end": 269,
            "label": {}
        },
        {
            "ix": "8-1204_v1_55@0",
            "content": "<REF-13> Walker PD : The renal biopsy. Arch Pathol Lab Med. 2009 ; 133 ( 2 ): 181 – 8 . 19195962",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_55",
            "start": 0,
            "end": 95,
            "label": {}
        },
        {
            "ix": "8-1204_v1_56@0",
            "content": "<REF-14> Davis J : Davis et al FSGS biopsy audit.xlsx. figshare. Dataset. 2019 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_56",
            "start": 0,
            "end": 79,
            "label": {}
        },
        {
            "ix": "8-1204_v1_57@0",
            "content": "<REF-15> Xie J Wu X Ren H : COL4A3 mutations cause focal segmental glomerulosclerosis. J Mol Cell Biol. 2014 ; 6 ( 6 ): 498 – 505 . 25596306 10.1093/jmcb/mju040",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_57",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "8-1204_v1_58@0",
            "content": "<REF-16> Papazachariou L Papagregoriou G Hadjipanagi D : Frequent COL4 mutations in familial microhematuria accompanied by later-onset Alport nephropathy due to focal segmental glomerulosclerosis. Clin Genet. 2017 ; 92 ( 5 ): 517 – 27 . 28632965 10.1111/cge.13077",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_58",
            "start": 0,
            "end": 262,
            "label": {}
        },
        {
            "ix": "8-1204_v1_59@0",
            "content": "<REF-17> Voskarides K Pierides A Deltas C : COL4A3/COL4A4 mutations link familial hematuria and focal segmental glomerulosclerosis. glomerular epithelium destruction via basement membrane thinning? Connect Tissue Res. 2008 ; 49 ( 3 ): 283 – 8 . 18661361 10.1080/03008200802148280",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_59",
            "start": 0,
            "end": 278,
            "label": {}
        },
        {
            "ix": "8-1204_v1_60@0",
            "content": "<REF-18> Braunisch MC Buttner-Herold M Gunthner R : Heterozygous COL4A3 Variants in Histologically Diagnosed Focal Segmental Glomerulosclerosis. Front Pediatr. 2018 ; 6 : 171 . 29946535 10.3389/fped.2018.00171 6007128",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1204_v1_60",
            "start": 0,
            "end": 216,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "8-1204_v1_0",
            "tgt_ix": "8-1204_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_1",
            "tgt_ix": "8-1204_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_1",
            "tgt_ix": "8-1204_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_1",
            "tgt_ix": "8-1204_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_1",
            "tgt_ix": "8-1204_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_0",
            "tgt_ix": "8-1204_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_6",
            "tgt_ix": "8-1204_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_0",
            "tgt_ix": "8-1204_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_8",
            "tgt_ix": "8-1204_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_8",
            "tgt_ix": "8-1204_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_8",
            "tgt_ix": "8-1204_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_0",
            "tgt_ix": "8-1204_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_12",
            "tgt_ix": "8-1204_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_13",
            "tgt_ix": "8-1204_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_12",
            "tgt_ix": "8-1204_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_15",
            "tgt_ix": "8-1204_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_12",
            "tgt_ix": "8-1204_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_17",
            "tgt_ix": "8-1204_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_12",
            "tgt_ix": "8-1204_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_19",
            "tgt_ix": "8-1204_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_0",
            "tgt_ix": "8-1204_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_21",
            "tgt_ix": "8-1204_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_22",
            "tgt_ix": "8-1204_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_22",
            "tgt_ix": "8-1204_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_24",
            "tgt_ix": "8-1204_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_21",
            "tgt_ix": "8-1204_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_26",
            "tgt_ix": "8-1204_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_26",
            "tgt_ix": "8-1204_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_26",
            "tgt_ix": "8-1204_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_29",
            "tgt_ix": "8-1204_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_0",
            "tgt_ix": "8-1204_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_31",
            "tgt_ix": "8-1204_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_31",
            "tgt_ix": "8-1204_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_31",
            "tgt_ix": "8-1204_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_31",
            "tgt_ix": "8-1204_v1_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_31",
            "tgt_ix": "8-1204_v1_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_31",
            "tgt_ix": "8-1204_v1_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_0",
            "tgt_ix": "8-1204_v1_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_38",
            "tgt_ix": "8-1204_v1_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_39",
            "tgt_ix": "8-1204_v1_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_39",
            "tgt_ix": "8-1204_v1_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_39",
            "tgt_ix": "8-1204_v1_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_0",
            "tgt_ix": "8-1204_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_1",
            "tgt_ix": "8-1204_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_2",
            "tgt_ix": "8-1204_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_3",
            "tgt_ix": "8-1204_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_4",
            "tgt_ix": "8-1204_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_5",
            "tgt_ix": "8-1204_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_6",
            "tgt_ix": "8-1204_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_7",
            "tgt_ix": "8-1204_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_8",
            "tgt_ix": "8-1204_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_10",
            "tgt_ix": "8-1204_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_12",
            "tgt_ix": "8-1204_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_13",
            "tgt_ix": "8-1204_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_14",
            "tgt_ix": "8-1204_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_15",
            "tgt_ix": "8-1204_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_16",
            "tgt_ix": "8-1204_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_17",
            "tgt_ix": "8-1204_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_18",
            "tgt_ix": "8-1204_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_19",
            "tgt_ix": "8-1204_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_20",
            "tgt_ix": "8-1204_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_21",
            "tgt_ix": "8-1204_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_22",
            "tgt_ix": "8-1204_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_23",
            "tgt_ix": "8-1204_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_24",
            "tgt_ix": "8-1204_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_25",
            "tgt_ix": "8-1204_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_26",
            "tgt_ix": "8-1204_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_27",
            "tgt_ix": "8-1204_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_28",
            "tgt_ix": "8-1204_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_29",
            "tgt_ix": "8-1204_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_30",
            "tgt_ix": "8-1204_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_31",
            "tgt_ix": "8-1204_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_32",
            "tgt_ix": "8-1204_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_33",
            "tgt_ix": "8-1204_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_34",
            "tgt_ix": "8-1204_v1_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_35",
            "tgt_ix": "8-1204_v1_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_36",
            "tgt_ix": "8-1204_v1_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_37",
            "tgt_ix": "8-1204_v1_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_38",
            "tgt_ix": "8-1204_v1_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_39",
            "tgt_ix": "8-1204_v1_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_40",
            "tgt_ix": "8-1204_v1_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_41",
            "tgt_ix": "8-1204_v1_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_43",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_44",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_45",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_46",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_10",
            "tgt_ix": "8-1204_v1_48",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_10",
            "tgt_ix": "8-1204_v1_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_10",
            "tgt_ix": "8-1204_v1_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_18",
            "tgt_ix": "8-1204_v1_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_23",
            "tgt_ix": "8-1204_v1_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_34",
            "tgt_ix": "8-1204_v1_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_34",
            "tgt_ix": "8-1204_v1_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_36",
            "tgt_ix": "8-1204_v1_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_36",
            "tgt_ix": "8-1204_v1_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_23",
            "tgt_ix": "8-1204_v1_25",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_28",
            "tgt_ix": "8-1204_v1_30",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1204_v1_0",
            "tgt_ix": "8-1204_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_1",
            "tgt_ix": "8-1204_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_2",
            "tgt_ix": "8-1204_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_2",
            "tgt_ix": "8-1204_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_2",
            "tgt_ix": "8-1204_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_3",
            "tgt_ix": "8-1204_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_3",
            "tgt_ix": "8-1204_v1_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_4",
            "tgt_ix": "8-1204_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_4",
            "tgt_ix": "8-1204_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_4",
            "tgt_ix": "8-1204_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_4",
            "tgt_ix": "8-1204_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_5",
            "tgt_ix": "8-1204_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_5",
            "tgt_ix": "8-1204_v1_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_5",
            "tgt_ix": "8-1204_v1_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_6",
            "tgt_ix": "8-1204_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_7",
            "tgt_ix": "8-1204_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_8",
            "tgt_ix": "8-1204_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_9",
            "tgt_ix": "8-1204_v1_9@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_10",
            "tgt_ix": "8-1204_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_10",
            "tgt_ix": "8-1204_v1_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_10",
            "tgt_ix": "8-1204_v1_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_10",
            "tgt_ix": "8-1204_v1_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_11",
            "tgt_ix": "8-1204_v1_11@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_12",
            "tgt_ix": "8-1204_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_13",
            "tgt_ix": "8-1204_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_14",
            "tgt_ix": "8-1204_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_14",
            "tgt_ix": "8-1204_v1_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_14",
            "tgt_ix": "8-1204_v1_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_14",
            "tgt_ix": "8-1204_v1_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_15",
            "tgt_ix": "8-1204_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_16",
            "tgt_ix": "8-1204_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_16",
            "tgt_ix": "8-1204_v1_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_17",
            "tgt_ix": "8-1204_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_18",
            "tgt_ix": "8-1204_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_18",
            "tgt_ix": "8-1204_v1_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_18",
            "tgt_ix": "8-1204_v1_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_18",
            "tgt_ix": "8-1204_v1_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_18",
            "tgt_ix": "8-1204_v1_18@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_19",
            "tgt_ix": "8-1204_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_20",
            "tgt_ix": "8-1204_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_20",
            "tgt_ix": "8-1204_v1_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_20",
            "tgt_ix": "8-1204_v1_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_20",
            "tgt_ix": "8-1204_v1_20@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_21",
            "tgt_ix": "8-1204_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_22",
            "tgt_ix": "8-1204_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_23",
            "tgt_ix": "8-1204_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_23",
            "tgt_ix": "8-1204_v1_23@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_23",
            "tgt_ix": "8-1204_v1_23@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_23",
            "tgt_ix": "8-1204_v1_23@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_23",
            "tgt_ix": "8-1204_v1_23@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_23",
            "tgt_ix": "8-1204_v1_23@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_23",
            "tgt_ix": "8-1204_v1_23@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_24",
            "tgt_ix": "8-1204_v1_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_26",
            "tgt_ix": "8-1204_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_27",
            "tgt_ix": "8-1204_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_27",
            "tgt_ix": "8-1204_v1_27@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_27",
            "tgt_ix": "8-1204_v1_27@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_27",
            "tgt_ix": "8-1204_v1_27@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_27",
            "tgt_ix": "8-1204_v1_27@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_28",
            "tgt_ix": "8-1204_v1_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_28",
            "tgt_ix": "8-1204_v1_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_28",
            "tgt_ix": "8-1204_v1_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_28",
            "tgt_ix": "8-1204_v1_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_28",
            "tgt_ix": "8-1204_v1_28@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_28",
            "tgt_ix": "8-1204_v1_28@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_29",
            "tgt_ix": "8-1204_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_31",
            "tgt_ix": "8-1204_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_32",
            "tgt_ix": "8-1204_v1_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_32",
            "tgt_ix": "8-1204_v1_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_32",
            "tgt_ix": "8-1204_v1_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_32",
            "tgt_ix": "8-1204_v1_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_32",
            "tgt_ix": "8-1204_v1_32@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_32",
            "tgt_ix": "8-1204_v1_32@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_32",
            "tgt_ix": "8-1204_v1_32@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_32",
            "tgt_ix": "8-1204_v1_32@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_33",
            "tgt_ix": "8-1204_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_33",
            "tgt_ix": "8-1204_v1_33@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_33",
            "tgt_ix": "8-1204_v1_33@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_34",
            "tgt_ix": "8-1204_v1_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_34",
            "tgt_ix": "8-1204_v1_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_35",
            "tgt_ix": "8-1204_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_35",
            "tgt_ix": "8-1204_v1_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_35",
            "tgt_ix": "8-1204_v1_35@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_35",
            "tgt_ix": "8-1204_v1_35@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_35",
            "tgt_ix": "8-1204_v1_35@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_35",
            "tgt_ix": "8-1204_v1_35@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_36",
            "tgt_ix": "8-1204_v1_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_36",
            "tgt_ix": "8-1204_v1_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_36",
            "tgt_ix": "8-1204_v1_36@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_36",
            "tgt_ix": "8-1204_v1_36@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_37",
            "tgt_ix": "8-1204_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_37",
            "tgt_ix": "8-1204_v1_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_37",
            "tgt_ix": "8-1204_v1_37@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_38",
            "tgt_ix": "8-1204_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_39",
            "tgt_ix": "8-1204_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_40",
            "tgt_ix": "8-1204_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_40",
            "tgt_ix": "8-1204_v1_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_40",
            "tgt_ix": "8-1204_v1_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_41",
            "tgt_ix": "8-1204_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_42",
            "tgt_ix": "8-1204_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_43",
            "tgt_ix": "8-1204_v1_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_44",
            "tgt_ix": "8-1204_v1_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_45",
            "tgt_ix": "8-1204_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_46",
            "tgt_ix": "8-1204_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_47",
            "tgt_ix": "8-1204_v1_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_48",
            "tgt_ix": "8-1204_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_49",
            "tgt_ix": "8-1204_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_50",
            "tgt_ix": "8-1204_v1_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_51",
            "tgt_ix": "8-1204_v1_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_52",
            "tgt_ix": "8-1204_v1_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_53",
            "tgt_ix": "8-1204_v1_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_54",
            "tgt_ix": "8-1204_v1_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_55",
            "tgt_ix": "8-1204_v1_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_56",
            "tgt_ix": "8-1204_v1_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_57",
            "tgt_ix": "8-1204_v1_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_58",
            "tgt_ix": "8-1204_v1_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_59",
            "tgt_ix": "8-1204_v1_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1204_v1_60",
            "tgt_ix": "8-1204_v1_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "8-1204_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.19997.1",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "An audit of electron microscopy in the diagnosis of focal segmental glomerulosclerosis: are current pathological techniques missing important abnormalities in the glomerular basement membrane?",
        "abstract": "Background: There is an increasing appreciation that variants of the collagen IV genes may be associated with the development of focal segmental glomerulosclerosis (FSGS). On electron microscopy, such variants may produce characteristic changes within the glomerular basement membrane (GBM). These changes may be missed if glomerular lesions histologically diagnosed as FSGS on light microscopy are not subjected to electron microscopy. Methods: We conducted a retrospective cohort analysis of all patients presenting to two hospitals who received a primary histological diagnosis of FSGS to see if these samples underwent subsequent electron microscopy. Each such sample was also scrutinised for the presence of characteristic changes of an underlying collagen IV disorder Results: A total of 43 patients were identified. Of these, only 30 underwent electron microscopy. In two samples there were histological changes detected that might have suggested the underlying presence of a collagen IV disorder. Around one in three biopsy samples that had a histological diagnosis of FSGS were not subjected to electron microscopy. Conclusion: Renal biopsy samples that have a histological diagnosis of primary FSGS not subjected to subsequent electron microscopy may potentially miss ultrastructural changes in the GBM that could signify an underlying collagen IV disorder as the patient’s underlying disease process. This could potentially affect both them and their families’ investigative and management decisions given potential for implications for transplant, heritability and different disease pathogenesis. This represents a gap in care which should be reflected upon and rectified via iterative standard care and unit-level quality assurance initiatives.",
        "contributors": [
            {
                "surname": "Davis",
                "given-names": "Justin"
            },
            {
                "surname": "Tjipto",
                "given-names": "Alwie"
            },
            {
                "surname": "Hegerty",
                "given-names": "Katharine"
            },
            {
                "surname": "Mallett",
                "given-names": "Andrew"
            }
        ],
        "url": "https://f1000research.com/articles/8-1204/v1/",
        "doc_id": "8-1204",
        "version": 1,
        "ix_counter": 259,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}