{
    "nodes": [
        {
            "ix": "2-238_v2_0",
            "content": "Functional characterization of Candida albicans Hos2 histone deacetylase",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_2",
            "content": "Candida albicans is a mucosal commensal organism capable of causing superficial (oral and vaginal thrush) infections in immune normal hosts, but is a major pathogen causing systemic and mucosal infections in immunocompromised individuals. Azoles have been very effective anti-fungal agents and the mainstay in treating opportunistic mold and yeast infections. Azole resistant strains have emerged compromising the utility of this class of drugs. It has been shown that azole resistance can be reversed by the co-administration of a histone deacetylase (HDAC) inhibitor, suggesting that resistance is mediated by epigenetic mechanisms possibly involving Hos2, a fungal deacetylase. We report here the cloning and functional characterization of HOS2 (H igh O smolarity S ensitive) , a gene coding for fungal histone deacetylase from C. albicans . Inhibition studies showed that Hos2 is susceptible to pan inhibitors such as trichostatin A (TSA) and suberoylanilide hydroxamic acid (SAHA), but is not inhibited by class I inhibitors such as MS-275. This in vitro enzymatic assay, which is amenable to high throughput could be used for screening potent fungal Hos2 inhibitors that could be a potential anti-fungal adjuvant. Purified Hos2 protein consistently deacetylated tubulins, rather than histones from TSA-treated cells. Hos2 has been reported to be a putative NAD+ dependent histone deacetylase, a feature of sirtuins. We assayed for sirtuin activation with resveratrol and purified Hos2 protein and did not find any sirtuin activity.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_4",
            "content": "Candida albicans is a commensal organism found in the mucosa and gastrointestinal tract of most healthy individuals but can cause superficial (oral and vaginal thrush) infections in immune-normal hosts and severe systemic infection in immunocompromised patients <REF-1> . This fungus is of clinical importance and is one of the leading causes of systemic infections in immunocompromised individuals. C. albicans is the fourth most common cause of nosocomial bloodstream infections and is associated with high mortality rates <REF-2> . Azoles and echinocandins targeting the ergosterol and cell wall biosynthesis pathway respectively have been used as anti-fungal drugs though the emergence of drug-resistant strains has compromised the efficacy and utility of these drugs <REF-3> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_5",
            "content": "Azole resistance in Candida sp. is mediated by up regulation of genes encoding ERG11 , a lanosterol demethylase <REF-4> – <REF-6> , MDR1 <REF-5> , <REF-7> and by CDR (Candida drug resistance) efflux pumps <REF-5> , <REF-7> – <REF-9> . A combination of existing anti-fungals with new classes of drugs that act by different mechanisms will be viable alternatives to the current monotherapy regimen, which contributes to the emergence of drug resistance.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_6",
            "content": "Histone deacetylases (HDAC) play an important role in modulating chromatin conformation, by deacetylating crucial lysine residues in the histone octamers over which the chromatin DNA are wrapped <REF-10> . Human HDAC`s fall into four broad categories, Class I (HDAC1, 2, 3, and 8), Class II a (HDAC 4, 5, 7 and 9) Class II b (HDAC 6 and 10) Class III (sirtuins) and Class IV (HDAC11) based on sequence homology, substrate preference and co-factor requirements. The involvement of each of these isoforms in disease pathology has been elucidated to some extent in recent times. The approval of suberoylanilide hydroxamic acid (SAHA) <REF-11> , a well known inhibitor of HDACs by the US FDA for treating CTCL, (cutaneous T cell lymphoma) <REF-12> , <REF-13> has thrown open the doors for exploring the use of HDAC inhibitors in combination with existing drugs for several diseases, such as malaria and Kala-azar etc., <REF-14> – <REF-16> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_7",
            "content": "Class specific inhibitors are now becoming a reality for human HDAC isoforms. For example the HDAC Class I specific inhibitor MS-275 is in advanced clinical trials (clinical trial Nos. NCT00020579, NCT00866333) for several forms of cancer, and the HDAC Class II specific inhibitor ACY-1215 is at an advanced clinical phase (clinical trial Nos. NCT01323751 , NCT01583283 ) for myeloma.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_8",
            "content": "HDAC inhibitors have been shown to synergize the actions of antifungal agents, due to their effect on preventing drug resistance in vitro <REF-17> , <REF-18> . Therefore, an alternative approach to address fungal drug resistance could be to harness the potential of modulating fungal gene expression by inhibition of fungal HDACs <REF-17> , <REF-19> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_9",
            "content": "Hos2, a Class I HDAC enzyme plays an important role in gene activation in the yeast Saccharomyces cerevisiae by binding to open reading frames (ORFs) of active genes <REF-20> . Hos2/Set3 histone deacetylase complex (Set3C) plays a key role in the conversion of white phase to virulent opaque phase in C. albicans <REF-21> . Deletion of Hos2, the catalytic subunit of the Set3 complex produced a phenotype resembling inhibition of the Set3C by Trichostatin-A (TSA) <REF-22> . Serum-induced morphogenesis of some C. albicans strains was shown to be inhibited by TSA <REF-19> . Thus inhibiting the morphogenetic ability of this opportunistic pathogen using HDAC inhibitors holds the promise of future antifungal agents. Recently a small molecule, MGCD 290 (Hos2 inhibitor) has entered clinical trials (clinical trial number NCT01497223 )) for use in combination with azoles, such as fluconazole, for fungal infections <REF-18> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_10",
            "content": "In light of the emerging utility of Hos2 inhibition as an anti-fungal strategy, we have cloned and characterized the C. albicans HOS2 . In this report, we present details on optimizing the codons and cloning for heterologous gene expression in Sf9 insect cells. Purified Hos2 was characterized by functional deacetylase activities on histone/tubulin preparations and inhibition studies with SAHA, TSA and MS-275. The Candida genome database reports Hos2 to be a putative NAD+ dependent histone deacetylase <REF-23> , reminiscent of sirtuins. The Candida genome encodes for 3 sirtuins (HST1, HST2 and HST3). It has been shown that inhibition of HST3 by either gene repression or nicotinamide treatment reduces to a considerable extent the clinical severity of candidiasis <REF-24> . In light of this reported observation, we checked for sirtuin like activity of purified Hos2 preparations using resveratrol, which activates sirtuins <REF-25> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_11",
            "content": "Materials and methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "materials | methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_12",
            "content": "Isolation of C. albicans genomic DNA",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_13",
            "content": "C. albicans ATCC 90028 was obtained from ATCC and grown in Sabouraud dextrose media. The protoplasts were prepared from an overnight culture of fully-grown mycelia using zymolyase (Cat. No. L5263, Sigma, St. Louis, MO, USA) as per the manufacturer’s instructions. Protoplasts were lysed in a chaotrophic salt solution and genomic DNA was isolated according to manufacturer’s instruction (Qiagen, Hilden, Germany). The final eluate was reprecipitated with ammonium acetate and isopropanol and DNA quantified by UV spectrophotometer (Spectramax Gemini XS, Molecular devices, CA. USA).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_14",
            "content": "Cloning and expression of HOS2 in an insect cell expression system",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_15",
            "content": "Oligos were designed with codon changes made for 4 th and 271 st serine residues. Full length HOS2 gene was amplified by using 4 different primers ( Table 1 ) using splicing by overlap extension (SOE PCR), so that codon usage could be maintained in any heterologous expression system. The full-length blunt end PCR product was cloned in to pJET1.2 cloning vector (CloneJET PCR Cloning Kit Thermo Scientific) and confirmed by restriction digestion using BamH1 and Not1 . DNA sequencing using T7 promoter (forward, 5´-TAATAC GACTCACTATAGGG-3´) and pJET1.2 (reverse, 5´-AAGAACATCGATTTTCCATGGCAG-´3) sequencing primer ascertained the sequence of the recombinant Hos2 gene.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_16",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Oligonucleotide primer pairs for the PCR amplification of Hos2 gene by SOE PCR.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_17",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Oligonucleotide primer pairs for the PCR amplification of Hos2 gene by SOE PCR.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" valign=\"middle\">Sl. No.</th> <th align=\"left\" valign=\"middle\">Primer <break/>Name</th> <th align=\"left\">Primer sequence</th> </tr> </thead> <tbody> <tr> <td>1</td> <td>PR1</td> <td>5&#180; AAAAGGATCCATGACGATATCCATAAGTGAAACAGATACG 3&#180;</td> </tr> <tr> <td>2</td> <td>PR2</td> <td>5&#180; ATTATTTAAATCCATTATGGAACCGTTAAT 3&#180;</td> </tr> <tr> <td>3</td> <td>PR3</td> <td>5&#180; ATTAACGGTTCCATAATGGATTTAAATAAT 3&#180;</td> </tr> <tr> <td>4</td> <td>PR4</td> <td>5&#180; CACCACTAGCGGCCGCTAAGTCATTAGTTCTCCTAGTTTGGTTTCA 3&#180;</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Oligonucleotide primer pairs for the PCR amplification of Hos2 gene by SOE PCR.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_18",
            "content": "Recombinant baculoviruses were generated using the Bac-to-Bac ® baculovirus expression system according to the instructions of the manufacturer (Cat. No. 10359-016, Invitrogen, Carlsbad, USA). Sf9 insect cells (Cat. No. B825-01, Invitrogen, Carlsbad, USA) were cultured in complete TMN-FH medium (Cat. No. 554760, BD Bioscience, NJ, USA) served as host cells for virus generation and/or protein production. The HOS2 gene was cloned in frame with N-terminal hexa-histidine tag into the transfer vector pFastBac-HT B (Cat. No. 10584-027, Invitrogen, Carlsbad, USA) and transformed in to Escherichia coli DH10Bac cells (Cat. No. 10361-012, Invitrogen, Carlsbad, USA). Sf9 cells were transfected using cellfectin reagent (Cat. No. 10362-100, Invitrogen, Carlsbad, USA) with the recombinant bacmid, and the resulting viruses were tested for their ability to produce recombinant Hos2 protein using western blot. Production cultures were performed T-150 cell culture flasks (Greiner bio-one GmbH, Germany) at a density of 16×10 6 cells per flask. The cultures were inoculated with recombinant baculovirus stocks at multiplicities of infection of 10. At 4 days after infection, cells were harvested by centrifugation at 1200 g for 15 min at 4°C in a tabletop centrifuge (Model 5804R, Eppendorf AG, Hamburg, Germany). Cell pellets were stored at -80°C until protein purification.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_19",
            "content": "Purification of recombinant Hos2 protein",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_20",
            "content": "The infected Sf9 cell pellets were resuspended in in-house ice-cold lysis buffer [10 mM Tris pH 7.5, 130 mM NaCl, 1% triton X-100, 10 mM NaF, 10 mM NaPi (sodium phosphate), and 10 mM NaPPi (sodium pyrophosphate)] with 1 X EDTA free protease inhibitor cocktail (Cat. No. 539134, Calbiochem, Merck-Millipore, San Diego, CA). Insoluble material was removed by centrifugation (Model 5804R, Eppendorf AG, Hamburg, Germany) at 16000 g, 4°C for 15 min. The cleared lysate was processed for nickel affinity chromatography. Briefly, the cell supernatant was loaded onto a 3-ml nickel-nitrilotriacetic acid-agarose resin (Ni-NTA agarose, Cat. No. 30210, Qiagen, Hilden, Germany) packed column pre-equilibrated with equilibration buffer (25 mM Tris-Cl pH 8.0, 300 mM NaCl). The column was washed with wash buffer (25 mM Tris-Cl pH 8.0, 300 mM NaCl, 20 mM imidazole). His-tagged Hos2 protein was eluted with buffer containing 300 mM imidazole (Sigma, St. Louis, MO, USA). The Hos2 protein preparation was dialyzed into buffer (25 mM Tris, pH 8.0, 138 mM NaCl, 10% glycerol) and kept in 100 μl aliquots at -70°C. The concentration of Hos2 protein in the final eluate was estimated by Bradford assay (Bio-Rad Laboratories, CA, USA).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_21",
            "content": "Hos2 deacetylase enzymatic assay",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_22",
            "content": "HDAC inhibitors, namely SAHA, TSA or MS-275 were dissolved in DMSO as 10 mM stock and subsequently diluted in 1X assay buffer (50 mM Tris Cl, pH 8.0, 137 mM NaCl, 2.7 mM KCl, 2.5 mM MgCl 2 , 1 mg/ml BSA). Enzymatic assay was carried out in triplicates using the fluorogenic Class I HDAC substrate, Boc-Lys (Ac)-AMC (Cat. No. I1875, Bachem AG, Bubendorf, Switzerland). Briefly, 0.5 μg of purified recombinant protein in a volume of 10 μl of assay buffer was incubated with 50 μl of appropriate concentration of HDAC inhibitors and 20 μM of substrate at 37°C for 1 hr in 100 μl reaction volume. Reactions were terminated by the addition of trichostatin A (TSA)/suberoylanilide hydroxamic acid (SAHA), trypsin (1 mg/mL) (Sigma, St. Louis, MO, USA) and left at 37°C for 15 min, before reading the plates in a fluorimeter (Spectramax Gemini XS, Molecular devices, CA. USA) at wavelengths 360 nm (ext) and 460 nm (emi).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_23",
            "content": "Production of polyclonal anti sera against Hos2 protein",
            "ntype": "title",
            "meta": {
                "section": "2.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_24",
            "content": "Female BALB/c mice were purchased from The Jackson Laboratory (Bar Harbor, ME) at 4 weeks of age and then housed at the animal facility, Orchid Chemicals and Pharmaceuticals for 2 weeks in a specific-pathogen free facility with a 12 h light cycle (6 am–6 pm) and a 12 h dark cycle (6 pm–6 am). Groups of four mice were housed in sterilised polypropylene cages covered with stainless steel grid top, lined with autoclaved clean rice husk bedding. All animal experimentations were approved by the institutional animal ethics committee (Protocol No. 01/IAEC-05/PPK/2009). The native Hos2 protein (expressed in pET-32 bacterial vector system and purified using nickel affinity chromatography under denaturating conditions) was emulsified in complete Freund’s adjuvant and injected subcutaneously into two female BALB/c mice (20 μg/mice). Booster doses of the deacetylase antigen (20 μg/mice) were given on the 14 th and 21 st day in Freund’s incomplete adjuvant. Mice were bled 7 days after the second booster dose and polyclonal anti sera was separated after clotting the blood <REF-26> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_25",
            "content": "Cell culture",
            "ntype": "title",
            "meta": {
                "section": "2.6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_26",
            "content": "Jurkat, a human T lymphocyte cell line, and HeLa, a human cervical adenocarcinoma cell line was obtained from ATCC and were cultured in DMEM (Gibco, Life technologies) supplemented with 10% (v/v) fetal calf serum (FCS), 2 mM glutamine, 100 units/ml penicillin and 100 µg/ml streptomycin (Gibco, Life technologies).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_27",
            "content": "Isolation of nuclear histones from mammalian cells",
            "ntype": "title",
            "meta": {
                "section": "2.7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_28",
            "content": "Acetylated histones were isolated from HeLa cells treated with the HDAC inhibitor SAHA as per published protocol <REF-27> . The histone pellet was then resuspended in ultra pure water, stored in 50 μl aliquots at -70°C and the protein concentration was determined using a BCA kit (Pierce).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_29",
            "content": "Isolation of histones from Candida sp .",
            "ntype": "title",
            "meta": {
                "section": "2.8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_30",
            "content": "C. albicans ATCC 90028 mycelia (~5 gm wet weight) were washed with water, centrifuged at 10,000 rpm for 10 minutes at 4°C and the mycelial pellet was resuspended in 50 ml of 0.1 mM Tris-HCl, pH 9.4, 10 mM DTT. The sample was incubated with shaking at 30°C for 15 min and pelleted. The pellet was washed with 50 ml of sorbitol/HEPES buffer (1.2 M sorbitol, 20 mM Hepes, pH 7.4) and left resuspended in the same buffer containing lyticase (1000 units) overnight at 30°C for spheroplasting <REF-28> . The sample was pelleted and proceeded to histone isolation using acid extraction as described previously <REF-29> . Acetone was added at 3:1 (vol/vol) to precipitate the histones, which were subsequently dissolved in 10 mM Tris, pH-8.0.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_31",
            "content": "Deacetylation of nuclear histones",
            "ntype": "title",
            "meta": {
                "section": "2.9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_32",
            "content": "Acetylated histones isolated from SAHA treated HeLa cells were used for the deacetylation assay with recombinant Hos2 enzyme. In brief, purified acetylated histones (2 μg) were incubated with different amounts of recombinant Hos2 enzyme. Histone deacetylation with 300 ng of rhHDAC1 or rhHDAC6 (expressed in-house using Baculo-viral expression system) was used as a positive control. Deacetylation assays were carried out in 100 μl reaction volume for 1 hr at 37°C in reaction buffer (50 mM Tris Cl, pH 8.0, 137 mM NaCl, 2.7 mM KCl, 2.5 mM MgCl 2 , 1 mg/ml BSA). At the end of incubation, the reaction was stopped by the addition of 1X Lammeli sample buffer. The protein samples were resolved by SDS-PAGE and immunoblotted with anti-acetylated H3 Histone (Ac-K-9) antibody to study the deacetylation of H3-histone by rHos2. The assay results are reproducible in three independent experiments.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_33",
            "content": "Deacetylation of acetylated tubulin",
            "ntype": "title",
            "meta": {
                "section": "2.10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_34",
            "content": "Whole cell extracts from TSA (Sigma, St. Louis, MO, USA) treated Jurkat cells were used for the α-tubulin deacetylation assay with recombinant Hos2 enzyme. In brief, whole cell extract (10 μg) were incubated with 5 and 8 μg of recombinant Hos2 protein. Deacetylation assays were carried out in 100 μl reaction volume for 3 hr at 37°C in reaction buffer (50 mM Tris-Cl, pH 8.0, 137 mM NaCl, 2.7 mM KCl, 2.5 mM MgCl 2 ). At the end of incubation, the reaction was stopped by the addition of 1X Lammeli sample buffer. The protein samples were resolved by SDS-PAGE and immunoblotted with either anti-acetylated α-tubulin or anti-α-tubulin antibodies. The assay results are reproducible in two independent experiments.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_35",
            "content": "Western blotting",
            "ntype": "title",
            "meta": {
                "section": "2.11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_36",
            "content": "Recombinant Hos2 protein or the acetylated/deacetylated nuclear histones from deacetylation assays were separated on 10–15% SDS-polyacrylamide gels. The gels were stained with coomassie blue (Phast gel, Aersham) or electro-blotted onto nitrocellulose membrane (HyBond-C, Amersham), which was blocked with 5% nonfat dry milk (Cat No. 70166, Fluka, Sigma-Aldrich) in 0.1% Tween- 20 in TBS for 1 hr, followed by overnight incubation at 4°C with either the polyclonal mouse serum (dilution 1:4000 of the sera), rabbit polyclonal anti-acetylated H3-Histone (dilution 1:4000, Ac-K-9 of H3-Histone, Cat. No. 06-599; Millipore), mouse monoclonal anti-acetylated tubulin (dilution 1:15000, Cat. No. T7451, Sigma) or mouse monoclonal anti-tubulin antibody (dilution 1:150000, Cat. No. T6199, Sigma). After incubation with the appropriate horseradish peroxidase conjugated secondary antibodies (Bovine anti-mouse IgG HRP conjugate-dilution 1:7500, Santa Cruz, SC-2371, Goat anti-rabbit IgG-HRP Upstate (Millipore) 12–348, dilution 1:4000), supersignal west pico substrate (Thermo Scientific Pierce) was used for detection.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_37",
            "content": "In vitro Sirt1 activation assay",
            "ntype": "title",
            "meta": {
                "section": "2.12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_38",
            "content": "HeLa nuclear extract (2 μg) or recombinant Hos2 enzyme (300 ng) was incubated with NAD+ (500 μM), Fluor de Lys ® −Sirt1 (Enzo lifescience), varying concentrations of resveratrol (Cat. No. 0219605205, MP Biomedicals, Ohio, USA) (30, 100, 250 and 500 μM) in presence or absence of the pan-HDAC inhibitor trichostatin, in 50 μl reaction volume at 37°C for 30 min. The reaction was carried out in triplicate following manufacturer’s protocol (Enzo lifescience).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_39",
            "content": "Statistical analysis",
            "ntype": "title",
            "meta": {
                "section": "2.13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_40",
            "content": "All values are expressed as mean ± standard deviation and the graphs were generated using Graph-Pad Prism ® (Version 4) for Windows (GraphPad Software, San Diego, California, USA. Statistical analysis was performed by one-way analysis of variance (ANOVA), followed by Bonferroni multiple comparison test for all parameters. Results were considered statistically significant at P < 0.05.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_41",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_42",
            "content": "HOS2 gene PCR",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_43",
            "content": "Codon usage in C. albicans is different from standard genetic code. The 4 th serine and the 271 st serine of HOS2 are translated as leucine in both mammalian and in insect cell expression systems. Hence, these codons were mutated using oligonucleotide primers to express serine in the recombinant Hos2 protein. The PCR product was cloned in the pFastbac-HTB shuttle vector and subsequently into baculo viral DNA using the Bac-to-Bac expression system.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_44",
            "content": "Protein expression and purification",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_45",
            "content": "The Hos2 enzyme was expressed in the baculoviral-insect cell expression system as a NH 2 -terminal hexa histidine tagged fusion protein, which is detected on Western blot as a ~52 kDa protein using our own polyclonal anti-Hos2 anti-sera raised against Hos2 protein in mice. SDS-PAGE analysis of purified protein revealed a major band at ~52 kDa ( Figure 1A ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_46",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Expression of his-tagged Hos2 in insect cells and its characterization. ( A ) Sf9 cells were infected with 10 MOI of recombinant Hos2 baculovirus for 72 hours and the soluble fraction was collected. Two μg of protein was separated on a 10% SDS-PAGE. Lane 2 is coomassie stained SDS-PAGE and Lane 3 is Hos2 protein recognized by polyclonal anti sera from mice. Molecular weight markers are labeled at the left side (Lane 1) of the blot. ( B ) Concentration dependent increase in deacetylase activity following incubation of baculo expressed Hos2 with Boc-lys (ac)-AMC fluorogenic peptide substrate in 1 hr assay at 37°C. Assays were carried out in triplicates and analysed for statistical significance by one way ANOVA (Bonferroni's Multiple Comparison Test) using GraphPad Prism software.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_47",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Expression of his-tagged Hos2 in insect cells and its characterization.</title> <p>( <bold>A</bold>) Sf9 cells were infected with 10 MOI of recombinant Hos2 baculovirus for 72 hours and the soluble fraction was collected. Two &#956;g of protein was separated on a 10% SDS-PAGE. Lane 2 is coomassie stained SDS-PAGE and Lane 3 is Hos2 protein recognized by polyclonal anti sera from mice. Molecular weight markers are labeled at the left side (Lane 1) of the blot. ( <bold>B</bold>) Concentration dependent increase in deacetylase activity following incubation of baculo expressed Hos2 with Boc-lys (ac)-AMC fluorogenic peptide substrate in 1 hr assay at 37&#176;C. Assays were carried out in triplicates and analysed for statistical significance by one way ANOVA (Bonferroni's Multiple Comparison Test) using GraphPad Prism software.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Expression of his-tagged Hos2 in insect cells and its characterization. ( A ) Sf9 cells were infected with 10 MOI of recombinant Hos2 baculovirus for 72 hours and the soluble fraction was collected. Two μg of protein was separated on a 10% SDS-PAGE. Lane 2 is coomassie stained SDS-PAGE and Lane 3 is Hos2 protein recognized by polyclonal anti sera from mice. Molecular weight markers are labeled at the left side (Lane 1) of the blot. ( B ) Concentration dependent increase in deacetylase activity following incubation of baculo expressed Hos2 with Boc-lys (ac)-AMC fluorogenic peptide substrate in 1 hr assay at 37°C. Assays were carried out in triplicates and analysed for statistical significance by one way ANOVA (Bonferroni's Multiple Comparison Test) using GraphPad Prism software.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_48",
            "content": "In vitro deacetylation assay using synthetic peptide substrate",
            "ntype": "title",
            "meta": {
                "section": "3.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_49",
            "content": "Recombinant Hos2 enzyme was assayed for deacetylase activity using the synthetic deacetylase substrate, Boc-Lys (ac)-AMC. The total activity with Boc-Lys (ac) AMC showed the enzyme to be active in deacetylating the lysine residue and the activity increased significantly ( P < 0.05 ) with an increase in Hos2 concentration ( Figure 1B ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_50",
            "content": "The inhibition of deacetylation activity of recombinant Hos2 was studied using classical HDAC inhibitors namely SAHA, TSA and MS-275. TSA was very potent in inhibiting Hos2 with an IC 50 of 2.8 nM, SAHA inhibited Hos2 with an IC 50 of 65 nM ( Figure 2 , Table 2 ). However, MS-275 showed > 50% inhibition of Hos2 activity only at 10 μM ( Table 3 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_51",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Dose-dependent inhibition of Hos2 deacetylase activity by SAHA (squares) and TSA (triangles). Recombinant Hos2 enzyme was incubated with different concentrations of pan-HDAC inhibitors (SAHA or TSA) and the enzyme activity assay was performed. Assays were carried out in triplicates and error bars were calculated using GraphPad prism software.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_52",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Dose-dependent inhibition of Hos2 deacetylase activity by SAHA (squares) and TSA (triangles).</title> <p>Recombinant Hos2 enzyme was incubated with different concentrations of pan-HDAC inhibitors (SAHA or TSA) and the enzyme activity assay was performed. Assays were carried out in triplicates and error bars were calculated using GraphPad prism software.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Dose-dependent inhibition of Hos2 deacetylase activity by SAHA (squares) and TSA (triangles). Recombinant Hos2 enzyme was incubated with different concentrations of pan-HDAC inhibitors (SAHA or TSA) and the enzyme activity assay was performed. Assays were carried out in triplicates and error bars were calculated using GraphPad prism software.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_53",
            "content": "Table 2.",
            "ntype": "label",
            "meta": {
                "id": "T2",
                "caption": "IC 50 values of standard HDAC inhibitors.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_54",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T2\" position=\"anchor\"> <caption> <title>IC <sub>50</sub> values of standard HDAC inhibitors.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">Sl. No.</th> <th align=\"left\">Pan HDAC inhibitor</th> <th align=\"left\">IC <sub>50</sub> &#177; SE (nM)</th> </tr> </thead> <tbody> <tr> <td>1</td> <td>SAHA</td> <td>65.4 &#177; 2.4</td> </tr> <tr> <td>2</td> <td>TSA</td> <td>2.8 &#177; 0.9</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T2",
                "caption": "IC 50 values of standard HDAC inhibitors.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_55",
            "content": "Table 3.",
            "ntype": "label",
            "meta": {
                "id": "T3",
                "caption": "Hos2 enzyme inhibition values of Class I HDAC inhibitor.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_56",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T3\" position=\"anchor\"> <caption> <title>Hos2 enzyme inhibition values of Class I HDAC inhibitor.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" rowspan=\"2\" valign=\"middle\">Sl. No.</th> <th align=\"left\" rowspan=\"2\" valign=\"middle\">Class I HDAC inhibitor</th> <th align=\"center\" colspan=\"2\" valign=\"middle\">% inhibition &#177; SE</th> </tr> <tr> <th align=\"left\">10 &#181;M</th> <th align=\"left\">1 &#181;M</th> </tr> </thead> <tbody> <tr> <td>1</td> <td>MS275</td> <td>56.3 &#177; 0.9</td> <td>46.3 &#177; 1.4</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T3",
                "caption": "Hos2 enzyme inhibition values of Class I HDAC inhibitor.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_57",
            "content": "In vitro deacetylation assay using natural substrates",
            "ntype": "title",
            "meta": {
                "section": "3.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_58",
            "content": "The ability of purified Hos2 protein to deacetylate acetylated histones was examined in vitro using acetylated nuclear histone preparation made from SAHA treated HeLa cells. The nuclear histones from HeLa cells were isolated using a modified protocol of Shechter et al. <REF-27> and established the deacetylation assay using rhHDAC1/rhHDAC6 as controls along with rHos2. In these assays it was found that 0.3 μg of rhHDAC1 was able to deacetylate the nuclear acetylated histones as detected by an anti-H3-K9 histone antibody. Recombinant hHDAC1 was more potent in deacetylating lysine residues in H3-histones than rhHDAC6. However, no significant deacetylation of H3-Histone was seen with 0.3 μg of Hos2 ( Figure 3A ). Similar results were obtained with acetylated histones from Candida in the in vitro histone deacetylation assay with purified Hos2 protein (up to 3 μg, Figure 3B ). In contrast, when recombinant Hos2 was incubated with mammalian acetylated α-tubulin, a significant reduction in acetylation of α-tubulin (K40) could be observed ( Figure 4 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_59",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "Deacetylation assays of deacetylases with nuclear histones. A . Histone H3 acetylation determined by Western blot of extracted acetylated histones (2 µg) Control (Lane 1), incubated with 300 ng of recombinant Hos2 protein (Lane 2), recombinant human HDAC1 (HD1 Lane 3) and recombinant human HDAC6 (HD6 Lane 4) for 1 hour at 37°C in HDAC assay buffer. B . Histone H3 acetylation determined by Western blot of extracted acetylated histones (2 µg) isolated from C. albicans , incubated with different concentrations of recombinant Hos2 protein for 1 hour at 37°C in HDAC assay buffer.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_60",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>Deacetylation assays of deacetylases with nuclear histones.</title> <p> <bold>A</bold>. Histone H3 acetylation determined by Western blot of extracted acetylated histones (2 &#181;g) Control (Lane 1), incubated with 300 ng of recombinant Hos2 protein (Lane 2), recombinant human HDAC1 (HD1 Lane 3) and recombinant human HDAC6 (HD6 Lane 4) for 1 hour at 37&#176;C in HDAC assay buffer. <bold>B</bold>. Histone H3 acetylation determined by Western blot of extracted acetylated histones (2 &#181;g) isolated from <italic>C. albicans</italic>, incubated with different concentrations of recombinant Hos2 protein for 1 hour at 37&#176;C in HDAC assay buffer.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "Deacetylation assays of deacetylases with nuclear histones. A . Histone H3 acetylation determined by Western blot of extracted acetylated histones (2 µg) Control (Lane 1), incubated with 300 ng of recombinant Hos2 protein (Lane 2), recombinant human HDAC1 (HD1 Lane 3) and recombinant human HDAC6 (HD6 Lane 4) for 1 hour at 37°C in HDAC assay buffer. B . Histone H3 acetylation determined by Western blot of extracted acetylated histones (2 µg) isolated from C. albicans , incubated with different concentrations of recombinant Hos2 protein for 1 hour at 37°C in HDAC assay buffer.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_61",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Deacetylation assays of rHos2 with α tubulin. α-tubulin acetylation determined by Western blot of SAHA-treated whole cell extracts containing acetylated α-tubulin (10 µg) incubated with 0, 5 or 8 µg of recombinant Hos2 for 3 hrs at 37°C in HDAC assay buffer.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_62",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <title>Deacetylation assays of rHos2 with &#945; tubulin.</title> <p>&#945;-tubulin acetylation determined by Western blot of SAHA-treated whole cell extracts containing acetylated &#945;-tubulin (10 &#181;g) incubated with 0, 5 or 8 &#181;g of recombinant Hos2 for 3 hrs at 37&#176;C in HDAC assay buffer.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Deacetylation assays of rHos2 with α tubulin. α-tubulin acetylation determined by Western blot of SAHA-treated whole cell extracts containing acetylated α-tubulin (10 µg) incubated with 0, 5 or 8 µg of recombinant Hos2 for 3 hrs at 37°C in HDAC assay buffer.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_63",
            "content": "In vitro Sirt1 deacetylation assay using fluor-de-lys substrate",
            "ntype": "title",
            "meta": {
                "section": "3.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_64",
            "content": "Since Hos2 is a putative NAD+ dependent deacetylase, a feature of sirtuin class of deacetylases, it was of interest to check if the Hos2 protein displayed any sirtuin like activity. The sirtuin-like activity in response to the sirtuin activator resveratrol was studied using fluor-de-lys, a synthetic Sirt1 substrate. HeLa nuclear extract was used as a positive control for sirtuin activity. In the presence of TSA where the HDAC activities are inhibited no appreciable NAD+ dependent deacetylase-like activity was seen, following incubation of Hos2 with different concentrations of resveratrol ( Figure 5 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_65",
            "content": "Figure 5.",
            "ntype": "label",
            "meta": {
                "id": "f5",
                "caption": "SIRTI activation following incubation of Resveratrol with rHos2. Fold activation of the Sirt1 like activity following incubation of recombinant Hos2 enzyme with different concentration of resveratrol in presence and absence of HDAC inhibitor trichostatin. Assays were carried out in triplicates and analysed for statistical significance by one way ANOVA (Bonferroni's Multiple Comparison Test) using GraphPad Prism software.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_66",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f5\" position=\"float\"> <caption> <title>SIRTI activation following incubation of Resveratrol with rHos2.</title> <p>Fold activation of the Sirt1 like activity following incubation of recombinant <italic>Hos2</italic> enzyme with different concentration of resveratrol in presence and absence of HDAC inhibitor trichostatin. Assays were carried out in triplicates and analysed for statistical significance by one way ANOVA (Bonferroni's Multiple Comparison Test) using GraphPad Prism software.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure5.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f5",
                "caption": "SIRTI activation following incubation of Resveratrol with rHos2. Fold activation of the Sirt1 like activity following incubation of recombinant Hos2 enzyme with different concentration of resveratrol in presence and absence of HDAC inhibitor trichostatin. Assays were carried out in triplicates and analysed for statistical significance by one way ANOVA (Bonferroni's Multiple Comparison Test) using GraphPad Prism software.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4538/d991a4c1-27b6-48fa-820e-5667f12193e2_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_67",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_68",
            "content": "Pathogenic fungi are increasingly responsible for life threatening infections in the elderly and immunocompromised patients. While some species have intrinsic resistance to anti-fungals, others develop resistance during the course of treatment. Increasing antifungal resistance and treatment failures in patients is becoming a challenge.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_69",
            "content": "The Candida genome encodes at least 3 distinct classes of histone deacetylases in addition to sirtuins. There are 8 different histone deacetylases ( HOS1, HOS2, HOS3, HDA1, HDA2, HDA3, RPD3, RPD31 ) which all have distinct roles in the morphogenesis of C. albicans . HDAC inhibitors, by virtue of their ability to prevent antifungal resistance in vitro, have been proposed as antifungal adjuvants. Hos2 is a histone deacetylase and interacts with several proteins both in the cytoplasmic milieu as well in the nucleus <REF-30> . Hos2 along with Set3 (SET domain-containing protein 3) an associated protein, plays an important role in controlling gene expression by associating with transcriptionally active regions of the chromatin <REF-31> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_70",
            "content": "It has been surmised that inhibiting Hda1 for example might enhance the anti-fungal effect of HDAC inhibitors by limiting hyphal development, while inhibiting Hos2 might contribute to limiting yeast development <REF-32> . Hos2 has an essential function in morphogenesis especially during conditions of nitrogen starvation <REF-33> . The critical role of HDAC`s in C. albicans pathogenesis and survival to antifungal treatment underscores the necessity to study HDAC function in this organism.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_71",
            "content": "The increasing clinical incidences of azole resistant fungal infections in critical care patients, makes a good reason to find additional drug targets to control such diseases. There is at least one small molecule (MGCD 290) that inhibits Hos2 histone deacetylase that has progressed to clinical trials. MGCD 290 in combination with azoles was shown to be active against azole resistant yeasts and moulds <REF-18> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_72",
            "content": "In order to better understand the role played by the Candida Hos2 enzyme we attempted to clone, express and characterize the protein in detail. This study describes the cloning, expression, purification and characterization of the Hos2 deacetylase enzyme from C. albicans .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_73",
            "content": "We cloned and expressed the HOS2 gene in baculoviral expression system as a 6x his-tagged protein, which exhibits classical deacetylase activity with the synthetic Boc-Lys (ac)-AMC peptide substrate. In our study, the yield of the Hos2 protein was generally low and probably could be attributed to difference in codon usage between Candida and Sf9 insect cells. This in vitro enzymatic assay, amenable to high throughput, could be used for screening potent fungal Hos2 inhibitors that could be a potential anti-fungal adjuvant.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_74",
            "content": "Our studies with the recombinant Hos2 protein showed that it is susceptible to inhibition by standard HDAC inhibitors such as SAHA and TSA. We characterized the inhibition profile of purified proteins with SAHA and TSA and showed that TSA is a more potent inhibitor of Hos2 with an IC 50 of 2.8 ± 0.9 nM compared to SAHA (IC 50 65.4 ± 2.4 nM). Our studies with the Class I HDAC inhibitor MS-275 showed that this inhibitor did not inhibit Hos2 deacetylase as effectively as the pan HDAC inhibitors SAHA or TSA, suggesting that Candida Hos2 is more similar to Class II deacetylases.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_75",
            "content": "The recombinant Hos2 failed to deacetylate either mammalian or fungal nuclear histones, suggesting that the histones are not the preferred substrates for the Hos2 enzyme. The fact that, the recombinant Hos2 enzyme did not show any inhibition with the Class I inhibitor MS-275 led us to explore alternate substrates including tubulins, which are substrates for Class II histone deacetylases. Experiments with total lysates from Jurkat cells containing acetylated α-tubulin showed a dose dependent deacetylation albeit at higher concentration of Hos2 (> 5 μg). Hos2 in essence resembles the Class II mammalian HDACs, specifically HDAC6 in its preference for tubulin deacetylation. It has been shown that microtubules in the fungal hyphae drive nuclear dynamics and cell cycle progression to morphogenesis <REF-34> . In view of the fact that Hos2 seems to preferentially deacetylate tubulins, it would be interesting to see if Hos2 inhibitors would act as anti-fungals, either as a monotherapy or in synergy, with existing anti-tubulin agents such as benomyl, nocodazole etc. The physiological relevance of tubulin deacetylation by Hos2 warrants further study.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_76",
            "content": "The Candida genome database <REF-23> predicts Hos2 protein to be a NAD+ dependent deacetylase. Sirtuins which are classified as Class III deacetylases are NAD+ dependent enzymes activated by polyphenols such as resveratrol. Sirtuins have been proposed to regulate cellular metabolism, ageing and other related processes, specifically cellular stress response to caloric restriction, mediating life span extension. The role of resveratrol as a sirtuin activator has been resolved recently and it is now known that in addition to activating Sirt1, it also activates Sirt5, while inhibiting Sirt3 <REF-25> . Thus inhibiting any sirtuin like activity with small molecule inhibitors could be another way of enhancing the activity of currently used anti-fungals. We evaluated the possibility of Hos2 being a sirtuin like enzyme with a known Sirt1 activator resveratrol. We did not observe any significant ( P value 0.5317 and 0.4411, in the presence and absence of trichostatin respectively) activation of NAD+ dependent deacetylase activity with the fluor-de-lys substrate.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_77",
            "content": "In conclusion this study establishes a functional assay for purified Hos2 protein. This in vitro enzymatic assay can be used to screen small molecule inhibitors of Hos2, which can synergise current anti-fungals in the clinic.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_78",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_79",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2014 Karthikeyan G et al.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_80",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_81",
            "content": "figshare: Tubulin deacetylation and rHos2 protein blots, doi: 10.6084/m9.figshare.841666 <REF-35>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_82",
            "content": "figshare: Sirtuin assay of purified Hos2 preparations using resveratrol: UPDATE 1, doi: 10.6084/m9.figshare.1031579 <REF-36>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_83",
            "content": "figshare: Deacetylase activities of rHos2 and dose response curves of rHos2 inhibition by standard HDAC inhibitors: UPDATE 1, doi: 10.6084/m9.figshare.1031581 <REF-37>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_84",
            "content": "<REF-1> Odds FC : Candida and candidosis: a review and bibliography : Bailliere Tindall; 1988 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_85",
            "content": "<REF-2> Pfaller MA Diekema DJ Jones RN : International surveillance of bloodstream infections due to Candida species: frequency of occurrence and In vitro susceptibilities to fluconazole, ravuconazole, and voriconazole of isolates collected from 1997 through 1999 in the SENTRY antimicrobial surveillance program. J Clin Microbiol. 2001 ; 39 ( 9 ): 3254 – 3259 . 11526159 10.1128/JCM.39.9.3254-3259.2001 88327",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_86",
            "content": "<REF-3> Fera MT La Camera E De Sarro A : New triazoles and echinocandins: mode of action, In vitro activity and mechanisms of resistance. Expert Rev Anti Infect Ther. 2009 ; 7 ( 8 ): 981 – 998 . 19803707 10.1586/eri.09.67",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_87",
            "content": "<REF-4> Sanglard D Ischer F Koymans L : Amino acid substitutions in the cytochrome P-450 lanosterol 14alpha-demethylase (CYP51A1) from azole-resistant Candida albicans clinical isolates contribute to resistance to azole antifungal agents. Antimicrob Agents Chemother. 1998 ; 42 ( 2 ): 241 – 253 . 9527767 105395",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_88",
            "content": "<REF-5> White TC : The presence of an R467K amino acid substitution and loss of allelic variation correlate with an azole-resistant lanosterol 14alpha demethylase in Candida albicans. Antimicrob Agents Chemother. 1997 ; 41 ( 7 ): 1488 – 1494 . 9210671 163945",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_89",
            "content": "<REF-6> Song JL Harry JB Eastman RT : The Candida albicans lanosterol 14-alpha-demethylase (ERG11) gene promoter is maximally induced after prolonged growth with antifungal drugs. Antimicrob Agents Chemother. 2004 ; 48 ( 4 ): 1136 – 1144 . 15047513 10.1128/AAC.48.4.1136-1144.2004 375326",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_90",
            "content": "<REF-7> Sanglard D Kuchler K Ischer F : Mechanisms of resistance to azole antifungal agents in Candida albicans isolates from AIDS patients involve specific multidrug transporters. Antimicrob Agents Chemother. 1995 ; 39 ( 11 ): 2378 – 2386 . 8585712 10.1128/AAC.39.11.2378 162951",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_91",
            "content": "<REF-9> Marr KA Lyons CN Rustad TR : Rapid, transient fluconazole resistance in Candida albicans is associated with increased mRNA levels of CDR. Antimicrob Agents Chemother. 1998 ; 42 ( 10 ): 2584 – 2589 . 9756759 105901",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_92",
            "content": "<REF-10> Clayton AL Hazzalin CA Mahadevan LC : Enhanced histone acetylation and transcription: a dynamic perspective. Mol Cell. 2006 ; 23 ( 3 ): 289 – 296 . 16885019 10.1016/j.molcel.2006.06.017",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_93",
            "content": "<REF-11> Marks PA : Discovery and development of SAHA as an anticancer agent. Oncogene. 2007 ; 26 ( 9 ): 1351 – 1356 . 17322921 10.1038/sj.onc.1210204",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_94",
            "content": "<REF-12> Campas-Moya C : Romidepsin for the treatment of cutaneous T-cell lymphoma. Drugs Today (Barc.). 2009 ; 45 ( 11 ): 787 – 795 . 20126671 10.1358/dot.2009.45.11.1437052",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_95",
            "content": "<REF-13> Duvic M Vu J : Update on the treatment of cutaneous T-cell lymphoma (CTCL): Focus on vorinostat. Biologics. 2007 ; 1 ( 4 ): 377 – 392 . 19707308 2721288",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_96",
            "content": "<REF-14> Dokmanovic M Clarke C Marks PA : Histone deacetylase inhibitors: overview and perspectives. Mol Cancer Res. 2007 ; 5 ( 10 ): 981 – 989 . 17951399 10.1158/1541-7786.MCR-07-0324",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_97",
            "content": "<REF-16> Riester D Hildmann C Schwienhorst A : Histone deacetylase inhibitors--turning epigenic mechanisms of gene regulation into tools of therapeutic intervention in malignant and other diseases. Appl Microbiol Biotechnol. 2007 ; 75 ( 3 ): 499 – 514 . 17377788 10.1007/s00253-007-0912-1",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_98",
            "content": "<REF-17> Smith WL Edlind TD : Histone deacetylase inhibitors enhance Candida albicans sensitivity to azoles and related antifungals: correlation with reduction in CDR and ERG upregulation. Antimicrob Agents Chemother. 2002 ; 46 ( 11 ): 3532 – 3539 . 12384361 10.1128/AAC.46.11.3532-3539.2002 128736",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_99",
            "content": "<REF-18> Pfaller MA Messer SA Georgopapadakou N : Activity of MGCD290, a Hos2 histone deacetylase inhibitor, in combination with azole antifungals against opportunistic fungal pathogens. J Clin Microbiol. 2009 ; 47 ( 12 ): 3797 – 3804 . 19794038 10.1128/JCM.00618-09 2786684",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_100",
            "content": "<REF-19> Simonetti G Passariello C Rotili D : Histone deacetylase inhibitors may reduce pathogenicity and virulence in Candida albicans. FEMS Yeast Res. 2007 ; 7 ( 8 ): 1371 – 1380 . 17627775 10.1111/j.1567-1364.2007.00276.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_101",
            "content": "<REF-20> Wang A Kurdistani SK Grunstein M : Requirement of Hos2 histone deacetylase for gene activity in yeast. Science. 2002 ; 298 ( 5597 ): 1412 – 1414 . 12434058 10.1126/science.1077790",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_102",
            "content": "<REF-21> Hnisz D Schwarzmuller T Kuchler K : Transcriptional loops meet chromatin: a dual-layer network controls white-opaque switching in Candida albicans. Mol Microbiol. 2009 ; 74 ( 1 ): 1 – 15 . 19555456 10.1111/j.1365-2958.2009.06772.x 2764112",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_103",
            "content": "<REF-22> Hnisz D Majer O Frohner IE : The Set3/Hos2 histone deacetylase complex attenuates cAMP/PKA signaling to regulate morphogenesis and virulence of Candida albicans. PLoS Pathog. 2010 ; 6 ( 5 ): e1000889 . 20485517 10.1371/journal.ppat.1000889 2869326",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_104",
            "content": "<REF-23> Arnaud MB ID Skrzypek MS Binkley J : Candida Genome Database . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_105",
            "content": "<REF-24> Wurtele H Tsao S Lepine G : Modulation of histone H3 lysine 56 acetylation as an antifungal therapeutic strategy. Nat Med. 2010 ; 16 ( 7 ): 774 – 780 . 20601951 10.1038/nm.2175",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_106",
            "content": "<REF-25> Gertz M Nguyen GT Fischer F : A molecular mechanism for direct sirtuin activation by resveratrol. PLoS One. 2012 ; 7 ( 11 ): e49761 . 23185430 10.1371/journal.pone.0049761 3504108",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_107",
            "content": "<REF-26> Fuller SA Takahashi M Hurrell JG : Immunization of Mice. Curr Protoc Mol Biol. John Wiley & Sons, Inc.; 2001 . 18265076 10.1002/0471142727.mb1104s18",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_108",
            "content": "<REF-27> Shechter D Dormann HL Allis CD : Extraction, purification and analysis of histones. Nat Protoc. 2007 ; 2 ( 6 ): 1445 – 1457 . 17545981 10.1038/nprot.2007.202",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_109",
            "content": "<REF-28> Yeast Nuclei Isolation . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_110",
            "content": "<REF-29> Knapp AR Ren C Su X : Quantitative profiling of histone post-translational modifications by stable isotope labeling. Methods. 2007 ; 41 ( 3 ): 312 – 319 . 17309842 10.1016/j.ymeth.2006.08.017 2572810",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_111",
            "content": "<REF-30> Wiren M Silverstein RA Sinha I : Genomewide analysis of nucleosome density histone acetylation and HDAC function in fission yeast. EMBO J. 2005 ; 24 ( 16 ): 2906 – 2918 . 16079916 10.1038/sj.emboj.7600758 1187943",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_112",
            "content": "<REF-31> Hnisz D Bardet AF Nobile CJ : A histone deacetylase adjusts transcription kinetics at coding sequences during Candida albicans morphogenesis. PLoS Genet. 2012 ; 8 ( 12 ): e1003118 . 23236295 10.1371/journal.pgen.1003118 3516536",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_113",
            "content": "<REF-32> Zacchi LF Schulz WL Davis DA : HOS2 and HDA1 encode histone deacetylases with opposing roles in Candida albicans morphogenesis. PLoS One. 2010 ; 5 ( 8 ): e12171 . 20730094 10.1371/journal.pone.0012171 2921335",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_114",
            "content": "<REF-33> Robyr D Suka Y Xenarios I : Microarray deacetylation maps determine genome-wide functions for yeast histone deacetylases. Cell. 2002 ; 109 ( 4 ): 437 – 446 . 12086601 10.1016/S0092-8674(02)00746-8",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_115",
            "content": "<REF-34> Finley KR Berman J : Microtubules in Candida albicans Hyphae Drive Nuclear Dynamics and Connect Cell Cycle Progression to Morphogenesis. Eukaryot Cell. 2005 ; 4 ( 10 ): 1697 – 1711 . 16215177 10.1128/EC.4.10.1697-1711.2005 1265902",
            "ntype": "ref",
            "meta": {
                "id": "ref-34",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_116",
            "content": "<REF-35> Karthikeyan G Maneesh PS Nachiappan DM : Tubulin deacetylation and rHos2 protein blots. figshare. 2014 . Data Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-35",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_117",
            "content": "<REF-36> Karthikeyan G Maneesh PS Nachiappan DM : Deacetylase activities of rHos2 and dose response curves of rHos2 inhibition by standard HDAC inhibitors. figshare. 2014 . Data Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-36",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-238_v2_118",
            "content": "<REF-37> Karthikeyan G Maneesh PS Nachiappan DM : Sirtuin assay of purified Hos2 preparations using resveratrol. figshare. 2014 . Data Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-37",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "2-238_v2_0@0",
            "content": "Functional characterization of Candida albicans Hos2 histone deacetylase",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_0",
            "start": 0,
            "end": 71,
            "label": {}
        },
        {
            "ix": "2-238_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-238_v2_2@0",
            "content": "Candida albicans is a mucosal commensal organism capable of causing superficial (oral and vaginal thrush) infections in immune normal hosts, but is a major pathogen causing systemic and mucosal infections in immunocompromised individuals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_2",
            "start": 0,
            "end": 237,
            "label": {}
        },
        {
            "ix": "2-238_v2_2@1",
            "content": "Azoles have been very effective anti-fungal agents and the mainstay in treating opportunistic mold and yeast infections.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_2",
            "start": 239,
            "end": 358,
            "label": {}
        },
        {
            "ix": "2-238_v2_2@2",
            "content": "Azole resistant strains have emerged compromising the utility of this class of drugs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_2",
            "start": 360,
            "end": 444,
            "label": {}
        },
        {
            "ix": "2-238_v2_2@3",
            "content": "It has been shown that azole resistance can be reversed by the co-administration of a histone deacetylase (HDAC) inhibitor, suggesting that resistance is mediated by epigenetic mechanisms possibly involving Hos2, a fungal deacetylase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_2",
            "start": 446,
            "end": 679,
            "label": {}
        },
        {
            "ix": "2-238_v2_2@4",
            "content": "We report here the cloning and functional characterization of HOS2 (H igh O smolarity S ensitive) , a gene coding for fungal histone deacetylase from C. albicans .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_2",
            "start": 681,
            "end": 843,
            "label": {}
        },
        {
            "ix": "2-238_v2_2@5",
            "content": "Inhibition studies showed that Hos2 is susceptible to pan inhibitors such as trichostatin A (TSA) and suberoylanilide hydroxamic acid (SAHA), but is not inhibited by class I inhibitors such as MS-275.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_2",
            "start": 845,
            "end": 1044,
            "label": {}
        },
        {
            "ix": "2-238_v2_2@6",
            "content": "This in vitro enzymatic assay, which is amenable to high throughput could be used for screening potent fungal Hos2 inhibitors that could be a potential anti-fungal adjuvant.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_2",
            "start": 1046,
            "end": 1218,
            "label": {}
        },
        {
            "ix": "2-238_v2_2@7",
            "content": "Purified Hos2 protein consistently deacetylated tubulins, rather than histones from TSA-treated cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_2",
            "start": 1220,
            "end": 1321,
            "label": {}
        },
        {
            "ix": "2-238_v2_2@8",
            "content": "Hos2 has been reported to be a putative NAD+ dependent histone deacetylase, a feature of sirtuins.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_2",
            "start": 1323,
            "end": 1420,
            "label": {}
        },
        {
            "ix": "2-238_v2_2@9",
            "content": "We assayed for sirtuin activation with resveratrol and purified Hos2 protein and did not find any sirtuin activity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_2",
            "start": 1422,
            "end": 1536,
            "label": {}
        },
        {
            "ix": "2-238_v2_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-238_v2_4@0",
            "content": "Candida albicans is a commensal organism found in the mucosa and gastrointestinal tract of most healthy individuals but can cause superficial (oral and vaginal thrush) infections in immune-normal hosts and severe systemic infection in immunocompromised patients <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_4",
            "start": 0,
            "end": 270,
            "label": {}
        },
        {
            "ix": "2-238_v2_4@1",
            "content": "This fungus is of clinical importance and is one of the leading causes of systemic infections in immunocompromised individuals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_4",
            "start": 272,
            "end": 398,
            "label": {}
        },
        {
            "ix": "2-238_v2_4@2",
            "content": "C. albicans is the fourth most common cause of nosocomial bloodstream infections and is associated with high mortality rates <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_4",
            "start": 400,
            "end": 533,
            "label": {}
        },
        {
            "ix": "2-238_v2_4@3",
            "content": "Azoles and echinocandins targeting the ergosterol and cell wall biosynthesis pathway respectively have been used as anti-fungal drugs though the emergence of drug-resistant strains has compromised the efficacy and utility of these drugs <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_4",
            "start": 535,
            "end": 780,
            "label": {}
        },
        {
            "ix": "2-238_v2_5@0",
            "content": "Azole resistance in Candida sp. is mediated by up regulation of genes encoding ERG11 , a lanosterol demethylase <REF-4> – <REF-6> , MDR1 <REF-5> , <REF-7> and by CDR (Candida drug resistance) efflux pumps <REF-5> , <REF-7> – <REF-9> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_5",
            "start": 0,
            "end": 233,
            "label": {}
        },
        {
            "ix": "2-238_v2_5@1",
            "content": "A combination of existing anti-fungals with new classes of drugs that act by different mechanisms will be viable alternatives to the current monotherapy regimen, which contributes to the emergence of drug resistance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_5",
            "start": 235,
            "end": 450,
            "label": {}
        },
        {
            "ix": "2-238_v2_6@0",
            "content": "Histone deacetylases (HDAC) play an important role in modulating chromatin conformation, by deacetylating crucial lysine residues in the histone octamers over which the chromatin DNA are wrapped <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_6",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "2-238_v2_6@1",
            "content": "Human HDAC`s fall into four broad categories, Class I (HDAC1, 2, 3, and 8), Class II a (HDAC 4, 5, 7 and 9) Class II b (HDAC 6 and 10) Class III (sirtuins) and Class IV (HDAC11) based on sequence homology, substrate preference and co-factor requirements.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_6",
            "start": 206,
            "end": 459,
            "label": {}
        },
        {
            "ix": "2-238_v2_6@2",
            "content": "The involvement of each of these isoforms in disease pathology has been elucidated to some extent in recent times.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_6",
            "start": 461,
            "end": 574,
            "label": {}
        },
        {
            "ix": "2-238_v2_6@3",
            "content": "The approval of suberoylanilide hydroxamic acid (SAHA) <REF-11> , a well known inhibitor of HDACs by the US FDA for treating CTCL, (cutaneous T cell lymphoma) <REF-12> , <REF-13> has thrown open the doors for exploring the use of HDAC inhibitors in combination with existing drugs for several diseases, such as malaria and Kala-azar etc., <REF-14> – <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_6",
            "start": 576,
            "end": 935,
            "label": {}
        },
        {
            "ix": "2-238_v2_7@0",
            "content": "Class specific inhibitors are now becoming a reality for human HDAC isoforms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_7",
            "start": 0,
            "end": 76,
            "label": {}
        },
        {
            "ix": "2-238_v2_7@1",
            "content": "For example the HDAC Class I specific inhibitor MS-275 is in advanced clinical trials (clinical trial Nos. NCT00020579, NCT00866333) for several forms of cancer, and the HDAC Class II specific inhibitor ACY-1215 is at an advanced clinical phase (clinical trial Nos. NCT01323751 , NCT01583283 ) for myeloma.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_7",
            "start": 78,
            "end": 383,
            "label": {}
        },
        {
            "ix": "2-238_v2_8@0",
            "content": "HDAC inhibitors have been shown to synergize the actions of antifungal agents, due to their effect on preventing drug resistance in vitro <REF-17> , <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_8",
            "start": 0,
            "end": 158,
            "label": {}
        },
        {
            "ix": "2-238_v2_8@1",
            "content": "Therefore, an alternative approach to address fungal drug resistance could be to harness the potential of modulating fungal gene expression by inhibition of fungal HDACs <REF-17> , <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_8",
            "start": 160,
            "end": 350,
            "label": {}
        },
        {
            "ix": "2-238_v2_9@0",
            "content": "Hos2, a Class I HDAC enzyme plays an important role in gene activation in the yeast Saccharomyces cerevisiae by binding to open reading frames (ORFs) of active genes <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_9",
            "start": 0,
            "end": 175,
            "label": {}
        },
        {
            "ix": "2-238_v2_9@1",
            "content": "Hos2/Set3 histone deacetylase complex (Set3C) plays a key role in the conversion of white phase to virulent opaque phase in C. albicans <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_9",
            "start": 177,
            "end": 322,
            "label": {}
        },
        {
            "ix": "2-238_v2_9@2",
            "content": "Deletion of Hos2, the catalytic subunit of the Set3 complex produced a phenotype resembling inhibition of the Set3C by Trichostatin-A (TSA) <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_9",
            "start": 324,
            "end": 473,
            "label": {}
        },
        {
            "ix": "2-238_v2_9@3",
            "content": "Serum-induced morphogenesis of some C. albicans strains was shown to be inhibited by TSA <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_9",
            "start": 475,
            "end": 573,
            "label": {}
        },
        {
            "ix": "2-238_v2_9@4",
            "content": "Thus inhibiting the morphogenetic ability of this opportunistic pathogen using HDAC inhibitors holds the promise of future antifungal agents.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_9",
            "start": 575,
            "end": 715,
            "label": {}
        },
        {
            "ix": "2-238_v2_9@5",
            "content": "Recently a small molecule, MGCD 290 (Hos2 inhibitor) has entered clinical trials (clinical trial number NCT01497223 )) for use in combination with azoles, such as fluconazole, for fungal infections <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_9",
            "start": 717,
            "end": 924,
            "label": {}
        },
        {
            "ix": "2-238_v2_10@0",
            "content": "In light of the emerging utility of Hos2 inhibition as an anti-fungal strategy, we have cloned and characterized the C. albicans HOS2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_10",
            "start": 0,
            "end": 134,
            "label": {}
        },
        {
            "ix": "2-238_v2_10@1",
            "content": "In this report, we present details on optimizing the codons and cloning for heterologous gene expression in Sf9 insect cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_10",
            "start": 136,
            "end": 260,
            "label": {}
        },
        {
            "ix": "2-238_v2_10@2",
            "content": "Purified Hos2 was characterized by functional deacetylase activities on histone/tubulin preparations and inhibition studies with SAHA, TSA and MS-275.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_10",
            "start": 262,
            "end": 411,
            "label": {}
        },
        {
            "ix": "2-238_v2_10@3",
            "content": "The Candida genome database reports Hos2 to be a putative NAD+ dependent histone deacetylase <REF-23> , reminiscent of sirtuins.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_10",
            "start": 413,
            "end": 540,
            "label": {}
        },
        {
            "ix": "2-238_v2_10@4",
            "content": "The Candida genome encodes for 3 sirtuins (HST1, HST2 and HST3).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_10",
            "start": 542,
            "end": 605,
            "label": {}
        },
        {
            "ix": "2-238_v2_10@5",
            "content": "It has been shown that inhibition of HST3 by either gene repression or nicotinamide treatment reduces to a considerable extent the clinical severity of candidiasis <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_10",
            "start": 607,
            "end": 780,
            "label": {}
        },
        {
            "ix": "2-238_v2_10@6",
            "content": "In light of this reported observation, we checked for sirtuin like activity of purified Hos2 preparations using resveratrol, which activates sirtuins <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_10",
            "start": 782,
            "end": 941,
            "label": {}
        },
        {
            "ix": "2-238_v2_11@0",
            "content": "Materials and methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_11",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "2-238_v2_12@0",
            "content": "Isolation of C. albicans genomic DNA",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_12",
            "start": 0,
            "end": 35,
            "label": {}
        },
        {
            "ix": "2-238_v2_13@0",
            "content": "C. albicans ATCC 90028 was obtained from ATCC and grown in Sabouraud dextrose media.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_13",
            "start": 0,
            "end": 83,
            "label": {}
        },
        {
            "ix": "2-238_v2_13@1",
            "content": "The protoplasts were prepared from an overnight culture of fully-grown mycelia using zymolyase (Cat. No. L5263, Sigma, St. Louis, MO, USA) as per the manufacturer’s instructions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_13",
            "start": 85,
            "end": 262,
            "label": {}
        },
        {
            "ix": "2-238_v2_13@2",
            "content": "Protoplasts were lysed in a chaotrophic salt solution and genomic DNA was isolated according to manufacturer’s instruction (Qiagen, Hilden, Germany).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_13",
            "start": 264,
            "end": 412,
            "label": {}
        },
        {
            "ix": "2-238_v2_13@3",
            "content": "The final eluate was reprecipitated with ammonium acetate and isopropanol and DNA quantified by UV spectrophotometer (Spectramax Gemini XS, Molecular devices, CA. USA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_13",
            "start": 414,
            "end": 581,
            "label": {}
        },
        {
            "ix": "2-238_v2_14@0",
            "content": "Cloning and expression of HOS2 in an insect cell expression system",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_14",
            "start": 0,
            "end": 65,
            "label": {}
        },
        {
            "ix": "2-238_v2_15@0",
            "content": "Oligos were designed with codon changes made for 4 th and 271 st serine residues.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_15",
            "start": 0,
            "end": 80,
            "label": {}
        },
        {
            "ix": "2-238_v2_15@1",
            "content": "Full length HOS2 gene was amplified by using 4 different primers ( Table 1 ) using splicing by overlap extension (SOE PCR), so that codon usage could be maintained in any heterologous expression system.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_15",
            "start": 82,
            "end": 283,
            "label": {}
        },
        {
            "ix": "2-238_v2_15@2",
            "content": "The full-length blunt end PCR product was cloned in to pJET1.2 cloning vector (CloneJET PCR Cloning Kit Thermo Scientific) and confirmed by restriction digestion using BamH1 and Not1 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_15",
            "start": 285,
            "end": 468,
            "label": {}
        },
        {
            "ix": "2-238_v2_15@3",
            "content": "DNA sequencing using T7 promoter (forward, 5´-TAATAC GACTCACTATAGGG-3´) and pJET1.2 (reverse, 5´-AAGAACATCGATTTTCCATGGCAG-´3) sequencing primer ascertained the sequence of the recombinant Hos2 gene.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_15",
            "start": 470,
            "end": 667,
            "label": {}
        },
        {
            "ix": "2-238_v2_16@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_16",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-238_v2_18@0",
            "content": "Recombinant baculoviruses were generated using the Bac-to-Bac ® baculovirus expression system according to the instructions of the manufacturer (Cat. No. 10359-016, Invitrogen, Carlsbad, USA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_18",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "2-238_v2_18@1",
            "content": "Sf9 insect cells (Cat. No. B825-01, Invitrogen, Carlsbad, USA) were cultured in complete TMN-FH medium (Cat. No. 554760, BD Bioscience, NJ, USA) served as host cells for virus generation and/or protein production.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_18",
            "start": 193,
            "end": 405,
            "label": {}
        },
        {
            "ix": "2-238_v2_18@2",
            "content": "The HOS2 gene was cloned in frame with N-terminal hexa-histidine tag into the transfer vector pFastBac-HT B (Cat. No. 10584-027, Invitrogen, Carlsbad, USA) and transformed in to Escherichia coli DH10Bac cells (Cat. No. 10361-012, Invitrogen, Carlsbad, USA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_18",
            "start": 407,
            "end": 663,
            "label": {}
        },
        {
            "ix": "2-238_v2_18@3",
            "content": "Sf9 cells were transfected using cellfectin reagent (Cat. No. 10362-100, Invitrogen, Carlsbad, USA) with the recombinant bacmid, and the resulting viruses were tested for their ability to produce recombinant Hos2 protein using western blot.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_18",
            "start": 665,
            "end": 904,
            "label": {}
        },
        {
            "ix": "2-238_v2_18@4",
            "content": "Production cultures were performed T-150 cell culture flasks (Greiner bio-one GmbH, Germany) at a density of 16×10 6 cells per flask.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_18",
            "start": 906,
            "end": 1038,
            "label": {}
        },
        {
            "ix": "2-238_v2_18@5",
            "content": "The cultures were inoculated with recombinant baculovirus stocks at multiplicities of infection of 10.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_18",
            "start": 1040,
            "end": 1141,
            "label": {}
        },
        {
            "ix": "2-238_v2_18@6",
            "content": "At 4 days after infection, cells were harvested by centrifugation at 1200 g for 15 min at 4°C in a tabletop centrifuge (Model 5804R, Eppendorf AG, Hamburg, Germany).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_18",
            "start": 1143,
            "end": 1307,
            "label": {}
        },
        {
            "ix": "2-238_v2_18@7",
            "content": "Cell pellets were stored at -80°C until protein purification.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_18",
            "start": 1309,
            "end": 1369,
            "label": {}
        },
        {
            "ix": "2-238_v2_19@0",
            "content": "Purification of recombinant Hos2 protein",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_19",
            "start": 0,
            "end": 39,
            "label": {}
        },
        {
            "ix": "2-238_v2_20@0",
            "content": "The infected Sf9 cell pellets were resuspended in in-house ice-cold lysis buffer [10 mM Tris pH 7.5, 130 mM NaCl, 1% triton X-100, 10 mM NaF, 10 mM NaPi (sodium phosphate), and 10 mM NaPPi (sodium pyrophosphate)] with 1 X EDTA free protease inhibitor cocktail (Cat. No. 539134, Calbiochem, Merck-Millipore, San Diego, CA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_20",
            "start": 0,
            "end": 321,
            "label": {}
        },
        {
            "ix": "2-238_v2_20@1",
            "content": "Insoluble material was removed by centrifugation (Model 5804R, Eppendorf AG, Hamburg, Germany) at 16000 g, 4°C for 15 min.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_20",
            "start": 323,
            "end": 444,
            "label": {}
        },
        {
            "ix": "2-238_v2_20@2",
            "content": "The cleared lysate was processed for nickel affinity chromatography.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_20",
            "start": 446,
            "end": 513,
            "label": {}
        },
        {
            "ix": "2-238_v2_20@3",
            "content": "Briefly, the cell supernatant was loaded onto a 3-ml nickel-nitrilotriacetic acid-agarose resin (Ni-NTA agarose, Cat. No. 30210, Qiagen, Hilden, Germany) packed column pre-equilibrated with equilibration buffer (25 mM Tris-Cl pH 8.0, 300 mM NaCl).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_20",
            "start": 515,
            "end": 761,
            "label": {}
        },
        {
            "ix": "2-238_v2_20@4",
            "content": "The column was washed with wash buffer (25 mM Tris-Cl pH 8.0, 300 mM NaCl, 20 mM imidazole).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_20",
            "start": 763,
            "end": 854,
            "label": {}
        },
        {
            "ix": "2-238_v2_20@5",
            "content": "His-tagged Hos2 protein was eluted with buffer containing 300 mM imidazole (Sigma, St. Louis, MO, USA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_20",
            "start": 856,
            "end": 958,
            "label": {}
        },
        {
            "ix": "2-238_v2_20@6",
            "content": "The Hos2 protein preparation was dialyzed into buffer (25 mM Tris, pH 8.0, 138 mM NaCl, 10% glycerol) and kept in 100 μl aliquots at -70°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_20",
            "start": 960,
            "end": 1098,
            "label": {}
        },
        {
            "ix": "2-238_v2_20@7",
            "content": "The concentration of Hos2 protein in the final eluate was estimated by Bradford assay (Bio-Rad Laboratories, CA, USA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_20",
            "start": 1100,
            "end": 1217,
            "label": {}
        },
        {
            "ix": "2-238_v2_21@0",
            "content": "Hos2 deacetylase enzymatic assay",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_21",
            "start": 0,
            "end": 31,
            "label": {}
        },
        {
            "ix": "2-238_v2_22@0",
            "content": "HDAC inhibitors, namely SAHA, TSA or MS-275 were dissolved in DMSO as 10 mM stock and subsequently diluted in 1X assay buffer (50 mM Tris Cl, pH 8.0, 137 mM NaCl, 2.7 mM KCl, 2.5 mM MgCl 2 , 1 mg/ml BSA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_22",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "2-238_v2_22@1",
            "content": "Enzymatic assay was carried out in triplicates using the fluorogenic Class I HDAC substrate, Boc-Lys (Ac)-AMC (Cat. No. I1875, Bachem AG, Bubendorf, Switzerland).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_22",
            "start": 205,
            "end": 366,
            "label": {}
        },
        {
            "ix": "2-238_v2_22@2",
            "content": "Briefly, 0.5 μg of purified recombinant protein in a volume of 10 μl of assay buffer was incubated with 50 μl of appropriate concentration of HDAC inhibitors and 20 μM of substrate at 37°C for 1 hr in 100 μl reaction volume.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_22",
            "start": 368,
            "end": 591,
            "label": {}
        },
        {
            "ix": "2-238_v2_22@3",
            "content": "Reactions were terminated by the addition of trichostatin A (TSA)/suberoylanilide hydroxamic acid (SAHA), trypsin (1 mg/mL) (Sigma, St. Louis, MO, USA) and left at 37°C for 15 min, before reading the plates in a fluorimeter (Spectramax Gemini XS, Molecular devices, CA. USA) at wavelengths 360 nm (ext) and 460 nm (emi).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_22",
            "start": 593,
            "end": 912,
            "label": {}
        },
        {
            "ix": "2-238_v2_23@0",
            "content": "Production of polyclonal anti sera against Hos2 protein",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_23",
            "start": 0,
            "end": 54,
            "label": {}
        },
        {
            "ix": "2-238_v2_24@0",
            "content": "Female BALB/c mice were purchased from The Jackson Laboratory (Bar Harbor, ME) at 4 weeks of age and then housed at the animal facility, Orchid Chemicals and Pharmaceuticals for 2 weeks in a specific-pathogen free facility with a 12 h light cycle (6 am–6 pm) and a 12 h dark cycle (6 pm–6 am).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_24",
            "start": 0,
            "end": 292,
            "label": {}
        },
        {
            "ix": "2-238_v2_24@1",
            "content": "Groups of four mice were housed in sterilised polypropylene cages covered with stainless steel grid top, lined with autoclaved clean rice husk bedding.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_24",
            "start": 294,
            "end": 444,
            "label": {}
        },
        {
            "ix": "2-238_v2_24@2",
            "content": "All animal experimentations were approved by the institutional animal ethics committee (Protocol No. 01/IAEC-05/PPK/2009).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_24",
            "start": 446,
            "end": 567,
            "label": {}
        },
        {
            "ix": "2-238_v2_24@3",
            "content": "The native Hos2 protein (expressed in pET-32 bacterial vector system and purified using nickel affinity chromatography under denaturating conditions) was emulsified in complete Freund’s adjuvant and injected subcutaneously into two female BALB/c mice (20 μg/mice).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_24",
            "start": 569,
            "end": 832,
            "label": {}
        },
        {
            "ix": "2-238_v2_24@4",
            "content": "Booster doses of the deacetylase antigen (20 μg/mice) were given on the 14 th and 21 st day in Freund’s incomplete adjuvant.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_24",
            "start": 834,
            "end": 957,
            "label": {}
        },
        {
            "ix": "2-238_v2_24@5",
            "content": "Mice were bled 7 days after the second booster dose and polyclonal anti sera was separated after clotting the blood <REF-26> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_24",
            "start": 959,
            "end": 1084,
            "label": {}
        },
        {
            "ix": "2-238_v2_25@0",
            "content": "Cell culture",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_25",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-238_v2_26@0",
            "content": "Jurkat, a human T lymphocyte cell line, and HeLa, a human cervical adenocarcinoma cell line was obtained from ATCC and were cultured in DMEM (Gibco, Life technologies) supplemented with 10% (v/v) fetal calf serum (FCS), 2 mM glutamine, 100 units/ml penicillin and 100 µg/ml streptomycin (Gibco, Life technologies).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_26",
            "start": 0,
            "end": 313,
            "label": {}
        },
        {
            "ix": "2-238_v2_27@0",
            "content": "Isolation of nuclear histones from mammalian cells",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_27",
            "start": 0,
            "end": 49,
            "label": {}
        },
        {
            "ix": "2-238_v2_28@0",
            "content": "Acetylated histones were isolated from HeLa cells treated with the HDAC inhibitor SAHA as per published protocol <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_28",
            "start": 0,
            "end": 122,
            "label": {}
        },
        {
            "ix": "2-238_v2_28@1",
            "content": "The histone pellet was then resuspended in ultra pure water, stored in 50 μl aliquots at -70°C and the protein concentration was determined using a BCA kit (Pierce).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_28",
            "start": 124,
            "end": 288,
            "label": {}
        },
        {
            "ix": "2-238_v2_29@0",
            "content": "Isolation of histones from Candida sp .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_29",
            "start": 0,
            "end": 38,
            "label": {}
        },
        {
            "ix": "2-238_v2_30@0",
            "content": "C. albicans ATCC 90028 mycelia (~5 gm wet weight) were washed with water, centrifuged at 10,000 rpm for 10 minutes at 4°C and the mycelial pellet was resuspended in 50 ml of 0.1 mM Tris-HCl, pH 9.4, 10 mM DTT.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_30",
            "start": 0,
            "end": 208,
            "label": {}
        },
        {
            "ix": "2-238_v2_30@1",
            "content": "The sample was incubated with shaking at 30°C for 15 min and pelleted.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_30",
            "start": 210,
            "end": 279,
            "label": {}
        },
        {
            "ix": "2-238_v2_30@2",
            "content": "The pellet was washed with 50 ml of sorbitol/HEPES buffer (1.2 M sorbitol, 20 mM Hepes, pH 7.4) and left resuspended in the same buffer containing lyticase (1000 units) overnight at 30°C for spheroplasting <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_30",
            "start": 281,
            "end": 496,
            "label": {}
        },
        {
            "ix": "2-238_v2_30@3",
            "content": "The sample was pelleted and proceeded to histone isolation using acid extraction as described previously <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_30",
            "start": 498,
            "end": 612,
            "label": {}
        },
        {
            "ix": "2-238_v2_30@4",
            "content": "Acetone was added at 3:1 (vol/vol) to precipitate the histones, which were subsequently dissolved in 10 mM Tris, pH-8.0.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_30",
            "start": 614,
            "end": 733,
            "label": {}
        },
        {
            "ix": "2-238_v2_31@0",
            "content": "Deacetylation of nuclear histones",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_31",
            "start": 0,
            "end": 32,
            "label": {}
        },
        {
            "ix": "2-238_v2_32@0",
            "content": "Acetylated histones isolated from SAHA treated HeLa cells were used for the deacetylation assay with recombinant Hos2 enzyme.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_32",
            "start": 0,
            "end": 124,
            "label": {}
        },
        {
            "ix": "2-238_v2_32@1",
            "content": "In brief, purified acetylated histones (2 μg) were incubated with different amounts of recombinant Hos2 enzyme.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_32",
            "start": 126,
            "end": 236,
            "label": {}
        },
        {
            "ix": "2-238_v2_32@2",
            "content": "Histone deacetylation with 300 ng of rhHDAC1 or rhHDAC6 (expressed in-house using Baculo-viral expression system) was used as a positive control.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_32",
            "start": 238,
            "end": 382,
            "label": {}
        },
        {
            "ix": "2-238_v2_32@3",
            "content": "Deacetylation assays were carried out in 100 μl reaction volume for 1 hr at 37°C in reaction buffer (50 mM Tris Cl, pH 8.0, 137 mM NaCl, 2.7 mM KCl, 2.5 mM MgCl 2 , 1 mg/ml BSA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_32",
            "start": 384,
            "end": 561,
            "label": {}
        },
        {
            "ix": "2-238_v2_32@4",
            "content": "At the end of incubation, the reaction was stopped by the addition of 1X Lammeli sample buffer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_32",
            "start": 563,
            "end": 657,
            "label": {}
        },
        {
            "ix": "2-238_v2_32@5",
            "content": "The protein samples were resolved by SDS-PAGE and immunoblotted with anti-acetylated H3 Histone (Ac-K-9) antibody to study the deacetylation of H3-histone by rHos2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_32",
            "start": 659,
            "end": 822,
            "label": {}
        },
        {
            "ix": "2-238_v2_32@6",
            "content": "The assay results are reproducible in three independent experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_32",
            "start": 824,
            "end": 891,
            "label": {}
        },
        {
            "ix": "2-238_v2_33@0",
            "content": "Deacetylation of acetylated tubulin",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_33",
            "start": 0,
            "end": 34,
            "label": {}
        },
        {
            "ix": "2-238_v2_34@0",
            "content": "Whole cell extracts from TSA (Sigma, St. Louis, MO, USA) treated Jurkat cells were used for the α-tubulin deacetylation assay with recombinant Hos2 enzyme.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_34",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "2-238_v2_34@1",
            "content": "In brief, whole cell extract (10 μg) were incubated with 5 and 8 μg of recombinant Hos2 protein.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_34",
            "start": 156,
            "end": 251,
            "label": {}
        },
        {
            "ix": "2-238_v2_34@2",
            "content": "Deacetylation assays were carried out in 100 μl reaction volume for 3 hr at 37°C in reaction buffer (50 mM Tris-Cl, pH 8.0, 137 mM NaCl, 2.7 mM KCl, 2.5 mM MgCl 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_34",
            "start": 253,
            "end": 417,
            "label": {}
        },
        {
            "ix": "2-238_v2_34@3",
            "content": "At the end of incubation, the reaction was stopped by the addition of 1X Lammeli sample buffer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_34",
            "start": 419,
            "end": 513,
            "label": {}
        },
        {
            "ix": "2-238_v2_34@4",
            "content": "The protein samples were resolved by SDS-PAGE and immunoblotted with either anti-acetylated α-tubulin or anti-α-tubulin antibodies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_34",
            "start": 515,
            "end": 645,
            "label": {}
        },
        {
            "ix": "2-238_v2_34@5",
            "content": "The assay results are reproducible in two independent experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_34",
            "start": 647,
            "end": 712,
            "label": {}
        },
        {
            "ix": "2-238_v2_35@0",
            "content": "Western blotting",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_35",
            "start": 0,
            "end": 15,
            "label": {}
        },
        {
            "ix": "2-238_v2_36@0",
            "content": "Recombinant Hos2 protein or the acetylated/deacetylated nuclear histones from deacetylation assays were separated on 10–15% SDS-polyacrylamide gels.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_36",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "2-238_v2_36@1",
            "content": "The gels were stained with coomassie blue (Phast gel, Aersham) or electro-blotted onto nitrocellulose membrane (HyBond-C, Amersham), which was blocked with 5% nonfat dry milk (Cat No. 70166, Fluka, Sigma-Aldrich) in 0.1% Tween- 20 in TBS for 1 hr, followed by overnight incubation at 4°C with either the polyclonal mouse serum (dilution 1:4000 of the sera), rabbit polyclonal anti-acetylated H3-Histone (dilution 1:4000, Ac-K-9 of H3-Histone, Cat. No. 06-599; Millipore), mouse monoclonal anti-acetylated tubulin (dilution 1:15000, Cat. No. T7451, Sigma) or mouse monoclonal anti-tubulin antibody (dilution 1:150000, Cat. No. T6199, Sigma).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_36",
            "start": 149,
            "end": 788,
            "label": {}
        },
        {
            "ix": "2-238_v2_36@2",
            "content": "After incubation with the appropriate horseradish peroxidase conjugated secondary antibodies (Bovine anti-mouse IgG HRP conjugate-dilution 1:7500, Santa Cruz, SC-2371, Goat anti-rabbit IgG-HRP Upstate (Millipore) 12–348, dilution 1:4000), supersignal west pico substrate (Thermo Scientific Pierce) was used for detection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_36",
            "start": 790,
            "end": 1110,
            "label": {}
        },
        {
            "ix": "2-238_v2_37@0",
            "content": "In vitro Sirt1 activation assay",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_37",
            "start": 0,
            "end": 30,
            "label": {}
        },
        {
            "ix": "2-238_v2_38@0",
            "content": "HeLa nuclear extract (2 μg) or recombinant Hos2 enzyme (300 ng) was incubated with NAD+ (500 μM), Fluor de Lys ® −Sirt1 (Enzo lifescience), varying concentrations of resveratrol (Cat. No. 0219605205, MP Biomedicals, Ohio, USA) (30, 100, 250 and 500 μM) in presence or absence of the pan-HDAC inhibitor trichostatin, in 50 μl reaction volume at 37°C for 30 min.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_38",
            "start": 0,
            "end": 359,
            "label": {}
        },
        {
            "ix": "2-238_v2_38@1",
            "content": "The reaction was carried out in triplicate following manufacturer’s protocol (Enzo lifescience).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_38",
            "start": 361,
            "end": 456,
            "label": {}
        },
        {
            "ix": "2-238_v2_39@0",
            "content": "Statistical analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_39",
            "start": 0,
            "end": 19,
            "label": {}
        },
        {
            "ix": "2-238_v2_40@0",
            "content": "All values are expressed as mean ± standard deviation and the graphs were generated using Graph-Pad Prism ® (Version 4) for Windows (GraphPad Software, San Diego, California, USA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_40",
            "start": 0,
            "end": 178,
            "label": {}
        },
        {
            "ix": "2-238_v2_40@1",
            "content": "Statistical analysis was performed by one-way analysis of variance (ANOVA), followed by Bonferroni multiple comparison test for all parameters.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_40",
            "start": 180,
            "end": 322,
            "label": {}
        },
        {
            "ix": "2-238_v2_40@2",
            "content": "Results were considered statistically significant at P < 0.05.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_40",
            "start": 324,
            "end": 385,
            "label": {}
        },
        {
            "ix": "2-238_v2_41@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_41",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-238_v2_42@0",
            "content": "HOS2 gene PCR",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_42",
            "start": 0,
            "end": 12,
            "label": {}
        },
        {
            "ix": "2-238_v2_43@0",
            "content": "Codon usage in C. albicans is different from standard genetic code.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_43",
            "start": 0,
            "end": 66,
            "label": {}
        },
        {
            "ix": "2-238_v2_43@1",
            "content": "The 4 th serine and the 271 st serine of HOS2 are translated as leucine in both mammalian and in insect cell expression systems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_43",
            "start": 68,
            "end": 195,
            "label": {}
        },
        {
            "ix": "2-238_v2_43@2",
            "content": "Hence, these codons were mutated using oligonucleotide primers to express serine in the recombinant Hos2 protein.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_43",
            "start": 197,
            "end": 309,
            "label": {}
        },
        {
            "ix": "2-238_v2_43@3",
            "content": "The PCR product was cloned in the pFastbac-HTB shuttle vector and subsequently into baculo viral DNA using the Bac-to-Bac expression system.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_43",
            "start": 311,
            "end": 450,
            "label": {}
        },
        {
            "ix": "2-238_v2_44@0",
            "content": "Protein expression and purification",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_44",
            "start": 0,
            "end": 34,
            "label": {}
        },
        {
            "ix": "2-238_v2_45@0",
            "content": "The Hos2 enzyme was expressed in the baculoviral-insect cell expression system as a NH 2 -terminal hexa histidine tagged fusion protein, which is detected on Western blot as a ~52 kDa protein using our own polyclonal anti-Hos2 anti-sera raised against Hos2 protein in mice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_45",
            "start": 0,
            "end": 272,
            "label": {}
        },
        {
            "ix": "2-238_v2_45@1",
            "content": "SDS-PAGE analysis of purified protein revealed a major band at ~52 kDa ( Figure 1A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_45",
            "start": 274,
            "end": 358,
            "label": {}
        },
        {
            "ix": "2-238_v2_46@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_46",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-238_v2_48@0",
            "content": "In vitro deacetylation assay using synthetic peptide substrate",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_48",
            "start": 0,
            "end": 61,
            "label": {}
        },
        {
            "ix": "2-238_v2_49@0",
            "content": "Recombinant Hos2 enzyme was assayed for deacetylase activity using the synthetic deacetylase substrate, Boc-Lys (ac)-AMC.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_49",
            "start": 0,
            "end": 120,
            "label": {}
        },
        {
            "ix": "2-238_v2_49@1",
            "content": "The total activity with Boc-Lys (ac) AMC showed the enzyme to be active in deacetylating the lysine residue and the activity increased significantly ( P < 0.05 ) with an increase in Hos2 concentration ( Figure 1B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_49",
            "start": 122,
            "end": 336,
            "label": {}
        },
        {
            "ix": "2-238_v2_50@0",
            "content": "The inhibition of deacetylation activity of recombinant Hos2 was studied using classical HDAC inhibitors namely SAHA, TSA and MS-275.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_50",
            "start": 0,
            "end": 132,
            "label": {}
        },
        {
            "ix": "2-238_v2_50@1",
            "content": "TSA was very potent in inhibiting Hos2 with an IC 50 of 2.8 nM, SAHA inhibited Hos2 with an IC 50 of 65 nM ( Figure 2 , Table 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_50",
            "start": 134,
            "end": 263,
            "label": {}
        },
        {
            "ix": "2-238_v2_50@2",
            "content": "However, MS-275 showed > 50% inhibition of Hos2 activity only at 10 μM ( Table 3 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_50",
            "start": 265,
            "end": 347,
            "label": {}
        },
        {
            "ix": "2-238_v2_51@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_51",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-238_v2_53@0",
            "content": "Table 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_53",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-238_v2_55@0",
            "content": "Table 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_55",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-238_v2_57@0",
            "content": "In vitro deacetylation assay using natural substrates",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_57",
            "start": 0,
            "end": 52,
            "label": {}
        },
        {
            "ix": "2-238_v2_58@0",
            "content": "The ability of purified Hos2 protein to deacetylate acetylated histones was examined in vitro using acetylated nuclear histone preparation made from SAHA treated HeLa cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_58",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "2-238_v2_58@1",
            "content": "The nuclear histones from HeLa cells were isolated using a modified protocol of Shechter et al. <REF-27> and established the deacetylation assay using rhHDAC1/rhHDAC6 as controls along with rHos2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_58",
            "start": 174,
            "end": 369,
            "label": {}
        },
        {
            "ix": "2-238_v2_58@2",
            "content": "In these assays it was found that 0.3 μg of rhHDAC1 was able to deacetylate the nuclear acetylated histones as detected by an anti-H3-K9 histone antibody.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_58",
            "start": 371,
            "end": 524,
            "label": {}
        },
        {
            "ix": "2-238_v2_58@3",
            "content": "Recombinant hHDAC1 was more potent in deacetylating lysine residues in H3-histones than rhHDAC6.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_58",
            "start": 526,
            "end": 621,
            "label": {}
        },
        {
            "ix": "2-238_v2_58@4",
            "content": "However, no significant deacetylation of H3-Histone was seen with 0.3 μg of Hos2 ( Figure 3A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_58",
            "start": 623,
            "end": 717,
            "label": {}
        },
        {
            "ix": "2-238_v2_58@5",
            "content": "Similar results were obtained with acetylated histones from Candida in the in vitro histone deacetylation assay with purified Hos2 protein (up to 3 μg, Figure 3B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_58",
            "start": 719,
            "end": 882,
            "label": {}
        },
        {
            "ix": "2-238_v2_58@6",
            "content": "In contrast, when recombinant Hos2 was incubated with mammalian acetylated α-tubulin, a significant reduction in acetylation of α-tubulin (K40) could be observed ( Figure 4 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_58",
            "start": 884,
            "end": 1058,
            "label": {}
        },
        {
            "ix": "2-238_v2_59@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_59",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-238_v2_61@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_61",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-238_v2_63@0",
            "content": "In vitro Sirt1 deacetylation assay using fluor-de-lys substrate",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_63",
            "start": 0,
            "end": 62,
            "label": {}
        },
        {
            "ix": "2-238_v2_64@0",
            "content": "Since Hos2 is a putative NAD+ dependent deacetylase, a feature of sirtuin class of deacetylases, it was of interest to check if the Hos2 protein displayed any sirtuin like activity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_64",
            "start": 0,
            "end": 180,
            "label": {}
        },
        {
            "ix": "2-238_v2_64@1",
            "content": "The sirtuin-like activity in response to the sirtuin activator resveratrol was studied using fluor-de-lys, a synthetic Sirt1 substrate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_64",
            "start": 182,
            "end": 316,
            "label": {}
        },
        {
            "ix": "2-238_v2_64@2",
            "content": "HeLa nuclear extract was used as a positive control for sirtuin activity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_64",
            "start": 318,
            "end": 390,
            "label": {}
        },
        {
            "ix": "2-238_v2_64@3",
            "content": "In the presence of TSA where the HDAC activities are inhibited no appreciable NAD+ dependent deacetylase-like activity was seen, following incubation of Hos2 with different concentrations of resveratrol ( Figure 5 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_64",
            "start": 392,
            "end": 607,
            "label": {}
        },
        {
            "ix": "2-238_v2_65@0",
            "content": "Figure 5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_65",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-238_v2_67@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_67",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "2-238_v2_68@0",
            "content": "Pathogenic fungi are increasingly responsible for life threatening infections in the elderly and immunocompromised patients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_68",
            "start": 0,
            "end": 123,
            "label": {}
        },
        {
            "ix": "2-238_v2_68@1",
            "content": "While some species have intrinsic resistance to anti-fungals, others develop resistance during the course of treatment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_68",
            "start": 125,
            "end": 243,
            "label": {}
        },
        {
            "ix": "2-238_v2_68@2",
            "content": "Increasing antifungal resistance and treatment failures in patients is becoming a challenge.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_68",
            "start": 245,
            "end": 336,
            "label": {}
        },
        {
            "ix": "2-238_v2_69@0",
            "content": "The Candida genome encodes at least 3 distinct classes of histone deacetylases in addition to sirtuins.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_69",
            "start": 0,
            "end": 102,
            "label": {}
        },
        {
            "ix": "2-238_v2_69@1",
            "content": "There are 8 different histone deacetylases ( HOS1, HOS2, HOS3, HDA1, HDA2, HDA3, RPD3, RPD31 ) which all have distinct roles in the morphogenesis of C. albicans .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_69",
            "start": 104,
            "end": 265,
            "label": {}
        },
        {
            "ix": "2-238_v2_69@2",
            "content": "HDAC inhibitors, by virtue of their ability to prevent antifungal resistance in vitro, have been proposed as antifungal adjuvants.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_69",
            "start": 267,
            "end": 396,
            "label": {}
        },
        {
            "ix": "2-238_v2_69@3",
            "content": "Hos2 is a histone deacetylase and interacts with several proteins both in the cytoplasmic milieu as well in the nucleus <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_69",
            "start": 398,
            "end": 527,
            "label": {}
        },
        {
            "ix": "2-238_v2_69@4",
            "content": "Hos2 along with Set3 (SET domain-containing protein 3) an associated protein, plays an important role in controlling gene expression by associating with transcriptionally active regions of the chromatin <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_69",
            "start": 529,
            "end": 741,
            "label": {}
        },
        {
            "ix": "2-238_v2_70@0",
            "content": "It has been surmised that inhibiting Hda1 for example might enhance the anti-fungal effect of HDAC inhibitors by limiting hyphal development, while inhibiting Hos2 might contribute to limiting yeast development <REF-32> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_70",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "2-238_v2_70@1",
            "content": "Hos2 has an essential function in morphogenesis especially during conditions of nitrogen starvation <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_70",
            "start": 222,
            "end": 331,
            "label": {}
        },
        {
            "ix": "2-238_v2_70@2",
            "content": "The critical role of HDAC`s in C. albicans pathogenesis and survival to antifungal treatment underscores the necessity to study HDAC function in this organism.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_70",
            "start": 333,
            "end": 491,
            "label": {}
        },
        {
            "ix": "2-238_v2_71@0",
            "content": "The increasing clinical incidences of azole resistant fungal infections in critical care patients, makes a good reason to find additional drug targets to control such diseases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_71",
            "start": 0,
            "end": 175,
            "label": {}
        },
        {
            "ix": "2-238_v2_71@1",
            "content": "There is at least one small molecule (MGCD 290) that inhibits Hos2 histone deacetylase that has progressed to clinical trials.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_71",
            "start": 177,
            "end": 302,
            "label": {}
        },
        {
            "ix": "2-238_v2_71@2",
            "content": "MGCD 290 in combination with azoles was shown to be active against azole resistant yeasts and moulds <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_71",
            "start": 304,
            "end": 414,
            "label": {}
        },
        {
            "ix": "2-238_v2_72@0",
            "content": "In order to better understand the role played by the Candida Hos2 enzyme we attempted to clone, express and characterize the protein in detail.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_72",
            "start": 0,
            "end": 142,
            "label": {}
        },
        {
            "ix": "2-238_v2_72@1",
            "content": "This study describes the cloning, expression, purification and characterization of the Hos2 deacetylase enzyme from C. albicans .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_72",
            "start": 144,
            "end": 272,
            "label": {}
        },
        {
            "ix": "2-238_v2_73@0",
            "content": "We cloned and expressed the HOS2 gene in baculoviral expression system as a 6x his-tagged protein, which exhibits classical deacetylase activity with the synthetic Boc-Lys (ac)-AMC peptide substrate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_73",
            "start": 0,
            "end": 198,
            "label": {}
        },
        {
            "ix": "2-238_v2_73@1",
            "content": "In our study, the yield of the Hos2 protein was generally low and probably could be attributed to difference in codon usage between Candida and Sf9 insect cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_73",
            "start": 200,
            "end": 360,
            "label": {}
        },
        {
            "ix": "2-238_v2_73@2",
            "content": "This in vitro enzymatic assay, amenable to high throughput, could be used for screening potent fungal Hos2 inhibitors that could be a potential anti-fungal adjuvant.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_73",
            "start": 362,
            "end": 526,
            "label": {}
        },
        {
            "ix": "2-238_v2_74@0",
            "content": "Our studies with the recombinant Hos2 protein showed that it is susceptible to inhibition by standard HDAC inhibitors such as SAHA and TSA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_74",
            "start": 0,
            "end": 138,
            "label": {}
        },
        {
            "ix": "2-238_v2_74@1",
            "content": "We characterized the inhibition profile of purified proteins with SAHA and TSA and showed that TSA is a more potent inhibitor of Hos2 with an IC 50 of 2.8 ± 0.9 nM compared to SAHA (IC 50 65.4 ± 2.4 nM).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_74",
            "start": 140,
            "end": 342,
            "label": {}
        },
        {
            "ix": "2-238_v2_74@2",
            "content": "Our studies with the Class I HDAC inhibitor MS-275 showed that this inhibitor did not inhibit Hos2 deacetylase as effectively as the pan HDAC inhibitors SAHA or TSA, suggesting that Candida Hos2 is more similar to Class II deacetylases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_74",
            "start": 344,
            "end": 579,
            "label": {}
        },
        {
            "ix": "2-238_v2_75@0",
            "content": "The recombinant Hos2 failed to deacetylate either mammalian or fungal nuclear histones, suggesting that the histones are not the preferred substrates for the Hos2 enzyme.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_75",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "2-238_v2_75@1",
            "content": "The fact that, the recombinant Hos2 enzyme did not show any inhibition with the Class I inhibitor MS-275 led us to explore alternate substrates including tubulins, which are substrates for Class II histone deacetylases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_75",
            "start": 171,
            "end": 389,
            "label": {}
        },
        {
            "ix": "2-238_v2_75@2",
            "content": "Experiments with total lysates from Jurkat cells containing acetylated α-tubulin showed a dose dependent deacetylation albeit at higher concentration of Hos2 (> 5 μg).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_75",
            "start": 391,
            "end": 557,
            "label": {}
        },
        {
            "ix": "2-238_v2_75@3",
            "content": "Hos2 in essence resembles the Class II mammalian HDACs, specifically HDAC6 in its preference for tubulin deacetylation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_75",
            "start": 559,
            "end": 677,
            "label": {}
        },
        {
            "ix": "2-238_v2_75@4",
            "content": "It has been shown that microtubules in the fungal hyphae drive nuclear dynamics and cell cycle progression to morphogenesis <REF-34> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_75",
            "start": 679,
            "end": 812,
            "label": {}
        },
        {
            "ix": "2-238_v2_75@5",
            "content": "In view of the fact that Hos2 seems to preferentially deacetylate tubulins, it would be interesting to see if Hos2 inhibitors would act as anti-fungals, either as a monotherapy or in synergy, with existing anti-tubulin agents such as benomyl, nocodazole etc.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_75",
            "start": 814,
            "end": 1071,
            "label": {}
        },
        {
            "ix": "2-238_v2_75@6",
            "content": "The physiological relevance of tubulin deacetylation by Hos2 warrants further study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_75",
            "start": 1073,
            "end": 1156,
            "label": {}
        },
        {
            "ix": "2-238_v2_76@0",
            "content": "The Candida genome database <REF-23> predicts Hos2 protein to be a NAD+ dependent deacetylase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_76",
            "start": 0,
            "end": 93,
            "label": {}
        },
        {
            "ix": "2-238_v2_76@1",
            "content": "Sirtuins which are classified as Class III deacetylases are NAD+ dependent enzymes activated by polyphenols such as resveratrol.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_76",
            "start": 95,
            "end": 222,
            "label": {}
        },
        {
            "ix": "2-238_v2_76@2",
            "content": "Sirtuins have been proposed to regulate cellular metabolism, ageing and other related processes, specifically cellular stress response to caloric restriction, mediating life span extension.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_76",
            "start": 224,
            "end": 412,
            "label": {}
        },
        {
            "ix": "2-238_v2_76@3",
            "content": "The role of resveratrol as a sirtuin activator has been resolved recently and it is now known that in addition to activating Sirt1, it also activates Sirt5, while inhibiting Sirt3 <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_76",
            "start": 414,
            "end": 603,
            "label": {}
        },
        {
            "ix": "2-238_v2_76@4",
            "content": "Thus inhibiting any sirtuin like activity with small molecule inhibitors could be another way of enhancing the activity of currently used anti-fungals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_76",
            "start": 605,
            "end": 755,
            "label": {}
        },
        {
            "ix": "2-238_v2_76@5",
            "content": "We evaluated the possibility of Hos2 being a sirtuin like enzyme with a known Sirt1 activator resveratrol.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_76",
            "start": 757,
            "end": 862,
            "label": {}
        },
        {
            "ix": "2-238_v2_76@6",
            "content": "We did not observe any significant ( P value 0.5317 and 0.4411, in the presence and absence of trichostatin respectively) activation of NAD+ dependent deacetylase activity with the fluor-de-lys substrate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_76",
            "start": 864,
            "end": 1067,
            "label": {}
        },
        {
            "ix": "2-238_v2_77@0",
            "content": "In conclusion this study establishes a functional assay for purified Hos2 protein.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_77",
            "start": 0,
            "end": 81,
            "label": {}
        },
        {
            "ix": "2-238_v2_77@1",
            "content": "This in vitro enzymatic assay can be used to screen small molecule inhibitors of Hos2, which can synergise current anti-fungals in the clinic.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_77",
            "start": 83,
            "end": 224,
            "label": {}
        },
        {
            "ix": "2-238_v2_78@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_78",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "2-238_v2_79@0",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2014 Karthikeyan G et al.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_79",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "2-238_v2_80@0",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_80",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "2-238_v2_81@0",
            "content": "figshare: Tubulin deacetylation and rHos2 protein blots, doi: 10.6084/m9.figshare.841666 <REF-35>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_81",
            "start": 0,
            "end": 96,
            "label": {}
        },
        {
            "ix": "2-238_v2_82@0",
            "content": "figshare: Sirtuin assay of purified Hos2 preparations using resveratrol: UPDATE 1, doi: 10.6084/m9.figshare.1031579 <REF-36>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_82",
            "start": 0,
            "end": 123,
            "label": {}
        },
        {
            "ix": "2-238_v2_83@0",
            "content": "figshare: Deacetylase activities of rHos2 and dose response curves of rHos2 inhibition by standard HDAC inhibitors: UPDATE 1, doi: 10.6084/m9.figshare.1031581 <REF-37>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_83",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "2-238_v2_84@0",
            "content": "<REF-1> Odds FC : Candida and candidosis: a review and bibliography : Bailliere Tindall; 1988 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_84",
            "start": 0,
            "end": 111,
            "label": {}
        },
        {
            "ix": "2-238_v2_85@0",
            "content": "<REF-2> Pfaller MA Diekema DJ Jones RN : International surveillance of bloodstream infections due to Candida species: frequency of occurrence and In vitro susceptibilities to fluconazole, ravuconazole, and voriconazole of isolates collected from 1997 through 1999 in the SENTRY antimicrobial surveillance program. J Clin Microbiol. 2001 ; 39 ( 9 ): 3254 – 3259 . 11526159 10.1128/JCM.39.9.3254-3259.2001 88327",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_85",
            "start": 0,
            "end": 408,
            "label": {}
        },
        {
            "ix": "2-238_v2_86@0",
            "content": "<REF-3> Fera MT La Camera E De Sarro A : New triazoles and echinocandins: mode of action, In vitro activity and mechanisms of resistance. Expert Rev Anti Infect Ther. 2009 ; 7 ( 8 ): 981 – 998 . 19803707 10.1586/eri.09.67",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_86",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "2-238_v2_87@0",
            "content": "<REF-4> Sanglard D Ischer F Koymans L : Amino acid substitutions in the cytochrome P-450 lanosterol 14alpha-demethylase (CYP51A1) from azole-resistant Candida albicans clinical isolates contribute to resistance to azole antifungal agents. Antimicrob Agents Chemother. 1998 ; 42 ( 2 ): 241 – 253 . 9527767 105395",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_87",
            "start": 0,
            "end": 310,
            "label": {}
        },
        {
            "ix": "2-238_v2_88@0",
            "content": "<REF-5> White TC : The presence of an R467K amino acid substitution and loss of allelic variation correlate with an azole-resistant lanosterol 14alpha demethylase in Candida albicans. Antimicrob Agents Chemother. 1997 ; 41 ( 7 ): 1488 – 1494 . 9210671 163945",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_88",
            "start": 0,
            "end": 257,
            "label": {}
        },
        {
            "ix": "2-238_v2_89@0",
            "content": "<REF-6> Song JL Harry JB Eastman RT : The Candida albicans lanosterol 14-alpha-demethylase (ERG11) gene promoter is maximally induced after prolonged growth with antifungal drugs. Antimicrob Agents Chemother. 2004 ; 48 ( 4 ): 1136 – 1144 . 15047513 10.1128/AAC.48.4.1136-1144.2004 375326",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_89",
            "start": 0,
            "end": 286,
            "label": {}
        },
        {
            "ix": "2-238_v2_90@0",
            "content": "<REF-7> Sanglard D Kuchler K Ischer F : Mechanisms of resistance to azole antifungal agents in Candida albicans isolates from AIDS patients involve specific multidrug transporters. Antimicrob Agents Chemother. 1995 ; 39 ( 11 ): 2378 – 2386 . 8585712 10.1128/AAC.39.11.2378 162951",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_90",
            "start": 0,
            "end": 278,
            "label": {}
        },
        {
            "ix": "2-238_v2_91@0",
            "content": "<REF-9> Marr KA Lyons CN Rustad TR : Rapid, transient fluconazole resistance in Candida albicans is associated with increased mRNA levels of CDR. Antimicrob Agents Chemother. 1998 ; 42 ( 10 ): 2584 – 2589 . 9756759 105901",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_91",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "2-238_v2_92@0",
            "content": "<REF-10> Clayton AL Hazzalin CA Mahadevan LC : Enhanced histone acetylation and transcription: a dynamic perspective. Mol Cell. 2006 ; 23 ( 3 ): 289 – 296 . 16885019 10.1016/j.molcel.2006.06.017",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_92",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "2-238_v2_93@0",
            "content": "<REF-11> Marks PA : Discovery and development of SAHA as an anticancer agent. Oncogene. 2007 ; 26 ( 9 ): 1351 – 1356 . 17322921 10.1038/sj.onc.1210204",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_93",
            "start": 0,
            "end": 149,
            "label": {}
        },
        {
            "ix": "2-238_v2_94@0",
            "content": "<REF-12> Campas-Moya C : Romidepsin for the treatment of cutaneous T-cell lymphoma. Drugs Today (Barc.). 2009 ; 45 ( 11 ): 787 – 795 . 20126671 10.1358/dot.2009.45.11.1437052",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_94",
            "start": 0,
            "end": 173,
            "label": {}
        },
        {
            "ix": "2-238_v2_95@0",
            "content": "<REF-13> Duvic M Vu J : Update on the treatment of cutaneous T-cell lymphoma (CTCL): Focus on vorinostat. Biologics. 2007 ; 1 ( 4 ): 377 – 392 . 19707308 2721288",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_95",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "2-238_v2_96@0",
            "content": "<REF-14> Dokmanovic M Clarke C Marks PA : Histone deacetylase inhibitors: overview and perspectives. Mol Cancer Res. 2007 ; 5 ( 10 ): 981 – 989 . 17951399 10.1158/1541-7786.MCR-07-0324",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_96",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "2-238_v2_97@0",
            "content": "<REF-16> Riester D Hildmann C Schwienhorst A : Histone deacetylase inhibitors--turning epigenic mechanisms of gene regulation into tools of therapeutic intervention in malignant and other diseases. Appl Microbiol Biotechnol. 2007 ; 75 ( 3 ): 499 – 514 . 17377788 10.1007/s00253-007-0912-1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_97",
            "start": 0,
            "end": 287,
            "label": {}
        },
        {
            "ix": "2-238_v2_98@0",
            "content": "<REF-17> Smith WL Edlind TD : Histone deacetylase inhibitors enhance Candida albicans sensitivity to azoles and related antifungals: correlation with reduction in CDR and ERG upregulation. Antimicrob Agents Chemother. 2002 ; 46 ( 11 ): 3532 – 3539 . 12384361 10.1128/AAC.46.11.3532-3539.2002 128736",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_98",
            "start": 0,
            "end": 297,
            "label": {}
        },
        {
            "ix": "2-238_v2_99@0",
            "content": "<REF-18> Pfaller MA Messer SA Georgopapadakou N : Activity of MGCD290, a Hos2 histone deacetylase inhibitor, in combination with azole antifungals against opportunistic fungal pathogens. J Clin Microbiol. 2009 ; 47 ( 12 ): 3797 – 3804 . 19794038 10.1128/JCM.00618-09 2786684",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_99",
            "start": 0,
            "end": 273,
            "label": {}
        },
        {
            "ix": "2-238_v2_100@0",
            "content": "<REF-19> Simonetti G Passariello C Rotili D : Histone deacetylase inhibitors may reduce pathogenicity and virulence in Candida albicans. FEMS Yeast Res. 2007 ; 7 ( 8 ): 1371 – 1380 . 17627775 10.1111/j.1567-1364.2007.00276.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_100",
            "start": 0,
            "end": 223,
            "label": {}
        },
        {
            "ix": "2-238_v2_101@0",
            "content": "<REF-20> Wang A Kurdistani SK Grunstein M : Requirement of Hos2 histone deacetylase for gene activity in yeast. Science. 2002 ; 298 ( 5597 ): 1412 – 1414 . 12434058 10.1126/science.1077790",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_101",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "2-238_v2_102@0",
            "content": "<REF-21> Hnisz D Schwarzmuller T Kuchler K : Transcriptional loops meet chromatin: a dual-layer network controls white-opaque switching in Candida albicans. Mol Microbiol. 2009 ; 74 ( 1 ): 1 – 15 . 19555456 10.1111/j.1365-2958.2009.06772.x 2764112",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_102",
            "start": 0,
            "end": 246,
            "label": {}
        },
        {
            "ix": "2-238_v2_103@0",
            "content": "<REF-22> Hnisz D Majer O Frohner IE : The Set3/Hos2 histone deacetylase complex attenuates cAMP/PKA signaling to regulate morphogenesis and virulence of Candida albicans. PLoS Pathog. 2010 ; 6 ( 5 ): e1000889 . 20485517 10.1371/journal.ppat.1000889 2869326",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_103",
            "start": 0,
            "end": 255,
            "label": {}
        },
        {
            "ix": "2-238_v2_104@0",
            "content": "<REF-23> Arnaud MB ID Skrzypek MS Binkley J : Candida Genome Database . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_104",
            "start": 0,
            "end": 87,
            "label": {}
        },
        {
            "ix": "2-238_v2_105@0",
            "content": "<REF-24> Wurtele H Tsao S Lepine G : Modulation of histone H3 lysine 56 acetylation as an antifungal therapeutic strategy. Nat Med. 2010 ; 16 ( 7 ): 774 – 780 . 20601951 10.1038/nm.2175",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_105",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "2-238_v2_106@0",
            "content": "<REF-25> Gertz M Nguyen GT Fischer F : A molecular mechanism for direct sirtuin activation by resveratrol. PLoS One. 2012 ; 7 ( 11 ): e49761 . 23185430 10.1371/journal.pone.0049761 3504108",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_106",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "2-238_v2_107@0",
            "content": "<REF-26> Fuller SA Takahashi M Hurrell JG : Immunization of Mice. Curr Protoc Mol Biol. John Wiley & Sons, Inc.; 2001 . 18265076 10.1002/0471142727.mb1104s18",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_107",
            "start": 0,
            "end": 156,
            "label": {}
        },
        {
            "ix": "2-238_v2_108@0",
            "content": "<REF-27> Shechter D Dormann HL Allis CD : Extraction, purification and analysis of histones. Nat Protoc. 2007 ; 2 ( 6 ): 1445 – 1457 . 17545981 10.1038/nprot.2007.202",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_108",
            "start": 0,
            "end": 165,
            "label": {}
        },
        {
            "ix": "2-238_v2_109@0",
            "content": "<REF-28> Yeast Nuclei Isolation . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_109",
            "start": 0,
            "end": 49,
            "label": {}
        },
        {
            "ix": "2-238_v2_110@0",
            "content": "<REF-29> Knapp AR Ren C Su X : Quantitative profiling of histone post-translational modifications by stable isotope labeling. Methods. 2007 ; 41 ( 3 ): 312 – 319 . 17309842 10.1016/j.ymeth.2006.08.017 2572810",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_110",
            "start": 0,
            "end": 207,
            "label": {}
        },
        {
            "ix": "2-238_v2_111@0",
            "content": "<REF-30> Wiren M Silverstein RA Sinha I : Genomewide analysis of nucleosome density histone acetylation and HDAC function in fission yeast. EMBO J. 2005 ; 24 ( 16 ): 2906 – 2918 . 16079916 10.1038/sj.emboj.7600758 1187943",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_111",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "2-238_v2_112@0",
            "content": "<REF-31> Hnisz D Bardet AF Nobile CJ : A histone deacetylase adjusts transcription kinetics at coding sequences during Candida albicans morphogenesis. PLoS Genet. 2012 ; 8 ( 12 ): e1003118 . 23236295 10.1371/journal.pgen.1003118 3516536",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_112",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "2-238_v2_113@0",
            "content": "<REF-32> Zacchi LF Schulz WL Davis DA : HOS2 and HDA1 encode histone deacetylases with opposing roles in Candida albicans morphogenesis. PLoS One. 2010 ; 5 ( 8 ): e12171 . 20730094 10.1371/journal.pone.0012171 2921335",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_113",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "2-238_v2_114@0",
            "content": "<REF-33> Robyr D Suka Y Xenarios I : Microarray deacetylation maps determine genome-wide functions for yeast histone deacetylases. Cell. 2002 ; 109 ( 4 ): 437 – 446 . 12086601 10.1016/S0092-8674(02)00746-8",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_114",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "2-238_v2_115@0",
            "content": "<REF-34> Finley KR Berman J : Microtubules in Candida albicans Hyphae Drive Nuclear Dynamics and Connect Cell Cycle Progression to Morphogenesis. Eukaryot Cell. 2005 ; 4 ( 10 ): 1697 – 1711 . 16215177 10.1128/EC.4.10.1697-1711.2005 1265902",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_115",
            "start": 0,
            "end": 238,
            "label": {}
        },
        {
            "ix": "2-238_v2_116@0",
            "content": "<REF-35> Karthikeyan G Maneesh PS Nachiappan DM : Tubulin deacetylation and rHos2 protein blots. figshare. 2014 . Data Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_116",
            "start": 0,
            "end": 124,
            "label": {}
        },
        {
            "ix": "2-238_v2_117@0",
            "content": "<REF-36> Karthikeyan G Maneesh PS Nachiappan DM : Deacetylase activities of rHos2 and dose response curves of rHos2 inhibition by standard HDAC inhibitors. figshare. 2014 . Data Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_117",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "2-238_v2_118@0",
            "content": "<REF-37> Karthikeyan G Maneesh PS Nachiappan DM : Sirtuin assay of purified Hos2 preparations using resveratrol. figshare. 2014 . Data Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-238_v2_118",
            "start": 0,
            "end": 140,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "2-238_v2_0",
            "tgt_ix": "2-238_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_1",
            "tgt_ix": "2-238_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_0",
            "tgt_ix": "2-238_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_3",
            "tgt_ix": "2-238_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_3",
            "tgt_ix": "2-238_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_3",
            "tgt_ix": "2-238_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_3",
            "tgt_ix": "2-238_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_3",
            "tgt_ix": "2-238_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_3",
            "tgt_ix": "2-238_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_3",
            "tgt_ix": "2-238_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_0",
            "tgt_ix": "2-238_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_12",
            "tgt_ix": "2-238_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_14",
            "tgt_ix": "2-238_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_14",
            "tgt_ix": "2-238_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_16",
            "tgt_ix": "2-238_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_14",
            "tgt_ix": "2-238_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_19",
            "tgt_ix": "2-238_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_21",
            "tgt_ix": "2-238_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_23",
            "tgt_ix": "2-238_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_25",
            "tgt_ix": "2-238_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_27",
            "tgt_ix": "2-238_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_29",
            "tgt_ix": "2-238_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_31",
            "tgt_ix": "2-238_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_33",
            "tgt_ix": "2-238_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_35",
            "tgt_ix": "2-238_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_37",
            "tgt_ix": "2-238_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_39",
            "tgt_ix": "2-238_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_0",
            "tgt_ix": "2-238_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_41",
            "tgt_ix": "2-238_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_42",
            "tgt_ix": "2-238_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_41",
            "tgt_ix": "2-238_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_44",
            "tgt_ix": "2-238_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_44",
            "tgt_ix": "2-238_v2_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_46",
            "tgt_ix": "2-238_v2_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_41",
            "tgt_ix": "2-238_v2_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_48",
            "tgt_ix": "2-238_v2_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_48",
            "tgt_ix": "2-238_v2_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_48",
            "tgt_ix": "2-238_v2_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_51",
            "tgt_ix": "2-238_v2_52",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_48",
            "tgt_ix": "2-238_v2_53",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_53",
            "tgt_ix": "2-238_v2_54",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_48",
            "tgt_ix": "2-238_v2_55",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_55",
            "tgt_ix": "2-238_v2_56",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_41",
            "tgt_ix": "2-238_v2_57",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_57",
            "tgt_ix": "2-238_v2_58",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_57",
            "tgt_ix": "2-238_v2_59",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_59",
            "tgt_ix": "2-238_v2_60",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_57",
            "tgt_ix": "2-238_v2_61",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_61",
            "tgt_ix": "2-238_v2_62",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_41",
            "tgt_ix": "2-238_v2_63",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_63",
            "tgt_ix": "2-238_v2_64",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_63",
            "tgt_ix": "2-238_v2_65",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_65",
            "tgt_ix": "2-238_v2_66",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_0",
            "tgt_ix": "2-238_v2_67",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_68",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_69",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_70",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_71",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_72",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_73",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_74",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_75",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_76",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_77",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_0",
            "tgt_ix": "2-238_v2_78",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_78",
            "tgt_ix": "2-238_v2_79",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_78",
            "tgt_ix": "2-238_v2_80",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_78",
            "tgt_ix": "2-238_v2_81",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_78",
            "tgt_ix": "2-238_v2_82",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_78",
            "tgt_ix": "2-238_v2_83",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_0",
            "tgt_ix": "2-238_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_1",
            "tgt_ix": "2-238_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_3",
            "tgt_ix": "2-238_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_4",
            "tgt_ix": "2-238_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_5",
            "tgt_ix": "2-238_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_7",
            "tgt_ix": "2-238_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_8",
            "tgt_ix": "2-238_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_9",
            "tgt_ix": "2-238_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_12",
            "tgt_ix": "2-238_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_13",
            "tgt_ix": "2-238_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_14",
            "tgt_ix": "2-238_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_15",
            "tgt_ix": "2-238_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_16",
            "tgt_ix": "2-238_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_17",
            "tgt_ix": "2-238_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_18",
            "tgt_ix": "2-238_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_19",
            "tgt_ix": "2-238_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_20",
            "tgt_ix": "2-238_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_21",
            "tgt_ix": "2-238_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_22",
            "tgt_ix": "2-238_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_23",
            "tgt_ix": "2-238_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_24",
            "tgt_ix": "2-238_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_25",
            "tgt_ix": "2-238_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_26",
            "tgt_ix": "2-238_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_27",
            "tgt_ix": "2-238_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_28",
            "tgt_ix": "2-238_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_29",
            "tgt_ix": "2-238_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_30",
            "tgt_ix": "2-238_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_31",
            "tgt_ix": "2-238_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_32",
            "tgt_ix": "2-238_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_33",
            "tgt_ix": "2-238_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_34",
            "tgt_ix": "2-238_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_35",
            "tgt_ix": "2-238_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_36",
            "tgt_ix": "2-238_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_37",
            "tgt_ix": "2-238_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_38",
            "tgt_ix": "2-238_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_39",
            "tgt_ix": "2-238_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_40",
            "tgt_ix": "2-238_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_41",
            "tgt_ix": "2-238_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_42",
            "tgt_ix": "2-238_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_43",
            "tgt_ix": "2-238_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_44",
            "tgt_ix": "2-238_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_45",
            "tgt_ix": "2-238_v2_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_46",
            "tgt_ix": "2-238_v2_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_47",
            "tgt_ix": "2-238_v2_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_48",
            "tgt_ix": "2-238_v2_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_49",
            "tgt_ix": "2-238_v2_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_50",
            "tgt_ix": "2-238_v2_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_51",
            "tgt_ix": "2-238_v2_52",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_52",
            "tgt_ix": "2-238_v2_53",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_53",
            "tgt_ix": "2-238_v2_54",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_54",
            "tgt_ix": "2-238_v2_55",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_55",
            "tgt_ix": "2-238_v2_56",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_56",
            "tgt_ix": "2-238_v2_57",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_57",
            "tgt_ix": "2-238_v2_58",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_58",
            "tgt_ix": "2-238_v2_59",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_59",
            "tgt_ix": "2-238_v2_60",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_60",
            "tgt_ix": "2-238_v2_61",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_61",
            "tgt_ix": "2-238_v2_62",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_62",
            "tgt_ix": "2-238_v2_63",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_63",
            "tgt_ix": "2-238_v2_64",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_64",
            "tgt_ix": "2-238_v2_65",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_65",
            "tgt_ix": "2-238_v2_66",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_66",
            "tgt_ix": "2-238_v2_67",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_68",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_68",
            "tgt_ix": "2-238_v2_69",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_69",
            "tgt_ix": "2-238_v2_70",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_70",
            "tgt_ix": "2-238_v2_71",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_71",
            "tgt_ix": "2-238_v2_72",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_72",
            "tgt_ix": "2-238_v2_73",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_73",
            "tgt_ix": "2-238_v2_74",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_74",
            "tgt_ix": "2-238_v2_75",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_75",
            "tgt_ix": "2-238_v2_76",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_76",
            "tgt_ix": "2-238_v2_77",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_77",
            "tgt_ix": "2-238_v2_78",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_78",
            "tgt_ix": "2-238_v2_79",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_79",
            "tgt_ix": "2-238_v2_80",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_80",
            "tgt_ix": "2-238_v2_81",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_81",
            "tgt_ix": "2-238_v2_82",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_82",
            "tgt_ix": "2-238_v2_83",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_4",
            "tgt_ix": "2-238_v2_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_4",
            "tgt_ix": "2-238_v2_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_4",
            "tgt_ix": "2-238_v2_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_5",
            "tgt_ix": "2-238_v2_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_5",
            "tgt_ix": "2-238_v2_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_5",
            "tgt_ix": "2-238_v2_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_5",
            "tgt_ix": "2-238_v2_90",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_5",
            "tgt_ix": "2-238_v2_91",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_92",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_93",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_94",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_95",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_96",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_97",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_8",
            "tgt_ix": "2-238_v2_98",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_8",
            "tgt_ix": "2-238_v2_99",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_8",
            "tgt_ix": "2-238_v2_100",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_9",
            "tgt_ix": "2-238_v2_101",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_9",
            "tgt_ix": "2-238_v2_102",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_9",
            "tgt_ix": "2-238_v2_103",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_104",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_105",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_106",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_24",
            "tgt_ix": "2-238_v2_107",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_28",
            "tgt_ix": "2-238_v2_108",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_30",
            "tgt_ix": "2-238_v2_109",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_30",
            "tgt_ix": "2-238_v2_110",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_69",
            "tgt_ix": "2-238_v2_111",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_69",
            "tgt_ix": "2-238_v2_112",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_70",
            "tgt_ix": "2-238_v2_113",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_70",
            "tgt_ix": "2-238_v2_114",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_75",
            "tgt_ix": "2-238_v2_115",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_81",
            "tgt_ix": "2-238_v2_116",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_82",
            "tgt_ix": "2-238_v2_117",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_83",
            "tgt_ix": "2-238_v2_118",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_15",
            "tgt_ix": "2-238_v2_17",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_45",
            "tgt_ix": "2-238_v2_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_50",
            "tgt_ix": "2-238_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_50",
            "tgt_ix": "2-238_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_50",
            "tgt_ix": "2-238_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_58",
            "tgt_ix": "2-238_v2_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_58",
            "tgt_ix": "2-238_v2_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_64",
            "tgt_ix": "2-238_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-238_v2_0",
            "tgt_ix": "2-238_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_1",
            "tgt_ix": "2-238_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_2@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_2@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_2@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_2",
            "tgt_ix": "2-238_v2_2@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_3",
            "tgt_ix": "2-238_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_4",
            "tgt_ix": "2-238_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_4",
            "tgt_ix": "2-238_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_4",
            "tgt_ix": "2-238_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_4",
            "tgt_ix": "2-238_v2_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_5",
            "tgt_ix": "2-238_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_5",
            "tgt_ix": "2-238_v2_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_6",
            "tgt_ix": "2-238_v2_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_7",
            "tgt_ix": "2-238_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_7",
            "tgt_ix": "2-238_v2_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_8",
            "tgt_ix": "2-238_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_8",
            "tgt_ix": "2-238_v2_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_9",
            "tgt_ix": "2-238_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_9",
            "tgt_ix": "2-238_v2_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_9",
            "tgt_ix": "2-238_v2_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_9",
            "tgt_ix": "2-238_v2_9@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_9",
            "tgt_ix": "2-238_v2_9@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_9",
            "tgt_ix": "2-238_v2_9@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_10@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_10",
            "tgt_ix": "2-238_v2_10@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_11",
            "tgt_ix": "2-238_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_12",
            "tgt_ix": "2-238_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_13",
            "tgt_ix": "2-238_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_13",
            "tgt_ix": "2-238_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_13",
            "tgt_ix": "2-238_v2_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_13",
            "tgt_ix": "2-238_v2_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_14",
            "tgt_ix": "2-238_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_15",
            "tgt_ix": "2-238_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_15",
            "tgt_ix": "2-238_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_15",
            "tgt_ix": "2-238_v2_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_15",
            "tgt_ix": "2-238_v2_15@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_16",
            "tgt_ix": "2-238_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_18",
            "tgt_ix": "2-238_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_18",
            "tgt_ix": "2-238_v2_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_18",
            "tgt_ix": "2-238_v2_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_18",
            "tgt_ix": "2-238_v2_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_18",
            "tgt_ix": "2-238_v2_18@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_18",
            "tgt_ix": "2-238_v2_18@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_18",
            "tgt_ix": "2-238_v2_18@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_18",
            "tgt_ix": "2-238_v2_18@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_19",
            "tgt_ix": "2-238_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_20",
            "tgt_ix": "2-238_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_20",
            "tgt_ix": "2-238_v2_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_20",
            "tgt_ix": "2-238_v2_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_20",
            "tgt_ix": "2-238_v2_20@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_20",
            "tgt_ix": "2-238_v2_20@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_20",
            "tgt_ix": "2-238_v2_20@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_20",
            "tgt_ix": "2-238_v2_20@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_20",
            "tgt_ix": "2-238_v2_20@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_21",
            "tgt_ix": "2-238_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_22",
            "tgt_ix": "2-238_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_22",
            "tgt_ix": "2-238_v2_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_22",
            "tgt_ix": "2-238_v2_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_22",
            "tgt_ix": "2-238_v2_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_23",
            "tgt_ix": "2-238_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_24",
            "tgt_ix": "2-238_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_24",
            "tgt_ix": "2-238_v2_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_24",
            "tgt_ix": "2-238_v2_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_24",
            "tgt_ix": "2-238_v2_24@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_24",
            "tgt_ix": "2-238_v2_24@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_24",
            "tgt_ix": "2-238_v2_24@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_25",
            "tgt_ix": "2-238_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_26",
            "tgt_ix": "2-238_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_27",
            "tgt_ix": "2-238_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_28",
            "tgt_ix": "2-238_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_28",
            "tgt_ix": "2-238_v2_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_29",
            "tgt_ix": "2-238_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_30",
            "tgt_ix": "2-238_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_30",
            "tgt_ix": "2-238_v2_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_30",
            "tgt_ix": "2-238_v2_30@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_30",
            "tgt_ix": "2-238_v2_30@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_30",
            "tgt_ix": "2-238_v2_30@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_31",
            "tgt_ix": "2-238_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_32",
            "tgt_ix": "2-238_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_32",
            "tgt_ix": "2-238_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_32",
            "tgt_ix": "2-238_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_32",
            "tgt_ix": "2-238_v2_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_32",
            "tgt_ix": "2-238_v2_32@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_32",
            "tgt_ix": "2-238_v2_32@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_32",
            "tgt_ix": "2-238_v2_32@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_33",
            "tgt_ix": "2-238_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_34",
            "tgt_ix": "2-238_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_34",
            "tgt_ix": "2-238_v2_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_34",
            "tgt_ix": "2-238_v2_34@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_34",
            "tgt_ix": "2-238_v2_34@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_34",
            "tgt_ix": "2-238_v2_34@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_34",
            "tgt_ix": "2-238_v2_34@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_35",
            "tgt_ix": "2-238_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_36",
            "tgt_ix": "2-238_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_36",
            "tgt_ix": "2-238_v2_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_36",
            "tgt_ix": "2-238_v2_36@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_37",
            "tgt_ix": "2-238_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_38",
            "tgt_ix": "2-238_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_38",
            "tgt_ix": "2-238_v2_38@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_39",
            "tgt_ix": "2-238_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_40",
            "tgt_ix": "2-238_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_40",
            "tgt_ix": "2-238_v2_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_40",
            "tgt_ix": "2-238_v2_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_41",
            "tgt_ix": "2-238_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_42",
            "tgt_ix": "2-238_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_43",
            "tgt_ix": "2-238_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_43",
            "tgt_ix": "2-238_v2_43@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_43",
            "tgt_ix": "2-238_v2_43@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_43",
            "tgt_ix": "2-238_v2_43@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_44",
            "tgt_ix": "2-238_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_45",
            "tgt_ix": "2-238_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_45",
            "tgt_ix": "2-238_v2_45@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_46",
            "tgt_ix": "2-238_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_48",
            "tgt_ix": "2-238_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_49",
            "tgt_ix": "2-238_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_49",
            "tgt_ix": "2-238_v2_49@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_50",
            "tgt_ix": "2-238_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_50",
            "tgt_ix": "2-238_v2_50@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_50",
            "tgt_ix": "2-238_v2_50@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_51",
            "tgt_ix": "2-238_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_53",
            "tgt_ix": "2-238_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_55",
            "tgt_ix": "2-238_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_57",
            "tgt_ix": "2-238_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_58",
            "tgt_ix": "2-238_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_58",
            "tgt_ix": "2-238_v2_58@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_58",
            "tgt_ix": "2-238_v2_58@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_58",
            "tgt_ix": "2-238_v2_58@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_58",
            "tgt_ix": "2-238_v2_58@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_58",
            "tgt_ix": "2-238_v2_58@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_58",
            "tgt_ix": "2-238_v2_58@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_59",
            "tgt_ix": "2-238_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_61",
            "tgt_ix": "2-238_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_63",
            "tgt_ix": "2-238_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_64",
            "tgt_ix": "2-238_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_64",
            "tgt_ix": "2-238_v2_64@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_64",
            "tgt_ix": "2-238_v2_64@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_64",
            "tgt_ix": "2-238_v2_64@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_65",
            "tgt_ix": "2-238_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_67",
            "tgt_ix": "2-238_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_68",
            "tgt_ix": "2-238_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_68",
            "tgt_ix": "2-238_v2_68@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_68",
            "tgt_ix": "2-238_v2_68@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_69",
            "tgt_ix": "2-238_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_69",
            "tgt_ix": "2-238_v2_69@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_69",
            "tgt_ix": "2-238_v2_69@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_69",
            "tgt_ix": "2-238_v2_69@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_69",
            "tgt_ix": "2-238_v2_69@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_70",
            "tgt_ix": "2-238_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_70",
            "tgt_ix": "2-238_v2_70@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_70",
            "tgt_ix": "2-238_v2_70@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_71",
            "tgt_ix": "2-238_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_71",
            "tgt_ix": "2-238_v2_71@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_71",
            "tgt_ix": "2-238_v2_71@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_72",
            "tgt_ix": "2-238_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_72",
            "tgt_ix": "2-238_v2_72@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_73",
            "tgt_ix": "2-238_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_73",
            "tgt_ix": "2-238_v2_73@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_73",
            "tgt_ix": "2-238_v2_73@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_74",
            "tgt_ix": "2-238_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_74",
            "tgt_ix": "2-238_v2_74@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_74",
            "tgt_ix": "2-238_v2_74@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_75",
            "tgt_ix": "2-238_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_75",
            "tgt_ix": "2-238_v2_75@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_75",
            "tgt_ix": "2-238_v2_75@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_75",
            "tgt_ix": "2-238_v2_75@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_75",
            "tgt_ix": "2-238_v2_75@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_75",
            "tgt_ix": "2-238_v2_75@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_75",
            "tgt_ix": "2-238_v2_75@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_76",
            "tgt_ix": "2-238_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_76",
            "tgt_ix": "2-238_v2_76@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_76",
            "tgt_ix": "2-238_v2_76@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_76",
            "tgt_ix": "2-238_v2_76@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_76",
            "tgt_ix": "2-238_v2_76@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_76",
            "tgt_ix": "2-238_v2_76@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_76",
            "tgt_ix": "2-238_v2_76@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_77",
            "tgt_ix": "2-238_v2_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_77",
            "tgt_ix": "2-238_v2_77@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_78",
            "tgt_ix": "2-238_v2_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_79",
            "tgt_ix": "2-238_v2_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_80",
            "tgt_ix": "2-238_v2_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_81",
            "tgt_ix": "2-238_v2_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_82",
            "tgt_ix": "2-238_v2_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_83",
            "tgt_ix": "2-238_v2_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_84",
            "tgt_ix": "2-238_v2_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_85",
            "tgt_ix": "2-238_v2_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_86",
            "tgt_ix": "2-238_v2_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_87",
            "tgt_ix": "2-238_v2_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_88",
            "tgt_ix": "2-238_v2_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_89",
            "tgt_ix": "2-238_v2_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_90",
            "tgt_ix": "2-238_v2_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_91",
            "tgt_ix": "2-238_v2_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_92",
            "tgt_ix": "2-238_v2_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_93",
            "tgt_ix": "2-238_v2_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_94",
            "tgt_ix": "2-238_v2_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_95",
            "tgt_ix": "2-238_v2_95@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_96",
            "tgt_ix": "2-238_v2_96@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_97",
            "tgt_ix": "2-238_v2_97@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_98",
            "tgt_ix": "2-238_v2_98@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_99",
            "tgt_ix": "2-238_v2_99@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_100",
            "tgt_ix": "2-238_v2_100@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_101",
            "tgt_ix": "2-238_v2_101@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_102",
            "tgt_ix": "2-238_v2_102@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_103",
            "tgt_ix": "2-238_v2_103@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_104",
            "tgt_ix": "2-238_v2_104@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_105",
            "tgt_ix": "2-238_v2_105@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_106",
            "tgt_ix": "2-238_v2_106@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_107",
            "tgt_ix": "2-238_v2_107@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_108",
            "tgt_ix": "2-238_v2_108@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_109",
            "tgt_ix": "2-238_v2_109@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_110",
            "tgt_ix": "2-238_v2_110@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_111",
            "tgt_ix": "2-238_v2_111@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_112",
            "tgt_ix": "2-238_v2_112@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_113",
            "tgt_ix": "2-238_v2_113@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_114",
            "tgt_ix": "2-238_v2_114@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_115",
            "tgt_ix": "2-238_v2_115@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_116",
            "tgt_ix": "2-238_v2_116@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_117",
            "tgt_ix": "2-238_v2_117@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-238_v2_118",
            "tgt_ix": "2-238_v2_118@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "2-238_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.2-238.v2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/3.0/",
        "title": "Functional characterization of \n                     Candida \n                      albicans  Hos2 histone deacetylase",
        "abstract": "Candida albicans is a mucosal commensal organism capable of causing superficial (oral and vaginal thrush) infections in immune normal hosts, but is a major pathogen causing systemic and mucosal infections in immunocompromised individuals. Azoles have been very effective anti-fungal agents and the mainstay in treating opportunistic mold and yeast infections. Azole resistant strains have emerged compromising the utility of this class of drugs. It has been shown that azole resistance can be reversed by the co-administration of a histone deacetylase (HDAC) inhibitor, suggesting that resistance is mediated by epigenetic mechanisms possibly involving Hos2, a fungal deacetylase. We report here the cloning and functional characterization of HOS2 (H igh O smolarity S ensitive) , a gene coding for fungal histone deacetylase from C. albicans . Inhibition studies showed that Hos2 is susceptible to pan inhibitors such as trichostatin A (TSA) and suberoylanilide hydroxamic acid (SAHA), but is not inhibited by class I inhibitors such as MS-275. This in vitro enzymatic assay, which is amenable to high throughput could be used for screening potent fungal Hos2 inhibitors that could be a potential anti-fungal adjuvant. Purified Hos2 protein consistently deacetylated tubulins, rather than histones from TSA-treated cells. Hos2 has been reported to be a putative NAD+ dependent histone deacetylase, a feature of sirtuins. We assayed for sirtuin activation with resveratrol and purified Hos2 protein and did not find any sirtuin activity.",
        "contributors": [
            {
                "surname": "Karthikeyan",
                "given-names": "G"
            },
            {
                "surname": "Paul-Satyaseela",
                "given-names": "Maneesh"
            },
            {
                "surname": "Dhatchana Moorthy",
                "given-names": "Nachiappan"
            },
            {
                "surname": "Gopalaswamy",
                "given-names": "Radha"
            },
            {
                "surname": "Narayanan",
                "given-names": "Shridhar"
            }
        ],
        "url": "https://f1000research.com/articles/2-238/v2/",
        "doc_id": "2-238",
        "version": 2,
        "ix_counter": 470,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}