{
    "nodes": [
        {
            "ix": "2-180_v1_report1747_0",
            "content": "Reviewer response for version 1",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_1",
            "content": "This is an outstandingly planned and well-executed study that shows that the rodent brain, after a daily 10 minute exposure to low field pulsed magnetic stimulation for 5 weeks (i.e. 35 sessions) exhibits null effects on learning behavior and hippocampus dendritic spine density in both Wild Type and Ephrine A2-/- mice. The effort of the authors deserves a lot of credit, as studies like this one are extremely hard, long and laborious to perform and the possibility of significant results always uncertain. In spite of the current null results, this kind of work is greatly needed in the field of non-invasive brain stimulation in order to understand the cellular underpinnings of these techniques and assess the safeness and real therapeutic potential of stimulation technologies in clinical neurorehabilitation. Overall, the neurostimulation community should strongly thank the authors for investing their know-how, time and effort to carry over this type of animal research and we all should encourage them to pursue their efforts in the future.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_2",
            "content": "GENERAL POINTS",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_3",
            "content": "The only limitation of the current manuscript is related to the difficulties in interpreting null outcomes; in this case a triple negative result. Not only did low field pulsed magnetic stimulation prove unable to modify visual learning behavior or hippocampus spine density in these two population of mice but neither of the two showed (as should have been at least expected) significant differences in any of these two measures. The authors do an excellent job going over the different possibilities that could explain this null pattern of outcomes, even if they do not have much basis to rule out any of the hypotheses in particular. Among other important issues, the study emphasizes once more the importance of task titration. Task titration is strongly related to animal motivation (and thus intake restriction) and is a key variable and therefore needs to be manipulated carefully to make sure that the potentially effective impact of magnetic pulses can be demonstrated behaviorally. With regards to the question however of whether or not increasing food restriction could have rendered, as the authors suggest, behavioral learning tests more sensitive, the answer remains unknown. It could also be that highly motivated animals would rapidly show ceiling learning effects and render the task less sensitive to modulation. To this reviewer, the performance of both groups of animals in the inversion phase of the task seems to show enough room for behavioral improvement, even after 5 weeks of stimulation; thus it is tempting to also speculate that such a complex task for a rodent (which relies on several cognitive processes such as visuo-spatial attention, visual perception, visual, spatial and declarative memory, associative rewarded learning, rule understanding and switching and decision making) may not have been well suited to the functions of the brain regions aimed at in this study and/or that their impact could have rapidly compensated for by other systems or regions.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_4",
            "content": "Adding to the authors’ arguments with regards to the lack of spine density effects, one could also argue that a direct impact of the stimulation (and not an indirect effect of the stimulation on learning behavior driving subsequent effects on memory related regions) on such measures could and should have occurred primarily in the cortical regions overlying the hippocampus (which have not been analysed in this study) rather than in the more deeply located hippocampus CA1 and DG neurons. Of course, if the targeted region theoretically related to the behavior that is being measured is not at least directly or indirectly impacted and modified in activity by the pulses, then no behavioral differences between sham and real rTMS patterns should be expected in either population of mice. All these explanations are directly or indirectly mentioned in the discussion and when not explicitly mentioned in the text, they emerge logically from the results. However any effort to nuance and expand such justifications even further would be welcome.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_5",
            "content": "To this reviewer, the only possibility (that would also be compatible with the negative outcomes of this study) that is not explicitly mentioned in the discussion is that the delivered low field pulsed magnetic patterns (even if estimated by means of a Hall device in postmortem brains as reaching intensities of ~6 mT in the hippocampus) were not effective at all. Several reasons that could account for that eventuality are; that the field was too weak to penetrate deep enough with a minimal intensity, imprecise widely distributed targeting or a field strongly attenuated by the space left, as indicated in the manuscript, between the stimulating coil and the top of the head. This reviewer cannot demonstrate that this possibility is more likely than any of the others already mentioned in the manuscript. Nonetheless, in the absence of any positive sign of a stimulatory impact, this possibility cannot be ruled out and should probably be briefly discussed. Additionally, it should be clear throughout the manuscript, that the ability of the current experiment to highlight the innocuity of 5 weeks of low field pulsed magnetic brain stimulation needs to be interpreted carefully and associated with the field strengths delivered by the modified e-cell device by Global Energy Medicine, which is far from the normal field strength for TMS/rTMS devices operated in humans for either research or therapeutic purposes.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_6",
            "content": "MINOR COMMENTS AND SUGGESTIONS",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_7",
            "content": "- Introduction, Page 1, Col 1, Par 1, Line 6. Could the authors re-evaluate the adequacy of the term “metaplasticity” with regards to TMS-induced LTP effects, as to this reviewer, the main effect of high frequency stimulation are LTP or LTP-like effects. Metaplasticity is a consequence of forcing homeostatic plasticity beyond a particular boundary, which may result in paradoxical modulatory effects.",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_8",
            "content": "- Introduction, Page 1, Col 1, Par 2, Lines 7-9 . With regards to this issue, in this particular study were the authors hypothesizing a direct impact of low field pulsed magnetic stimulation on specific cortical locations translated through connectivity into a declarative and spatial memory region such as the hippocampus, or a cortical effect of stimulation leading to subsequent changes in behavior that could leave a distinctive memory trace in the hippocampus?",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_9",
            "content": "- Introduction, Page 1, Col 1, Par 3 . The paper by May et al. 2007, Cereb. Cortex, in which the effect of 5 straight days of rTMS on humans assessed with MRI methods and regional size increases (hypothetically attributed to increases in spine density) could be relevant for this introduction.",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_10",
            "content": "- Methods, Page 1, Col 2, Par 1, Lines 7-8. Could the authors provide an idea of how far in their development (if possible in age compared to humans) are 8-10 week old mice? It seems that in a prior study by the same authors that showed significant results after 14 days of low field rTMS on the visual cortex by Rodger et al. 2012, FASEB J, the mice were slightly younger (6-8 weeks). Is this period crucial in terms of postnatal development for mice? Could a less plastically sensitive brain of 8-10 week old mice vs. 6-8 week old mice explain the current null results? Please comment briefly in the manuscript.",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_11",
            "content": "- Methods, Page 2, Col 2, Par 2, Lines 6-7. Why were mice tested before the low field pulsed magnetic stimulation session and not also immediately thereafter, when the impact of the stimulation should have been stronger? Although I understand the authors sought a long-term effect, such a measure could have proven useful to reveal at least an immediate day-to-day impact of stimulation and become a proof of their efficacy? Given the order of events, one could be tempted to speculate the possibility of non-synergistic interaction between the lasting effects of task practice and immediately subsequent low field rTMS stimulation, cancelling the modulatory effects.",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_12",
            "content": "- Methods, Page 3, Col 1, Par 2, Lines 7-8 . As this is not a standard rTMS stimulation device, some additional information on the stimulation source should be given to be able to compare the efficiency of low field pulsed magnetic stimulation with current human rTMS equipment. More specifically, what is the shape of the stimulating pulse (monophasic, biphasic?) and what is the rise time of the field? The pattern of stimulation used seems essentially an “excitatory” 10 Hz rTMS pattern, preceded and followed by short instances of ~6 Hz stimulation. Was this high frequency employed as a way to induce LTP phenomena in the hippocampus or as a tool to enhance cortical excitability and facilitate learning behavior leading then to functional and anatomical modulations of the hippocampus? Please comment briefly.",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_13",
            "content": "- Methods, Page 3, Col 1, Par 2, Lines 7-8. Navigation of the TMS coil of course could have been improved given the high-focality of the device used by the authors and the fact that any small head movements in a small rodent brain could easily lead to a completely different area of stimulation. It is true that prior studies in awake felines by our own group (see Valero-Cabré et al . 2006, Exp Brain , Valero-Cabre A et al. 2008, Eur J Neurosci. ) have used a similar manual procedure, but it is also the case that the coils and brains in those studies were larger and precise location on a specific region of the posterior parietal cortex was guided day to day by stereotaxic based measures and references. In many instances, we additionally benefited from parietal bone transparency during surgery, and identified in each animal the sulci/gyral pattern and labelled the exact area of interest (see Valero-Cabré et al . 2005 Exp Brain Res, Valero-Cabré et al .2007 Exp Brain Res ). Furthermore, in groups that were to be followed longitudinally, we placed a dental acrylic plug, that could be palpated through the skin of the scalp (see Afifi et al. 2012 Eur J Neurosci ) which was then used as consistent localization marker. The correct positioning of those plugs with regards to the stimulated areas was often verified pre-treatment by anatomical MRI methods and also in post-mortem brain dissections at the end of the follow up. In the current study, given the elongated shape of the hippocampus in rodents, which part of the rodent cortex or which stereotaxic level was aimed at during the stimulation? Also, in contrast with the quoted feline study, the authors indicate here that the coil was not in direct contact with the scalp. As air is a strong isolator, could that have attenuated the strength of such a low intensity field even further? Were Hall probe field measures in the hippocampus performed with the stimulating cell also separated from the scalp?",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_14",
            "content": "- Discussion, Page 5, Col 1, Par 1, Lines 4-6. The statement “ The absence of observed behavioral and structural change is consistent with previously reported rTMS specificity for abnormal systems ” needs to be expanded upon as the Ephrin-A2-/- mice have indeed abnormal systems. Maybe a short comment on how to reconcile the current findings with those reported in Rodger et al. 2012, FASEB J , would be important as in that study by the same authors similar stimulation patterns were able to correct cortico-collicular connectivity only in Ephrin-A2-/- and not in Wild type mice, supporting the above-mentioned statement.",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_15",
            "content": "- Discussion, Page 5, Col 1, Par 1, Lines 6-8 . I would strongly advise the authors to alter the contents of the sentence “ Furthermore, the lack of adverse effects in our long term study contributes evidence that rTMS is safe to use in healthy control participants ”. Could they rephrase to something like “Furthermore, the lack of adverse effects in our long term study suggests that up to 5 weeks of daily sessions (35 session) of low field pulsed magnetic stimulation at the parameters used in this study appears safe to use in healthy participants”. This is important as the intensity levels employed are very different of those employed in human rTMS, which are much higher, and this information could have some public health implications for future use of rTMS in humans.",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_16",
            "content": "- Discussion, Page 5, Col 2, Par 1, Lines 19-21 . Please check the accuracy of the sentence “ To our knowledge, there have been no studies assessing cognitive effects of long-term rTMS in patients and healthy controls, which presents a large gap in knowledge ”",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_17",
            "content": "- Discussion, Page 5, Col 2, Par 1, Lines 21-22 . As indicated above (comment 10), would the authors agree to rewrite the sentence “ Although more research is needed, our results support that rTMS is safe to use in healthy control participants… ” and revise the second part of it “ … invaluable in assessment of rTMS effects clinically ” which to this reviewer is confusing?",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-180_v1_report1747_18",
            "content": "- Discussion, Page 5, Col 2, Par 2, Lines 5-8. This sentence can be a bit surprising to readers, why did the authors chose a knock out for Ephrine A2 in a study that aimed to analyze spine density in the hippocampus if as they affirm in this paragraph, this molecule is not involved in spine dynamics? Maybe the rational for that choice needs to be explained more carefully.",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "2-180_v1_report1747_0@0",
            "content": "Reviewer response for version 1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_0",
            "start": 0,
            "end": 30,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_1@0",
            "content": "This is an outstandingly planned and well-executed study that shows that the rodent brain, after a daily 10 minute exposure to low field pulsed magnetic stimulation for 5 weeks (i.e. 35 sessions) exhibits null effects on learning behavior and hippocampus dendritic spine density in both Wild Type and Ephrine A2-/- mice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_1",
            "start": 0,
            "end": 319,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_1@1",
            "content": "The effort of the authors deserves a lot of credit, as studies like this one are extremely hard, long and laborious to perform and the possibility of significant results always uncertain.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_1",
            "start": 321,
            "end": 507,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_1@2",
            "content": "In spite of the current null results, this kind of work is greatly needed in the field of non-invasive brain stimulation in order to understand the cellular underpinnings of these techniques and assess the safeness and real therapeutic potential of stimulation technologies in clinical neurorehabilitation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_1",
            "start": 509,
            "end": 814,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_1@3",
            "content": "Overall, the neurostimulation community should strongly thank the authors for investing their know-how, time and effort to carry over this type of animal research and we all should encourage them to pursue their efforts in the future.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_1",
            "start": 816,
            "end": 1049,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_2@0",
            "content": "GENERAL POINTS",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_2",
            "start": 0,
            "end": 13,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_3@0",
            "content": "The only limitation of the current manuscript is related to the difficulties in interpreting null outcomes; in this case a triple negative result.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_3",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_3@1",
            "content": "Not only did low field pulsed magnetic stimulation prove unable to modify visual learning behavior or hippocampus spine density in these two population of mice but neither of the two showed (as should have been at least expected) significant differences in any of these two measures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_3",
            "start": 147,
            "end": 429,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_3@2",
            "content": "The authors do an excellent job going over the different possibilities that could explain this null pattern of outcomes, even if they do not have much basis to rule out any of the hypotheses in particular.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_3",
            "start": 431,
            "end": 635,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_3@3",
            "content": "Among other important issues, the study emphasizes once more the importance of task titration.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_3",
            "start": 637,
            "end": 730,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_3@4",
            "content": "Task titration is strongly related to animal motivation (and thus intake restriction) and is a key variable and therefore needs to be manipulated carefully to make sure that the potentially effective impact of magnetic pulses can be demonstrated behaviorally.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_3",
            "start": 732,
            "end": 990,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_3@5",
            "content": "With regards to the question however of whether or not increasing food restriction could have rendered, as the authors suggest, behavioral learning tests more sensitive, the answer remains unknown.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_3",
            "start": 992,
            "end": 1188,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_3@6",
            "content": "It could also be that highly motivated animals would rapidly show ceiling learning effects and render the task less sensitive to modulation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_3",
            "start": 1190,
            "end": 1329,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_3@7",
            "content": "To this reviewer, the performance of both groups of animals in the inversion phase of the task seems to show enough room for behavioral improvement, even after 5 weeks of stimulation; thus it is tempting to also speculate that such a complex task for a rodent (which relies on several cognitive processes such as visuo-spatial attention, visual perception, visual, spatial and declarative memory, associative rewarded learning, rule understanding and switching and decision making) may not have been well suited to the functions of the brain regions aimed at in this study and/or that their impact could have rapidly compensated for by other systems or regions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_3",
            "start": 1331,
            "end": 1991,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_4@0",
            "content": "Adding to the authors’ arguments with regards to the lack of spine density effects, one could also argue that a direct impact of the stimulation (and not an indirect effect of the stimulation on learning behavior driving subsequent effects on memory related regions) on such measures could and should have occurred primarily in the cortical regions overlying the hippocampus (which have not been analysed in this study) rather than in the more deeply located hippocampus CA1 and DG neurons.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_4",
            "start": 0,
            "end": 489,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_4@1",
            "content": "Of course, if the targeted region theoretically related to the behavior that is being measured is not at least directly or indirectly impacted and modified in activity by the pulses, then no behavioral differences between sham and real rTMS patterns should be expected in either population of mice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_4",
            "start": 491,
            "end": 788,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_4@2",
            "content": "All these explanations are directly or indirectly mentioned in the discussion and when not explicitly mentioned in the text, they emerge logically from the results.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_4",
            "start": 790,
            "end": 953,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_4@3",
            "content": "However any effort to nuance and expand such justifications even further would be welcome.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_4",
            "start": 955,
            "end": 1044,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_5@0",
            "content": "To this reviewer, the only possibility (that would also be compatible with the negative outcomes of this study) that is not explicitly mentioned in the discussion is that the delivered low field pulsed magnetic patterns (even if estimated by means of a Hall device in postmortem brains as reaching intensities of ~6 mT in the hippocampus) were not effective at all.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_5",
            "start": 0,
            "end": 364,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_5@1",
            "content": "Several reasons that could account for that eventuality are; that the field was too weak to penetrate deep enough with a minimal intensity, imprecise widely distributed targeting or a field strongly attenuated by the space left, as indicated in the manuscript, between the stimulating coil and the top of the head.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_5",
            "start": 366,
            "end": 679,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_5@2",
            "content": "This reviewer cannot demonstrate that this possibility is more likely than any of the others already mentioned in the manuscript.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_5",
            "start": 681,
            "end": 809,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_5@3",
            "content": "Nonetheless, in the absence of any positive sign of a stimulatory impact, this possibility cannot be ruled out and should probably be briefly discussed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_5",
            "start": 811,
            "end": 962,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_5@4",
            "content": "Additionally, it should be clear throughout the manuscript, that the ability of the current experiment to highlight the innocuity of 5 weeks of low field pulsed magnetic brain stimulation needs to be interpreted carefully and associated with the field strengths delivered by the modified e-cell device by Global Energy Medicine, which is far from the normal field strength for TMS/rTMS devices operated in humans for either research or therapeutic purposes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_5",
            "start": 964,
            "end": 1420,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_6@0",
            "content": "MINOR COMMENTS AND SUGGESTIONS",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_6",
            "start": 0,
            "end": 29,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_7@0",
            "content": "- Introduction, Page 1, Col 1, Par 1, Line 6. Could the authors re-evaluate the adequacy of the term “metaplasticity” with regards to TMS-induced LTP effects, as to this reviewer, the main effect of high frequency stimulation are LTP or LTP-like effects. Metaplasticity is a consequence of forcing homeostatic plasticity beyond a particular boundary, which may result in paradoxical modulatory effects.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_7",
            "start": 0,
            "end": 401,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_8@0",
            "content": "- Introduction, Page 1, Col 1, Par 2, Lines 7-9 . With regards to this issue, in this particular study were the authors hypothesizing a direct impact of low field pulsed magnetic stimulation on specific cortical locations translated through connectivity into a declarative and spatial memory region such as the hippocampus, or a cortical effect of stimulation leading to subsequent changes in behavior that could leave a distinctive memory trace in the hippocampus?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_8",
            "start": 0,
            "end": 464,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_9@0",
            "content": "- Introduction, Page 1, Col 1, Par 3 . The paper by May et al. 2007, Cereb. Cortex, in which the effect of 5 straight days of rTMS on humans assessed with MRI methods and regional size increases (hypothetically attributed to increases in spine density) could be relevant for this introduction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_9",
            "start": 0,
            "end": 292,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_10@0",
            "content": "- Methods, Page 1, Col 2, Par 1, Lines 7-8. Could the authors provide an idea of how far in their development (if possible in age compared to humans) are 8-10 week old mice? It seems that in a prior study by the same authors that showed significant results after 14 days of low field rTMS on the visual cortex by Rodger et al. 2012, FASEB J, the mice were slightly younger (6-8 weeks). Is this period crucial in terms of postnatal development for mice? Could a less plastically sensitive brain of 8-10 week old mice vs. 6-8 week old mice explain the current null results? Please comment briefly in the manuscript.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_10",
            "start": 0,
            "end": 612,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_11@0",
            "content": "- Methods, Page 2, Col 2, Par 2, Lines 6-7. Why were mice tested before the low field pulsed magnetic stimulation session and not also immediately thereafter, when the impact of the stimulation should have been stronger? Although I understand the authors sought a long-term effect, such a measure could have proven useful to reveal at least an immediate day-to-day impact of stimulation and become a proof of their efficacy? Given the order of events, one could be tempted to speculate the possibility of non-synergistic interaction between the lasting effects of task practice and immediately subsequent low field rTMS stimulation, cancelling the modulatory effects.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_11",
            "start": 0,
            "end": 666,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_12@0",
            "content": "- Methods, Page 3, Col 1, Par 2, Lines 7-8 . As this is not a standard rTMS stimulation device, some additional information on the stimulation source should be given to be able to compare the efficiency of low field pulsed magnetic stimulation with current human rTMS equipment. More specifically, what is the shape of the stimulating pulse (monophasic, biphasic?) and what is the rise time of the field? The pattern of stimulation used seems essentially an “excitatory” 10 Hz rTMS pattern, preceded and followed by short instances of ~6 Hz stimulation. Was this high frequency employed as a way to induce LTP phenomena in the hippocampus or as a tool to enhance cortical excitability and facilitate learning behavior leading then to functional and anatomical modulations of the hippocampus? Please comment briefly.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_12",
            "start": 0,
            "end": 814,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_13@0",
            "content": "- Methods, Page 3, Col 1, Par 2, Lines 7-8. Navigation of the TMS coil of course could have been improved given the high-focality of the device used by the authors and the fact that any small head movements in a small rodent brain could easily lead to a completely different area of stimulation. It is true that prior studies in awake felines by our own group (see Valero-Cabré et al . 2006, Exp Brain , Valero-Cabre A et al. 2008, Eur J Neurosci. ) have used a similar manual procedure, but it is also the case that the coils and brains in those studies were larger and precise location on a specific region of the posterior parietal cortex was guided day to day by stereotaxic based measures and references. In many instances, we additionally benefited from parietal bone transparency during surgery, and identified in each animal the sulci/gyral pattern and labelled the exact area of interest (see Valero-Cabré et al . 2005 Exp Brain Res, Valero-Cabré et al .2007 Exp Brain Res ). Furthermore, in groups that were to be followed longitudinally, we placed a dental acrylic plug, that could be palpated through the skin of the scalp (see Afifi et al. 2012 Eur J Neurosci ) which was then used as consistent localization marker. The correct positioning of those plugs with regards to the stimulated areas was often verified pre-treatment by anatomical MRI methods and also in post-mortem brain dissections at the end of the follow up. In the current study, given the elongated shape of the hippocampus in rodents, which part of the rodent cortex or which stereotaxic level was aimed at during the stimulation? Also, in contrast with the quoted feline study, the authors indicate here that the coil was not in direct contact with the scalp. As air is a strong isolator, could that have attenuated the strength of such a low intensity field even further? Were Hall probe field measures in the hippocampus performed with the stimulating cell also separated from the scalp?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_13",
            "start": 0,
            "end": 1969,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_14@0",
            "content": "- Discussion, Page 5, Col 1, Par 1, Lines 4-6. The statement “ The absence of observed behavioral and structural change is consistent with previously reported rTMS specificity for abnormal systems ” needs to be expanded upon as the Ephrin-A2-/- mice have indeed abnormal systems. Maybe a short comment on how to reconcile the current findings with those reported in Rodger et al. 2012, FASEB J , would be important as in that study by the same authors similar stimulation patterns were able to correct cortico-collicular connectivity only in Ephrin-A2-/- and not in Wild type mice, supporting the above-mentioned statement.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_14",
            "start": 0,
            "end": 622,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_15@0",
            "content": "- Discussion, Page 5, Col 1, Par 1, Lines 6-8 . I would strongly advise the authors to alter the contents of the sentence “ Furthermore, the lack of adverse effects in our long term study contributes evidence that rTMS is safe to use in healthy control participants ”. Could they rephrase to something like “Furthermore, the lack of adverse effects in our long term study suggests that up to 5 weeks of daily sessions (35 session) of low field pulsed magnetic stimulation at the parameters used in this study appears safe to use in healthy participants”. This is important as the intensity levels employed are very different of those employed in human rTMS, which are much higher, and this information could have some public health implications for future use of rTMS in humans.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_15",
            "start": 0,
            "end": 777,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_16@0",
            "content": "- Discussion, Page 5, Col 2, Par 1, Lines 19-21 . Please check the accuracy of the sentence “ To our knowledge, there have been no studies assessing cognitive effects of long-term rTMS in patients and healthy controls, which presents a large gap in knowledge ”",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_16",
            "start": 0,
            "end": 259,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_17@0",
            "content": "- Discussion, Page 5, Col 2, Par 1, Lines 21-22 . As indicated above (comment 10), would the authors agree to rewrite the sentence “ Although more research is needed, our results support that rTMS is safe to use in healthy control participants… ” and revise the second part of it “ … invaluable in assessment of rTMS effects clinically ” which to this reviewer is confusing?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_17",
            "start": 0,
            "end": 373,
            "label": {}
        },
        {
            "ix": "2-180_v1_report1747_18@0",
            "content": "- Discussion, Page 5, Col 2, Par 2, Lines 5-8. This sentence can be a bit surprising to readers, why did the authors chose a knock out for Ephrine A2 in a study that aimed to analyze spine density in the hippocampus if as they affirm in this paragraph, this molecule is not involved in spine dynamics? Maybe the rational for that choice needs to be explained more carefully.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-180_v1_report1747_18",
            "start": 0,
            "end": 373,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_1",
            "tgt_ix": "2-180_v1_report1747_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_2",
            "tgt_ix": "2-180_v1_report1747_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_3",
            "tgt_ix": "2-180_v1_report1747_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_4",
            "tgt_ix": "2-180_v1_report1747_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_5",
            "tgt_ix": "2-180_v1_report1747_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_6",
            "tgt_ix": "2-180_v1_report1747_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_7",
            "tgt_ix": "2-180_v1_report1747_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_8",
            "tgt_ix": "2-180_v1_report1747_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_9",
            "tgt_ix": "2-180_v1_report1747_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_10",
            "tgt_ix": "2-180_v1_report1747_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_11",
            "tgt_ix": "2-180_v1_report1747_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_12",
            "tgt_ix": "2-180_v1_report1747_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_13",
            "tgt_ix": "2-180_v1_report1747_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_14",
            "tgt_ix": "2-180_v1_report1747_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_15",
            "tgt_ix": "2-180_v1_report1747_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_16",
            "tgt_ix": "2-180_v1_report1747_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_17",
            "tgt_ix": "2-180_v1_report1747_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_0",
            "tgt_ix": "2-180_v1_report1747_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_1",
            "tgt_ix": "2-180_v1_report1747_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_1",
            "tgt_ix": "2-180_v1_report1747_1@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_1",
            "tgt_ix": "2-180_v1_report1747_1@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_1",
            "tgt_ix": "2-180_v1_report1747_1@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_2",
            "tgt_ix": "2-180_v1_report1747_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_3",
            "tgt_ix": "2-180_v1_report1747_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_3",
            "tgt_ix": "2-180_v1_report1747_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_3",
            "tgt_ix": "2-180_v1_report1747_3@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_3",
            "tgt_ix": "2-180_v1_report1747_3@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_3",
            "tgt_ix": "2-180_v1_report1747_3@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_3",
            "tgt_ix": "2-180_v1_report1747_3@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_3",
            "tgt_ix": "2-180_v1_report1747_3@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_3",
            "tgt_ix": "2-180_v1_report1747_3@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_4",
            "tgt_ix": "2-180_v1_report1747_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_4",
            "tgt_ix": "2-180_v1_report1747_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_4",
            "tgt_ix": "2-180_v1_report1747_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_4",
            "tgt_ix": "2-180_v1_report1747_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_5",
            "tgt_ix": "2-180_v1_report1747_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_5",
            "tgt_ix": "2-180_v1_report1747_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_5",
            "tgt_ix": "2-180_v1_report1747_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_5",
            "tgt_ix": "2-180_v1_report1747_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_5",
            "tgt_ix": "2-180_v1_report1747_5@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_6",
            "tgt_ix": "2-180_v1_report1747_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_7",
            "tgt_ix": "2-180_v1_report1747_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_8",
            "tgt_ix": "2-180_v1_report1747_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_9",
            "tgt_ix": "2-180_v1_report1747_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_10",
            "tgt_ix": "2-180_v1_report1747_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_11",
            "tgt_ix": "2-180_v1_report1747_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_12",
            "tgt_ix": "2-180_v1_report1747_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_13",
            "tgt_ix": "2-180_v1_report1747_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_14",
            "tgt_ix": "2-180_v1_report1747_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_15",
            "tgt_ix": "2-180_v1_report1747_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_16",
            "tgt_ix": "2-180_v1_report1747_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_17",
            "tgt_ix": "2-180_v1_report1747_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-180_v1_report1747_18",
            "tgt_ix": "2-180_v1_report1747_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "2-180_v1_report1747",
    "meta": {
        "review_id": "2-180_v1_report1747",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "recommendation": "approve",
        "doi": "10.5256/f1000research.2167.r1747",
        "contributors": [
            {
                "surname": "Valero-Cabre",
                "given-names": "Antoni"
            }
        ],
        "ix_counter": 73,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}