{
    "nodes": [
        {
            "ix": "3-67_v2_0",
            "content": "Evidence from molecular dynamics simulations of conformational preorganization in the ribonuclease H active site",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_2",
            "content": "Ribonuclease H1 (RNase H) enzymes are well-conserved endonucleases that are present in all domains of life and are particularly important in the life cycle of retroviruses as domains within reverse transcriptase. Despite extensive study, especially of the E. coli homolog, the interaction of the highly negatively charged active site with catalytically required magnesium ions remains poorly understood. In this work, we describe molecular dynamics simulations of the E. coli homolog in complex with magnesium ions, as well as simulations of other homologs in their apo states. Collectively, these results suggest that the active site is highly rigid in the apo state of all homologs studied and is conformationally preorganized to favor the binding of a magnesium ion. Notably, representatives of bacterial, eukaryotic, and retroviral RNases H all exhibit similar active-site rigidity, suggesting that this dynamic feature is only subtly modulated by amino acid sequence and may primarily be imposed by the distinctive RNase H protein fold.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_4",
            "content": "Ribonuclease H1 (RNase H) proteins are well-conserved endonucleases that are found in all domains of life and cleave the RNA strand of an RNA-DNA duplex substrate. The RNase H active site canonically consists of a highly conserved DED(D) motif ( Figure 1 ), three to four carboxylate-containing residues collectively participating in the binding of catalytically required divalent cations, Mg 2+ under physiological conditions. This active-site sequence motif and requirement for Mg 2+ is widely shared with other nucleases, suggesting a common catalytic mechanism <REF-1> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_5",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Conservation of the ribonuclease H active site. ( A ) Residue conservation among bacterial RNase H homologs mapped onto the structure of ecRNH (PDB ID 2RN2). Highly conserved residues are shown in red, highly variable residues in green, and sites with insufficient data in yellow. Image produced using ConSurf. ( B ) Electrostatic map of the solvent-accessible surface of ecRNH produced using APBS. Red represents regions of negative charge and blue represents regions of positive charge. The active-site residues are represented as sticks in both cases.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_6",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Conservation of the ribonuclease H active site.</title> <p>( <bold>A</bold>) Residue conservation among bacterial RNase H homologs mapped onto the structure of ecRNH (PDB ID 2RN2). Highly conserved residues are shown in red, highly variable residues in green, and sites with insufficient data in yellow. Image produced using ConSurf. ( <bold>B</bold>) Electrostatic map of the solvent-accessible surface of ecRNH produced using APBS. Red represents regions of negative charge and blue represents regions of positive charge. The active-site residues are represented as sticks in both cases.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Conservation of the ribonuclease H active site. ( A ) Residue conservation among bacterial RNase H homologs mapped onto the structure of ecRNH (PDB ID 2RN2). Highly conserved residues are shown in red, highly variable residues in green, and sites with insufficient data in yellow. Image produced using ConSurf. ( B ) Electrostatic map of the solvent-accessible surface of ecRNH produced using APBS. Red represents regions of negative charge and blue represents regions of positive charge. The active-site residues are represented as sticks in both cases.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_7",
            "content": "The best-studied member of the RNase H family is the homolog from Escherichia coli (ecRNH), in which this active-site motif is represented as D10, E48, D70, and D134 <REF-2> ( Figure 2A ). Measurements of the pKa values of the active-site residues indicate perturbed pKa values for D10 and D70 which normalize upon Mg 2+ binding, clearly establishing these residues as critical for interaction with ions <REF-3> . The pH optimum for the RNase H reaction in vitro is approximately 7.5–8.5 <REF-4> , a value at which all active-site residues should be deprotonated <REF-3> and therefore accessible for ion binding.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_8",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Conformational diversity of metal-ion interactions with ecRNH as determined by crystallography. In all cases the backbone and active-site sidechains from ecRNH in the absence of ion (PDB ID 2RN2) are shown in light blue for comparison. ( A ) Structural superposition of the four active-site residues in two structures of ecRNH in the absence of metal ions: 2RN2 (light blue) and 1RNH (dark blue). ( B ) Structural diversity of RNases H in complex with a single Mg 2+ ion: ecRNH (1RDD), green; XMRV WT (4E89), dark cyan; XMRV ΔC (3P1G), maroon; MoMLV ΔC (2HB5), purple. The two deletion mutants (indicated as ΔC) bind Mg 2+ in slightly different positions than do their corresponding full-length proteins and both contain two alternate conformations for E48 and D134. ( C ) Comparison of Mg 2+ and Mn 2+ complexes: ecRNH with Mg 2+ (1RDD), green; ecRNH with Mn 2+ (1G15), orange; HIV RNase H domain with ecRNH helix C insertion with Mn 2+ (3HYF), brown. ( D ) Structural diversity of RNases H in complex with substrate: Homo sapiens RNase H with Ca 2+ ions (2QKK), brown; Bacillus halodurans RNase H with Mn 2+ ions (1ZBI), dark green.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_9",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Conformational diversity of metal-ion interactions with ecRNH as determined by crystallography.</title> <p>In all cases the backbone and active-site sidechains from ecRNH in the absence of ion (PDB ID 2RN2) are shown in light blue for comparison. ( <bold>A</bold>) Structural superposition of the four active-site residues in two structures of ecRNH in the absence of metal ions: 2RN2 (light blue) and 1RNH (dark blue). ( <bold>B</bold>) Structural diversity of RNases H in complex with a single Mg <sup>2+</sup> ion: ecRNH (1RDD), green; XMRV WT (4E89), dark cyan; XMRV &#916;C (3P1G), maroon; MoMLV &#916;C (2HB5), purple. The two deletion mutants (indicated as &#916;C) bind Mg <sup>2+</sup> in slightly different positions than do their corresponding full-length proteins and both contain two alternate conformations for E48 and D134. ( <bold>C</bold>) Comparison of Mg <sup>2+</sup> and Mn <sup>2+</sup> complexes: ecRNH with Mg <sup>2+</sup> (1RDD), green; ecRNH with Mn <sup>2+</sup> (1G15), orange; HIV RNase H domain with ecRNH helix C insertion with Mn <sup>2+</sup> (3HYF), brown. ( <bold>D</bold>) Structural diversity of RNases H in complex with substrate: <italic>Homo sapiens</italic> RNase H with Ca <sup>2+</sup> ions (2QKK), brown; <italic>Bacillus halodurans</italic> RNase H with Mn <sup>2+</sup> ions (1ZBI), dark green.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Conformational diversity of metal-ion interactions with ecRNH as determined by crystallography. In all cases the backbone and active-site sidechains from ecRNH in the absence of ion (PDB ID 2RN2) are shown in light blue for comparison. ( A ) Structural superposition of the four active-site residues in two structures of ecRNH in the absence of metal ions: 2RN2 (light blue) and 1RNH (dark blue). ( B ) Structural diversity of RNases H in complex with a single Mg 2+ ion: ecRNH (1RDD), green; XMRV WT (4E89), dark cyan; XMRV ΔC (3P1G), maroon; MoMLV ΔC (2HB5), purple. The two deletion mutants (indicated as ΔC) bind Mg 2+ in slightly different positions than do their corresponding full-length proteins and both contain two alternate conformations for E48 and D134. ( C ) Comparison of Mg 2+ and Mn 2+ complexes: ecRNH with Mg 2+ (1RDD), green; ecRNH with Mn 2+ (1G15), orange; HIV RNase H domain with ecRNH helix C insertion with Mn 2+ (3HYF), brown. ( D ) Structural diversity of RNases H in complex with substrate: Homo sapiens RNase H with Ca 2+ ions (2QKK), brown; Bacillus halodurans RNase H with Mn 2+ ions (1ZBI), dark green.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_10",
            "content": "Despite extensive study, the interaction of metal ions with the ecRNH active site is poorly understood. Activity has been reported in the presence of Mn 2+ as well as the physiologically relevant Mg 2+ <REF-5> . Significant differences have been observed between the protein’s interactions with Mg 2+ and Mn 2+ . Co-crystallization studies of ecRNH with high concentrations of Mg 2+ find a single bound metal ion <REF-6> ( Figure 2B ). By contrast, co-crystallization with Mn 2+ reveals two bound ions, one associated with residues D10 and D134 (denoted the A site), and one associated with D10, E48, and D70 (denoted the B site) <REF-7> ( Figure 2C ); the B site is similar but not identical to the previously identified Mg 2+ site. Single Mn 2+ sites have been identified in the presence of mutations of E48 and/or D134 <REF-8> , both of which are dispensable for Mn 2+ -dependent activity <REF-9> . Crystallographic studies of related RNases H from the archaeal extremophile Bacillus halodurans <REF-10> and from Homo sapiens <REF-11> in complex with substrate find two bound ions in the active site ( Figure 2D ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_11",
            "content": "Experimental evidence from nuclear magnetic resonance (NMR) studies locates the area surrounding the active site as the region most susceptible to perturbation upon interaction with ions ( Figure 3 ). Titration of Mg 2+ with ecRNH, monitored independently by 1 H and 25 Mg 2+ NMR, suggests that only a single ion binds to the protein in the absence of substrate <REF-5> . The identified binding site has relatively weak affinity; K d has been reported in the micromolar <REF-5> to low millimolar range <REF-12> . The second site may be occupied only upon binding of substrate <REF-8> , possibly due to the presence of high local concentration in the ion cloud of the highly negatively charged nucleic acid molecule. Conformational changes in the active site upon binding the first ion have been suggested as well, with the second site proposed as being responsible for the attenuation of activity at high ion concentrations <REF-13> . Collectively, these results have been used to propose both a one-metal <REF-7> , <REF-8> , 14 and a two-metal <REF-10> , <REF-15> , <REF-16> catalytic mechanism. Computational work using the quantum mechanics/molecular mechanics (QM/MM) method applied to the Bacillus halodurans <REF-17> – <REF-19> and Homo sapiens <REF-20> complexes generally supports the two-metal mechanism.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_12",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "Experimental NMR measurements of the effects of Mg 2+ binding mapped onto the structure of ecRNH. ( A ) Active site residues (yellow) and other DENQ residues (green) that experience perturbation upon Mg 2+ binding <REF-24> . ( B ) Chemical shift perturbation values for sidechain C γδ reflecting the effects of Mg 2+ binding <REF-24> . White corresponds to no chemical shift change, red corresponds to a large change, and non-DENQ residues are shown in light blue. ( C ) Residues previously shown to experience backbone 15 N or 1 H chemical shift changes upon binding Mg 2+ <REF-25> .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_13",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>Experimental NMR measurements of the effects of Mg <sup>2+</sup> binding mapped onto the structure of ecRNH.</title> <p>( <bold>A</bold>) Active site residues (yellow) and other DENQ residues (green) that experience perturbation upon Mg <sup>2+</sup> binding <sup> <xref ref-type=\"bibr\" rid=\"ref-24\">24</xref> </sup>. ( <bold>B</bold>) Chemical shift perturbation values for sidechain <italic>C <sup>&#947;&#948;</sup> </italic> reflecting the effects of Mg <sup>2+</sup> binding <sup> <xref ref-type=\"bibr\" rid=\"ref-24\">24</xref> </sup>. White corresponds to no chemical shift change, red corresponds to a large change, and non-DENQ residues are shown in light blue. ( <bold>C</bold>) Residues previously shown to experience backbone <sup>15</sup>N or <sup>1</sup>H chemical shift changes upon binding Mg <sup>2+</sup> <sup> <xref ref-type=\"bibr\" rid=\"ref-25\">25</xref> </sup>.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "Experimental NMR measurements of the effects of Mg 2+ binding mapped onto the structure of ecRNH. ( A ) Active site residues (yellow) and other DENQ residues (green) that experience perturbation upon Mg 2+ binding <REF-24> . ( B ) Chemical shift perturbation values for sidechain C γδ reflecting the effects of Mg 2+ binding <REF-24> . White corresponds to no chemical shift change, red corresponds to a large change, and non-DENQ residues are shown in light blue. ( C ) Residues previously shown to experience backbone 15 N or 1 H chemical shift changes upon binding Mg 2+ <REF-25> .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_14",
            "content": "RNase H domains are widely distributed in cellular organisms, but also occur as a component of the reverse transcriptase protein found in retroviruses, in which they are required for viral proliferation <REF-21> . For this reason, inhibitors of retroviral RNase H domains, particularly that of HIV, have been widely reported <REF-15> , <REF-22> , although none to date have reached clinical use. Most such inhibitors interact with the active site in the metal-bound state <REF-22> and therefore must be selective for retroviral RNase H domains to find clinical utility. The HIV RNase H domain (hivRNH) has been reported to bind two metal ions even in the absence of substrate <REF-23> , although the reason for this difference in behavior between hivRNH and ecRNH is not clear. The Homo sapiens RNase H domain (hsRNH) has not been structurally characterized in the absence of substrate and its binding behavior is less well understood. However, it has higher sequence identity and is more structurally similar to ecRNH than hivRNH.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_15",
            "content": "Combined nuclear magnetic resonance (NMR) and molecular dynamics (MD) studies of the behavior of the ecRNH active site residues suggest that the residues of the ecRNH active site are preorganized in the apo state for the binding of a single Mg 2+ ion <REF-24> . However, experimental constraints prevent the detailed observation of the protein’s dynamic behavior in the presence of a bound ion at ps-ns timescale. The present work aims to more fully understand the dynamics of ecRNH in the Mg 2+ -bound state through molecular dynamics simulations of ecRNH in the presence of single Mg 2+ ions in various positions in the active site as suggested by crystallographic studies. In addition, the dynamic behavior of the active site in the apo state is compared with homologs from other organisms.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_16",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_17",
            "content": "For each initial protein structure, protonation states for titratable residues were assigned either by experimental measurement (for ecRNH <REF-3> ) or by prediction using the H++ <REF-26> pKa predictor. Unless otherwise specified, all simulations were performed at a pH of 5.5 to recapitulate the conditions used in prior NMR experiments on ecRNH <REF-27> , <REF-28> . It should be noted that the experimental pH optima for the RNase H reaction in vitro are approximately 7.5–8.5 for ecRNH and 8.5–9.5 for ttRNH <REF-4> ; however, NMR data are not available at these pH ranges due to sample precipitation. The active site residue D10 has a pKa of 6.1 in the absence of Mg 2+ ; however, its pKa normalizes in the presence of Mg 2+ <REF-3> and therefore is not expected to be protonated at either the experimental or optimal pH. Crystallographic water molecules were removed from all structures prior to solvation using Schrodinger’s Maestro tool, version 8.5 or 9.1, as distributed in the Desmond software package. Simulations were performed as described <REF-24> , <REF-29> using Desmond academic release 3 or source release 2.4.2.1 <REF-30> . Proteins were described with the Amber99SB force field <REF-31> , solvated with TIP3P water <REF-32> in a cubic box with a 10Å buffer region from solute to box boundary, and neutralized with Cl − ions. Bonds to hydrogen atoms were constrained using the M-SHAKE algorithm <REF-33> . Simulations containing Mg 2+ ions used the Aqvist parameter set <REF-34> . Electrostatics were calculated with the PME method using a 9Å cutoff. All simulations used a 2.5fs inner timestep on a 1-1-3 RESPA cycle and were performed in the NVT ensemble using a Nosé-Hoover thermostat after equilibration to constant box volume for 5ns in the NPT ensemble. All simulations described in this work were run for 100ns unless otherwise noted. These simulation conditions applied to the apo state of RNase H homologs have previously been shown to reproduce NMR data well <REF-35> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_18",
            "content": "Order parameters were calculated by the equation <REF-36> :",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_19",
            "content": "S 2 = 1 2 ( 3 ∑ i = 1 3 ∑ j = 1 3 〈 μ i μ j 〉 2 − 1 )",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_20",
            "content": "in which µ i and µ j represent the x, y, and z components of a unit vector μ → in the direction of a given chemical bond. This represents the long-time limit of the angular reorientational correlation function for a given bond vector.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_21",
            "content": "Protein Data Bank (PDB, RRID:nif-0000-00135) structures used for initiating trajectories are listed, along with their resolutions and any system-specific preparation steps, in Table 1 .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_22",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Crystal structures used to initiate molecular dynamics simulations of RNases H.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_23",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Crystal structures used to initiate molecular dynamics simulations of RNases H.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">PDB ID</th> <th align=\"left\">Protein</th> <th align=\"left\">Source organism</th> <th align=\"left\">Resolution (&#197;)</th> <th align=\"left\">Comments</th> </tr> </thead> <tbody> <tr> <td> <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.rcsb.org/pdb/explore/explore.do?structureId=2rn2\">2RN2</ext-link> <sup> <xref ref-type=\"bibr\" rid=\"ref-37\">37</xref> </sup> </td> <td>ecRNH</td> <td> <italic>Escherichia coli</italic> </td> <td>1.48</td> <td>&#8212;</td> </tr> <tr> <td> <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.rcsb.org/pdb/explore/explore.do?structureId=1rdd\">1RDD</ext-link> <sup> <xref ref-type=\"bibr\" rid=\"ref-6\">6</xref> </sup> </td> <td>ecRNH</td> <td> <italic>Escherichia coli</italic> </td> <td>2.80</td> <td> <italic>E. coli</italic> WT with single bound Mg <sup>2+</sup> ion</td> </tr> <tr> <td> <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.rcsb.org/pdb/explore/explore.do?structureId=1ril\">1RIL</ext-link> <sup> <xref ref-type=\"bibr\" rid=\"ref-38\">38</xref> </sup> </td> <td>ttRNH</td> <td> <italic>Thermus</italic> <break/> <italic>thermophilus</italic> </td> <td>2.80</td> <td>&#8212;</td> </tr> <tr> <td> <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.rcsb.org/pdb/explore/explore.do?structureId=2e4l\">2E4L</ext-link> <sup> <xref ref-type=\"bibr\" rid=\"ref-39\">39</xref> </sup> </td> <td>soRNH</td> <td> <italic>Shewanella</italic> <break/> <italic>oneidensis</italic> </td> <td>2.00</td> <td>&#8212;</td> </tr> <tr> <td> <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.rcsb.org/pdb/explore/explore.do?structureId=3h08\">3H08</ext-link> <sup> <xref ref-type=\"bibr\" rid=\"ref-40\">40</xref> </sup> </td> <td>ctRNH</td> <td> <italic>Chlorobium</italic> <break/> <italic>tepidum</italic> </td> <td>1.60</td> <td>Missing residues in handle and active-site loop <break/>modeled in from 1RIL</td> </tr> <tr> <td> <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.rcsb.org/pdb/explore/explore.do?structureId=2qk9\">2QK9</ext-link> <sup> <xref ref-type=\"bibr\" rid=\"ref-11\">11</xref> </sup> </td> <td>hsRNH</td> <td> <italic>Homo sapiens</italic> </td> <td>2.55</td> <td>Substrate removed and catalytically inactivating D210N <break/>mutation reversed in Maestro 8.5</td> </tr> <tr> <td> <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.rcsb.org/pdb/explore/explore.do?structureId=3k2p\">3K2P</ext-link> <sup> <xref ref-type=\"bibr\" rid=\"ref-41\">41</xref> </sup> </td> <td>hivRNH</td> <td>HIV</td> <td>2.04</td> <td>Inhibitor and bound metal ions removed in Maestro 9.1; <break/>chosen as the HIV structure with lowest RMSD to the <break/>unbound state (PDB ID 1HRH) with the active-site loop <break/>resolved</td> </tr> <tr> <td> <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.rcsb.org/pdb/explore/explore.do?structureId=3v1o\">3V1O</ext-link> <sup> <xref ref-type=\"bibr\" rid=\"ref-42\">42</xref> </sup> </td> <td>xmrvRNH</td> <td>XMRV</td> <td>1.88</td> <td>Full length XMRV RNase H domain with no bound ion</td> </tr> <tr> <td> <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.rcsb.org/pdb/explore/explore.do?structureId=3p1g\">3P1G</ext-link> <sup> <xref ref-type=\"bibr\" rid=\"ref-43\">43</xref> </sup> </td> <td>xmrvRNH &#916; <italic>C</italic> </td> <td>XMRV</td> <td>1.60</td> <td>Helix C and handle region deletion mutant of XMRV <break/>RNase H domain with single bound Mg <sup>2+</sup> ion</td> </tr> </tbody> </table> <table-wrap-foot> <fn> <p>Summary of crystal structures used as starting points for molecular dynamics simulations of RNase H homologs.</p> </fn> </table-wrap-foot> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Crystal structures used to initiate molecular dynamics simulations of RNases H.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_24",
            "content": "Results and discussion",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results | discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_25",
            "content": "The crystallographic Mg 2+ site is unstable in simulation",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_26",
            "content": "A simulation was initiated from the crystal structure of ecRNH in the Mg 2+ -bound state (PDB ID 1RDD) <REF-6> . However, the position of the ion identified in this structure is not stable in simulation and exits the binding site immediately upon initiation of the trajectory. The ion transiently interacts with the protein at a variety of sites on the protein surface over the course of the 89ns trajectory but never returns to its original position in the active site ( Figure 4A ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_27",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Mg 2+ ion dynamics in a simulation initiated from the ecRNH Mg 2+ -bound crystal structure. ( A ) Occupancy map from an 89ns simulation initiated from the ecRNH structure solved in the presence of Mg 2+ (PDB ID 1RDD), contoured to 0.05% occupancy (corresponding to at least 45ps total residence time). The ion exits the active site and interacts with a variety of regions on the protein surface. ( B ) The active-site region of the 1RDD structure, colored by atomic B-factor. The B-factor of the ion is substantially larger than the surrounding residues, and is in fact larger than the B-factor of any other atom in the structure save crystallographic waters.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_28",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <title>Mg <sup>2+</sup> ion dynamics in a simulation initiated from the ecRNH Mg <sup>2+</sup>-bound crystal structure.</title> <p>( <bold>A</bold>) Occupancy map from an 89ns simulation initiated from the ecRNH structure solved in the presence of Mg <sup>2+</sup> (PDB ID 1RDD), contoured to 0.05% occupancy (corresponding to at least 45ps total residence time). The ion exits the active site and interacts with a variety of regions on the protein surface. ( <bold>B</bold>) The active-site region of the 1RDD structure, colored by atomic B-factor. The B-factor of the ion is substantially larger than the surrounding residues, and is in fact larger than the B-factor of any other atom in the structure save crystallographic waters.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Mg 2+ ion dynamics in a simulation initiated from the ecRNH Mg 2+ -bound crystal structure. ( A ) Occupancy map from an 89ns simulation initiated from the ecRNH structure solved in the presence of Mg 2+ (PDB ID 1RDD), contoured to 0.05% occupancy (corresponding to at least 45ps total residence time). The ion exits the active site and interacts with a variety of regions on the protein surface. ( B ) The active-site region of the 1RDD structure, colored by atomic B-factor. The B-factor of the ion is substantially larger than the surrounding residues, and is in fact larger than the B-factor of any other atom in the structure save crystallographic waters.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_29",
            "content": "Historically, simulation of the behavior of multivalent ions using standard molecular mechanics force fields has been a long-standing challenge <REF-44> . It is therefore possible that the instability of this position in simulation is an artifact of force field errors. However, given that ions in this position are not observed in the substrate-bound structures of RNase H homologs ( Figure 2D ), and that the B-factor of the Mg 2+ ion in the 1RDD structure is much higher than those of the surrounding residues ( Figure 4B ), it is likely that this position does not reflect the most stable conformation of the protein-ion complex in solution.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_30",
            "content": "Both the crystallographic A and B sites are stable in simulation",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_31",
            "content": "Additional simulations were carried out under the same conditions for single Mg 2+ ions in each of the two Mn 2+ binding sites identified for ecRNH. Because the crystal structure of ecRNH solved in the presence of Mn 2+ (PDB ID 1G15) exhibits disorder in both the active-site and handle loops <REF-7> , the ion positions were instead modeled into the apo ecRNH structure (PDB ID 2RN2) by superposition. For the model of the B-site Mg 2+ ion, the rotamer of E48 was also corrected to match the orientation observed in the 1G15 structure. For comparison to an alternative homolog, the Mg 2+ ion in the B site was also modeled into the RNase H structure from the thermophilic bacterium Thermus thermophilus (ttRNH, PDB ID 1RIL), whose structure was also solved in the absence of divalent ions <REF-38> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_32",
            "content": "Mg 2+ ions were found to be stably associated with the ecRNH active site in both simulations, despite the fact that the ions were modeled into a structure that did not originally contain them ( Figure 5 ). This observation clearly supports the hypothesis that conformational preorganization in the active site promotes ion binding. It is possible that the effectiveness of this modeling procedure was facilitated by a well-documented feature of crystal packing in ecRNH, in which the amino group of a lysine sidechain in a neighboring molecule inserts into the negatively charged active site in a position approximating the B site <REF-8> . However, a short simulation of ttRNH, whose structure does not contain this contact, with Mg 2+ modeled into the B site was also stable, suggesting that crystal contacts in ecRNH are not responsible for the observation of preorganization in its active site.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_33",
            "content": "Figure 5.",
            "ntype": "label",
            "meta": {
                "id": "f5",
                "caption": "Mg 2+ ion dynamics in an ecRNH simulation initiated with single ions in the A and B sites. ( A ) Occupancy maps contoured at 10% occupancy for the A site (blue) and B site (green). Neither ion leaves the active site over the 100ns trajectory length. ( B ) Closer view of the active site in which the four active-site residues in apo ecRNH and the positions of the two Mn 2+ from which the trajectories were initiated (derived from PDB ID 1G15) are shown for comparison.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_34",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f5\" position=\"float\"> <caption> <title>Mg <sup>2+</sup> ion dynamics in an ecRNH simulation initiated with single ions in the A and B sites.</title> <p>( <bold>A</bold>) Occupancy maps contoured at 10% occupancy for the A site (blue) and B site (green). Neither ion leaves the active site over the 100ns trajectory length. ( <bold>B</bold>) Closer view of the active site in which the four active-site residues in apo ecRNH and the positions of the two Mn <sup>2+</sup> from which the trajectories were initiated (derived from PDB ID 1G15) are shown for comparison.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure5.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f5",
                "caption": "Mg 2+ ion dynamics in an ecRNH simulation initiated with single ions in the A and B sites. ( A ) Occupancy maps contoured at 10% occupancy for the A site (blue) and B site (green). Neither ion leaves the active site over the 100ns trajectory length. ( B ) Closer view of the active site in which the four active-site residues in apo ecRNH and the positions of the two Mn 2+ from which the trajectories were initiated (derived from PDB ID 1G15) are shown for comparison.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_35",
            "content": "The active site is conformationally preorganized for ion binding in the B site",
            "ntype": "title",
            "meta": {
                "section": "3.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_36",
            "content": "The presence of Mg 2+ located in either the A or the B site did not substantially affect the dynamics of the active-site residues as determined by S 2 . All four residues remain highly rigid in the presence of a Mg 2+ ion in either position ( Figure 6 ). The major difference between the unbound, A site, and B site trajectories’ sidechain dynamics was observed in a short loop between helix D and β- sheet 5. Experiments have demonstrated dynamics in this region on the ps-ns timescale, suggesting that the loop is simply incompletely sampled in 100ns simulations rather than significantly perturbed by ion binding. No significant differences in the behavior of these residues upon introduction of ions are observed experimentally <REF-24> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_37",
            "content": "Figure 6.",
            "ntype": "label",
            "meta": {
                "id": "f6",
                "caption": "Differences in DENQ sidechain S 2 values in the presence of Mg 2+ ions in ecRNH. Calculated S 2 values are shown for various simulation conditions with standard errors of the mean: ecRNH apo (light blue), A site (dark blue), B site (green). The four active-site residues are indicated with red triangles. In no case does the difference between any two simulations reach statistical significance.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure6.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_38",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f6\" position=\"float\"> <caption> <title>Differences in DENQ sidechain <italic>S</italic> <sup>2</sup> values in the presence of Mg <sup>2+</sup> ions in ecRNH.</title> <p>Calculated <italic>S</italic> <sup>2</sup> values are shown for various simulation conditions with standard errors of the mean: ecRNH apo (light blue), A site (dark blue), B site (green). The four active-site residues are indicated with red triangles. In no case does the difference between any two simulations reach statistical significance.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure6.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f6",
                "caption": "Differences in DENQ sidechain S 2 values in the presence of Mg 2+ ions in ecRNH. Calculated S 2 values are shown for various simulation conditions with standard errors of the mean: ecRNH apo (light blue), A site (dark blue), B site (green). The four active-site residues are indicated with red triangles. In no case does the difference between any two simulations reach statistical significance.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure6.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_39",
            "content": "Of the four conserved catalytic residues, D134 is known to be somewhat dispensable; catalytic activity is retained, though reduced, by substitutions with N or H, which also increase thermostability <REF-45> . In conjunction with crystallographic evidence, this suggests that the B site is occupied in the absence of substrate. Because measurements of the sidechain 13 C γδ resonances by NMR could not clearly distinguish the behavior of D134 (the unique participant in the A site) from E48 (the unique participant in the B site) <REF-24> , comparisons of the two trajectories provide an additional opportunity to distinguish between these two sites.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_40",
            "content": "Although single metal ions in both sites were stably bound to the protein, the RMSD over the course of each 100ns trajectory was larger for the ion in the A site (1.2Å) compared to the B site (0.6Å), which in turn is similar to the RMSD of a 30ns control simulation of ttRNH with an ion modeled into the B site (0.6Å). Additionally, a small amount of motion in the direction of the B site was observed for the ion in the A site; the initial and final positions differ by 1.7Å ( Figure 5 ). (By comparison, the A and B sites are about 4Å apart.)",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_41",
            "content": "Distinct conformations were also observed for several neighboring residues, reflecting reorganization of local hydrogen bonding networks to accommodate ion binding in each of the two sites. N45 does not differ significantly in sidechain rigidity between the two trajectories, but it does differ in conformation: in the A site trajectory, it is oriented away from the substrate-binding site and participates in a network of interactions that also includes the conserved site T43, while in the B site trajectory N45 is primarily oriented into solvent and occupies the rotamer found in the hsRNH-substrate complex.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_42",
            "content": "The hydrogen-bonding network surrounding D134 unsurprisingly differs considerably between the A and B site trajectories. Occupancy of inter-sidechain hydrogen bonds in this region is summarized in Table 2 . H124, which interacts with substrate in the hsRNH complex and is known to be associated with product release, forms hydrogen bonds with D134 in the B site trajectory, partially displacing one of the hydrogen bonds formed between D134 and R138 in the apo trajectory. By contrast, H124 interacts primarily with E131 in the A site trajectory, while D134 coordinates Mg 2+ in a monodentate manner, partially displacing the R138-D134 interaction. This conformation too is at odds with experimental evidence, since E131 experiences minimal chemical shift perturbation upon Mg 2+ binding <REF-24> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_43",
            "content": "Table 2.",
            "ntype": "label",
            "meta": {
                "id": "T2",
                "caption": "Hydrogen bond occupancy in the network surrounding D134 in ecRNH.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_44",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T2\" position=\"anchor\"> <caption> <title>Hydrogen bond occupancy in the network surrounding D134 in ecRNH.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">H-bond</th> <th align=\"left\">Apo</th> <th align=\"left\">A Site</th> <th align=\"left\">B Site</th> </tr> </thead> <tbody> <tr> <td>H124-E131</td> <td>2.2%</td> <td>47.0%</td> <td>16.7%</td> </tr> <tr> <td>H124-D134</td> <td>0.8%</td> <td>1.5%</td> <td>23.8%</td> </tr> <tr> <td>H124-E135</td> <td>0%</td> <td>0%</td> <td>0.3%</td> </tr> <tr> <td>R138-E131</td> <td>0%</td> <td>11.3%</td> <td>0%</td> </tr> <tr> <td>R138-D134</td> <td>74.1%</td> <td>48.4%</td> <td>65.5%</td> </tr> <tr> <td>R138-E135</td> <td>43.4%</td> <td>29.8%</td> <td>50.1%</td> </tr> </tbody> </table> <table-wrap-foot> <fn> <p>Comparison of hydrogen-bonding environments in the network surrounding the active-site residue D134 in the apo trajectory of ecRNH compared to trajectories containing an Mg <sup>2+</sup> ion in either the A or the B site. Hydrogen bonds were considered formed if the donor-acceptor distance was less than 3.1&#197; and the donor-hydrogen-acceptor angle was less than 25&#176;.</p> </fn> </table-wrap-foot> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T2",
                "caption": "Hydrogen bond occupancy in the network surrounding D134 in ecRNH.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_45",
            "content": "Figure 7.",
            "ntype": "label",
            "meta": {
                "id": "f7",
                "caption": "Hydrogen-bonding environment of the A site of hsRNH in complex with substrate. Interactions between D134, R138, metal ion A, and the phosphate backbone of the RNA strand are shown (PDB ID 2QKK). An asterisk indicates the scissile phosphate. The preorganization of the R138-D134 salt bridge in the apo state of ecRNH likely minimizes the entropic cost of forming this interaction upon substrate binding.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure7.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_46",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f7\" position=\"float\"> <caption> <title>Hydrogen-bonding environment of the A site of hsRNH in complex with substrate.</title> <p>Interactions between D134, R138, metal ion A, and the phosphate backbone of the RNA strand are shown (PDB ID 2QKK). An asterisk indicates the scissile phosphate. The preorganization of the R138-D134 salt bridge in the <italic>apo</italic> state of ecRNH likely minimizes the entropic cost of forming this interaction upon substrate binding.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure7.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f7",
                "caption": "Hydrogen-bonding environment of the A site of hsRNH in complex with substrate. Interactions between D134, R138, metal ion A, and the phosphate backbone of the RNA strand are shown (PDB ID 2QKK). An asterisk indicates the scissile phosphate. The preorganization of the R138-D134 salt bridge in the apo state of ecRNH likely minimizes the entropic cost of forming this interaction upon substrate binding.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure7.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_47",
            "content": "These results collectively add to prior experimental evidence that the B site is the primary site for metal ion binding in the absence of substrate. Furthermore, the presence of a metal ion in the B site may induce reorganization of the surrounding sidechains into conformations conducive to subsequent substrate binding.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_48",
            "content": "Rigidity of active-site sidechains is conserved within the RNase H family",
            "ntype": "title",
            "meta": {
                "section": "3.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_49",
            "content": "Given that all known RNase H homologs have extremely similar active-site structures, it is likely that measurements made on the ecRNH protein can be generalized to other RNase H homologs. S 2 MD values were therefore calculated from previous simulations of the four handle-region-containing bacterial RNase H homologs of known structure, as well as for hsRNH in the absence of substrate <REF-29> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_50",
            "content": "As might be expected from the high level of structural conservation in the active-site region, the five handle-region-containing RNase H homologs compared differ very little in the dynamics of their active site residues ( Figure 9 ). Notably, the trajectory initiated from the hsRNH structure, which was solved in the presence of substrate and which contained a Na + ion in a position similar to the B site in ecRNH, differs very little from trajectories initiated from any other RNase H structure lacking these additional components. This observation provides strong support for the interpretation that the rigid active-site residues are conformationally preorganized for metal-ion interactions even in the unbound state.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_51",
            "content": "In order to better understand the relationships between dynamic processes in RNase H domains of retroviral origin compared to those from cellular organisms, additional simulations in the absence of divalent ions were performed on a set of retroviral RNase H homologs, whose sequences are shown in Figure 8 . In brief, no significant differences are observed between simulations initiated from the XMRV full-length structure compared to its ΔC mutant (in which helix C and the handle region are removed), between the XMRV ΔC mutant compared to the HIV homolog (which naturally lacks the handle sequence), or between any of the retroviral domains compared to ecRNH ( Figure 9 ). This result suggests that the preorganization of the active site on the ps-ns timescale is not significantly altered by differences in amino acid sequence among the subset of family members examined.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_52",
            "content": "Figure 8.",
            "ntype": "label",
            "meta": {
                "id": "f8",
                "caption": "Multiple sequence alignment of RNase H homologs. The Promals3D <REF-46> structural alignment of the PDB structures used to initiate simulations (see Table 1 ) is shown with active-site residues highlighted in yellow. Residues that form contacts with substrate in the hsRNH complex (PDB ID 2QK9) are highlighted in orange. The ΔC deletion of XMRV is shown in green. The catalytically inactivating D70N mutation in 2QK9 has been reversed and missing residues from the ctRNH structure (PDB ID 3H08) have been filled in for clarity. Residues are numbered relative to ecRNH. Figure prepared with UCSF Chimera <REF-47> .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure8.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_53",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f8\" position=\"float\"> <caption> <title>Multiple sequence alignment of RNase H homologs.</title> <p>The Promals3D <sup> <xref ref-type=\"bibr\" rid=\"ref-46\">46</xref> </sup> structural alignment of the PDB structures used to initiate simulations (see <xref ref-type=\"table\" rid=\"T1\">Table 1</xref>) is shown with active-site residues highlighted in yellow. Residues that form contacts with substrate in the hsRNH complex (PDB ID 2QK9) are highlighted in orange. The &#916;C deletion of XMRV is shown in green. The catalytically inactivating D70N mutation in 2QK9 has been reversed and missing residues from the ctRNH structure (PDB ID 3H08) have been filled in for clarity. Residues are numbered relative to ecRNH. Figure prepared with UCSF Chimera <sup> <xref ref-type=\"bibr\" rid=\"ref-47\">47</xref> </sup>.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure8.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f8",
                "caption": "Multiple sequence alignment of RNase H homologs. The Promals3D <REF-46> structural alignment of the PDB structures used to initiate simulations (see Table 1 ) is shown with active-site residues highlighted in yellow. Residues that form contacts with substrate in the hsRNH complex (PDB ID 2QK9) are highlighted in orange. The ΔC deletion of XMRV is shown in green. The catalytically inactivating D70N mutation in 2QK9 has been reversed and missing residues from the ctRNH structure (PDB ID 3H08) have been filled in for clarity. Residues are numbered relative to ecRNH. Figure prepared with UCSF Chimera <REF-47> .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure8.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_54",
            "content": "Figure 9.",
            "ntype": "label",
            "meta": {
                "id": "f9",
                "caption": "Active-site dynamics in RNase H homologs. Calculated S 2 values are shown for the four active-site residues in RNase H homologs. Left: soRNH (dark blue), ecRNH (light blue), ctRNH (magenta), ttRNH (red), hsRNH (purple). Right: ecRNH (light blue), XMRV WT (green), XMRV ΔC (yellow), HIV (brown). All simulations were carried out at 300K in the AMBER99SB force field with TIP3P water with structures protonated to reflect a pH of 5.5.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure9.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_55",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f9\" position=\"float\"> <caption> <title>Active-site dynamics in RNase H homologs.</title> <p>Calculated <italic>S</italic> <sup>2</sup> values are shown for the four active-site residues in RNase H homologs. Left: soRNH (dark blue), ecRNH (light blue), ctRNH (magenta), ttRNH (red), hsRNH (purple). Right: ecRNH (light blue), XMRV WT (green), XMRV &#916;C (yellow), HIV (brown). All simulations were carried out at 300K in the AMBER99SB force field with TIP3P water with structures protonated to reflect a pH of 5.5.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure9.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f9",
                "caption": "Active-site dynamics in RNase H homologs. Calculated S 2 values are shown for the four active-site residues in RNase H homologs. Left: soRNH (dark blue), ecRNH (light blue), ctRNH (magenta), ttRNH (red), hsRNH (purple). Right: ecRNH (light blue), XMRV WT (green), XMRV ΔC (yellow), HIV (brown). All simulations were carried out at 300K in the AMBER99SB force field with TIP3P water with structures protonated to reflect a pH of 5.5.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/4800/955a73de-9194-4a70-bcc3-db134900f61d_figure9.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_56",
            "content": "Conclusions",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "conclusions",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_57",
            "content": "In this work we aimed to use molecular dynamics simulations to understand the dynamic behavior of the RNase H family in complex with catalytically required Mg 2+ ions. We observe that the well-studied RNase H homolog from E. coli contains a conformationally preorganized active site that is highly rigid on the ps-ns timescale in the presence of a single Mg 2+ ion, which is likely located at the B site crystallographically identified by examining the Mn 2+ complex. Additionally, we examined the apo state dynamics of the active site—previously validated by comparison to NMR data in the case of the E. coli homolog <REF-24> —and found that similar patterns of active-site rigidity are present in all homologs examined, including representatives of bacterial, eukaryotic, and retroviral RNases H. This result suggests that the dynamics of the active site residues are only subtly modulated by the amino acid sequence variations present among structurally characterized family members. Instead, we hypothesize that this behavior is imposed by the overall protein fold, the topology of which serves to force the negatively charged active-site residues into proximity with one another. Although it has long been recognized that RNases H share similar topologies and active-site conformations with other endonucleases <REF-48> , the present work extends this observation from static crystal structures to dynamics on the ps-ns timescale.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_58",
            "content": "Simulations of the Homo sapiens RNase H homolog and the Thermus thermophilus argonaute protein (a distant RNase H homolog with similar active-site architecture) in complex with two Mg 2+ ions and substrate analogs also observe high active-site rigidity <REF-49> ; this is consistent with the present data and implies that active-site preorganization is a general property of this larger family of nucleases. Recent analysis of the larger RNase H-like superfamily identifies a common catalytic core in which the relative orientation of the active-site residues correlates with function, distinguishing endonucleases such as RNase H1 from exonuclease family members <REF-50> . Although selective inhibitors of the HIV RNase H domain have been developed based on the hypothesis that the metal ion dependence of the HIV domain’s catalytic mechanism differs from that of the human homolog <REF-15> , it is likely that the physical origin of this selectivity is not dependent on the active-site conformations sampled on the ps-ns timescale.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_59",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_60",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2014 Stafford KA and Palmer III AG",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_61",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_62",
            "content": "ZENODO: Molecular dynamics derived side chain order parameters for Asp, Glu, Asn, and Gln residues in ribonucleases H, and molecular dynamics trajectories for E. coli ribonuclease H, doi:10.5281/zenodo.8431 <REF-51>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_63",
            "content": "<REF-1> Tadokoro T Kanaya S : Ribonuclease H: molecular diversities, substrate binding domains, and catalytic mechanism of the prokaryotic enzymes. FEBS J. 2009 ; 276 ( 6 ): 1482 – 1493 . 19228197 10.1111/j.1742-4658.2009.06907.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_64",
            "content": "<REF-2> Kanaya S Kohara A Miura Y : Identification of the amino acid residues involved in an active site of Escherichia coli ribonuclease H by site-directed mutagenesis. J Biol Chem. 1990 ; 265 ( 8 ): 4615 – 4621 . 1689729",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_65",
            "content": "<REF-3> Oda Y Yamazaki T Nagayama K : Individual ionization constants of all the carboxyl groups in ribonuclease HI from Escherichia coli determined by NMR. Biochemistry. 1994 ; 33 ( 17 ): 5275 – 5284 . 7909691 10.1021/bi00183a034",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_66",
            "content": "<REF-4> Kanaya S Itaya M : Expression, purification, and characterization of a recombinant ribonuclease H from Thermus thermophilus HB8. J Biol Chem. 1992 ; 267 ( 14 ): 10184 – 10192 . 1315754",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_67",
            "content": "<REF-5> Huang HW Cowan JA : Metallobiochemistry of the magnesium ion. Characterization of the essential metal-binding site in Escherichia coli ribonuclease H. Eur J Biochem. 1994 ; 219 ( 1–2 ): 253 – 260 . 8306992 10.1111/j.1432-1033.1994.tb19936.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_68",
            "content": "<REF-6> Katayanagi K Okumura M Morikawa K : Crystal structure of Escherichia coli RNase HI in complex with Mg2+ at 2.8 A resolution: proof for a single Mg(2+)-binding site. Proteins. 1993 ; 17 ( 4 ): 337 – 346 . 8108376 10.1002/prot.340170402",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_69",
            "content": "<REF-7> Goedken ER Marqusee S : Co-crystal of Escherichia coli RNase HI with Mn2+ ions reveals two divalent metals bound in the active site. J Biol Chem. 2001 ; 276 ( 10 ): 7266 – 7271 . 11083878 10.1074/jbc.M009626200",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_70",
            "content": "<REF-8> Tsunaka Y Takano K Matsumura H : Identification of single Mn(2+) binding sites required for activation of the mutant proteins of E. coli RNase HI at Glu48 and/or Asp134 by X-ray crystallography. J Mol Biol. 2005 ; 345 ( 5 ): 1171 – 1183 . 15644213 10.1016/j.jmb.2004.11.007",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_71",
            "content": "<REF-9> Tsunaka Y Haruki M Morikawa M : Dispensability of glutamic acid 48 and aspartic acid 134 for Mn2+-dependent activity of Escherichia coli ribonuclease HI. Biochemistry. 2003 ; 42 ( 11 ): 3366 – 3374 . 12641469 10.1021/bi0205606",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_72",
            "content": "<REF-10> Nowotny M Gaidamakov SA Crouch RJ : Crystal structures of RNase H bound to an RNA/DNA hybrid: Substrate specificity and metal-dependent catalysis. Cell. 2005 ; 121 ( 7 ): 1005 – 1016 . 15989951 10.1016/j.cell.2005.04.024",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_73",
            "content": "<REF-11> Nowotny M Gaidamakov SA Ghirlando R : Structure of human RNase H1 complexed with an RNA/DNA hybrid: insight into HIV reverse transcription. Mol Cell. 2007 ; 28 ( 2 ): 264 – 276 . 17964265 10.1016/j.molcel.2007.08.015",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_74",
            "content": "<REF-12> Oda Y Nakamura H Kanaya S : Binding of metal ions to E. coli RNase HI observed by 1H–15N heteronuclear 2D NMR. J Biomol NMR. 1991 ; 1 ( 3 ): 247 – 255 . 1668722 10.1007/BF01875518",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_75",
            "content": "<REF-13> Keck JL Goedken ER Marqusee S : Activation/attenuation model for RNase H: A one-metal mechanism with second-metal inhibition. J Biol Chem. 1998 ; 273 ( 51 ): 34128 – 34133 . 9852071 10.1074/jbc.273.51.34128",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_76",
            "content": "<REF-15> Klumpp K Hang JQ Rajendran S : Two-metal ion mechanism of RNA cleavage by HIV RNase H and mechanism-based design of selective HIV RNase H inhibitors. Nucleic Acids Res. 2003 ; 31 ( 23 ): 6852 – 6859 . 14627818 10.1093/nar/gkg881 290251",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_77",
            "content": "<REF-16> Nowotny M Yang W : Stepwise analyses of metal ions in RNase H catalysis from substrate destabilization to product release. EMBO J. 2006 ; 25 ( 9 ): 1924 – 1933 . 16601679 10.1038/sj.emboj.7601076 1456928",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_78",
            "content": "<REF-17> De Vivo M Dal Peraro M Klein ML : Phosphodiester cleavage in ribonuclease H occurs via an associative two-metal-aided catalytic mechanism. J Am Chem Soc. 2008 ; 130 ( 33 ): 10955 – 10962 . 18662000 10.1021/ja8005786 2745632",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_79",
            "content": "<REF-19> Rosta E Nowotny M Yang W : Catalytic mechanism of RNA backbone cleavage by ribonuclease H from quantum mechanics/molecular mechanics simulations. J Am Chem Soc. 2011 ; 133 ( 23 ): 8934 – 8941 . 21539371 10.1021/ja200173a 3110985",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_80",
            "content": "<REF-20> Elsässer B Fels G : Atomistic details of the associative phosphodiester cleavage in human ribonuclease H. Phys Chem Chem Phys. 2010 ; 12 ( 36 ): 11081 – 8 . 20672157 10.1039/c001097a",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_81",
            "content": "<REF-21> Hostomsky Z Hostomska Z Matthews DA : Ribonucleases H . In Stuart M. Linn and Richard J. Roberts, editors, Nucleases . Cold Spring Harbor Laboratory Press, Cold Spring Harbor, NY 2nd edition. 1993 ; 341 – 376 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_82",
            "content": "<REF-22> Ilina T LaBarge K Sarafianos SG : Inhibitors of HIV-1 Reverse Transcriptase-Associated Ribonuclease H Activity. Biology. 2012 ; 1 ( 3 ): 521 – 541 . 23599900 10.3390/biology1030521 3627382",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_83",
            "content": "<REF-23> Davies JF 2nd Hostomska Z Hostomsky Z : Crystal structure of the ribonuclease H domain of HIV-1 reverse transcriptase. Science. 1991 ; 252 ( 5002 ): 88 – 95 . 1707186 10.1126/science.1707186",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_84",
            "content": "<REF-24> Stafford KA Ferrage F Cho JH : Side chain dynamics of carboxyl and carbonyl groups in the catalytic function of Escherichia coli ribonuclease H. J Am Chem Soc. 2013 ; 135 ( 48 ): 18024 – 18027 . 24219366 10.1021/ja409479y 3918730",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_85",
            "content": "<REF-26> Anandakrishnan R Aguilar B Onufriev AV : H++ 3.0: automating pK prediction and the preparation of biomolecular structures for atomistic molecular modeling and simulations. Nucleic Acids Res. 2012 ; 40 ( Web Server issue ): W537 – W541 . 22570416 10.1093/nar/gks375 3394296",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_86",
            "content": "<REF-27> Butterwick JA Patrick Loria J Astrof NS : Multiple time scale backbone dynamics of homologous thermophilic and mesophilic ribonuclease HI enzymes. J Mol Biol. 2004 ; 339 ( 4 ): 855 – 871 . 15165855 10.1016/j.jmb.2004.03.055",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_87",
            "content": "<REF-28> Butterwick JA Palmer AG : An inserted Gly residue fine tunes dynamics between mesophilic and thermophilic ribonucleases H. Protein Sci. 2006 ; 15 ( 12 ): 2697 – 2707 . 17088323 10.1110/ps.062398606 2242442",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_88",
            "content": "<REF-29> Stafford KA Robustelli P Palmer AG 3rd : Thermal adaptation of conformational dynamics in ribonuclease H. PLoS Comput Biol. 2013 ; 9 ( 10 ): e1003218 . 24098095 10.1371/journal.pcbi.1003218 3789780",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_89",
            "content": "<REF-30> Bowers KJ Chow E Xu H : Scalable algorithms for molecular dynamics simulations on commodity clusters . In Proceedings of the 2006 ACM/IEEE conference on Supercomputing , Tampa, Florida, ACM. 2006 ; 84 . 10.1145/1188455.1188544",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_90",
            "content": "<REF-31> Hornak V Abel R Okur A : Comparison of multiple Amber force fields and development of improved protein backbone parameters. Proteins. 2006 ; 65 ( 3 ): 712 – 725 . 16981200 10.1002/prot.21123",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_91",
            "content": "<REF-32> Jorgensen WL Chandrasekhar J Madura JD : Comparison of simple potential functions for simulating liquid water. J Chem Phys. 1983 ; 79 ( 2 ): 926 – 935 . 10.1063/1.445869",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_92",
            "content": "<REF-33> Kräutler V van Gunsteren WF Hünenberger PH : A fast SHAKE algorithm to solve distance constraint equations for small molecules in molecular dynamics simulations. J Comput Chem. 2001 ; 22 ( 5 ): 501 – 508 . 10.1002/1096-987X(20010415)22:5<501::AID-JCC1021>3.0.CO;2-V",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_93",
            "content": "<REF-34> Aaqvist J : Ion-water interaction potentials derived from free energy perturbation simulations. J Phys Chem. 1990 ; 94 ( 21 ): 8021 – 8024 . 10.1021/j100384a009",
            "ntype": "ref",
            "meta": {
                "id": "ref-34",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_94",
            "content": "<REF-35> Robustelli P Stafford KA Palmer AG 3rd : Interpreting protein structural dynamics from NMR chemical shifts. J Am Chem Soc. 2012 ; 134 ( 14 ): 6365 – 6374 . 22381384 10.1021/ja300265w 3324661",
            "ntype": "ref",
            "meta": {
                "id": "ref-35",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_95",
            "content": "<REF-36> Chandrasekhar I Clore GM Szabo A : A 500 ps molecular dynamics simulation study of interleukin-1 beta in water. Correlation with nuclear magnetic resonance spectroscopy and crystallography. J Mol Biol. 1992 ; 226 ( 1 ): 239 – 250 . 1619653 10.1016/0022-2836(92)90136-8",
            "ntype": "ref",
            "meta": {
                "id": "ref-36",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_96",
            "content": "<REF-38> Ishikawa K Okumura M Katayanagi K : Crystal structure of ribonuclease H from Thermus thermophilus HB8 refined at 2.8 A resolution. J Mol Biol. 1993 ; 230 ( 2 ): 529 – 542 . 8385228 10.1006/jmbi.1993.1169",
            "ntype": "ref",
            "meta": {
                "id": "ref-38",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_97",
            "content": "<REF-44> Mamatkulov S Fyta M Netz RR : Force fields for divalent cations based on single-ion and ion-pair properties. J Chem Phys. 2013 ; 138 ( 2 ): 024505 . 23320702 10.1063/1.4772808",
            "ntype": "ref",
            "meta": {
                "id": "ref-44",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_98",
            "content": "<REF-45> Haruki M Noguchi E Nakai C : Investigating the role of conserved residue Asp134 in Escherichia coli ribonuclease HI by site-directed random mutagenesis. Eur J Biochem. 1994 ; 220 ( 2 ): 623 – 631 . 8125123 10.1111/j.1432-1033.1994.tb18664.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-45",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_99",
            "content": "<REF-48> Yang W Steitz TA : Recombining the structures of HIV integrase, RuvC and RNase H. Structure. 1995 ; 3 ( 2 ): 131 – 134 . 7735828 10.1016/S0969-2126(01)00142-3",
            "ntype": "ref",
            "meta": {
                "id": "ref-48",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_100",
            "content": "<REF-49> Maláč K Barvík I : Complex between human RNase HI and the phosphonate-DNA/RNA duplex: molecular dynamics study. J Mol Graph Model. 2013 ; 44 : 81 – 90 . 23751958 10.1016/j.jmgm.2013.05.004",
            "ntype": "ref",
            "meta": {
                "id": "ref-49",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_101",
            "content": "<REF-50> Majorek KA Dunin-Horkawicz S Steczkiewicz K : The RNase H-like superfamily: new members, comparative structural analysis and evolutionary classification. Nucleic Acids Res. 2014 ; 42 ( 7 ): 4160 – 79 . 24464998 10.1093/nar/gkt1414 3985635",
            "ntype": "ref",
            "meta": {
                "id": "ref-50",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-67_v2_102",
            "content": "<REF-51> Stafford KA Palmer AG III : Molecular dynamics derived side chain order parameters for Asp, Glu, Asn, and Gln residues in ribonucleases H, and molecular dynamics trajectories for E. coli ribonuclease H. ZENODO. 2014 . Data Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-51",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "3-67_v2_0@0",
            "content": "Evidence from molecular dynamics simulations of conformational preorganization in the ribonuclease H active site",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_0",
            "start": 0,
            "end": 111,
            "label": {}
        },
        {
            "ix": "3-67_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "3-67_v2_2@0",
            "content": "Ribonuclease H1 (RNase H) enzymes are well-conserved endonucleases that are present in all domains of life and are particularly important in the life cycle of retroviruses as domains within reverse transcriptase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_2",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "3-67_v2_2@1",
            "content": "Despite extensive study, especially of the E. coli homolog, the interaction of the highly negatively charged active site with catalytically required magnesium ions remains poorly understood.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_2",
            "start": 213,
            "end": 402,
            "label": {}
        },
        {
            "ix": "3-67_v2_2@2",
            "content": "In this work, we describe molecular dynamics simulations of the E. coli homolog in complex with magnesium ions, as well as simulations of other homologs in their apo states.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_2",
            "start": 404,
            "end": 576,
            "label": {}
        },
        {
            "ix": "3-67_v2_2@3",
            "content": "Collectively, these results suggest that the active site is highly rigid in the apo state of all homologs studied and is conformationally preorganized to favor the binding of a magnesium ion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_2",
            "start": 578,
            "end": 768,
            "label": {}
        },
        {
            "ix": "3-67_v2_2@4",
            "content": "Notably, representatives of bacterial, eukaryotic, and retroviral RNases H all exhibit similar active-site rigidity, suggesting that this dynamic feature is only subtly modulated by amino acid sequence and may primarily be imposed by the distinctive RNase H protein fold.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_2",
            "start": 770,
            "end": 1040,
            "label": {}
        },
        {
            "ix": "3-67_v2_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "3-67_v2_4@0",
            "content": "Ribonuclease H1 (RNase H) proteins are well-conserved endonucleases that are found in all domains of life and cleave the RNA strand of an RNA-DNA duplex substrate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_4",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "3-67_v2_4@1",
            "content": "The RNase H active site canonically consists of a highly conserved DED(D) motif ( Figure 1 ), three to four carboxylate-containing residues collectively participating in the binding of catalytically required divalent cations, Mg 2+ under physiological conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_4",
            "start": 164,
            "end": 426,
            "label": {}
        },
        {
            "ix": "3-67_v2_4@2",
            "content": "This active-site sequence motif and requirement for Mg 2+ is widely shared with other nucleases, suggesting a common catalytic mechanism <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_4",
            "start": 428,
            "end": 573,
            "label": {}
        },
        {
            "ix": "3-67_v2_5@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_5",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-67_v2_7@0",
            "content": "The best-studied member of the RNase H family is the homolog from Escherichia coli (ecRNH), in which this active-site motif is represented as D10, E48, D70, and D134 <REF-2> ( Figure 2A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_7",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "3-67_v2_7@1",
            "content": "Measurements of the pKa values of the active-site residues indicate perturbed pKa values for D10 and D70 which normalize upon Mg 2+ binding, clearly establishing these residues as critical for interaction with ions <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_7",
            "start": 189,
            "end": 412,
            "label": {}
        },
        {
            "ix": "3-67_v2_7@2",
            "content": "The pH optimum for the RNase H reaction in vitro is approximately 7.5–8.5 <REF-4> , a value at which all active-site residues should be deprotonated <REF-3> and therefore accessible for ion binding.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_7",
            "start": 414,
            "end": 611,
            "label": {}
        },
        {
            "ix": "3-67_v2_8@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_8",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-67_v2_10@0",
            "content": "Despite extensive study, the interaction of metal ions with the ecRNH active site is poorly understood.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_10",
            "start": 0,
            "end": 102,
            "label": {}
        },
        {
            "ix": "3-67_v2_10@1",
            "content": "Activity has been reported in the presence of Mn 2+ as well as the physiologically relevant Mg 2+ <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_10",
            "start": 104,
            "end": 210,
            "label": {}
        },
        {
            "ix": "3-67_v2_10@2",
            "content": "Significant differences have been observed between the protein’s interactions with Mg 2+ and Mn 2+ .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_10",
            "start": 212,
            "end": 311,
            "label": {}
        },
        {
            "ix": "3-67_v2_10@3",
            "content": "Co-crystallization studies of ecRNH with high concentrations of Mg 2+ find a single bound metal ion <REF-6> ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_10",
            "start": 313,
            "end": 434,
            "label": {}
        },
        {
            "ix": "3-67_v2_10@4",
            "content": "By contrast, co-crystallization with Mn 2+ reveals two bound ions, one associated with residues D10 and D134 (denoted the A site), and one associated with D10, E48, and D70 (denoted the B site) <REF-7> ( Figure 2C ); the B site is similar but not identical to the previously identified Mg 2+ site.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_10",
            "start": 436,
            "end": 732,
            "label": {}
        },
        {
            "ix": "3-67_v2_10@5",
            "content": "Single Mn 2+ sites have been identified in the presence of mutations of E48 and/or D134 <REF-8> , both of which are dispensable for Mn 2+ -dependent activity <REF-9> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_10",
            "start": 734,
            "end": 900,
            "label": {}
        },
        {
            "ix": "3-67_v2_10@6",
            "content": "Crystallographic studies of related RNases H from the archaeal extremophile Bacillus halodurans <REF-10> and from Homo sapiens <REF-11> in complex with substrate find two bound ions in the active site ( Figure 2D ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_10",
            "start": 902,
            "end": 1116,
            "label": {}
        },
        {
            "ix": "3-67_v2_11@0",
            "content": "Experimental evidence from nuclear magnetic resonance (NMR) studies locates the area surrounding the active site as the region most susceptible to perturbation upon interaction with ions ( Figure 3 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_11",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "3-67_v2_11@1",
            "content": "Titration of Mg 2+ with ecRNH, monitored independently by 1 H and 25 Mg 2+ NMR, suggests that only a single ion binds to the protein in the absence of substrate <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_11",
            "start": 201,
            "end": 370,
            "label": {}
        },
        {
            "ix": "3-67_v2_11@2",
            "content": "The identified binding site has relatively weak affinity; K d has been reported in the micromolar <REF-5> to low millimolar range <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_11",
            "start": 372,
            "end": 511,
            "label": {}
        },
        {
            "ix": "3-67_v2_11@3",
            "content": "The second site may be occupied only upon binding of substrate <REF-8> , possibly due to the presence of high local concentration in the ion cloud of the highly negatively charged nucleic acid molecule.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_11",
            "start": 513,
            "end": 714,
            "label": {}
        },
        {
            "ix": "3-67_v2_11@4",
            "content": "Conformational changes in the active site upon binding the first ion have been suggested as well, with the second site proposed as being responsible for the attenuation of activity at high ion concentrations <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_11",
            "start": 716,
            "end": 933,
            "label": {}
        },
        {
            "ix": "3-67_v2_11@5",
            "content": "Collectively, these results have been used to propose both a one-metal <REF-7> , <REF-8> , 14 and a two-metal <REF-10> , <REF-15> , <REF-16> catalytic mechanism.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_11",
            "start": 935,
            "end": 1095,
            "label": {}
        },
        {
            "ix": "3-67_v2_11@6",
            "content": "Computational work using the quantum mechanics/molecular mechanics (QM/MM) method applied to the Bacillus halodurans <REF-17> – <REF-19> and Homo sapiens <REF-20> complexes generally supports the two-metal mechanism.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_11",
            "start": 1097,
            "end": 1312,
            "label": {}
        },
        {
            "ix": "3-67_v2_12@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_12",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-67_v2_14@0",
            "content": "RNase H domains are widely distributed in cellular organisms, but also occur as a component of the reverse transcriptase protein found in retroviruses, in which they are required for viral proliferation <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_14",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "3-67_v2_14@1",
            "content": "For this reason, inhibitors of retroviral RNase H domains, particularly that of HIV, have been widely reported <REF-15> , <REF-22> , although none to date have reached clinical use.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_14",
            "start": 214,
            "end": 394,
            "label": {}
        },
        {
            "ix": "3-67_v2_14@2",
            "content": "Most such inhibitors interact with the active site in the metal-bound state <REF-22> and therefore must be selective for retroviral RNase H domains to find clinical utility.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_14",
            "start": 396,
            "end": 568,
            "label": {}
        },
        {
            "ix": "3-67_v2_14@3",
            "content": "The HIV RNase H domain (hivRNH) has been reported to bind two metal ions even in the absence of substrate <REF-23> , although the reason for this difference in behavior between hivRNH and ecRNH is not clear.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_14",
            "start": 570,
            "end": 776,
            "label": {}
        },
        {
            "ix": "3-67_v2_14@4",
            "content": "The Homo sapiens RNase H domain (hsRNH) has not been structurally characterized in the absence of substrate and its binding behavior is less well understood.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_14",
            "start": 778,
            "end": 934,
            "label": {}
        },
        {
            "ix": "3-67_v2_14@5",
            "content": "However, it has higher sequence identity and is more structurally similar to ecRNH than hivRNH.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_14",
            "start": 936,
            "end": 1030,
            "label": {}
        },
        {
            "ix": "3-67_v2_15@0",
            "content": "Combined nuclear magnetic resonance (NMR) and molecular dynamics (MD) studies of the behavior of the ecRNH active site residues suggest that the residues of the ecRNH active site are preorganized in the apo state for the binding of a single Mg 2+ ion <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_15",
            "start": 0,
            "end": 260,
            "label": {}
        },
        {
            "ix": "3-67_v2_15@1",
            "content": "However, experimental constraints prevent the detailed observation of the protein’s dynamic behavior in the presence of a bound ion at ps-ns timescale.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_15",
            "start": 262,
            "end": 412,
            "label": {}
        },
        {
            "ix": "3-67_v2_15@2",
            "content": "The present work aims to more fully understand the dynamics of ecRNH in the Mg 2+ -bound state through molecular dynamics simulations of ecRNH in the presence of single Mg 2+ ions in various positions in the active site as suggested by crystallographic studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_15",
            "start": 414,
            "end": 674,
            "label": {}
        },
        {
            "ix": "3-67_v2_15@3",
            "content": "In addition, the dynamic behavior of the active site in the apo state is compared with homologs from other organisms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_15",
            "start": 676,
            "end": 792,
            "label": {}
        },
        {
            "ix": "3-67_v2_16@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_16",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@0",
            "content": "For each initial protein structure, protonation states for titratable residues were assigned either by experimental measurement (for ecRNH <REF-3> ) or by prediction using the H++ <REF-26> pKa predictor.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@1",
            "content": "Unless otherwise specified, all simulations were performed at a pH of 5.5 to recapitulate the conditions used in prior NMR experiments on ecRNH <REF-27> , <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 204,
            "end": 368,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@2",
            "content": "It should be noted that the experimental pH optima for the RNase H reaction in vitro are approximately 7.5–8.5 for ecRNH and 8.5–9.5 for ttRNH <REF-4> ; however, NMR data are not available at these pH ranges due to sample precipitation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 370,
            "end": 605,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@3",
            "content": "The active site residue D10 has a pKa of 6.1 in the absence of Mg 2+ ; however, its pKa normalizes in the presence of Mg 2+ <REF-3> and therefore is not expected to be protonated at either the experimental or optimal pH. Crystallographic water molecules were removed from all structures prior to solvation using Schrodinger’s Maestro tool, version 8.5 or 9.1, as distributed in the Desmond software package.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 607,
            "end": 1013,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@4",
            "content": "Simulations were performed as described <REF-24> , <REF-29> using Desmond academic release 3 or source release 2.4.2.1 <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 1015,
            "end": 1143,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@5",
            "content": "Proteins were described with the Amber99SB force field <REF-31> , solvated with TIP3P water <REF-32> in a cubic box with a 10Å buffer region from solute to box boundary, and neutralized with Cl − ions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 1145,
            "end": 1345,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@6",
            "content": "Bonds to hydrogen atoms were constrained using the M-SHAKE algorithm <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 1347,
            "end": 1425,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@7",
            "content": "Simulations containing Mg 2+ ions used the Aqvist parameter set <REF-34> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 1427,
            "end": 1500,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@8",
            "content": "Electrostatics were calculated with the PME method using a 9Å cutoff.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 1502,
            "end": 1570,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@9",
            "content": "All simulations used a 2.5fs inner timestep on a 1-1-3 RESPA cycle and were performed in the NVT ensemble using a Nosé-Hoover thermostat after equilibration to constant box volume for 5ns in the NPT ensemble.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 1572,
            "end": 1779,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@10",
            "content": "All simulations described in this work were run for 100ns unless otherwise noted.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 1781,
            "end": 1861,
            "label": {}
        },
        {
            "ix": "3-67_v2_17@11",
            "content": "These simulation conditions applied to the apo state of RNase H homologs have previously been shown to reproduce NMR data well <REF-35> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_17",
            "start": 1863,
            "end": 1999,
            "label": {}
        },
        {
            "ix": "3-67_v2_18@0",
            "content": "Order parameters were calculated by the equation <REF-36> :",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_18",
            "start": 0,
            "end": 58,
            "label": {}
        },
        {
            "ix": "3-67_v2_19@0",
            "content": "S 2 = 1 2 ( 3 ∑ i = 1 3 ∑ j = 1 3 〈 μ i μ j 〉 2 − 1 )",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_19",
            "start": 0,
            "end": 52,
            "label": {}
        },
        {
            "ix": "3-67_v2_20@0",
            "content": "in which µ i and µ j represent the x, y, and z components of a unit vector μ → in the direction of a given chemical bond.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_20",
            "start": 0,
            "end": 120,
            "label": {}
        },
        {
            "ix": "3-67_v2_20@1",
            "content": "This represents the long-time limit of the angular reorientational correlation function for a given bond vector.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_20",
            "start": 122,
            "end": 233,
            "label": {}
        },
        {
            "ix": "3-67_v2_21@0",
            "content": "Protein Data Bank (PDB, RRID:nif-0000-00135) structures used for initiating trajectories are listed, along with their resolutions and any system-specific preparation steps, in Table 1 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_21",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "3-67_v2_22@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_22",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "3-67_v2_24@0",
            "content": "Results and discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_24",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "3-67_v2_25@0",
            "content": "The crystallographic Mg 2+ site is unstable in simulation",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_25",
            "start": 0,
            "end": 56,
            "label": {}
        },
        {
            "ix": "3-67_v2_26@0",
            "content": "A simulation was initiated from the crystal structure of ecRNH in the Mg 2+ -bound state (PDB ID 1RDD) <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_26",
            "start": 0,
            "end": 111,
            "label": {}
        },
        {
            "ix": "3-67_v2_26@1",
            "content": "However, the position of the ion identified in this structure is not stable in simulation and exits the binding site immediately upon initiation of the trajectory.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_26",
            "start": 113,
            "end": 275,
            "label": {}
        },
        {
            "ix": "3-67_v2_26@2",
            "content": "The ion transiently interacts with the protein at a variety of sites on the protein surface over the course of the 89ns trajectory but never returns to its original position in the active site ( Figure 4A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_26",
            "start": 277,
            "end": 483,
            "label": {}
        },
        {
            "ix": "3-67_v2_27@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_27",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-67_v2_29@0",
            "content": "Historically, simulation of the behavior of multivalent ions using standard molecular mechanics force fields has been a long-standing challenge <REF-44> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_29",
            "start": 0,
            "end": 153,
            "label": {}
        },
        {
            "ix": "3-67_v2_29@1",
            "content": "It is therefore possible that the instability of this position in simulation is an artifact of force field errors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_29",
            "start": 155,
            "end": 268,
            "label": {}
        },
        {
            "ix": "3-67_v2_29@2",
            "content": "However, given that ions in this position are not observed in the substrate-bound structures of RNase H homologs ( Figure 2D ), and that the B-factor of the Mg 2+ ion in the 1RDD structure is much higher than those of the surrounding residues ( Figure 4B ), it is likely that this position does not reflect the most stable conformation of the protein-ion complex in solution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_29",
            "start": 270,
            "end": 644,
            "label": {}
        },
        {
            "ix": "3-67_v2_30@0",
            "content": "Both the crystallographic A and B sites are stable in simulation",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_30",
            "start": 0,
            "end": 63,
            "label": {}
        },
        {
            "ix": "3-67_v2_31@0",
            "content": "Additional simulations were carried out under the same conditions for single Mg 2+ ions in each of the two Mn 2+ binding sites identified for ecRNH.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_31",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "3-67_v2_31@1",
            "content": "Because the crystal structure of ecRNH solved in the presence of Mn 2+ (PDB ID 1G15) exhibits disorder in both the active-site and handle loops <REF-7> , the ion positions were instead modeled into the apo ecRNH structure (PDB ID 2RN2) by superposition.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_31",
            "start": 149,
            "end": 401,
            "label": {}
        },
        {
            "ix": "3-67_v2_31@2",
            "content": "For the model of the B-site Mg 2+ ion, the rotamer of E48 was also corrected to match the orientation observed in the 1G15 structure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_31",
            "start": 403,
            "end": 535,
            "label": {}
        },
        {
            "ix": "3-67_v2_31@3",
            "content": "For comparison to an alternative homolog, the Mg 2+ ion in the B site was also modeled into the RNase H structure from the thermophilic bacterium Thermus thermophilus (ttRNH, PDB ID 1RIL), whose structure was also solved in the absence of divalent ions <REF-38> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_31",
            "start": 537,
            "end": 799,
            "label": {}
        },
        {
            "ix": "3-67_v2_32@0",
            "content": "Mg 2+ ions were found to be stably associated with the ecRNH active site in both simulations, despite the fact that the ions were modeled into a structure that did not originally contain them ( Figure 5 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_32",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "3-67_v2_32@1",
            "content": "This observation clearly supports the hypothesis that conformational preorganization in the active site promotes ion binding.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_32",
            "start": 206,
            "end": 330,
            "label": {}
        },
        {
            "ix": "3-67_v2_32@2",
            "content": "It is possible that the effectiveness of this modeling procedure was facilitated by a well-documented feature of crystal packing in ecRNH, in which the amino group of a lysine sidechain in a neighboring molecule inserts into the negatively charged active site in a position approximating the B site <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_32",
            "start": 332,
            "end": 639,
            "label": {}
        },
        {
            "ix": "3-67_v2_32@3",
            "content": "However, a short simulation of ttRNH, whose structure does not contain this contact, with Mg 2+ modeled into the B site was also stable, suggesting that crystal contacts in ecRNH are not responsible for the observation of preorganization in its active site.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_32",
            "start": 641,
            "end": 897,
            "label": {}
        },
        {
            "ix": "3-67_v2_33@0",
            "content": "Figure 5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_33",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-67_v2_35@0",
            "content": "The active site is conformationally preorganized for ion binding in the B site",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_35",
            "start": 0,
            "end": 77,
            "label": {}
        },
        {
            "ix": "3-67_v2_36@0",
            "content": "The presence of Mg 2+ located in either the A or the B site did not substantially affect the dynamics of the active-site residues as determined by S 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_36",
            "start": 0,
            "end": 151,
            "label": {}
        },
        {
            "ix": "3-67_v2_36@1",
            "content": "All four residues remain highly rigid in the presence of a Mg 2+ ion in either position ( Figure 6 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_36",
            "start": 153,
            "end": 253,
            "label": {}
        },
        {
            "ix": "3-67_v2_36@2",
            "content": "The major difference between the unbound, A site, and B site trajectories’ sidechain dynamics was observed in a short loop between helix D and β- sheet 5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_36",
            "start": 255,
            "end": 408,
            "label": {}
        },
        {
            "ix": "3-67_v2_36@3",
            "content": "Experiments have demonstrated dynamics in this region on the ps-ns timescale, suggesting that the loop is simply incompletely sampled in 100ns simulations rather than significantly perturbed by ion binding.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_36",
            "start": 410,
            "end": 615,
            "label": {}
        },
        {
            "ix": "3-67_v2_36@4",
            "content": "No significant differences in the behavior of these residues upon introduction of ions are observed experimentally <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_36",
            "start": 617,
            "end": 741,
            "label": {}
        },
        {
            "ix": "3-67_v2_37@0",
            "content": "Figure 6.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_37",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-67_v2_39@0",
            "content": "Of the four conserved catalytic residues, D134 is known to be somewhat dispensable; catalytic activity is retained, though reduced, by substitutions with N or H, which also increase thermostability <REF-45> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_39",
            "start": 0,
            "end": 207,
            "label": {}
        },
        {
            "ix": "3-67_v2_39@1",
            "content": "In conjunction with crystallographic evidence, this suggests that the B site is occupied in the absence of substrate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_39",
            "start": 209,
            "end": 325,
            "label": {}
        },
        {
            "ix": "3-67_v2_39@2",
            "content": "Because measurements of the sidechain 13 C γδ resonances by NMR could not clearly distinguish the behavior of D134 (the unique participant in the A site) from E48 (the unique participant in the B site) <REF-24> , comparisons of the two trajectories provide an additional opportunity to distinguish between these two sites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_39",
            "start": 327,
            "end": 648,
            "label": {}
        },
        {
            "ix": "3-67_v2_40@0",
            "content": "Although single metal ions in both sites were stably bound to the protein, the RMSD over the course of each 100ns trajectory was larger for the ion in the A site (1.2Å) compared to the B site (0.6Å), which in turn is similar to the RMSD of a 30ns control simulation of ttRNH with an ion modeled into the B site (0.6Å).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_40",
            "start": 0,
            "end": 317,
            "label": {}
        },
        {
            "ix": "3-67_v2_40@1",
            "content": "Additionally, a small amount of motion in the direction of the B site was observed for the ion in the A site; the initial and final positions differ by 1.7Å ( Figure 5 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_40",
            "start": 319,
            "end": 488,
            "label": {}
        },
        {
            "ix": "3-67_v2_40@2",
            "content": "(By comparison, the A and B sites are about 4Å apart.)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_40",
            "start": 490,
            "end": 543,
            "label": {}
        },
        {
            "ix": "3-67_v2_41@0",
            "content": "Distinct conformations were also observed for several neighboring residues, reflecting reorganization of local hydrogen bonding networks to accommodate ion binding in each of the two sites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_41",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "3-67_v2_41@1",
            "content": "N45 does not differ significantly in sidechain rigidity between the two trajectories, but it does differ in conformation: in the A site trajectory, it is oriented away from the substrate-binding site and participates in a network of interactions that also includes the conserved site T43, while in the B site trajectory N45 is primarily oriented into solvent and occupies the rotamer found in the hsRNH-substrate complex.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_41",
            "start": 190,
            "end": 610,
            "label": {}
        },
        {
            "ix": "3-67_v2_42@0",
            "content": "The hydrogen-bonding network surrounding D134 unsurprisingly differs considerably between the A and B site trajectories.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_42",
            "start": 0,
            "end": 119,
            "label": {}
        },
        {
            "ix": "3-67_v2_42@1",
            "content": "Occupancy of inter-sidechain hydrogen bonds in this region is summarized in Table 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_42",
            "start": 121,
            "end": 205,
            "label": {}
        },
        {
            "ix": "3-67_v2_42@2",
            "content": "H124, which interacts with substrate in the hsRNH complex and is known to be associated with product release, forms hydrogen bonds with D134 in the B site trajectory, partially displacing one of the hydrogen bonds formed between D134 and R138 in the apo trajectory.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_42",
            "start": 207,
            "end": 471,
            "label": {}
        },
        {
            "ix": "3-67_v2_42@3",
            "content": "By contrast, H124 interacts primarily with E131 in the A site trajectory, while D134 coordinates Mg 2+ in a monodentate manner, partially displacing the R138-D134 interaction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_42",
            "start": 473,
            "end": 647,
            "label": {}
        },
        {
            "ix": "3-67_v2_42@4",
            "content": "This conformation too is at odds with experimental evidence, since E131 experiences minimal chemical shift perturbation upon Mg 2+ binding <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_42",
            "start": 649,
            "end": 797,
            "label": {}
        },
        {
            "ix": "3-67_v2_43@0",
            "content": "Table 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_43",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "3-67_v2_45@0",
            "content": "Figure 7.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_45",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-67_v2_47@0",
            "content": "These results collectively add to prior experimental evidence that the B site is the primary site for metal ion binding in the absence of substrate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_47",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "3-67_v2_47@1",
            "content": "Furthermore, the presence of a metal ion in the B site may induce reorganization of the surrounding sidechains into conformations conducive to subsequent substrate binding.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_47",
            "start": 149,
            "end": 320,
            "label": {}
        },
        {
            "ix": "3-67_v2_48@0",
            "content": "Rigidity of active-site sidechains is conserved within the RNase H family",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_48",
            "start": 0,
            "end": 72,
            "label": {}
        },
        {
            "ix": "3-67_v2_49@0",
            "content": "Given that all known RNase H homologs have extremely similar active-site structures, it is likely that measurements made on the ecRNH protein can be generalized to other RNase H homologs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_49",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "3-67_v2_49@1",
            "content": "S 2 MD values were therefore calculated from previous simulations of the four handle-region-containing bacterial RNase H homologs of known structure, as well as for hsRNH in the absence of substrate <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_49",
            "start": 188,
            "end": 396,
            "label": {}
        },
        {
            "ix": "3-67_v2_50@0",
            "content": "As might be expected from the high level of structural conservation in the active-site region, the five handle-region-containing RNase H homologs compared differ very little in the dynamics of their active site residues ( Figure 9 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_50",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "3-67_v2_50@1",
            "content": "Notably, the trajectory initiated from the hsRNH structure, which was solved in the presence of substrate and which contained a Na + ion in a position similar to the B site in ecRNH, differs very little from trajectories initiated from any other RNase H structure lacking these additional components.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_50",
            "start": 234,
            "end": 533,
            "label": {}
        },
        {
            "ix": "3-67_v2_50@2",
            "content": "This observation provides strong support for the interpretation that the rigid active-site residues are conformationally preorganized for metal-ion interactions even in the unbound state.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_50",
            "start": 535,
            "end": 721,
            "label": {}
        },
        {
            "ix": "3-67_v2_51@0",
            "content": "In order to better understand the relationships between dynamic processes in RNase H domains of retroviral origin compared to those from cellular organisms, additional simulations in the absence of divalent ions were performed on a set of retroviral RNase H homologs, whose sequences are shown in Figure 8 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_51",
            "start": 0,
            "end": 306,
            "label": {}
        },
        {
            "ix": "3-67_v2_51@1",
            "content": "In brief, no significant differences are observed between simulations initiated from the XMRV full-length structure compared to its ΔC mutant (in which helix C and the handle region are removed), between the XMRV ΔC mutant compared to the HIV homolog (which naturally lacks the handle sequence), or between any of the retroviral domains compared to ecRNH ( Figure 9 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_51",
            "start": 308,
            "end": 675,
            "label": {}
        },
        {
            "ix": "3-67_v2_51@2",
            "content": "This result suggests that the preorganization of the active site on the ps-ns timescale is not significantly altered by differences in amino acid sequence among the subset of family members examined.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_51",
            "start": 677,
            "end": 875,
            "label": {}
        },
        {
            "ix": "3-67_v2_52@0",
            "content": "Figure 8.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_52",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-67_v2_54@0",
            "content": "Figure 9.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_54",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-67_v2_56@0",
            "content": "Conclusions",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_56",
            "start": 0,
            "end": 10,
            "label": {}
        },
        {
            "ix": "3-67_v2_57@0",
            "content": "In this work we aimed to use molecular dynamics simulations to understand the dynamic behavior of the RNase H family in complex with catalytically required Mg 2+ ions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_57",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "3-67_v2_57@1",
            "content": "We observe that the well-studied RNase H homolog from E. coli contains a conformationally preorganized active site that is highly rigid on the ps-ns timescale in the presence of a single Mg 2+ ion, which is likely located at the B site crystallographically identified by examining the Mn 2+ complex.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_57",
            "start": 168,
            "end": 466,
            "label": {}
        },
        {
            "ix": "3-67_v2_57@2",
            "content": "Additionally, we examined the apo state dynamics of the active site—previously validated by comparison to NMR data in the case of the E. coli homolog <REF-24> —and found that similar patterns of active-site rigidity are present in all homologs examined, including representatives of bacterial, eukaryotic, and retroviral RNases H. This result suggests that the dynamics of the active site residues are only subtly modulated by the amino acid sequence variations present among structurally characterized family members.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_57",
            "start": 468,
            "end": 985,
            "label": {}
        },
        {
            "ix": "3-67_v2_57@3",
            "content": "Instead, we hypothesize that this behavior is imposed by the overall protein fold, the topology of which serves to force the negatively charged active-site residues into proximity with one another.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_57",
            "start": 987,
            "end": 1183,
            "label": {}
        },
        {
            "ix": "3-67_v2_57@4",
            "content": "Although it has long been recognized that RNases H share similar topologies and active-site conformations with other endonucleases <REF-48> , the present work extends this observation from static crystal structures to dynamics on the ps-ns timescale.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_57",
            "start": 1185,
            "end": 1434,
            "label": {}
        },
        {
            "ix": "3-67_v2_58@0",
            "content": "Simulations of the Homo sapiens RNase H homolog and the Thermus thermophilus argonaute protein (a distant RNase H homolog with similar active-site architecture) in complex with two Mg 2+ ions and substrate analogs also observe high active-site rigidity <REF-49> ; this is consistent with the present data and implies that active-site preorganization is a general property of this larger family of nucleases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_58",
            "start": 0,
            "end": 406,
            "label": {}
        },
        {
            "ix": "3-67_v2_58@1",
            "content": "Recent analysis of the larger RNase H-like superfamily identifies a common catalytic core in which the relative orientation of the active-site residues correlates with function, distinguishing endonucleases such as RNase H1 from exonuclease family members <REF-50> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_58",
            "start": 408,
            "end": 673,
            "label": {}
        },
        {
            "ix": "3-67_v2_58@2",
            "content": "Although selective inhibitors of the HIV RNase H domain have been developed based on the hypothesis that the metal ion dependence of the HIV domain’s catalytic mechanism differs from that of the human homolog <REF-15> , it is likely that the physical origin of this selectivity is not dependent on the active-site conformations sampled on the ps-ns timescale.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_58",
            "start": 675,
            "end": 1033,
            "label": {}
        },
        {
            "ix": "3-67_v2_59@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_59",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "3-67_v2_60@0",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2014 Stafford KA and Palmer III AG",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_60",
            "start": 0,
            "end": 144,
            "label": {}
        },
        {
            "ix": "3-67_v2_61@0",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_61",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "3-67_v2_62@0",
            "content": "ZENODO: Molecular dynamics derived side chain order parameters for Asp, Glu, Asn, and Gln residues in ribonucleases H, and molecular dynamics trajectories for E. coli ribonuclease H, doi:10.5281/zenodo.8431 <REF-51>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_62",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "3-67_v2_63@0",
            "content": "<REF-1> Tadokoro T Kanaya S : Ribonuclease H: molecular diversities, substrate binding domains, and catalytic mechanism of the prokaryotic enzymes. FEBS J. 2009 ; 276 ( 6 ): 1482 – 1493 . 19228197 10.1111/j.1742-4658.2009.06907.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_63",
            "start": 0,
            "end": 228,
            "label": {}
        },
        {
            "ix": "3-67_v2_64@0",
            "content": "<REF-2> Kanaya S Kohara A Miura Y : Identification of the amino acid residues involved in an active site of Escherichia coli ribonuclease H by site-directed mutagenesis. J Biol Chem. 1990 ; 265 ( 8 ): 4615 – 4621 . 1689729",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_64",
            "start": 0,
            "end": 221,
            "label": {}
        },
        {
            "ix": "3-67_v2_65@0",
            "content": "<REF-3> Oda Y Yamazaki T Nagayama K : Individual ionization constants of all the carboxyl groups in ribonuclease HI from Escherichia coli determined by NMR. Biochemistry. 1994 ; 33 ( 17 ): 5275 – 5284 . 7909691 10.1021/bi00183a034",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_65",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "3-67_v2_66@0",
            "content": "<REF-4> Kanaya S Itaya M : Expression, purification, and characterization of a recombinant ribonuclease H from Thermus thermophilus HB8. J Biol Chem. 1992 ; 267 ( 14 ): 10184 – 10192 . 1315754",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_66",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "3-67_v2_67@0",
            "content": "<REF-5> Huang HW Cowan JA : Metallobiochemistry of the magnesium ion. Characterization of the essential metal-binding site in Escherichia coli ribonuclease H. Eur J Biochem. 1994 ; 219 ( 1–2 ): 253 – 260 . 8306992 10.1111/j.1432-1033.1994.tb19936.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_67",
            "start": 0,
            "end": 247,
            "label": {}
        },
        {
            "ix": "3-67_v2_68@0",
            "content": "<REF-6> Katayanagi K Okumura M Morikawa K : Crystal structure of Escherichia coli RNase HI in complex with Mg2+ at 2.8 A resolution: proof for a single Mg(2+)-binding site. Proteins. 1993 ; 17 ( 4 ): 337 – 346 . 8108376 10.1002/prot.340170402",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_68",
            "start": 0,
            "end": 241,
            "label": {}
        },
        {
            "ix": "3-67_v2_69@0",
            "content": "<REF-7> Goedken ER Marqusee S : Co-crystal of Escherichia coli RNase HI with Mn2+ ions reveals two divalent metals bound in the active site. J Biol Chem. 2001 ; 276 ( 10 ): 7266 – 7271 . 11083878 10.1074/jbc.M009626200",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_69",
            "start": 0,
            "end": 217,
            "label": {}
        },
        {
            "ix": "3-67_v2_70@0",
            "content": "<REF-8> Tsunaka Y Takano K Matsumura H : Identification of single Mn(2+) binding sites required for activation of the mutant proteins of E. coli RNase HI at Glu48 and/or Asp134 by X-ray crystallography. J Mol Biol. 2005 ; 345 ( 5 ): 1171 – 1183 . 15644213 10.1016/j.jmb.2004.11.007",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_70",
            "start": 0,
            "end": 280,
            "label": {}
        },
        {
            "ix": "3-67_v2_71@0",
            "content": "<REF-9> Tsunaka Y Haruki M Morikawa M : Dispensability of glutamic acid 48 and aspartic acid 134 for Mn2+-dependent activity of Escherichia coli ribonuclease HI. Biochemistry. 2003 ; 42 ( 11 ): 3366 – 3374 . 12641469 10.1021/bi0205606",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_71",
            "start": 0,
            "end": 233,
            "label": {}
        },
        {
            "ix": "3-67_v2_72@0",
            "content": "<REF-10> Nowotny M Gaidamakov SA Crouch RJ : Crystal structures of RNase H bound to an RNA/DNA hybrid: Substrate specificity and metal-dependent catalysis. Cell. 2005 ; 121 ( 7 ): 1005 – 1016 . 15989951 10.1016/j.cell.2005.04.024",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_72",
            "start": 0,
            "end": 228,
            "label": {}
        },
        {
            "ix": "3-67_v2_73@0",
            "content": "<REF-11> Nowotny M Gaidamakov SA Ghirlando R : Structure of human RNase H1 complexed with an RNA/DNA hybrid: insight into HIV reverse transcription. Mol Cell. 2007 ; 28 ( 2 ): 264 – 276 . 17964265 10.1016/j.molcel.2007.08.015",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_73",
            "start": 0,
            "end": 224,
            "label": {}
        },
        {
            "ix": "3-67_v2_74@0",
            "content": "<REF-12> Oda Y Nakamura H Kanaya S : Binding of metal ions to E. coli RNase HI observed by 1H–15N heteronuclear 2D NMR. J Biomol NMR. 1991 ; 1 ( 3 ): 247 – 255 . 1668722 10.1007/BF01875518",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_74",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "3-67_v2_75@0",
            "content": "<REF-13> Keck JL Goedken ER Marqusee S : Activation/attenuation model for RNase H: A one-metal mechanism with second-metal inhibition. J Biol Chem. 1998 ; 273 ( 51 ): 34128 – 34133 . 9852071 10.1074/jbc.273.51.34128",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_75",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "3-67_v2_76@0",
            "content": "<REF-15> Klumpp K Hang JQ Rajendran S : Two-metal ion mechanism of RNA cleavage by HIV RNase H and mechanism-based design of selective HIV RNase H inhibitors. Nucleic Acids Res. 2003 ; 31 ( 23 ): 6852 – 6859 . 14627818 10.1093/nar/gkg881 290251",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_76",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "3-67_v2_77@0",
            "content": "<REF-16> Nowotny M Yang W : Stepwise analyses of metal ions in RNase H catalysis from substrate destabilization to product release. EMBO J. 2006 ; 25 ( 9 ): 1924 – 1933 . 16601679 10.1038/sj.emboj.7601076 1456928",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_77",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "3-67_v2_78@0",
            "content": "<REF-17> De Vivo M Dal Peraro M Klein ML : Phosphodiester cleavage in ribonuclease H occurs via an associative two-metal-aided catalytic mechanism. J Am Chem Soc. 2008 ; 130 ( 33 ): 10955 – 10962 . 18662000 10.1021/ja8005786 2745632",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_78",
            "start": 0,
            "end": 231,
            "label": {}
        },
        {
            "ix": "3-67_v2_79@0",
            "content": "<REF-19> Rosta E Nowotny M Yang W : Catalytic mechanism of RNA backbone cleavage by ribonuclease H from quantum mechanics/molecular mechanics simulations. J Am Chem Soc. 2011 ; 133 ( 23 ): 8934 – 8941 . 21539371 10.1021/ja200173a 3110985",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_79",
            "start": 0,
            "end": 236,
            "label": {}
        },
        {
            "ix": "3-67_v2_80@0",
            "content": "<REF-20> Elsässer B Fels G : Atomistic details of the associative phosphodiester cleavage in human ribonuclease H. Phys Chem Chem Phys. 2010 ; 12 ( 36 ): 11081 – 8 . 20672157 10.1039/c001097a",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_80",
            "start": 0,
            "end": 190,
            "label": {}
        },
        {
            "ix": "3-67_v2_81@0",
            "content": "<REF-21> Hostomsky Z Hostomska Z Matthews DA : Ribonucleases H . In Stuart M. Linn and Richard J. Roberts, editors, Nucleases . Cold Spring Harbor Laboratory Press, Cold Spring Harbor, NY 2nd edition. 1993 ; 341 – 376 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_81",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "3-67_v2_82@0",
            "content": "<REF-22> Ilina T LaBarge K Sarafianos SG : Inhibitors of HIV-1 Reverse Transcriptase-Associated Ribonuclease H Activity. Biology. 2012 ; 1 ( 3 ): 521 – 541 . 23599900 10.3390/biology1030521 3627382",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_82",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "3-67_v2_83@0",
            "content": "<REF-23> Davies JF 2nd Hostomska Z Hostomsky Z : Crystal structure of the ribonuclease H domain of HIV-1 reverse transcriptase. Science. 1991 ; 252 ( 5002 ): 88 – 95 . 1707186 10.1126/science.1707186",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_83",
            "start": 0,
            "end": 198,
            "label": {}
        },
        {
            "ix": "3-67_v2_84@0",
            "content": "<REF-24> Stafford KA Ferrage F Cho JH : Side chain dynamics of carboxyl and carbonyl groups in the catalytic function of Escherichia coli ribonuclease H. J Am Chem Soc. 2013 ; 135 ( 48 ): 18024 – 18027 . 24219366 10.1021/ja409479y 3918730",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_84",
            "start": 0,
            "end": 237,
            "label": {}
        },
        {
            "ix": "3-67_v2_85@0",
            "content": "<REF-26> Anandakrishnan R Aguilar B Onufriev AV : H++ 3.0: automating pK prediction and the preparation of biomolecular structures for atomistic molecular modeling and simulations. Nucleic Acids Res. 2012 ; 40 ( Web Server issue ): W537 – W541 . 22570416 10.1093/nar/gks375 3394296",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_85",
            "start": 0,
            "end": 280,
            "label": {}
        },
        {
            "ix": "3-67_v2_86@0",
            "content": "<REF-27> Butterwick JA Patrick Loria J Astrof NS : Multiple time scale backbone dynamics of homologous thermophilic and mesophilic ribonuclease HI enzymes. J Mol Biol. 2004 ; 339 ( 4 ): 855 – 871 . 15165855 10.1016/j.jmb.2004.03.055",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_86",
            "start": 0,
            "end": 231,
            "label": {}
        },
        {
            "ix": "3-67_v2_87@0",
            "content": "<REF-28> Butterwick JA Palmer AG : An inserted Gly residue fine tunes dynamics between mesophilic and thermophilic ribonucleases H. Protein Sci. 2006 ; 15 ( 12 ): 2697 – 2707 . 17088323 10.1110/ps.062398606 2242442",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_87",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "3-67_v2_88@0",
            "content": "<REF-29> Stafford KA Robustelli P Palmer AG 3rd : Thermal adaptation of conformational dynamics in ribonuclease H. PLoS Comput Biol. 2013 ; 9 ( 10 ): e1003218 . 24098095 10.1371/journal.pcbi.1003218 3789780",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_88",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "3-67_v2_89@0",
            "content": "<REF-30> Bowers KJ Chow E Xu H : Scalable algorithms for molecular dynamics simulations on commodity clusters . In Proceedings of the 2006 ACM/IEEE conference on Supercomputing , Tampa, Florida, ACM. 2006 ; 84 . 10.1145/1188455.1188544",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_89",
            "start": 0,
            "end": 234,
            "label": {}
        },
        {
            "ix": "3-67_v2_90@0",
            "content": "<REF-31> Hornak V Abel R Okur A : Comparison of multiple Amber force fields and development of improved protein backbone parameters. Proteins. 2006 ; 65 ( 3 ): 712 – 725 . 16981200 10.1002/prot.21123",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_90",
            "start": 0,
            "end": 198,
            "label": {}
        },
        {
            "ix": "3-67_v2_91@0",
            "content": "<REF-32> Jorgensen WL Chandrasekhar J Madura JD : Comparison of simple potential functions for simulating liquid water. J Chem Phys. 1983 ; 79 ( 2 ): 926 – 935 . 10.1063/1.445869",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_91",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "3-67_v2_92@0",
            "content": "<REF-33> Kräutler V van Gunsteren WF Hünenberger PH : A fast SHAKE algorithm to solve distance constraint equations for small molecules in molecular dynamics simulations. J Comput Chem. 2001 ; 22 ( 5 ): 501 – 508 . 10.1002/1096-987X(20010415)22:5<501::AID-JCC1021>3.0.CO;2-V",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_92",
            "start": 0,
            "end": 273,
            "label": {}
        },
        {
            "ix": "3-67_v2_93@0",
            "content": "<REF-34> Aaqvist J : Ion-water interaction potentials derived from free energy perturbation simulations. J Phys Chem. 1990 ; 94 ( 21 ): 8021 – 8024 . 10.1021/j100384a009",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_93",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "3-67_v2_94@0",
            "content": "<REF-35> Robustelli P Stafford KA Palmer AG 3rd : Interpreting protein structural dynamics from NMR chemical shifts. J Am Chem Soc. 2012 ; 134 ( 14 ): 6365 – 6374 . 22381384 10.1021/ja300265w 3324661",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_94",
            "start": 0,
            "end": 198,
            "label": {}
        },
        {
            "ix": "3-67_v2_95@0",
            "content": "<REF-36> Chandrasekhar I Clore GM Szabo A : A 500 ps molecular dynamics simulation study of interleukin-1 beta in water. Correlation with nuclear magnetic resonance spectroscopy and crystallography. J Mol Biol. 1992 ; 226 ( 1 ): 239 – 250 . 1619653 10.1016/0022-2836(92)90136-8",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_95",
            "start": 0,
            "end": 276,
            "label": {}
        },
        {
            "ix": "3-67_v2_96@0",
            "content": "<REF-38> Ishikawa K Okumura M Katayanagi K : Crystal structure of ribonuclease H from Thermus thermophilus HB8 refined at 2.8 A resolution. J Mol Biol. 1993 ; 230 ( 2 ): 529 – 542 . 8385228 10.1006/jmbi.1993.1169",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_96",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "3-67_v2_97@0",
            "content": "<REF-44> Mamatkulov S Fyta M Netz RR : Force fields for divalent cations based on single-ion and ion-pair properties. J Chem Phys. 2013 ; 138 ( 2 ): 024505 . 23320702 10.1063/1.4772808",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_97",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "3-67_v2_98@0",
            "content": "<REF-45> Haruki M Noguchi E Nakai C : Investigating the role of conserved residue Asp134 in Escherichia coli ribonuclease HI by site-directed random mutagenesis. Eur J Biochem. 1994 ; 220 ( 2 ): 623 – 631 . 8125123 10.1111/j.1432-1033.1994.tb18664.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_98",
            "start": 0,
            "end": 248,
            "label": {}
        },
        {
            "ix": "3-67_v2_99@0",
            "content": "<REF-48> Yang W Steitz TA : Recombining the structures of HIV integrase, RuvC and RNase H. Structure. 1995 ; 3 ( 2 ): 131 – 134 . 7735828 10.1016/S0969-2126(01)00142-3",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_99",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "3-67_v2_100@0",
            "content": "<REF-49> Maláč K Barvík I : Complex between human RNase HI and the phosphonate-DNA/RNA duplex: molecular dynamics study. J Mol Graph Model. 2013 ; 44 : 81 – 90 . 23751958 10.1016/j.jmgm.2013.05.004",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_100",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "3-67_v2_101@0",
            "content": "<REF-50> Majorek KA Dunin-Horkawicz S Steczkiewicz K : The RNase H-like superfamily: new members, comparative structural analysis and evolutionary classification. Nucleic Acids Res. 2014 ; 42 ( 7 ): 4160 – 79 . 24464998 10.1093/nar/gkt1414 3985635",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_101",
            "start": 0,
            "end": 246,
            "label": {}
        },
        {
            "ix": "3-67_v2_102@0",
            "content": "<REF-51> Stafford KA Palmer AG III : Molecular dynamics derived side chain order parameters for Asp, Glu, Asn, and Gln residues in ribonucleases H, and molecular dynamics trajectories for E. coli ribonuclease H. ZENODO. 2014 . Data Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-67_v2_102",
            "start": 0,
            "end": 237,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "3-67_v2_0",
            "tgt_ix": "3-67_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_1",
            "tgt_ix": "3-67_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_0",
            "tgt_ix": "3-67_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_5",
            "tgt_ix": "3-67_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_8",
            "tgt_ix": "3-67_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_12",
            "tgt_ix": "3-67_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_0",
            "tgt_ix": "3-67_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_16",
            "tgt_ix": "3-67_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_16",
            "tgt_ix": "3-67_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_16",
            "tgt_ix": "3-67_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_16",
            "tgt_ix": "3-67_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_16",
            "tgt_ix": "3-67_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_16",
            "tgt_ix": "3-67_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_22",
            "tgt_ix": "3-67_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_0",
            "tgt_ix": "3-67_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_24",
            "tgt_ix": "3-67_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_25",
            "tgt_ix": "3-67_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_25",
            "tgt_ix": "3-67_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_27",
            "tgt_ix": "3-67_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_25",
            "tgt_ix": "3-67_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_24",
            "tgt_ix": "3-67_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_30",
            "tgt_ix": "3-67_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_30",
            "tgt_ix": "3-67_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_30",
            "tgt_ix": "3-67_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_33",
            "tgt_ix": "3-67_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_24",
            "tgt_ix": "3-67_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_37",
            "tgt_ix": "3-67_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_43",
            "tgt_ix": "3-67_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_45",
            "tgt_ix": "3-67_v2_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_24",
            "tgt_ix": "3-67_v2_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_48",
            "tgt_ix": "3-67_v2_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_48",
            "tgt_ix": "3-67_v2_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_48",
            "tgt_ix": "3-67_v2_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_48",
            "tgt_ix": "3-67_v2_52",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_52",
            "tgt_ix": "3-67_v2_53",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_48",
            "tgt_ix": "3-67_v2_54",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_54",
            "tgt_ix": "3-67_v2_55",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_0",
            "tgt_ix": "3-67_v2_56",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_56",
            "tgt_ix": "3-67_v2_57",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_56",
            "tgt_ix": "3-67_v2_58",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_0",
            "tgt_ix": "3-67_v2_59",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_59",
            "tgt_ix": "3-67_v2_60",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_59",
            "tgt_ix": "3-67_v2_61",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_59",
            "tgt_ix": "3-67_v2_62",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_0",
            "tgt_ix": "3-67_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_1",
            "tgt_ix": "3-67_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_2",
            "tgt_ix": "3-67_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_4",
            "tgt_ix": "3-67_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_5",
            "tgt_ix": "3-67_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_6",
            "tgt_ix": "3-67_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_7",
            "tgt_ix": "3-67_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_8",
            "tgt_ix": "3-67_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_9",
            "tgt_ix": "3-67_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_12",
            "tgt_ix": "3-67_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_13",
            "tgt_ix": "3-67_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_14",
            "tgt_ix": "3-67_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_15",
            "tgt_ix": "3-67_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_16",
            "tgt_ix": "3-67_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_18",
            "tgt_ix": "3-67_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_19",
            "tgt_ix": "3-67_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_20",
            "tgt_ix": "3-67_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_21",
            "tgt_ix": "3-67_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_22",
            "tgt_ix": "3-67_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_23",
            "tgt_ix": "3-67_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_24",
            "tgt_ix": "3-67_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_25",
            "tgt_ix": "3-67_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_26",
            "tgt_ix": "3-67_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_27",
            "tgt_ix": "3-67_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_28",
            "tgt_ix": "3-67_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_29",
            "tgt_ix": "3-67_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_30",
            "tgt_ix": "3-67_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_31",
            "tgt_ix": "3-67_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_32",
            "tgt_ix": "3-67_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_33",
            "tgt_ix": "3-67_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_34",
            "tgt_ix": "3-67_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_36",
            "tgt_ix": "3-67_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_37",
            "tgt_ix": "3-67_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_38",
            "tgt_ix": "3-67_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_39",
            "tgt_ix": "3-67_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_40",
            "tgt_ix": "3-67_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_41",
            "tgt_ix": "3-67_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_42",
            "tgt_ix": "3-67_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_43",
            "tgt_ix": "3-67_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_44",
            "tgt_ix": "3-67_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_45",
            "tgt_ix": "3-67_v2_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_46",
            "tgt_ix": "3-67_v2_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_47",
            "tgt_ix": "3-67_v2_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_48",
            "tgt_ix": "3-67_v2_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_49",
            "tgt_ix": "3-67_v2_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_50",
            "tgt_ix": "3-67_v2_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_51",
            "tgt_ix": "3-67_v2_52",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_52",
            "tgt_ix": "3-67_v2_53",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_53",
            "tgt_ix": "3-67_v2_54",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_54",
            "tgt_ix": "3-67_v2_55",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_55",
            "tgt_ix": "3-67_v2_56",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_56",
            "tgt_ix": "3-67_v2_57",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_57",
            "tgt_ix": "3-67_v2_58",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_58",
            "tgt_ix": "3-67_v2_59",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_59",
            "tgt_ix": "3-67_v2_60",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_60",
            "tgt_ix": "3-67_v2_61",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_61",
            "tgt_ix": "3-67_v2_62",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_4",
            "tgt_ix": "3-67_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_7",
            "tgt_ix": "3-67_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_7",
            "tgt_ix": "3-67_v2_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_7",
            "tgt_ix": "3-67_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_14",
            "tgt_ix": "3-67_v2_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_14",
            "tgt_ix": "3-67_v2_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_14",
            "tgt_ix": "3-67_v2_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_15",
            "tgt_ix": "3-67_v2_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_90",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_91",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_92",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_93",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_94",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_18",
            "tgt_ix": "3-67_v2_95",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_31",
            "tgt_ix": "3-67_v2_96",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_29",
            "tgt_ix": "3-67_v2_97",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_39",
            "tgt_ix": "3-67_v2_98",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_57",
            "tgt_ix": "3-67_v2_99",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_58",
            "tgt_ix": "3-67_v2_100",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_58",
            "tgt_ix": "3-67_v2_101",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_62",
            "tgt_ix": "3-67_v2_102",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_4",
            "tgt_ix": "3-67_v2_6",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_7",
            "tgt_ix": "3-67_v2_9",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_13",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_21",
            "tgt_ix": "3-67_v2_23",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_26",
            "tgt_ix": "3-67_v2_28",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_32",
            "tgt_ix": "3-67_v2_34",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_36",
            "tgt_ix": "3-67_v2_38",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_42",
            "tgt_ix": "3-67_v2_44",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_51",
            "tgt_ix": "3-67_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_50",
            "tgt_ix": "3-67_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-67_v2_0",
            "tgt_ix": "3-67_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_1",
            "tgt_ix": "3-67_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_2",
            "tgt_ix": "3-67_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_2",
            "tgt_ix": "3-67_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_2",
            "tgt_ix": "3-67_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_2",
            "tgt_ix": "3-67_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_2",
            "tgt_ix": "3-67_v2_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_3",
            "tgt_ix": "3-67_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_4",
            "tgt_ix": "3-67_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_4",
            "tgt_ix": "3-67_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_4",
            "tgt_ix": "3-67_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_5",
            "tgt_ix": "3-67_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_7",
            "tgt_ix": "3-67_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_7",
            "tgt_ix": "3-67_v2_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_7",
            "tgt_ix": "3-67_v2_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_8",
            "tgt_ix": "3-67_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_10@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_10",
            "tgt_ix": "3-67_v2_10@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_11@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_11@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_11@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_11@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_11",
            "tgt_ix": "3-67_v2_11@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_12",
            "tgt_ix": "3-67_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_14",
            "tgt_ix": "3-67_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_14",
            "tgt_ix": "3-67_v2_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_14",
            "tgt_ix": "3-67_v2_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_14",
            "tgt_ix": "3-67_v2_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_14",
            "tgt_ix": "3-67_v2_14@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_14",
            "tgt_ix": "3-67_v2_14@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_15",
            "tgt_ix": "3-67_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_15",
            "tgt_ix": "3-67_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_15",
            "tgt_ix": "3-67_v2_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_15",
            "tgt_ix": "3-67_v2_15@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_16",
            "tgt_ix": "3-67_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_17",
            "tgt_ix": "3-67_v2_17@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_18",
            "tgt_ix": "3-67_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_19",
            "tgt_ix": "3-67_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_20",
            "tgt_ix": "3-67_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_20",
            "tgt_ix": "3-67_v2_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_21",
            "tgt_ix": "3-67_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_22",
            "tgt_ix": "3-67_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_24",
            "tgt_ix": "3-67_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_25",
            "tgt_ix": "3-67_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_26",
            "tgt_ix": "3-67_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_26",
            "tgt_ix": "3-67_v2_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_26",
            "tgt_ix": "3-67_v2_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_27",
            "tgt_ix": "3-67_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_29",
            "tgt_ix": "3-67_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_29",
            "tgt_ix": "3-67_v2_29@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_29",
            "tgt_ix": "3-67_v2_29@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_30",
            "tgt_ix": "3-67_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_31",
            "tgt_ix": "3-67_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_31",
            "tgt_ix": "3-67_v2_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_31",
            "tgt_ix": "3-67_v2_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_31",
            "tgt_ix": "3-67_v2_31@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_32",
            "tgt_ix": "3-67_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_32",
            "tgt_ix": "3-67_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_32",
            "tgt_ix": "3-67_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_32",
            "tgt_ix": "3-67_v2_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_33",
            "tgt_ix": "3-67_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_35",
            "tgt_ix": "3-67_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_36",
            "tgt_ix": "3-67_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_36",
            "tgt_ix": "3-67_v2_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_36",
            "tgt_ix": "3-67_v2_36@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_36",
            "tgt_ix": "3-67_v2_36@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_36",
            "tgt_ix": "3-67_v2_36@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_37",
            "tgt_ix": "3-67_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_39",
            "tgt_ix": "3-67_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_39",
            "tgt_ix": "3-67_v2_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_39",
            "tgt_ix": "3-67_v2_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_40",
            "tgt_ix": "3-67_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_40",
            "tgt_ix": "3-67_v2_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_40",
            "tgt_ix": "3-67_v2_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_41",
            "tgt_ix": "3-67_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_41",
            "tgt_ix": "3-67_v2_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_42",
            "tgt_ix": "3-67_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_42",
            "tgt_ix": "3-67_v2_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_42",
            "tgt_ix": "3-67_v2_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_42",
            "tgt_ix": "3-67_v2_42@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_42",
            "tgt_ix": "3-67_v2_42@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_43",
            "tgt_ix": "3-67_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_45",
            "tgt_ix": "3-67_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_47",
            "tgt_ix": "3-67_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_47",
            "tgt_ix": "3-67_v2_47@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_48",
            "tgt_ix": "3-67_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_49",
            "tgt_ix": "3-67_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_49",
            "tgt_ix": "3-67_v2_49@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_50",
            "tgt_ix": "3-67_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_50",
            "tgt_ix": "3-67_v2_50@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_50",
            "tgt_ix": "3-67_v2_50@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_51",
            "tgt_ix": "3-67_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_51",
            "tgt_ix": "3-67_v2_51@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_51",
            "tgt_ix": "3-67_v2_51@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_52",
            "tgt_ix": "3-67_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_54",
            "tgt_ix": "3-67_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_56",
            "tgt_ix": "3-67_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_57",
            "tgt_ix": "3-67_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_57",
            "tgt_ix": "3-67_v2_57@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_57",
            "tgt_ix": "3-67_v2_57@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_57",
            "tgt_ix": "3-67_v2_57@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_57",
            "tgt_ix": "3-67_v2_57@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_58",
            "tgt_ix": "3-67_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_58",
            "tgt_ix": "3-67_v2_58@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_58",
            "tgt_ix": "3-67_v2_58@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_59",
            "tgt_ix": "3-67_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_60",
            "tgt_ix": "3-67_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_61",
            "tgt_ix": "3-67_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_62",
            "tgt_ix": "3-67_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_63",
            "tgt_ix": "3-67_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_64",
            "tgt_ix": "3-67_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_65",
            "tgt_ix": "3-67_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_66",
            "tgt_ix": "3-67_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_67",
            "tgt_ix": "3-67_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_68",
            "tgt_ix": "3-67_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_69",
            "tgt_ix": "3-67_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_70",
            "tgt_ix": "3-67_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_71",
            "tgt_ix": "3-67_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_72",
            "tgt_ix": "3-67_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_73",
            "tgt_ix": "3-67_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_74",
            "tgt_ix": "3-67_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_75",
            "tgt_ix": "3-67_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_76",
            "tgt_ix": "3-67_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_77",
            "tgt_ix": "3-67_v2_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_78",
            "tgt_ix": "3-67_v2_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_79",
            "tgt_ix": "3-67_v2_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_80",
            "tgt_ix": "3-67_v2_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_81",
            "tgt_ix": "3-67_v2_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_82",
            "tgt_ix": "3-67_v2_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_83",
            "tgt_ix": "3-67_v2_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_84",
            "tgt_ix": "3-67_v2_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_85",
            "tgt_ix": "3-67_v2_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_86",
            "tgt_ix": "3-67_v2_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_87",
            "tgt_ix": "3-67_v2_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_88",
            "tgt_ix": "3-67_v2_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_89",
            "tgt_ix": "3-67_v2_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_90",
            "tgt_ix": "3-67_v2_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_91",
            "tgt_ix": "3-67_v2_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_92",
            "tgt_ix": "3-67_v2_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_93",
            "tgt_ix": "3-67_v2_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_94",
            "tgt_ix": "3-67_v2_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_95",
            "tgt_ix": "3-67_v2_95@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_96",
            "tgt_ix": "3-67_v2_96@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_97",
            "tgt_ix": "3-67_v2_97@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_98",
            "tgt_ix": "3-67_v2_98@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_99",
            "tgt_ix": "3-67_v2_99@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_100",
            "tgt_ix": "3-67_v2_100@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_101",
            "tgt_ix": "3-67_v2_101@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-67_v2_102",
            "tgt_ix": "3-67_v2_102@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "3-67_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.3605.2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/3.0/",
        "title": "Evidence from molecular dynamics simulations of conformational preorganization in the ribonuclease H active site",
        "abstract": "Ribonuclease H1 (RNase H) enzymes are well-conserved endonucleases that are present in all domains of life and are particularly important in the life cycle of retroviruses as domains within reverse transcriptase. Despite extensive study, especially of the E. coli homolog, the interaction of the highly negatively charged active site with catalytically required magnesium ions remains poorly understood. In this work, we describe molecular dynamics simulations of the E. coli homolog in complex with magnesium ions, as well as simulations of other homologs in their apo states. Collectively, these results suggest that the active site is highly rigid in the apo state of all homologs studied and is conformationally preorganized to favor the binding of a magnesium ion. Notably, representatives of bacterial, eukaryotic, and retroviral RNases H all exhibit similar active-site rigidity, suggesting that this dynamic feature is only subtly modulated by amino acid sequence and may primarily be imposed by the distinctive RNase H protein fold.",
        "contributors": [
            {
                "surname": "Stafford",
                "given-names": "Kate A."
            },
            {
                "surname": "Palmer III",
                "given-names": "Arthur G."
            }
        ],
        "url": "https://f1000research.com/articles/3-67/v2/",
        "doc_id": "3-67",
        "version": 2,
        "ix_counter": 372,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}