{
    "nodes": [
        {
            "ix": "7-103_v2_0",
            "content": "Positive Mental Health from the perspective of Iranian society: A qualitative study",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_2",
            "content": "Background : According to the World Health Organization, mental health relates, not only to the absence of mental disorder, but also to Positive Mental Health. Studies have shown that promoting positive mental health, not only reduces the prevalence and incidence of mental disorders, but also affects the process of treatment and reduces related burden. However, this concept has different interpretations in different cultures, and in many societies, mental health is still considered the absence of mental illness. Thus, the present study was conducted to provide an in-depth understanding of Iranian adults` perspective towards the concept of positive mental health.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_3",
            "content": "Materials and Methods : In the present qualitative study, eight focus group discussions (6 to 8 adults in each session) were held consisting of 30 to 60 year-old men and women from Tehran. Data were analyzed in \"DeDoose\" qualitative software using content analysis.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_4",
            "content": "Results : According to the data obtained, participants found no difference between positive mental health and mental health, mostly equating it to the absence of mental disorders and having positive energy, peace in and satisfaction with life. According to the results, positive mental health has four domains of emotional/psychological, spiritual, social, and life skills.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_5",
            "content": "Conclusion : Understanding an individual’s positive mental health concepts culturally and providing appropriate community based programs can significantly promote the mental health of the community.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_6",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_7",
            "content": "According to the World Health Organization (WHO), mental health is more than just the absence of mental illness and it is also considered a state of well-being where individuals realize their skills, cope with normal life stresses, can work fruitfully and productively, and are able to make a contribution to their community (see WHO statement on mental health promotion ). Based on the results obtained in a study by Keyes et al. , complete mental health is a function of two interrelated independent entities, with positive mental health (PMH) as one axis, and the absence of mental disorder as the other <REF-1> – <REF-3> . The complete mental health approach covers previous approaches such as the pathogenic approach, which defines mental health as the absence of mental disorders, and the salutogenic approach, that focuses on the positive aspects of human abilities and functioning in emotions and behaviors <REF-1> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_8",
            "content": "Many studies on mental disorders and related diseases have been conducted so far throughout the world. A systematic review study by Steel et al. , reported that worldwide one in five adults had experienced a mental disorder during the previous 12 months and 29.2% during their lifetime (lifetime prevalence) in 2014 <REF-4> . These disorders occur at younger ages, and are chronic, and thus have many adverse effects on various aspects of life, including educational performance, employment, income, personal relationships and social participation <REF-5> . Thus, there is a need for further, more effective investment into prevention, treatment, and rehabilitation of these disorders.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_9",
            "content": "Despite the advances made in medical and psychiatric therapies, the prevalence and burden of mental diseases has not decreased <REF-6> . Therefore, community-based interventions should be conducted to prevent the incidence of new cases, and thus promote mental health at a community level <REF-7> . Using the slogan “mental health for all”, many countries have implemented extensive policies to promote mental health with an emphasis on its positive aspects <REF-8> . In fact, the concept of PMH includes personal capabilities in psychological, emotional, and social dimensions and promoting PMH leads to a reduction in psychological disorders, a decrease in the probability of all-cause mortality, prevention of suicidal behaviors, and impairment in academic performance <REF-9> – <REF-12> . Many studies suggest that PMH, as a key factor, will lead to positive cognition, positive behavior, and increased cognitive capabilities <REF-12> , <REF-13> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_10",
            "content": "According to the literature, PMH or mental well-being has two traditional approaches: Hedonic or positive feeling/affects that relies on feeling good (subjective wellbeing, life satisfaction and happiness), and Eudemonic, or positive functioning, with emphasis on optimal social and psychological functioning (engagement, fulfillment, sense of meaning and social wellbeing) <REF-3> , <REF-14> . PMH is formed by the combination of these two approaches, and is conceptualized by the presence of emotional, psychological, and social well-being <REF-15> . Since this concept is affected by demographic, biological, cultural, socioeconomic and psychological factors etc. <REF-16> , <REF-17> , it occurs very differently in different countries. For instance, the high level of PMH (flourishing) is 11.6% in South Korea, but 76.9% in Canada <REF-18> . A study conducted by Nosratabadi on Iranian students showed that 16% of students were classified as flourishing <REF-19> , and a study by Joshanloo et al. reported the level of PMH among Iranian students was lower than those in the Netherlands and South Africa <REF-20> . Understanding and determining the concept of PMH based on cultural-social differences is essential for promoting PMH and preventing psychological disorders. Furthermore, no study has yet addressed this subject in Iranian culture. Therefore, it was decided to conduct a qualitative study to carefully explore the concept of PMH and its domains in the Iranian society.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_11",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_12",
            "content": "Study design",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_13",
            "content": "The present study was conducted using a qualitative approach, which has proven useful in cultural, psychological, and psychiatric research <REF-21> . The reason for choosing a qualitative approach was its ability to provide an in-depth understanding of the concept of PMH from the perspective of the society <REF-21> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_14",
            "content": "Participant selection",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_15",
            "content": "Data were collected from May to August 2017. Participants were selected by purposive sampling technique <REF-22> and with maximum diversity from 30 to 60 years-old Iranian men and women living in different districts of Tehran, capital of Iran. According to purposive sampling and with the aim of obtaining maximum variation of participants` experiences regarding PMH, different characteristics were considered in sampling. These characteristics were gender, age, marital status, level of education, occupation and the social class.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_16",
            "content": "Data collection",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_17",
            "content": "Data was collected using focus group discussions (FGD). This method was chosen for its flexibility, and ability to boost constructive interactions amongst individuals, while increasing the understanding of the concepts being studied <REF-21> . The number of FGDs was decided according to data saturation, and discussions were performed in single gender groups (men and women separately). Each FGD lasted between 60 and 90 minutes on average, and ended when no new concept could be extracted. Each session was conducted with the participation of 6 to 8 Iranian adults. The locations for group discussions were chosen by interviewees (workplace, tailor shop, municipality health home etc.). In each FGD, first the moderator (corresponding author) introduced herself and her colleague (note taker) and explained the study objectives. A guide questionnaire was used to conduct and direct FGDs. This guide questionnaire had been designed by the research team members using a review of the literature and then validated by group discussion with experts ( Supplementary File 1 ). After the introduction, FGD began with a general question “What characteristics do you think a person with mental health has? Please explain”. Then, the FGD continued with other questions such as” In your opinion does mental health have any domains?” The concept of PMH and its domains were also asked and debated. During discussions, participants were encouraged to express openly about their opinions and experiences, and probing words such as where, when, how, why, etc. were used to ensure proper understanding of concepts referred to by participants, with the intention of exploring new concepts. The FGD ended when no new topics were expressed.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_18",
            "content": "Data analysis",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_19",
            "content": "All discussions (conducted in Persian) were recorded using a digital voice recorder. Each FGD was transcribed and all field notes and contextual details were added immediately after the session. Data were analyzed using directed content analysis <REF-23> . By using the Dedoose qualitative software Version 7.6.6, all transcribed discussions were imported into the software as a Microsoft Word template. Dedoose is a powerful, feature-rich, collaborative web-based application for managing, analyzing and presenting qualitative and mixed methods research. The software is applicable for Persian language and illustrates hierarchical linkage of codes for clear visualization of data structure. Discussions were read line-by-line and appropriate codes were assigned by the software. Then, coding was performed according to the study framework and the concept of PMH and its domains. Themes and subthemes extracted were used as the basis for creating new codes or modifying previous ones. Inductive codes were identified according to categories already found. Various aspects of trustworthiness were observed. All results obtained from each group discussion were shared with participants and checked by them (respondent validation). Data analysis was performed by two experts in the research team (dependability). Details of methodology, including collection of data, analysis, coding, etc. were clearly recorded (transferability). Team consistency was observed by the research team members during the process of analysis <REF-24> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_20",
            "content": "Ethics and consent",
            "ntype": "title",
            "meta": {
                "section": "3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_21",
            "content": "All participants completed informed consent forms. They were assured that their identities and other related information and responses would remain confidential throughout the survey and after.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_22",
            "content": "Participation was on a voluntary basis, meaning they could leave the FGD at any time during the session. Permission to record the discussions was obtained from participants for appropriate and precise analysis. The study protocol was approved by the ethical committee of the University of Social Welfare and Rehabilitation Sciences (Code: IR.USWR.REC.1396.204).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_23",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_24",
            "content": "In the present study, eight FGDs were conducted with individuals living in Tehran (4 FGDs with men and women separately). A total of 51 adults (29 women and 22 men) took part in these FGDs. The mean age of participants was 46.1. About one fifth of participants were unemployed and 47% had at least one university education. In this study, all individuals who had university education were considered as educated and those with high school certificate and lower degrees were deemed uneducated persons. Demographic variables of FGD participants are shown in Table 1 .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_25",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Characteristics of participants in focus group discussions.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_26",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Characteristics of participants in focus group discussions.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" valign=\"middle\">Variable</th> <th align=\"left\" valign=\"middle\">Categories</th> <th align=\"left\" valign=\"middle\">Female(N=29)</th> <th align=\"left\" valign=\"middle\">Male(N=22)</th> </tr> </thead> <tbody> <tr> <td align=\"left\" rowspan=\"3\" valign=\"middle\">Age (year)</td> <td align=\"left\" valign=\"middle\">Min</td> <td align=\"center\" valign=\"middle\">30</td> <td align=\"center\" valign=\"middle\">30</td> </tr> <tr> <td align=\"left\" valign=\"middle\">Max</td> <td align=\"center\" valign=\"middle\">58</td> <td align=\"center\" valign=\"middle\">59</td> </tr> <tr> <td align=\"left\" valign=\"middle\">Mean</td> <td align=\"center\" valign=\"middle\">45.3</td> <td align=\"center\" valign=\"middle\">46.9</td> </tr> <tr> <td align=\"left\" rowspan=\"2\" valign=\"middle\">Education (N)</td> <td align=\"left\" valign=\"middle\">Diploma &amp; lower <break/>(uneducated)</td> <td align=\"center\" valign=\"middle\">18</td> <td align=\"center\" valign=\"middle\">6</td> </tr> <tr> <td align=\"left\" valign=\"middle\">Higher than Diploma <break/>(educated)</td> <td align=\"center\" valign=\"middle\">11</td> <td align=\"center\" valign=\"middle\">16</td> </tr> <tr> <td align=\"left\" rowspan=\"3\" valign=\"middle\">Working status(N)</td> <td align=\"left\" valign=\"middle\">Employed</td> <td align=\"center\" valign=\"middle\">14</td> <td align=\"center\" valign=\"middle\">18</td> </tr> <tr> <td align=\"left\" valign=\"middle\">Housewife</td> <td align=\"center\" valign=\"middle\">9</td> <td align=\"center\" valign=\"middle\">0</td> </tr> <tr> <td align=\"left\" valign=\"middle\">Unemployed</td> <td align=\"center\" valign=\"middle\">6</td> <td align=\"center\" valign=\"middle\">4</td> </tr> <tr> <td align=\"left\" rowspan=\"3\" valign=\"middle\">Marital Status(N)</td> <td align=\"left\" valign=\"middle\">Married</td> <td align=\"center\" valign=\"middle\">20</td> <td align=\"center\" valign=\"middle\">14</td> </tr> <tr> <td align=\"left\" valign=\"middle\">Single</td> <td align=\"center\" valign=\"middle\">5</td> <td align=\"center\" valign=\"middle\">6</td> </tr> <tr> <td align=\"left\" valign=\"middle\">Divorce</td> <td align=\"center\" valign=\"middle\">4</td> <td align=\"center\" valign=\"middle\">2</td> </tr> <tr> <td align=\"left\" rowspan=\"4\" valign=\"middle\">Number of <break/>Children(N)</td> <td align=\"left\" valign=\"middle\">No child</td> <td align=\"center\" valign=\"middle\">5</td> <td align=\"center\" valign=\"middle\">8</td> </tr> <tr> <td align=\"left\" valign=\"middle\">One child</td> <td align=\"center\" valign=\"middle\">4</td> <td align=\"center\" valign=\"middle\">4</td> </tr> <tr> <td align=\"left\" valign=\"middle\">Two Children</td> <td align=\"center\" valign=\"middle\">14</td> <td align=\"center\" valign=\"middle\">8</td> </tr> <tr> <td align=\"left\" valign=\"middle\">Three &amp; More <break/>children</td> <td align=\"center\" valign=\"middle\">6</td> <td align=\"center\" valign=\"middle\">2</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Characteristics of participants in focus group discussions.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_27",
            "content": "In our qualitative investigation, two main themes were extracted; namely, general concept of positive mental health and domains of positive mental health, and four subthemes namely a) emotional/psychological domain, b) spiritual domain, c) life skills domain, and d) social domain (see Table 2 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_28",
            "content": "Table 2.",
            "ntype": "label",
            "meta": {
                "id": "T2",
                "caption": "Subthemes associated with domains of PMH.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_29",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T2\" position=\"anchor\"> <caption> <title>Subthemes associated with domains of PMH.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" valign=\"top\">Categories</th> <th align=\"left\" valign=\"top\">Subcategories</th> </tr> </thead> <tbody> <tr> <td align=\"left\" valign=\"top\">Emotional/Psychological</td> <td align=\"left\" valign=\"top\">satisfaction and calmness, feeling of love, empathy, optimism, mutual understanding <break/>and respect, personality stability, patience, feeling good, autonomy and flexibility</td> </tr> <tr> <td align=\"left\" valign=\"top\">Spiritual</td> <td align=\"left\" valign=\"top\">trust in God, belief in the other world (judgment day), faith in God, connection with <break/>God and moral Values</td> </tr> <tr> <td align=\"left\" valign=\"top\">Social</td> <td align=\"left\" valign=\"top\">social relations and Interaction, respect other people&#8217;s rights, accepting social <break/>norms, abiding and respecting law and standing up against injustice</td> </tr> <tr> <td align=\"left\" valign=\"top\">Life skills</td> <td align=\"left\" valign=\"top\">anger control, financial management, stress management, accountability, time <break/>management, problem-solving</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T2",
                "caption": "Subthemes associated with domains of PMH.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_30",
            "content": "General concept of PMH",
            "ntype": "title",
            "meta": {
                "section": "4.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_31",
            "content": "The majority of participants found no difference between PMH and mental health, and in fact considered them absolutely the same. Some believed that PMH meant getting positive energy from family and social environments. In fact, in providing a general definition of PMH, the focus was on positive energies, with both internal and external origins.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_32",
            "content": "“PMH means absorbing all positive energies…” (An uneducated woman ). “PMH means having control over your behaviors and solving your problems” (An educated woman). “PMH means energizing yourself and enjoying your life …” (An educated man).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_33",
            "content": "In view of most participants, PMH is a personal attribute that initially begins with being happy and living a happy life, and continues with satisfaction, flexibility, peace, and altruism.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_34",
            "content": "“I believe it is better to be happy in every situation. Laughing is the treatment of all incurable ailments…”( An educated man).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_35",
            "content": "Some considered happiness as the logical outcome of being in control of the situation. “Happiness is brought about by control over different situations. We behave correctly when we are in control” (An educated man), and women believed: “PMH rather meant enjoying what you have and being satisfied with your circumstances” .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_36",
            "content": "The view of many participants was, PMH has social dimensions, as well. Interpersonal relationships, respect for the rights of others, and observing social values are among dimensions that make up PMH.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_37",
            "content": "“You must behave in such a way to respect the personality of every single person in the community”( An educated man). “A mentally healthy person does not do anything that is against the custom” (An educated woman).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_38",
            "content": "Having different skills was cited to complement the definition of PMH, and it was separately proposed as one of the dimensions of PMH due to its particular importance.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_39",
            "content": "Domains of PMH",
            "ntype": "title",
            "meta": {
                "section": "4.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_40",
            "content": "According to participants’ views, we identified four domains of PMH in Iran, namely emotional/psychological, spiritual, social, and life skills in Iranian culture. Overall, these domains consisted of 29 subthemes covering different characteristics of an individual with PMH. Emotional/psychological is the main domain that covers many interlinked attributes of a mentally healthy individual. As an Islamic Asian country, where Iranian culture and Islamic beliefs are intertwined, spirituality and religiousness are considered as an essential element of PMH, which are presented as a separated domain. It also should be noted that developing life skills was mentioned separately due to the importance that participants placed on it ( Table 2 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_41",
            "content": "Emotional/psychological domain. All FGD participants said that emotions and personal characteristics are essential elements of mentally healthy people. They described emotions such as love, kindness, happiness etc., as the software of a human being. One must have suitable and harmonized software and hardware to be defined as a healthy person.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_42",
            "content": "- - Satisfaction and calmness: According to participants’ views, satisfaction was one of the most important attributes of those with PMH. Both gender groups believed that satisfaction was a unique attribute that protects an individual against adversities and brings calmness. “ It is not important what our financial status is; it is important seizing the moment and always feeling satisfied ….”(An educated woman). “ Financial issues are important; they don’t bring happiness although some people lose their mental stability when they become poor ….” (An uneducated woman).\n- - Affection was another attribute that was proposed in the emotional domain of PMH. Affection included loving oneself, family, friends, and society leads to kindness and power to support and assist others. “ To Love yourself, others, family, colleagues, and neighbors without any expectation is very effective. One with PMH should be in love, really in love with others …. ”(An uneducated man).\n- - Empathy which was derived from feeling of love cited by participants. Participants believed in it as an inseparable trait of people with good mental health despite of religion or ethnicity “ An emotionally healthy person cannot rest when he sees someone in trouble; saddens by sadness of others, cheers up with other people’s happiness. Such a person cannot be indifferent, and is affected by other people’s feelings and emotion… “(An educated woman).\n- - Expressing feelings and emotions: Mostly women pointed to this characteristic as a coping mechanism encountering unpleasant situations. Men cited to be mentally healthy one should consider logic in his emotion. “ Anyone who does not consider emotion will lose his/her mental health… no one likes an apathetic person…” (An uneducated woman).\n- - Mutual understanding: Most of participants noted it is an essential element in a relationship, especially in family relationships. One with good mental health understands others emotionally and psychologically, and can respect and support them more appropriately.\n- - Optimism: Many participants agreed that positive thinking and positive feeling creates trust, hope and progress in activities and that is the reason why people interested in optimistic people “Being positive generates hope, even if it is faked… ” (An educated women).\n- - Personality stability is another issue in the psychological dimension of PMH. Participants expressed mentally healthy people never change their manner easily and are reliable. In normal situations, everyone has a balanced character while he/she may experience different levels of instability in adversity “ …if each person has a steady personality in the face with miseries, and maintains his/her balance, that person is a mentally healthy… ”(Men`s group).\n- - Feeling good: This characteristic was mentioned in both male and female FGDs “ feeling good is important, and everyone should find out what makes her/him well. Some feel good by laughing and some by crying. It depends on personal characteristics… ” (An uneducated woman).\n- - Patience: This dimension also included patience in adversity in all life conditions. A patient person has less expectation and more contentment. “The threshold of patience and tolerance is very high in a mentally healthy person and he is patient in all adversities …”(Men`s group).\n- - Autonomy: “ Autonomy of personality is very important. Dependent people are very vulnerable …” (Men`s group).\n- - Flexibility: Participants believed that flexible individuals experience less stress. “ Mentally healthy people accept life problems and have a better position to come to terms with them …” (Women’s group).",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_43",
            "content": "Spiritual domain. In people’s view, spirituality is another of PMH’s personal dimension and emerged as a component of it. Spirituality was perceived to be essential in encountering adverse events. Participants mentioned a wide range of virtues based on their religious beliefs and values. They did not differentiate between spirituality and religiousness, although most of them stated their religious beliefs and practices.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_44",
            "content": "- - Connection with God: Most women believed that this dimension has a role in the definition of PMH because it strengthens being thankful, contented, and patient, which were recalled as flexibility. “ When you are connected with God, everything is perfect. People, who are connected with God, can better accept difficult circumstances of life… ” “ Anyone who seeks help only from God and has a strong connection with God, it means she is perfect…. ”\n- - Faith in God and belief in the other world (Judgment day): Another issue relating to the spiritual domain of PMH is faith which brings forgiveness, feeling of gratitude and peace. “ Belief in the judgment day and worship are attributes of mentally healthy person …” (An uneducated woman). “Being thankful and having faith is the core key. Having faith makes the individual peaceful, and a peaceful person is mentally healthy ….” (An educated man).\n- - Trust in God: Another issue in this domain is trust in God. Most participants believed that people, who trust in a solid support like God, attain peace and tranquility that guarantees their mental health.\n- - Moral values: Many moral qualities and values considered attributes of a mentally healthy person were presented by participants in all FGDs like truthfulness, kindness, forgiveness, charity, devotion, thankfulness, composure, helpfulness, etc.",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_45",
            "content": "Social domain. All participants believed that individuals with PMH are social people. They enjoy their relationship with others and exchange positive energy. A mentally healthy person can be considered as a supportive resource. Participants expressed different elements of social domain.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_46",
            "content": "- - Social relations and interactions: The majority of participants believed this issue should be considered as part of the definition of PMH. Having good interactions and possessing such skills was mentioned in all FGDs. Also, proper relationships were announced as key to providing support. “Mentally healthy individuals communicate so well that they are said to have ‘the charm’; everybody (young and old) appreciates them, and they can communicate to all age groups. They can always fascinate everybody …. ”(An uneducated woman). “ A mentally healthy person communicates to others pleasantly… everybody can have his support… ” (An educated man).\n- - Respect other people’s rights: This characteristic was addressed only by the men’s groups. “ One should respect other people’s rights, and be able to accept fellow human beings as they are, and not express superiority over others, meaning that one should not be narcissistic… ”\n- - Acceptance of social norms “ In my view, a mentally healthy person respects law and lives according to the society’s established norms and customs… ” (Women`s group).\n- - Abiding and respecting law was another issue proposed in the social dimension, which was cited in the definition of PMH from participants’ perspective.\n- - Standing up against injustice was another issue proposed in the social dimension of PMH, which was mostly suggested by men. “ A person is said to have PMH if they stand for their rights in community as much as they can …”",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_47",
            "content": "Life skills domain. In most participants’ views, PMH means having certain life skills which are necessary and help people cope with challenging situations, think positively, and reach their goals in a better way.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_48",
            "content": "- - Stress management: The overwhelming majority of participants experienced stress especially in their daily life and considered stress management, or having control over life adversities, as an inseparable part of PMH. “ In my view, a person is said to be healthy if they can have proper control over life problems or stresses that may occur, whichever side the stress is from… ”( An educated woman).” In dealing with problems, people should try to find the best solution, but those with the poor mentality cannot accept and overcome the problems and become indifferent… ”( Men`s group).\n- - Anger control: Another life skill recalled in providing PMH was anger control. In the view of the participants, anyone that can control anger in adversity and react appropriately has sound mental health.\n- - Financial management: An essential life skill considered by majority participants in order to maintain PMH was to control income and expenses. They believed all people experience different types of financial instable situations. The one who has the power of financial management to control and manage these instabilities in his life more efficiently has good mental health. “… mentally healthy individuals can manage their personal life in such a way so as to make their family feel fortunate despite financial difficulties… ”( Men’s group)\n- - Accountability was also cited as an important skill in the definition of PMH. “ Dutifulness, however defined by the individual is respectable, and a sign of good mental health …. ” (Women`s group).\n- - Time management: It was mostly referred to by women as another life skill that affects PMH. “A mentally healthy person uses her/his time well ….and saves time to help others … ”\n- - Problem-solving: This skill is among the most important skills pointed out by most participants. “A healthy person is a kind and sincere person who solves their problems calmly and does not react with haste…. (Men`s group).",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_49",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "5",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_50",
            "content": "The main objective of this present study was to explore PMH definition and its domains in accordance with the Iranian culture. Although this element of mental health seems to be the same in different regions, it is obvious that the concept of PMH is interpreted differently in diverse cultures with respect to its expression and significance <REF-25> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_51",
            "content": "The obtained results showed that Iranian participants considered the absence of mental disorder as a prerequisite for mental health and no one considered absence of mental disorder and PMH as two distinguished notions. According to Keyes et al. , mental health has two separate but correlating axis – one referring to presence or absence of mental disorders, and the other expressing a high level of PMH to a low level of PMH - and existence of one does not contradict the presence of the other. It means despite having mental disorder, an individual can have some level of PMH or vice versa <REF-1> , <REF-10> , <REF-13> . The results of the study implemented by Gilmour in a Canadian community supported Keyes` two continua model <REF-18> . This theory was not announced by any of the Iranian individuals participating in FGDs. Whereas Laidlaw and his challenges explored in their qualitative study that Scottish people paid attention to PMH and mental health separately <REF-26> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_52",
            "content": "In fact, Iranian participants generally considered PMH as getting positive energy, living happily, satisfaction and having peace and flexibility, with four main dimensions of emotional/psychological, spiritual, social, and life skills. Despite the difference in the perception of PMH in different cultures <REF-14> , our findings appear to comply with the PMH concepts in the literature, especially the WHO description <REF-5> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_53",
            "content": "Results of the study revealed four interrelated domains as emotional/psychological, spiritual, social, and life skills in Iranian culture. The findings support Vaingankar`s qualitative research in Singapore, another Asian country with a diverse cultural context, that described PMH domains as personal growth and characteristics, coping strategies, spiritual beliefs and relationships <REF-25> . Previous studies implemented by Keyes and his colleagues described PMH as salutogenic approaches of subjective wellbeing: with positive feeling defined as emotional wellbeing and positive functioning reflected as psychological wellbeing and social wellbeing <REF-1> , <REF-3> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_54",
            "content": "The role and importance of satisfaction reasonably creating and maintaining PMH were mentioned in the emotional/psychological dimension. According to the present study results, in the emotional domain, attributes such as satisfaction, love, empathy, understanding feelings and emotions, living happily, and positive thinking were suggested by participants. Review of the literature is also indicative of the importance of satisfaction in the maintenance and promotion of PMH in different cultural countries (see WHO Summary Report on PMH ) <REF-25> . Studies conducted by Monlina and Lyubomirsky indicated the importance of happiness, happy living and other positive emotions in increasing mental/physical well-being <REF-27> , <REF-28> . According to a study conducted in Singapore, positive thinking is able to affect promotion of PMH through interaction with people’s personality attributes <REF-25> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_55",
            "content": "In the spiritual domain, virtues such as faith in God and trust in a supernatural force, and also belief in the hereafter, were highlighted by the Iranian participants as with other Asian religious regions <REF-25> , <REF-29> , <REF-30> . It seems that spirituality is a notable way of obtaining wellbeing and there is a widespread belief that people with spiritual beliefs and faith have better mental wellbeing <REF-31> , <REF-32> . Although religiosity is considered as a main variable in defining PMH, Ganga and his challenge showed that people with different religions experience diverse level of PMH <REF-30> . It is important to realize more about interpersonal variations. Previous studies have shown that the most common mechanisms through which religion promotes well-being include social support networks, coping resources and positive emotions <REF-33> , <REF-34> . The spiritual dimension also increases creativity, patience, hope and vitality through communication and coping strategies <REF-35> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_56",
            "content": "In the social domain, proper social relations, respect for the rights of others, acceptance of social norms, and lawfulness were cited by Iranian participants. The literature contains evidence on the significant role of proper communication with others and high level of mental well-being <REF-36> . Close relationships provide support when needed as well as mutual cooperation <REF-25> . Social support networks have a considerable relationship with mood, performance and the quality of life (see WHO statement on mental health promotion ). New theories of well-being also point to the social aspects which correlate with the present study results <REF-37> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_57",
            "content": "Regarding life skills, which were explored as one of the main dimensions of PMH; stress management, accountability, anger control, problem solving, financial management, and time management were proposed in the present study. Stress coping skills appear to be one of the most important skills for finding peace and promoting well-being. In fact, stress coping mechanisms are not only important as factors affecting PMH, but also as PMH outcomes <REF-38> . Studies showed there is a strong relationship between financial management and satisfaction, and mental wellbeing <REF-39> . Also, existing evidence demonstrates a positive relationship between problem solving skills and social competencies <REF-40> . Generally, life skills empower people to cope with stresses and emotions, think critically, and are capable of making proper decisions.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_58",
            "content": "The present study has certain strengths and limitations. There is lack of appropriate studies, especially qualitative studies regarding defining social determinants of PMH in Iranian culture which can be considered as one of the most important strengths of this study. Using the qualitative approach provides an in-depth understanding of the concept of PMH from the society perspective. Besides, maximum variation has been observed in the selection of study samples (marital status, occupation, gender and education).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_59",
            "content": "Considering the study limitation, there is lack of generalizability and representativeness since the study was conducted using a qualitative method, and only its process and methodology can be generalized. The findings need more research attempts to be applicable to the broader Iranian adult population due to the multi ethnicity context of the country.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_60",
            "content": "In this study, we interpreted the concept of PMH and its aspects according to Iranian adults’ experiences. The results highlighted the significance and influences of emotional, psychological traits, spiritual and religious beliefs, social aspects and life skills on PMH. Although PMH is considered a well-defined concept, sited as top priority and measured annually in various national mental health surveys in most developed countries, it is a new subject in our nations and needs more investigations and research so it can be introduced as a culturally and linguistically multidimensional concept. Furthermore, a proper understating of how mental health professionals conceptualize the concept of PMH is essential in policy making and implementing proper community-based interventions in order to promote and protect mental health.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_61",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_62",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2018 Mirabzadeh A et al.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_63",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_64",
            "content": "Using Persian language as the national language of Iran during the process of data gathering, all raw data including quotes are available in Persian. Translation and availability of complete raw data will be done upon the request and the permission of Ethical Committee of University of Social Welfare and Rehabilitation Sciences in order to maintain the participants’ confidentiality. Anyone wishing to access the data should first contact the corresponding author who will facilitate contact with the ethical review board ( http://www.uswr.ac.ir Persian site, http://en.uswr.ac.ir/ English site. Contact email international_affairs@uswr.ac.ir )",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_65",
            "content": "<REF-1> Keyes CL : Mental health as a complete state: How the salutogenic perspective completes the picture. Bridging Occupational, Organizational and Public Health . Springer, 2014 ; 179 – 92 . 10.1007/978-94-007-5640-3_11",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_66",
            "content": "<REF-3> Keyes CL : Mental illness and/or mental health? Investigating axioms of the complete state model of health. J Consult Clin Psychol. 2005 ; 73 ( 3 ): 539 – 48 . 15982151 10.1037/0022-006X.73.3.539",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_67",
            "content": "<REF-4> Steel Z Marnane C Iranpour C : The global prevalence of common mental disorders: a systematic review and meta-analysis 1980–2013. Int J epidemiol. 2014 ; 43 ( 2 ): 476 – 93 . 24648481 10.1093/ije/dyu038 3997379",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_68",
            "content": "<REF-5> Barry MM : Addressing the determinants of positive mental health: concepts, evidence and practice. Int J Ment Health Promotion. 2009 ; 11 ( 3 ): 4 – 17 . 10.1080/14623730.2009.9721788",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_69",
            "content": "<REF-6> Whiteford HA Degenhardt L Rehm J : Global burden of disease attributable to mental and substance use disorders: findings from the Global Burden of Disease Study 2010. Lancet. 2013 ; 382 ( 9904 ): 1575 – 86 . 23993280 10.1016/S0140-6736(13)61611-6",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_70",
            "content": "<REF-7> Huppert FA : Psychological Well-being: Evidence Regarding its Causes and Consequences † . Appl Psychol: Health and Well-Being. 2009 ; 1 ( 2 ): 137 – 64 . 10.1111/j.1758-0854.2009.01008.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_71",
            "content": "<REF-8> Allen J Balfour R Bell R : Social determinants of mental health. Int Rev Psychiatry. 2014 ; 26 ( 4 ): 392 – 407 . 25137105 10.3109/09540261.2014.928270",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_72",
            "content": "<REF-9> Huppert FA Whittington JE : Evidence for the independence of positive and negative well-being: implications for quality of life assessment. Br J Health Psychol. 2003 ; 8 ( Pt 1 ): 107 – 22 . 12643820 10.1348/135910703762879246",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_73",
            "content": "<REF-10> Keyes CL Eisenberg D Perry GS : The relationship of level of positive mental health with current mental disorders in predicting suicidal behavior and academic impairment in college students. J Am Coll Health. 2012 ; 60 ( 2 ): 126 – 33 . 22316409 10.1080/07448481.2011.608393",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_74",
            "content": "<REF-12> Wood AM Joseph S : The absence of positive psychological (eudemonic) well-being as a risk factor for depression: A ten year cohort study. J Affect Disord. 2010 ; 122 ( 3 ): 213 – 7 . 19706357 10.1016/j.jad.2009.06.032",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_75",
            "content": "<REF-13> Keyes CL Dhingra SS Simoes EJ : Change in level of positive mental health as a predictor of future risk of mental illness. Am J Public Health. 2010 ; 100 ( 12 ): 2366 – 71 . 20966364 10.2105/AJPH.2010.192245 2978199",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_76",
            "content": "<REF-14> Friedli L : Mental health, resilience and inequalities . WHO Regional Office for Europe Copenhagen. 2009 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_77",
            "content": "<REF-15> Herrman H Jané-Llopis E : The status of mental health promotion. Public Health Rev. 2012 ; 34 : 6 . 10.1007/BF03391674",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_78",
            "content": "<REF-16> Huppert FA So TT : Flourishing Across Europe: Application of a New Conceptual Framework for Defining Well-Being. Soc Indic Res. 2013 ; 110 ( 3 ): 837 – 61 . 23329863 10.1007/s11205-011-9966-7 3545194",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_79",
            "content": "<REF-17> Karlsson H : Problems in the definitions of positive mental health. World psychiatry. 2012 ; 11 ( 2 ): 106 - 7 . 22654941 10.1016/j.wpsyc.2012.05.022 3363385",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_80",
            "content": "<REF-18> Gilmour H : Positive mental health and mental illness. Health Rep. 2014 ; 25 ( 9 ): 3 – 9 . 25229895",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_81",
            "content": "<REF-19> Nosratabasi M Joshanloo M Mohammadi F : Are Iranian Students Flourishing? Dev Psychol. 2010 ; 7 ( 25 ): 83 – 94 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_82",
            "content": "<REF-20> Joshanloo M Wissing MP Khumalo IP : Measurement invariance of the Mental Health Continuum-Short Form (MHC-SF) across three cultural groups. Pers Individ Dif. 2013 ; 55 ( 7 ): 755 – 9 . 10.1016/j.paid.2013.06.002",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_83",
            "content": "<REF-21> Holloway I Galvin K : Qualitative research in nursing and healthcare . John Wiley & Sons; 2016 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_84",
            "content": "<REF-22> Robinson OC : Sampling in interview-based qualitative research: A theoretical and practical guide. Qual Res Psychol. 2014 ; 11 ( 1 ): 25 – 41 . 10.1080/14780887.2013.801543",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_85",
            "content": "<REF-23> Hsieh HF Shannon SE : Three approaches to qualitative content analysis. Qual Health Res. 2005 ; 15 ( 9 ): 1277 – 88 . 16204405 10.1177/1049732305276687",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_86",
            "content": "<REF-24> Rolfe G : Validity, trustworthiness and rigour: quality and the idea of qualitative research. J Adv Nurs. 2006 ; 53 ( 3 ): 304 – 10 . 16441535 10.1111/j.1365-2648.2006.03727.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_87",
            "content": "<REF-25> Vaingankar JA Subramaiam M Lim YW : From well-being to positive mental health: conceptualization and qualitative development of an instrument in Singapore. Qual Life Res. 2012 ; 21 ( 10 ): 1785 – 94 . 22286222 10.1007/s11136-011-0105-3",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_88",
            "content": "<REF-26> Laidlaw A McLellan J Ozakinci G : Understanding undergraduate student perceptions of mental health, mental well-being and help-seeking behaviour. Stud High Edu. 2016 ; 41 ( 12 ): 2156 – 68 . 10.1080/03075079.2015.1026890",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_89",
            "content": "<REF-27> Molina FT : Happiness: Lessons from a new science . Sociologias. SciELO Brasil. 2015 ; 17 ( 40 ). 10.1590/15174522-017004031",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_90",
            "content": "<REF-28> Lyubomirsky S King L Diener E : The benefits of frequent positive affect: does happiness lead to success? Psychol Bull. 2005 ; 131 ( 6 ): 803 – 55 . 16351326 10.1037/0033-2909.131.6.803",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_91",
            "content": "<REF-29> Abdel-Khalek AM : Islam and mental health: A few speculations. Ment Health, Religion & Culture. 2011 ; 14 ( 2 ): 87 – 92 . 10.1080/13674676.2010.544867",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_92",
            "content": "<REF-30> Ganga NS Kutty VR : Influence of religion, religiosity and spirituality on positive mental health of young people. Ment Health, Religion & Culture. 2013 ; 16 ( 4 ): 435 – 43 . 10.1080/13674676.2012.697879",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_93",
            "content": "<REF-31> Gilbert P Nicollus V : Inspiring hope: Recognising the importance of spirituality in a whole person approach to mental health . NIMHE; 2003 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_94",
            "content": "<REF-32> MacGillivray PS Sumsion T Wicks-Nicholls J : Critical elements of spirituality as identified by adolescent mental health clients. Can J Occup Ther. 2006 ; 73 ( 5 ): 295 – 302 . 17201102 10.2182/cjot.06.006",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_95",
            "content": "<REF-33> Ju C Zhang B You X : Religiousness, social support and subjective well-being: An exploratory study among adolescents in an Asian atheist country. Int J Psychol. 2016 . 27132797 10.1002/ijop.12270",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_96",
            "content": "<REF-34> Ryu S Lee OEK : Faith, spirituality, and values among Asian-American older adults: an exploratory factor analysis of the Multidimensional Measures of Religion and Spirituality. Ment Health, Religion & Culture. 2016 ; 19 ( 8 ): 920 – 31 . 10.1080/13674676.2017.1290593",
            "ntype": "ref",
            "meta": {
                "id": "ref-34",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_97",
            "content": "<REF-35> Koenig HG : Research on religion, spirituality, and mental health: a review. Can J Psychiatry. 2009 ; 54 ( 5 ): 283 – 91 . 19497160 10.1177/070674370905400502",
            "ntype": "ref",
            "meta": {
                "id": "ref-35",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_98",
            "content": "<REF-36> Barry MM : Promoting positive mental health and well-being: Practice and policy. Mental Well-Being. Springer, 2013 ; 355 – 84 . 10.1007/978-94-007-5195-8_16",
            "ntype": "ref",
            "meta": {
                "id": "ref-36",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_99",
            "content": "<REF-37> Belgrave FZ Berry BM : Community Approaches to Promoting Positive Mental Health and Psychosocial Well-Being. Handbook of Mental Health in African American Youth. 2016 ; 121 – 140 . 10.1007/978-3-319-25501-9_8",
            "ntype": "ref",
            "meta": {
                "id": "ref-37",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_100",
            "content": "<REF-38> Humphreys K Mankowski ES Moos RH : Do enhanced friendship networks and active coping mediate the effect of self-help groups on substance abuse? Ann Behav Med. 1999 ; 21 ( 1 ): 54 – 60 . 18425655 10.1007/BF02895034",
            "ntype": "ref",
            "meta": {
                "id": "ref-38",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_101",
            "content": "<REF-39> Collard S Hayes D : Financial Wellbeing In Later Life: Evidence And Policy . 2014 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-39",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-103_v2_102",
            "content": "<REF-40> Patel A : Need For Life Skills Education among Tribal and Non Tribal Students. Int J Indian Psychol. 2014 ; 2 ( 1 ): 17 – 28 . 10.13140/2.1.4718.4643",
            "ntype": "ref",
            "meta": {
                "id": "ref-40",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "7-103_v2_0@0",
            "content": "Positive Mental Health from the perspective of Iranian society: A qualitative study",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_0",
            "start": 0,
            "end": 82,
            "label": {}
        },
        {
            "ix": "7-103_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-103_v2_2@0",
            "content": "Background : According to the World Health Organization, mental health relates, not only to the absence of mental disorder, but also to Positive Mental Health.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_2",
            "start": 0,
            "end": 158,
            "label": {}
        },
        {
            "ix": "7-103_v2_2@1",
            "content": "Studies have shown that promoting positive mental health, not only reduces the prevalence and incidence of mental disorders, but also affects the process of treatment and reduces related burden.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_2",
            "start": 160,
            "end": 353,
            "label": {}
        },
        {
            "ix": "7-103_v2_2@2",
            "content": "However, this concept has different interpretations in different cultures, and in many societies, mental health is still considered the absence of mental illness.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_2",
            "start": 355,
            "end": 516,
            "label": {}
        },
        {
            "ix": "7-103_v2_2@3",
            "content": "Thus, the present study was conducted to provide an in-depth understanding of Iranian adults` perspective towards the concept of positive mental health.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_2",
            "start": 518,
            "end": 669,
            "label": {}
        },
        {
            "ix": "7-103_v2_3@0",
            "content": "Materials and Methods : In the present qualitative study, eight focus group discussions (6 to 8 adults in each session) were held consisting of 30 to 60 year-old men and women from Tehran.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_3",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "7-103_v2_3@1",
            "content": "Data were analyzed in \"DeDoose\" qualitative software using content analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_3",
            "start": 189,
            "end": 264,
            "label": {}
        },
        {
            "ix": "7-103_v2_4@0",
            "content": "Results : According to the data obtained, participants found no difference between positive mental health and mental health, mostly equating it to the absence of mental disorders and having positive energy, peace in and satisfaction with life.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_4",
            "start": 0,
            "end": 242,
            "label": {}
        },
        {
            "ix": "7-103_v2_4@1",
            "content": "According to the results, positive mental health has four domains of emotional/psychological, spiritual, social, and life skills.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_4",
            "start": 244,
            "end": 372,
            "label": {}
        },
        {
            "ix": "7-103_v2_5@0",
            "content": "Conclusion : Understanding an individual’s positive mental health concepts culturally and providing appropriate community based programs can significantly promote the mental health of the community.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_5",
            "start": 0,
            "end": 197,
            "label": {}
        },
        {
            "ix": "7-103_v2_6@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_6",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "7-103_v2_7@0",
            "content": "According to the World Health Organization (WHO), mental health is more than just the absence of mental illness and it is also considered a state of well-being where individuals realize their skills, cope with normal life stresses, can work fruitfully and productively, and are able to make a contribution to their community (see WHO statement on mental health promotion ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_7",
            "start": 0,
            "end": 372,
            "label": {}
        },
        {
            "ix": "7-103_v2_7@1",
            "content": "Based on the results obtained in a study by Keyes et al. , complete mental health is a function of two interrelated independent entities, with positive mental health (PMH) as one axis, and the absence of mental disorder as the other <REF-1> – <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_7",
            "start": 374,
            "end": 625,
            "label": {}
        },
        {
            "ix": "7-103_v2_7@2",
            "content": "The complete mental health approach covers previous approaches such as the pathogenic approach, which defines mental health as the absence of mental disorders, and the salutogenic approach, that focuses on the positive aspects of human abilities and functioning in emotions and behaviors <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_7",
            "start": 627,
            "end": 923,
            "label": {}
        },
        {
            "ix": "7-103_v2_8@0",
            "content": "Many studies on mental disorders and related diseases have been conducted so far throughout the world.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_8",
            "start": 0,
            "end": 101,
            "label": {}
        },
        {
            "ix": "7-103_v2_8@1",
            "content": "A systematic review study by Steel et al. , reported that worldwide one in five adults had experienced a mental disorder during the previous 12 months and 29.2% during their lifetime (lifetime prevalence) in 2014 <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_8",
            "start": 103,
            "end": 324,
            "label": {}
        },
        {
            "ix": "7-103_v2_8@2",
            "content": "These disorders occur at younger ages, and are chronic, and thus have many adverse effects on various aspects of life, including educational performance, employment, income, personal relationships and social participation <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_8",
            "start": 326,
            "end": 556,
            "label": {}
        },
        {
            "ix": "7-103_v2_8@3",
            "content": "Thus, there is a need for further, more effective investment into prevention, treatment, and rehabilitation of these disorders.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_8",
            "start": 558,
            "end": 684,
            "label": {}
        },
        {
            "ix": "7-103_v2_9@0",
            "content": "Despite the advances made in medical and psychiatric therapies, the prevalence and burden of mental diseases has not decreased <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_9",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "7-103_v2_9@1",
            "content": "Therefore, community-based interventions should be conducted to prevent the incidence of new cases, and thus promote mental health at a community level <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_9",
            "start": 137,
            "end": 297,
            "label": {}
        },
        {
            "ix": "7-103_v2_9@2",
            "content": "Using the slogan “mental health for all”, many countries have implemented extensive policies to promote mental health with an emphasis on its positive aspects <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_9",
            "start": 299,
            "end": 466,
            "label": {}
        },
        {
            "ix": "7-103_v2_9@3",
            "content": "In fact, the concept of PMH includes personal capabilities in psychological, emotional, and social dimensions and promoting PMH leads to a reduction in psychological disorders, a decrease in the probability of all-cause mortality, prevention of suicidal behaviors, and impairment in academic performance <REF-9> – <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_9",
            "start": 468,
            "end": 791,
            "label": {}
        },
        {
            "ix": "7-103_v2_9@4",
            "content": "Many studies suggest that PMH, as a key factor, will lead to positive cognition, positive behavior, and increased cognitive capabilities <REF-12> , <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_9",
            "start": 793,
            "end": 950,
            "label": {}
        },
        {
            "ix": "7-103_v2_10@0",
            "content": "According to the literature, PMH or mental well-being has two traditional approaches: Hedonic or positive feeling/affects that relies on feeling good (subjective wellbeing, life satisfaction and happiness), and Eudemonic, or positive functioning, with emphasis on optimal social and psychological functioning (engagement, fulfillment, sense of meaning and social wellbeing) <REF-3> , <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_10",
            "start": 0,
            "end": 393,
            "label": {}
        },
        {
            "ix": "7-103_v2_10@1",
            "content": "PMH is formed by the combination of these two approaches, and is conceptualized by the presence of emotional, psychological, and social well-being <REF-15> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_10",
            "start": 395,
            "end": 551,
            "label": {}
        },
        {
            "ix": "7-103_v2_10@2",
            "content": "Since this concept is affected by demographic, biological, cultural, socioeconomic and psychological factors etc.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_10",
            "start": 553,
            "end": 665,
            "label": {}
        },
        {
            "ix": "7-103_v2_10@3",
            "content": "<REF-16> , <REF-17> , it occurs very differently in different countries.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_10",
            "start": 667,
            "end": 738,
            "label": {}
        },
        {
            "ix": "7-103_v2_10@4",
            "content": "For instance, the high level of PMH (flourishing) is 11.6% in South Korea, but 76.9% in Canada <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_10",
            "start": 740,
            "end": 844,
            "label": {}
        },
        {
            "ix": "7-103_v2_10@5",
            "content": "A study conducted by Nosratabadi on Iranian students showed that 16% of students were classified as flourishing <REF-19> , and a study by Joshanloo et al. reported the level of PMH among Iranian students was lower than those in the Netherlands and South Africa <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_10",
            "start": 846,
            "end": 1116,
            "label": {}
        },
        {
            "ix": "7-103_v2_10@6",
            "content": "Understanding and determining the concept of PMH based on cultural-social differences is essential for promoting PMH and preventing psychological disorders.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_10",
            "start": 1118,
            "end": 1273,
            "label": {}
        },
        {
            "ix": "7-103_v2_10@7",
            "content": "Furthermore, no study has yet addressed this subject in Iranian culture.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_10",
            "start": 1275,
            "end": 1346,
            "label": {}
        },
        {
            "ix": "7-103_v2_10@8",
            "content": "Therefore, it was decided to conduct a qualitative study to carefully explore the concept of PMH and its domains in the Iranian society.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_10",
            "start": 1348,
            "end": 1483,
            "label": {}
        },
        {
            "ix": "7-103_v2_11@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_11",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "7-103_v2_12@0",
            "content": "Study design",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_12",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "7-103_v2_13@0",
            "content": "The present study was conducted using a qualitative approach, which has proven useful in cultural, psychological, and psychiatric research <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_13",
            "start": 0,
            "end": 148,
            "label": {}
        },
        {
            "ix": "7-103_v2_13@1",
            "content": "The reason for choosing a qualitative approach was its ability to provide an in-depth understanding of the concept of PMH from the perspective of the society <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_13",
            "start": 150,
            "end": 317,
            "label": {}
        },
        {
            "ix": "7-103_v2_14@0",
            "content": "Participant selection",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_14",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "7-103_v2_15@0",
            "content": "Data were collected from May to August 2017.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_15",
            "start": 0,
            "end": 43,
            "label": {}
        },
        {
            "ix": "7-103_v2_15@1",
            "content": "Participants were selected by purposive sampling technique <REF-22> and with maximum diversity from 30 to 60 years-old Iranian men and women living in different districts of Tehran, capital of Iran.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_15",
            "start": 45,
            "end": 242,
            "label": {}
        },
        {
            "ix": "7-103_v2_15@2",
            "content": "According to purposive sampling and with the aim of obtaining maximum variation of participants` experiences regarding PMH, different characteristics were considered in sampling.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_15",
            "start": 244,
            "end": 421,
            "label": {}
        },
        {
            "ix": "7-103_v2_15@3",
            "content": "These characteristics were gender, age, marital status, level of education, occupation and the social class.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_15",
            "start": 423,
            "end": 530,
            "label": {}
        },
        {
            "ix": "7-103_v2_16@0",
            "content": "Data collection",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_16",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@0",
            "content": "Data was collected using focus group discussions (FGD).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 0,
            "end": 54,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@1",
            "content": "This method was chosen for its flexibility, and ability to boost constructive interactions amongst individuals, while increasing the understanding of the concepts being studied <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 56,
            "end": 242,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@2",
            "content": "The number of FGDs was decided according to data saturation, and discussions were performed in single gender groups (men and women separately).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 244,
            "end": 386,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@3",
            "content": "Each FGD lasted between 60 and 90 minutes on average, and ended when no new concept could be extracted.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 388,
            "end": 490,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@4",
            "content": "Each session was conducted with the participation of 6 to 8 Iranian adults.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 492,
            "end": 566,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@5",
            "content": "The locations for group discussions were chosen by interviewees (workplace, tailor shop, municipality health home etc.).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 568,
            "end": 687,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@6",
            "content": "In each FGD, first the moderator (corresponding author) introduced herself and her colleague (note taker) and explained the study objectives.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 689,
            "end": 829,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@7",
            "content": "A guide questionnaire was used to conduct and direct FGDs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 831,
            "end": 888,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@8",
            "content": "This guide questionnaire had been designed by the research team members using a review of the literature and then validated by group discussion with experts ( Supplementary File 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 890,
            "end": 1071,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@9",
            "content": "After the introduction, FGD began with a general question “What characteristics do you think a person with mental health has? Please explain”.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 1073,
            "end": 1214,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@10",
            "content": "Then, the FGD continued with other questions such as” In your opinion does mental health have any domains?” The concept of PMH and its domains were also asked and debated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 1216,
            "end": 1386,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@11",
            "content": "During discussions, participants were encouraged to express openly about their opinions and experiences, and probing words such as where, when, how, why, etc. were used to ensure proper understanding of concepts referred to by participants, with the intention of exploring new concepts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 1388,
            "end": 1673,
            "label": {}
        },
        {
            "ix": "7-103_v2_17@12",
            "content": "The FGD ended when no new topics were expressed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_17",
            "start": 1675,
            "end": 1722,
            "label": {}
        },
        {
            "ix": "7-103_v2_18@0",
            "content": "Data analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_18",
            "start": 0,
            "end": 12,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@0",
            "content": "All discussions (conducted in Persian) were recorded using a digital voice recorder.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 0,
            "end": 83,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@1",
            "content": "Each FGD was transcribed and all field notes and contextual details were added immediately after the session.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 85,
            "end": 193,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@2",
            "content": "Data were analyzed using directed content analysis <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 195,
            "end": 255,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@3",
            "content": "By using the Dedoose qualitative software Version 7.6.6, all transcribed discussions were imported into the software as a Microsoft Word template.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 257,
            "end": 402,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@4",
            "content": "Dedoose is a powerful, feature-rich, collaborative web-based application for managing, analyzing and presenting qualitative and mixed methods research.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 404,
            "end": 554,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@5",
            "content": "The software is applicable for Persian language and illustrates hierarchical linkage of codes for clear visualization of data structure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 556,
            "end": 691,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@6",
            "content": "Discussions were read line-by-line and appropriate codes were assigned by the software.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 693,
            "end": 779,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@7",
            "content": "Then, coding was performed according to the study framework and the concept of PMH and its domains.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 781,
            "end": 879,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@8",
            "content": "Themes and subthemes extracted were used as the basis for creating new codes or modifying previous ones.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 881,
            "end": 984,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@9",
            "content": "Inductive codes were identified according to categories already found.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 986,
            "end": 1055,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@10",
            "content": "Various aspects of trustworthiness were observed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 1057,
            "end": 1105,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@11",
            "content": "All results obtained from each group discussion were shared with participants and checked by them (respondent validation).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 1107,
            "end": 1228,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@12",
            "content": "Data analysis was performed by two experts in the research team (dependability).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 1230,
            "end": 1309,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@13",
            "content": "Details of methodology, including collection of data, analysis, coding, etc. were clearly recorded (transferability).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 1311,
            "end": 1427,
            "label": {}
        },
        {
            "ix": "7-103_v2_19@14",
            "content": "Team consistency was observed by the research team members during the process of analysis <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_19",
            "start": 1429,
            "end": 1528,
            "label": {}
        },
        {
            "ix": "7-103_v2_20@0",
            "content": "Ethics and consent",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_20",
            "start": 0,
            "end": 17,
            "label": {}
        },
        {
            "ix": "7-103_v2_21@0",
            "content": "All participants completed informed consent forms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_21",
            "start": 0,
            "end": 49,
            "label": {}
        },
        {
            "ix": "7-103_v2_21@1",
            "content": "They were assured that their identities and other related information and responses would remain confidential throughout the survey and after.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_21",
            "start": 51,
            "end": 192,
            "label": {}
        },
        {
            "ix": "7-103_v2_22@0",
            "content": "Participation was on a voluntary basis, meaning they could leave the FGD at any time during the session.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_22",
            "start": 0,
            "end": 103,
            "label": {}
        },
        {
            "ix": "7-103_v2_22@1",
            "content": "Permission to record the discussions was obtained from participants for appropriate and precise analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_22",
            "start": 105,
            "end": 209,
            "label": {}
        },
        {
            "ix": "7-103_v2_22@2",
            "content": "The study protocol was approved by the ethical committee of the University of Social Welfare and Rehabilitation Sciences (Code: IR.USWR.REC.1396.204).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_22",
            "start": 211,
            "end": 360,
            "label": {}
        },
        {
            "ix": "7-103_v2_23@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_23",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "7-103_v2_24@0",
            "content": "In the present study, eight FGDs were conducted with individuals living in Tehran (4 FGDs with men and women separately).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_24",
            "start": 0,
            "end": 120,
            "label": {}
        },
        {
            "ix": "7-103_v2_24@1",
            "content": "A total of 51 adults (29 women and 22 men) took part in these FGDs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_24",
            "start": 122,
            "end": 188,
            "label": {}
        },
        {
            "ix": "7-103_v2_24@2",
            "content": "The mean age of participants was 46.1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_24",
            "start": 190,
            "end": 227,
            "label": {}
        },
        {
            "ix": "7-103_v2_24@3",
            "content": "About one fifth of participants were unemployed and 47% had at least one university education.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_24",
            "start": 229,
            "end": 322,
            "label": {}
        },
        {
            "ix": "7-103_v2_24@4",
            "content": "In this study, all individuals who had university education were considered as educated and those with high school certificate and lower degrees were deemed uneducated persons.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_24",
            "start": 324,
            "end": 499,
            "label": {}
        },
        {
            "ix": "7-103_v2_24@5",
            "content": "Demographic variables of FGD participants are shown in Table 1 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_24",
            "start": 501,
            "end": 564,
            "label": {}
        },
        {
            "ix": "7-103_v2_25@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_25",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-103_v2_27@0",
            "content": "In our qualitative investigation, two main themes were extracted; namely, general concept of positive mental health and domains of positive mental health, and four subthemes namely a) emotional/psychological domain, b) spiritual domain, c) life skills domain, and d) social domain (see Table 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_27",
            "start": 0,
            "end": 295,
            "label": {}
        },
        {
            "ix": "7-103_v2_28@0",
            "content": "Table 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_28",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-103_v2_30@0",
            "content": "General concept of PMH",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_30",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "7-103_v2_31@0",
            "content": "The majority of participants found no difference between PMH and mental health, and in fact considered them absolutely the same.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_31",
            "start": 0,
            "end": 127,
            "label": {}
        },
        {
            "ix": "7-103_v2_31@1",
            "content": "Some believed that PMH meant getting positive energy from family and social environments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_31",
            "start": 129,
            "end": 217,
            "label": {}
        },
        {
            "ix": "7-103_v2_31@2",
            "content": "In fact, in providing a general definition of PMH, the focus was on positive energies, with both internal and external origins.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_31",
            "start": 219,
            "end": 345,
            "label": {}
        },
        {
            "ix": "7-103_v2_32@0",
            "content": "“PMH means absorbing all positive energies…” (An uneducated woman ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_32",
            "start": 0,
            "end": 67,
            "label": {}
        },
        {
            "ix": "7-103_v2_32@1",
            "content": "“PMH means having control over your behaviors and solving your problems” (An educated woman).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_32",
            "start": 69,
            "end": 161,
            "label": {}
        },
        {
            "ix": "7-103_v2_32@2",
            "content": "“PMH means energizing yourself and enjoying your life …” (An educated man).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_32",
            "start": 163,
            "end": 237,
            "label": {}
        },
        {
            "ix": "7-103_v2_33@0",
            "content": "In view of most participants, PMH is a personal attribute that initially begins with being happy and living a happy life, and continues with satisfaction, flexibility, peace, and altruism.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_33",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "7-103_v2_34@0",
            "content": "“I believe it is better to be happy in every situation. Laughing is the treatment of all incurable ailments…”( An educated man).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_34",
            "start": 0,
            "end": 127,
            "label": {}
        },
        {
            "ix": "7-103_v2_35@0",
            "content": "Some considered happiness as the logical outcome of being in control of the situation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_35",
            "start": 0,
            "end": 85,
            "label": {}
        },
        {
            "ix": "7-103_v2_35@1",
            "content": "“Happiness is brought about by control over different situations. We behave correctly when we are in control” (An educated man), and women believed: “PMH rather meant enjoying what you have and being satisfied with your circumstances” .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_35",
            "start": 87,
            "end": 322,
            "label": {}
        },
        {
            "ix": "7-103_v2_36@0",
            "content": "The view of many participants was, PMH has social dimensions, as well.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_36",
            "start": 0,
            "end": 69,
            "label": {}
        },
        {
            "ix": "7-103_v2_36@1",
            "content": "Interpersonal relationships, respect for the rights of others, and observing social values are among dimensions that make up PMH.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_36",
            "start": 71,
            "end": 199,
            "label": {}
        },
        {
            "ix": "7-103_v2_37@0",
            "content": "“You must behave in such a way to respect the personality of every single person in the community”( An educated man).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_37",
            "start": 0,
            "end": 116,
            "label": {}
        },
        {
            "ix": "7-103_v2_37@1",
            "content": "“A mentally healthy person does not do anything that is against the custom” (An educated woman).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_37",
            "start": 118,
            "end": 213,
            "label": {}
        },
        {
            "ix": "7-103_v2_38@0",
            "content": "Having different skills was cited to complement the definition of PMH, and it was separately proposed as one of the dimensions of PMH due to its particular importance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_38",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "7-103_v2_39@0",
            "content": "Domains of PMH",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_39",
            "start": 0,
            "end": 13,
            "label": {}
        },
        {
            "ix": "7-103_v2_40@0",
            "content": "According to participants’ views, we identified four domains of PMH in Iran, namely emotional/psychological, spiritual, social, and life skills in Iranian culture.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_40",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "7-103_v2_40@1",
            "content": "Overall, these domains consisted of 29 subthemes covering different characteristics of an individual with PMH.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_40",
            "start": 164,
            "end": 273,
            "label": {}
        },
        {
            "ix": "7-103_v2_40@2",
            "content": "Emotional/psychological is the main domain that covers many interlinked attributes of a mentally healthy individual.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_40",
            "start": 275,
            "end": 390,
            "label": {}
        },
        {
            "ix": "7-103_v2_40@3",
            "content": "As an Islamic Asian country, where Iranian culture and Islamic beliefs are intertwined, spirituality and religiousness are considered as an essential element of PMH, which are presented as a separated domain.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_40",
            "start": 392,
            "end": 599,
            "label": {}
        },
        {
            "ix": "7-103_v2_40@4",
            "content": "It also should be noted that developing life skills was mentioned separately due to the importance that participants placed on it ( Table 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_40",
            "start": 601,
            "end": 742,
            "label": {}
        },
        {
            "ix": "7-103_v2_41@0",
            "content": "Emotional/psychological domain.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_41",
            "start": 0,
            "end": 30,
            "label": {}
        },
        {
            "ix": "7-103_v2_41@1",
            "content": "All FGD participants said that emotions and personal characteristics are essential elements of mentally healthy people.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_41",
            "start": 32,
            "end": 150,
            "label": {}
        },
        {
            "ix": "7-103_v2_41@2",
            "content": "They described emotions such as love, kindness, happiness etc., as the software of a human being.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_41",
            "start": 152,
            "end": 248,
            "label": {}
        },
        {
            "ix": "7-103_v2_41@3",
            "content": "One must have suitable and harmonized software and hardware to be defined as a healthy person.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_41",
            "start": 250,
            "end": 343,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@0",
            "content": "- - Satisfaction and calmness: According to participants’ views, satisfaction was one of the most important attributes of those with PMH. Both gender groups believed that satisfaction was a unique attribute that protects an individual against adversities and brings calmness. “ It is not important what our financial status is; it is important seizing the moment and always feeling satisfied ….”(An educated woman). “ Financial issues are important; they don’t bring happiness although some people lose their mental stability when they become poor ….” (An uneducated woman).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 0,
            "end": 573,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@1",
            "content": "- - Affection was another attribute that was proposed in the emotional domain of PMH. Affection included loving oneself, family, friends, and society leads to kindness and power to support and assist others. “ To Love yourself, others, family, colleagues, and neighbors without any expectation is very effective. One with PMH should be in love, really in love with others …. ”(An uneducated man).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 575,
            "end": 970,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@2",
            "content": "- - Empathy which was derived from feeling of love cited by participants. Participants believed in it as an inseparable trait of people with good mental health despite of religion or ethnicity “ An emotionally healthy person cannot rest when he sees someone in trouble; saddens by sadness of others, cheers up with other people’s happiness. Such a person cannot be indifferent, and is affected by other people’s feelings and emotion… “(An educated woman).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 972,
            "end": 1426,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@3",
            "content": "- - Expressing feelings and emotions: Mostly women pointed to this characteristic as a coping mechanism encountering unpleasant situations. Men cited to be mentally healthy one should consider logic in his emotion. “ Anyone who does not consider emotion will lose his/her mental health… no one likes an apathetic person…” (An uneducated woman).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 1428,
            "end": 1771,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@4",
            "content": "- - Mutual understanding: Most of participants noted it is an essential element in a relationship, especially in family relationships. One with good mental health understands others emotionally and psychologically, and can respect and support them more appropriately.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 1773,
            "end": 2039,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@5",
            "content": "- - Optimism: Many participants agreed that positive thinking and positive feeling creates trust, hope and progress in activities and that is the reason why people interested in optimistic people “Being positive generates hope, even if it is faked… ” (An educated women).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 2041,
            "end": 2311,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@6",
            "content": "- - Personality stability is another issue in the psychological dimension of PMH. Participants expressed mentally healthy people never change their manner easily and are reliable. In normal situations, everyone has a balanced character while he/she may experience different levels of instability in adversity “ …if each person has a steady personality in the face with miseries, and maintains his/her balance, that person is a mentally healthy… ”(Men`s group).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 2313,
            "end": 2772,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@7",
            "content": "- - Feeling good: This characteristic was mentioned in both male and female FGDs “ feeling good is important, and everyone should find out what makes her/him well. Some feel good by laughing and some by crying. It depends on personal characteristics… ” (An uneducated woman).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 2774,
            "end": 3048,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@8",
            "content": "- - Patience: This dimension also included patience in adversity in all life conditions. A patient person has less expectation and more contentment. “The threshold of patience and tolerance is very high in a mentally healthy person and he is patient in all adversities …”(Men`s group).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 3050,
            "end": 3334,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@9",
            "content": "- - Autonomy: “ Autonomy of personality is very important. Dependent people are very vulnerable …” (Men`s group).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 3336,
            "end": 3448,
            "label": {}
        },
        {
            "ix": "7-103_v2_42@10",
            "content": "- - Flexibility: Participants believed that flexible individuals experience less stress. “ Mentally healthy people accept life problems and have a better position to come to terms with them …” (Women’s group).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_42",
            "start": 3450,
            "end": 3658,
            "label": {}
        },
        {
            "ix": "7-103_v2_43@0",
            "content": "Spiritual domain.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_43",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "7-103_v2_43@1",
            "content": "In people’s view, spirituality is another of PMH’s personal dimension and emerged as a component of it.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_43",
            "start": 18,
            "end": 120,
            "label": {}
        },
        {
            "ix": "7-103_v2_43@2",
            "content": "Spirituality was perceived to be essential in encountering adverse events.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_43",
            "start": 122,
            "end": 195,
            "label": {}
        },
        {
            "ix": "7-103_v2_43@3",
            "content": "Participants mentioned a wide range of virtues based on their religious beliefs and values.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_43",
            "start": 197,
            "end": 287,
            "label": {}
        },
        {
            "ix": "7-103_v2_43@4",
            "content": "They did not differentiate between spirituality and religiousness, although most of them stated their religious beliefs and practices.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_43",
            "start": 289,
            "end": 422,
            "label": {}
        },
        {
            "ix": "7-103_v2_44@0",
            "content": "- - Connection with God: Most women believed that this dimension has a role in the definition of PMH because it strengthens being thankful, contented, and patient, which were recalled as flexibility. “ When you are connected with God, everything is perfect. People, who are connected with God, can better accept difficult circumstances of life… ” “ Anyone who seeks help only from God and has a strong connection with God, it means she is perfect…. ”",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_44",
            "start": 0,
            "end": 449,
            "label": {}
        },
        {
            "ix": "7-103_v2_44@1",
            "content": "- - Faith in God and belief in the other world (Judgment day): Another issue relating to the spiritual domain of PMH is faith which brings forgiveness, feeling of gratitude and peace. “ Belief in the judgment day and worship are attributes of mentally healthy person …” (An uneducated woman). “Being thankful and having faith is the core key. Having faith makes the individual peaceful, and a peaceful person is mentally healthy ….” (An educated man).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_44",
            "start": 451,
            "end": 901,
            "label": {}
        },
        {
            "ix": "7-103_v2_44@2",
            "content": "- - Trust in God: Another issue in this domain is trust in God. Most participants believed that people, who trust in a solid support like God, attain peace and tranquility that guarantees their mental health.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_44",
            "start": 903,
            "end": 1110,
            "label": {}
        },
        {
            "ix": "7-103_v2_44@3",
            "content": "- - Moral values: Many moral qualities and values considered attributes of a mentally healthy person were presented by participants in all FGDs like truthfulness, kindness, forgiveness, charity, devotion, thankfulness, composure, helpfulness, etc.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_44",
            "start": 1112,
            "end": 1358,
            "label": {}
        },
        {
            "ix": "7-103_v2_45@0",
            "content": "Social domain.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_45",
            "start": 0,
            "end": 13,
            "label": {}
        },
        {
            "ix": "7-103_v2_45@1",
            "content": "All participants believed that individuals with PMH are social people.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_45",
            "start": 15,
            "end": 84,
            "label": {}
        },
        {
            "ix": "7-103_v2_45@2",
            "content": "They enjoy their relationship with others and exchange positive energy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_45",
            "start": 86,
            "end": 156,
            "label": {}
        },
        {
            "ix": "7-103_v2_45@3",
            "content": "A mentally healthy person can be considered as a supportive resource.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_45",
            "start": 158,
            "end": 226,
            "label": {}
        },
        {
            "ix": "7-103_v2_45@4",
            "content": "Participants expressed different elements of social domain.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_45",
            "start": 228,
            "end": 286,
            "label": {}
        },
        {
            "ix": "7-103_v2_46@0",
            "content": "- - Social relations and interactions: The majority of participants believed this issue should be considered as part of the definition of PMH. Having good interactions and possessing such skills was mentioned in all FGDs. Also, proper relationships were announced as key to providing support. “Mentally healthy individuals communicate so well that they are said to have ‘the charm’; everybody (young and old) appreciates them, and they can communicate to all age groups. They can always fascinate everybody …. ”(An uneducated woman). “ A mentally healthy person communicates to others pleasantly… everybody can have his support… ” (An educated man).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_46",
            "start": 0,
            "end": 648,
            "label": {}
        },
        {
            "ix": "7-103_v2_46@1",
            "content": "- - Respect other people’s rights: This characteristic was addressed only by the men’s groups. “ One should respect other people’s rights, and be able to accept fellow human beings as they are, and not express superiority over others, meaning that one should not be narcissistic… ”",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_46",
            "start": 650,
            "end": 930,
            "label": {}
        },
        {
            "ix": "7-103_v2_46@2",
            "content": "- - Acceptance of social norms “ In my view, a mentally healthy person respects law and lives according to the society’s established norms and customs… ” (Women`s group).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_46",
            "start": 932,
            "end": 1101,
            "label": {}
        },
        {
            "ix": "7-103_v2_46@3",
            "content": "- - Abiding and respecting law was another issue proposed in the social dimension, which was cited in the definition of PMH from participants’ perspective.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_46",
            "start": 1103,
            "end": 1257,
            "label": {}
        },
        {
            "ix": "7-103_v2_46@4",
            "content": "- - Standing up against injustice was another issue proposed in the social dimension of PMH, which was mostly suggested by men. “ A person is said to have PMH if they stand for their rights in community as much as they can …”",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_46",
            "start": 1259,
            "end": 1483,
            "label": {}
        },
        {
            "ix": "7-103_v2_47@0",
            "content": "Life skills domain.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_47",
            "start": 0,
            "end": 18,
            "label": {}
        },
        {
            "ix": "7-103_v2_47@1",
            "content": "In most participants’ views, PMH means having certain life skills which are necessary and help people cope with challenging situations, think positively, and reach their goals in a better way.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_47",
            "start": 20,
            "end": 211,
            "label": {}
        },
        {
            "ix": "7-103_v2_48@0",
            "content": "- - Stress management: The overwhelming majority of participants experienced stress especially in their daily life and considered stress management, or having control over life adversities, as an inseparable part of PMH. “ In my view, a person is said to be healthy if they can have proper control over life problems or stresses that may occur, whichever side the stress is from… ”( An educated woman).” In dealing with problems, people should try to find the best solution, but those with the poor mentality cannot accept and overcome the problems and become indifferent… ”( Men`s group).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_48",
            "start": 0,
            "end": 588,
            "label": {}
        },
        {
            "ix": "7-103_v2_48@1",
            "content": "- - Anger control: Another life skill recalled in providing PMH was anger control. In the view of the participants, anyone that can control anger in adversity and react appropriately has sound mental health.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_48",
            "start": 590,
            "end": 796,
            "label": {}
        },
        {
            "ix": "7-103_v2_48@2",
            "content": "- - Financial management: An essential life skill considered by majority participants in order to maintain PMH was to control income and expenses. They believed all people experience different types of financial instable situations. The one who has the power of financial management to control and manage these instabilities in his life more efficiently has good mental health. “… mentally healthy individuals can manage their personal life in such a way so as to make their family feel fortunate despite financial difficulties… ”( Men’s group)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_48",
            "start": 798,
            "end": 1341,
            "label": {}
        },
        {
            "ix": "7-103_v2_48@3",
            "content": "- - Accountability was also cited as an important skill in the definition of PMH. “ Dutifulness, however defined by the individual is respectable, and a sign of good mental health …. ” (Women`s group).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_48",
            "start": 1343,
            "end": 1543,
            "label": {}
        },
        {
            "ix": "7-103_v2_48@4",
            "content": "- - Time management: It was mostly referred to by women as another life skill that affects PMH. “A mentally healthy person uses her/his time well ….and saves time to help others … ”",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_48",
            "start": 1545,
            "end": 1725,
            "label": {}
        },
        {
            "ix": "7-103_v2_48@5",
            "content": "- - Problem-solving: This skill is among the most important skills pointed out by most participants. “A healthy person is a kind and sincere person who solves their problems calmly and does not react with haste…. (Men`s group).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_48",
            "start": 1727,
            "end": 1953,
            "label": {}
        },
        {
            "ix": "7-103_v2_49@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_49",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "7-103_v2_50@0",
            "content": "The main objective of this present study was to explore PMH definition and its domains in accordance with the Iranian culture.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_50",
            "start": 0,
            "end": 125,
            "label": {}
        },
        {
            "ix": "7-103_v2_50@1",
            "content": "Although this element of mental health seems to be the same in different regions, it is obvious that the concept of PMH is interpreted differently in diverse cultures with respect to its expression and significance <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_50",
            "start": 127,
            "end": 351,
            "label": {}
        },
        {
            "ix": "7-103_v2_51@0",
            "content": "The obtained results showed that Iranian participants considered the absence of mental disorder as a prerequisite for mental health and no one considered absence of mental disorder and PMH as two distinguished notions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_51",
            "start": 0,
            "end": 217,
            "label": {}
        },
        {
            "ix": "7-103_v2_51@1",
            "content": "According to Keyes et al. , mental health has two separate but correlating axis – one referring to presence or absence of mental disorders, and the other expressing a high level of PMH to a low level of PMH - and existence of one does not contradict the presence of the other.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_51",
            "start": 219,
            "end": 494,
            "label": {}
        },
        {
            "ix": "7-103_v2_51@2",
            "content": "It means despite having mental disorder, an individual can have some level of PMH or vice versa <REF-1> , <REF-10> , <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_51",
            "start": 496,
            "end": 622,
            "label": {}
        },
        {
            "ix": "7-103_v2_51@3",
            "content": "The results of the study implemented by Gilmour in a Canadian community supported Keyes` two continua model <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_51",
            "start": 624,
            "end": 741,
            "label": {}
        },
        {
            "ix": "7-103_v2_51@4",
            "content": "This theory was not announced by any of the Iranian individuals participating in FGDs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_51",
            "start": 743,
            "end": 828,
            "label": {}
        },
        {
            "ix": "7-103_v2_51@5",
            "content": "Whereas Laidlaw and his challenges explored in their qualitative study that Scottish people paid attention to PMH and mental health separately <REF-26> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_51",
            "start": 830,
            "end": 982,
            "label": {}
        },
        {
            "ix": "7-103_v2_52@0",
            "content": "In fact, Iranian participants generally considered PMH as getting positive energy, living happily, satisfaction and having peace and flexibility, with four main dimensions of emotional/psychological, spiritual, social, and life skills.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_52",
            "start": 0,
            "end": 234,
            "label": {}
        },
        {
            "ix": "7-103_v2_52@1",
            "content": "Despite the difference in the perception of PMH in different cultures <REF-14> , our findings appear to comply with the PMH concepts in the literature, especially the WHO description <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_52",
            "start": 236,
            "end": 427,
            "label": {}
        },
        {
            "ix": "7-103_v2_53@0",
            "content": "Results of the study revealed four interrelated domains as emotional/psychological, spiritual, social, and life skills in Iranian culture.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_53",
            "start": 0,
            "end": 137,
            "label": {}
        },
        {
            "ix": "7-103_v2_53@1",
            "content": "The findings support Vaingankar`s qualitative research in Singapore, another Asian country with a diverse cultural context, that described PMH domains as personal growth and characteristics, coping strategies, spiritual beliefs and relationships <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_53",
            "start": 139,
            "end": 394,
            "label": {}
        },
        {
            "ix": "7-103_v2_53@2",
            "content": "Previous studies implemented by Keyes and his colleagues described PMH as salutogenic approaches of subjective wellbeing: with positive feeling defined as emotional wellbeing and positive functioning reflected as psychological wellbeing and social wellbeing <REF-1> , <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_53",
            "start": 396,
            "end": 672,
            "label": {}
        },
        {
            "ix": "7-103_v2_54@0",
            "content": "The role and importance of satisfaction reasonably creating and maintaining PMH were mentioned in the emotional/psychological dimension.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_54",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "7-103_v2_54@1",
            "content": "According to the present study results, in the emotional domain, attributes such as satisfaction, love, empathy, understanding feelings and emotions, living happily, and positive thinking were suggested by participants.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_54",
            "start": 137,
            "end": 355,
            "label": {}
        },
        {
            "ix": "7-103_v2_54@2",
            "content": "Review of the literature is also indicative of the importance of satisfaction in the maintenance and promotion of PMH in different cultural countries (see WHO Summary Report on PMH ) <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_54",
            "start": 357,
            "end": 549,
            "label": {}
        },
        {
            "ix": "7-103_v2_54@3",
            "content": "Studies conducted by Monlina and Lyubomirsky indicated the importance of happiness, happy living and other positive emotions in increasing mental/physical well-being <REF-27> , <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_54",
            "start": 551,
            "end": 737,
            "label": {}
        },
        {
            "ix": "7-103_v2_54@4",
            "content": "According to a study conducted in Singapore, positive thinking is able to affect promotion of PMH through interaction with people’s personality attributes <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_54",
            "start": 739,
            "end": 903,
            "label": {}
        },
        {
            "ix": "7-103_v2_55@0",
            "content": "In the spiritual domain, virtues such as faith in God and trust in a supernatural force, and also belief in the hereafter, were highlighted by the Iranian participants as with other Asian religious regions <REF-25> , <REF-29> , <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_55",
            "start": 0,
            "end": 237,
            "label": {}
        },
        {
            "ix": "7-103_v2_55@1",
            "content": "It seems that spirituality is a notable way of obtaining wellbeing and there is a widespread belief that people with spiritual beliefs and faith have better mental wellbeing <REF-31> , <REF-32> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_55",
            "start": 239,
            "end": 433,
            "label": {}
        },
        {
            "ix": "7-103_v2_55@2",
            "content": "Although religiosity is considered as a main variable in defining PMH, Ganga and his challenge showed that people with different religions experience diverse level of PMH <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_55",
            "start": 435,
            "end": 615,
            "label": {}
        },
        {
            "ix": "7-103_v2_55@3",
            "content": "It is important to realize more about interpersonal variations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_55",
            "start": 617,
            "end": 679,
            "label": {}
        },
        {
            "ix": "7-103_v2_55@4",
            "content": "Previous studies have shown that the most common mechanisms through which religion promotes well-being include social support networks, coping resources and positive emotions <REF-33> , <REF-34> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_55",
            "start": 681,
            "end": 876,
            "label": {}
        },
        {
            "ix": "7-103_v2_55@5",
            "content": "The spiritual dimension also increases creativity, patience, hope and vitality through communication and coping strategies <REF-35> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_55",
            "start": 878,
            "end": 1010,
            "label": {}
        },
        {
            "ix": "7-103_v2_56@0",
            "content": "In the social domain, proper social relations, respect for the rights of others, acceptance of social norms, and lawfulness were cited by Iranian participants.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_56",
            "start": 0,
            "end": 158,
            "label": {}
        },
        {
            "ix": "7-103_v2_56@1",
            "content": "The literature contains evidence on the significant role of proper communication with others and high level of mental well-being <REF-36> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_56",
            "start": 160,
            "end": 298,
            "label": {}
        },
        {
            "ix": "7-103_v2_56@2",
            "content": "Close relationships provide support when needed as well as mutual cooperation <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_56",
            "start": 300,
            "end": 387,
            "label": {}
        },
        {
            "ix": "7-103_v2_56@3",
            "content": "Social support networks have a considerable relationship with mood, performance and the quality of life (see WHO statement on mental health promotion ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_56",
            "start": 389,
            "end": 540,
            "label": {}
        },
        {
            "ix": "7-103_v2_56@4",
            "content": "New theories of well-being also point to the social aspects which correlate with the present study results <REF-37> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_56",
            "start": 542,
            "end": 658,
            "label": {}
        },
        {
            "ix": "7-103_v2_57@0",
            "content": "Regarding life skills, which were explored as one of the main dimensions of PMH; stress management, accountability, anger control, problem solving, financial management, and time management were proposed in the present study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_57",
            "start": 0,
            "end": 224,
            "label": {}
        },
        {
            "ix": "7-103_v2_57@1",
            "content": "Stress coping skills appear to be one of the most important skills for finding peace and promoting well-being.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_57",
            "start": 226,
            "end": 335,
            "label": {}
        },
        {
            "ix": "7-103_v2_57@2",
            "content": "In fact, stress coping mechanisms are not only important as factors affecting PMH, but also as PMH outcomes <REF-38> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_57",
            "start": 337,
            "end": 454,
            "label": {}
        },
        {
            "ix": "7-103_v2_57@3",
            "content": "Studies showed there is a strong relationship between financial management and satisfaction, and mental wellbeing <REF-39> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_57",
            "start": 456,
            "end": 579,
            "label": {}
        },
        {
            "ix": "7-103_v2_57@4",
            "content": "Also, existing evidence demonstrates a positive relationship between problem solving skills and social competencies <REF-40> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_57",
            "start": 581,
            "end": 706,
            "label": {}
        },
        {
            "ix": "7-103_v2_57@5",
            "content": "Generally, life skills empower people to cope with stresses and emotions, think critically, and are capable of making proper decisions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_57",
            "start": 708,
            "end": 842,
            "label": {}
        },
        {
            "ix": "7-103_v2_58@0",
            "content": "The present study has certain strengths and limitations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_58",
            "start": 0,
            "end": 55,
            "label": {}
        },
        {
            "ix": "7-103_v2_58@1",
            "content": "There is lack of appropriate studies, especially qualitative studies regarding defining social determinants of PMH in Iranian culture which can be considered as one of the most important strengths of this study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_58",
            "start": 57,
            "end": 267,
            "label": {}
        },
        {
            "ix": "7-103_v2_58@2",
            "content": "Using the qualitative approach provides an in-depth understanding of the concept of PMH from the society perspective.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_58",
            "start": 269,
            "end": 385,
            "label": {}
        },
        {
            "ix": "7-103_v2_58@3",
            "content": "Besides, maximum variation has been observed in the selection of study samples (marital status, occupation, gender and education).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_58",
            "start": 387,
            "end": 516,
            "label": {}
        },
        {
            "ix": "7-103_v2_59@0",
            "content": "Considering the study limitation, there is lack of generalizability and representativeness since the study was conducted using a qualitative method, and only its process and methodology can be generalized.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_59",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "7-103_v2_59@1",
            "content": "The findings need more research attempts to be applicable to the broader Iranian adult population due to the multi ethnicity context of the country.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_59",
            "start": 206,
            "end": 353,
            "label": {}
        },
        {
            "ix": "7-103_v2_60@0",
            "content": "In this study, we interpreted the concept of PMH and its aspects according to Iranian adults’ experiences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_60",
            "start": 0,
            "end": 105,
            "label": {}
        },
        {
            "ix": "7-103_v2_60@1",
            "content": "The results highlighted the significance and influences of emotional, psychological traits, spiritual and religious beliefs, social aspects and life skills on PMH.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_60",
            "start": 107,
            "end": 269,
            "label": {}
        },
        {
            "ix": "7-103_v2_60@2",
            "content": "Although PMH is considered a well-defined concept, sited as top priority and measured annually in various national mental health surveys in most developed countries, it is a new subject in our nations and needs more investigations and research so it can be introduced as a culturally and linguistically multidimensional concept.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_60",
            "start": 271,
            "end": 598,
            "label": {}
        },
        {
            "ix": "7-103_v2_60@3",
            "content": "Furthermore, a proper understating of how mental health professionals conceptualize the concept of PMH is essential in policy making and implementing proper community-based interventions in order to promote and protect mental health.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_60",
            "start": 600,
            "end": 832,
            "label": {}
        },
        {
            "ix": "7-103_v2_61@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_61",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "7-103_v2_62@0",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2018 Mirabzadeh A et al.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_62",
            "start": 0,
            "end": 134,
            "label": {}
        },
        {
            "ix": "7-103_v2_63@0",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_63",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "7-103_v2_64@0",
            "content": "Using Persian language as the national language of Iran during the process of data gathering, all raw data including quotes are available in Persian.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_64",
            "start": 0,
            "end": 148,
            "label": {}
        },
        {
            "ix": "7-103_v2_64@1",
            "content": "Translation and availability of complete raw data will be done upon the request and the permission of Ethical Committee of University of Social Welfare and Rehabilitation Sciences in order to maintain the participants’ confidentiality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_64",
            "start": 150,
            "end": 384,
            "label": {}
        },
        {
            "ix": "7-103_v2_64@2",
            "content": "Anyone wishing to access the data should first contact the corresponding author who will facilitate contact with the ethical review board ( http://www.uswr.ac.ir Persian site, http://en.uswr.ac.ir/ English site. Contact email international_affairs@uswr.ac.ir )",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_64",
            "start": 386,
            "end": 645,
            "label": {}
        },
        {
            "ix": "7-103_v2_65@0",
            "content": "<REF-1> Keyes CL : Mental health as a complete state: How the salutogenic perspective completes the picture. Bridging Occupational, Organizational and Public Health . Springer, 2014 ; 179 – 92 . 10.1007/978-94-007-5640-3_11",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_65",
            "start": 0,
            "end": 222,
            "label": {}
        },
        {
            "ix": "7-103_v2_66@0",
            "content": "<REF-3> Keyes CL : Mental illness and/or mental health? Investigating axioms of the complete state model of health. J Consult Clin Psychol. 2005 ; 73 ( 3 ): 539 – 48 . 15982151 10.1037/0022-006X.73.3.539",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_66",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "7-103_v2_67@0",
            "content": "<REF-4> Steel Z Marnane C Iranpour C : The global prevalence of common mental disorders: a systematic review and meta-analysis 1980–2013. Int J epidemiol. 2014 ; 43 ( 2 ): 476 – 93 . 24648481 10.1093/ije/dyu038 3997379",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_67",
            "start": 0,
            "end": 217,
            "label": {}
        },
        {
            "ix": "7-103_v2_68@0",
            "content": "<REF-5> Barry MM : Addressing the determinants of positive mental health: concepts, evidence and practice. Int J Ment Health Promotion. 2009 ; 11 ( 3 ): 4 – 17 . 10.1080/14623730.2009.9721788",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_68",
            "start": 0,
            "end": 190,
            "label": {}
        },
        {
            "ix": "7-103_v2_69@0",
            "content": "<REF-6> Whiteford HA Degenhardt L Rehm J : Global burden of disease attributable to mental and substance use disorders: findings from the Global Burden of Disease Study 2010. Lancet. 2013 ; 382 ( 9904 ): 1575 – 86 . 23993280 10.1016/S0140-6736(13)61611-6",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_69",
            "start": 0,
            "end": 253,
            "label": {}
        },
        {
            "ix": "7-103_v2_70@0",
            "content": "<REF-7> Huppert FA : Psychological Well-being: Evidence Regarding its Causes and Consequences † . Appl Psychol: Health and Well-Being. 2009 ; 1 ( 2 ): 137 – 64 . 10.1111/j.1758-0854.2009.01008.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_70",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "7-103_v2_71@0",
            "content": "<REF-8> Allen J Balfour R Bell R : Social determinants of mental health. Int Rev Psychiatry. 2014 ; 26 ( 4 ): 392 – 407 . 25137105 10.3109/09540261.2014.928270",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_71",
            "start": 0,
            "end": 158,
            "label": {}
        },
        {
            "ix": "7-103_v2_72@0",
            "content": "<REF-9> Huppert FA Whittington JE : Evidence for the independence of positive and negative well-being: implications for quality of life assessment. Br J Health Psychol. 2003 ; 8 ( Pt 1 ): 107 – 22 . 12643820 10.1348/135910703762879246",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_72",
            "start": 0,
            "end": 233,
            "label": {}
        },
        {
            "ix": "7-103_v2_73@0",
            "content": "<REF-10> Keyes CL Eisenberg D Perry GS : The relationship of level of positive mental health with current mental disorders in predicting suicidal behavior and academic impairment in college students. J Am Coll Health. 2012 ; 60 ( 2 ): 126 – 33 . 22316409 10.1080/07448481.2011.608393",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_73",
            "start": 0,
            "end": 282,
            "label": {}
        },
        {
            "ix": "7-103_v2_74@0",
            "content": "<REF-12> Wood AM Joseph S : The absence of positive psychological (eudemonic) well-being as a risk factor for depression: A ten year cohort study. J Affect Disord. 2010 ; 122 ( 3 ): 213 – 7 . 19706357 10.1016/j.jad.2009.06.032",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_74",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "7-103_v2_75@0",
            "content": "<REF-13> Keyes CL Dhingra SS Simoes EJ : Change in level of positive mental health as a predictor of future risk of mental illness. Am J Public Health. 2010 ; 100 ( 12 ): 2366 – 71 . 20966364 10.2105/AJPH.2010.192245 2978199",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_75",
            "start": 0,
            "end": 223,
            "label": {}
        },
        {
            "ix": "7-103_v2_76@0",
            "content": "<REF-14> Friedli L : Mental health, resilience and inequalities . WHO Regional Office for Europe Copenhagen. 2009 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_76",
            "start": 0,
            "end": 131,
            "label": {}
        },
        {
            "ix": "7-103_v2_77@0",
            "content": "<REF-15> Herrman H Jané-Llopis E : The status of mental health promotion. Public Health Rev. 2012 ; 34 : 6 . 10.1007/BF03391674",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_77",
            "start": 0,
            "end": 126,
            "label": {}
        },
        {
            "ix": "7-103_v2_78@0",
            "content": "<REF-16> Huppert FA So TT : Flourishing Across Europe: Application of a New Conceptual Framework for Defining Well-Being. Soc Indic Res. 2013 ; 110 ( 3 ): 837 – 61 . 23329863 10.1007/s11205-011-9966-7 3545194",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_78",
            "start": 0,
            "end": 207,
            "label": {}
        },
        {
            "ix": "7-103_v2_79@0",
            "content": "<REF-17> Karlsson H : Problems in the definitions of positive mental health. World psychiatry. 2012 ; 11 ( 2 ): 106 - 7 . 22654941 10.1016/j.wpsyc.2012.05.022 3363385",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_79",
            "start": 0,
            "end": 165,
            "label": {}
        },
        {
            "ix": "7-103_v2_80@0",
            "content": "<REF-18> Gilmour H : Positive mental health and mental illness. Health Rep. 2014 ; 25 ( 9 ): 3 – 9 . 25229895",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_80",
            "start": 0,
            "end": 108,
            "label": {}
        },
        {
            "ix": "7-103_v2_81@0",
            "content": "<REF-19> Nosratabasi M Joshanloo M Mohammadi F : Are Iranian Students Flourishing? Dev Psychol. 2010 ; 7 ( 25 ): 83 – 94 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_81",
            "start": 0,
            "end": 138,
            "label": {}
        },
        {
            "ix": "7-103_v2_82@0",
            "content": "<REF-20> Joshanloo M Wissing MP Khumalo IP : Measurement invariance of the Mental Health Continuum-Short Form (MHC-SF) across three cultural groups. Pers Individ Dif. 2013 ; 55 ( 7 ): 755 – 9 . 10.1016/j.paid.2013.06.002",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_82",
            "start": 0,
            "end": 219,
            "label": {}
        },
        {
            "ix": "7-103_v2_83@0",
            "content": "<REF-21> Holloway I Galvin K : Qualitative research in nursing and healthcare . John Wiley & Sons; 2016 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_83",
            "start": 0,
            "end": 121,
            "label": {}
        },
        {
            "ix": "7-103_v2_84@0",
            "content": "<REF-22> Robinson OC : Sampling in interview-based qualitative research: A theoretical and practical guide. Qual Res Psychol. 2014 ; 11 ( 1 ): 25 – 41 . 10.1080/14780887.2013.801543",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_84",
            "start": 0,
            "end": 180,
            "label": {}
        },
        {
            "ix": "7-103_v2_85@0",
            "content": "<REF-23> Hsieh HF Shannon SE : Three approaches to qualitative content analysis. Qual Health Res. 2005 ; 15 ( 9 ): 1277 – 88 . 16204405 10.1177/1049732305276687",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_85",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "7-103_v2_86@0",
            "content": "<REF-24> Rolfe G : Validity, trustworthiness and rigour: quality and the idea of qualitative research. J Adv Nurs. 2006 ; 53 ( 3 ): 304 – 10 . 16441535 10.1111/j.1365-2648.2006.03727.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_86",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "7-103_v2_87@0",
            "content": "<REF-25> Vaingankar JA Subramaiam M Lim YW : From well-being to positive mental health: conceptualization and qualitative development of an instrument in Singapore. Qual Life Res. 2012 ; 21 ( 10 ): 1785 – 94 . 22286222 10.1007/s11136-011-0105-3",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_87",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "7-103_v2_88@0",
            "content": "<REF-26> Laidlaw A McLellan J Ozakinci G : Understanding undergraduate student perceptions of mental health, mental well-being and help-seeking behaviour. Stud High Edu. 2016 ; 41 ( 12 ): 2156 – 68 . 10.1080/03075079.2015.1026890",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_88",
            "start": 0,
            "end": 228,
            "label": {}
        },
        {
            "ix": "7-103_v2_89@0",
            "content": "<REF-27> Molina FT : Happiness: Lessons from a new science . Sociologias. SciELO Brasil. 2015 ; 17 ( 40 ). 10.1590/15174522-017004031",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_89",
            "start": 0,
            "end": 132,
            "label": {}
        },
        {
            "ix": "7-103_v2_90@0",
            "content": "<REF-28> Lyubomirsky S King L Diener E : The benefits of frequent positive affect: does happiness lead to success? Psychol Bull. 2005 ; 131 ( 6 ): 803 – 55 . 16351326 10.1037/0033-2909.131.6.803",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_90",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "7-103_v2_91@0",
            "content": "<REF-29> Abdel-Khalek AM : Islam and mental health: A few speculations. Ment Health, Religion & Culture. 2011 ; 14 ( 2 ): 87 – 92 . 10.1080/13674676.2010.544867",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_91",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "7-103_v2_92@0",
            "content": "<REF-30> Ganga NS Kutty VR : Influence of religion, religiosity and spirituality on positive mental health of young people. Ment Health, Religion & Culture. 2013 ; 16 ( 4 ): 435 – 43 . 10.1080/13674676.2012.697879",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_92",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "7-103_v2_93@0",
            "content": "<REF-31> Gilbert P Nicollus V : Inspiring hope: Recognising the importance of spirituality in a whole person approach to mental health . NIMHE; 2003 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_93",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "7-103_v2_94@0",
            "content": "<REF-32> MacGillivray PS Sumsion T Wicks-Nicholls J : Critical elements of spirituality as identified by adolescent mental health clients. Can J Occup Ther. 2006 ; 73 ( 5 ): 295 – 302 . 17201102 10.2182/cjot.06.006",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_94",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "7-103_v2_95@0",
            "content": "<REF-33> Ju C Zhang B You X : Religiousness, social support and subjective well-being: An exploratory study among adolescents in an Asian atheist country. Int J Psychol. 2016 . 27132797 10.1002/ijop.12270",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_95",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "7-103_v2_96@0",
            "content": "<REF-34> Ryu S Lee OEK : Faith, spirituality, and values among Asian-American older adults: an exploratory factor analysis of the Multidimensional Measures of Religion and Spirituality. Ment Health, Religion & Culture. 2016 ; 19 ( 8 ): 920 – 31 . 10.1080/13674676.2017.1290593",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_96",
            "start": 0,
            "end": 275,
            "label": {}
        },
        {
            "ix": "7-103_v2_97@0",
            "content": "<REF-35> Koenig HG : Research on religion, spirituality, and mental health: a review. Can J Psychiatry. 2009 ; 54 ( 5 ): 283 – 91 . 19497160 10.1177/070674370905400502",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_97",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "7-103_v2_98@0",
            "content": "<REF-36> Barry MM : Promoting positive mental health and well-being: Practice and policy. Mental Well-Being. Springer, 2013 ; 355 – 84 . 10.1007/978-94-007-5195-8_16",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_98",
            "start": 0,
            "end": 164,
            "label": {}
        },
        {
            "ix": "7-103_v2_99@0",
            "content": "<REF-37> Belgrave FZ Berry BM : Community Approaches to Promoting Positive Mental Health and Psychosocial Well-Being. Handbook of Mental Health in African American Youth. 2016 ; 121 – 140 . 10.1007/978-3-319-25501-9_8",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_99",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "7-103_v2_100@0",
            "content": "<REF-38> Humphreys K Mankowski ES Moos RH : Do enhanced friendship networks and active coping mediate the effect of self-help groups on substance abuse? Ann Behav Med. 1999 ; 21 ( 1 ): 54 – 60 . 18425655 10.1007/BF02895034",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_100",
            "start": 0,
            "end": 221,
            "label": {}
        },
        {
            "ix": "7-103_v2_101@0",
            "content": "<REF-39> Collard S Hayes D : Financial Wellbeing In Later Life: Evidence And Policy . 2014 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_101",
            "start": 0,
            "end": 108,
            "label": {}
        },
        {
            "ix": "7-103_v2_102@0",
            "content": "<REF-40> Patel A : Need For Life Skills Education among Tribal and Non Tribal Students. Int J Indian Psychol. 2014 ; 2 ( 1 ): 17 – 28 . 10.13140/2.1.4718.4643",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-103_v2_102",
            "start": 0,
            "end": 157,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "7-103_v2_0",
            "tgt_ix": "7-103_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_1",
            "tgt_ix": "7-103_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_1",
            "tgt_ix": "7-103_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_1",
            "tgt_ix": "7-103_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_1",
            "tgt_ix": "7-103_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_0",
            "tgt_ix": "7-103_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_6",
            "tgt_ix": "7-103_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_6",
            "tgt_ix": "7-103_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_6",
            "tgt_ix": "7-103_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_6",
            "tgt_ix": "7-103_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_0",
            "tgt_ix": "7-103_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_11",
            "tgt_ix": "7-103_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_12",
            "tgt_ix": "7-103_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_11",
            "tgt_ix": "7-103_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_14",
            "tgt_ix": "7-103_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_11",
            "tgt_ix": "7-103_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_16",
            "tgt_ix": "7-103_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_11",
            "tgt_ix": "7-103_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_18",
            "tgt_ix": "7-103_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_0",
            "tgt_ix": "7-103_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_20",
            "tgt_ix": "7-103_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_20",
            "tgt_ix": "7-103_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_0",
            "tgt_ix": "7-103_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_23",
            "tgt_ix": "7-103_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_23",
            "tgt_ix": "7-103_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_25",
            "tgt_ix": "7-103_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_23",
            "tgt_ix": "7-103_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_23",
            "tgt_ix": "7-103_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_28",
            "tgt_ix": "7-103_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_23",
            "tgt_ix": "7-103_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_30",
            "tgt_ix": "7-103_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_30",
            "tgt_ix": "7-103_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_30",
            "tgt_ix": "7-103_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_30",
            "tgt_ix": "7-103_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_30",
            "tgt_ix": "7-103_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_30",
            "tgt_ix": "7-103_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_30",
            "tgt_ix": "7-103_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_30",
            "tgt_ix": "7-103_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_23",
            "tgt_ix": "7-103_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_0",
            "tgt_ix": "7-103_v2_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_52",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_53",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_54",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_55",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_56",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_57",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_58",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_59",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_60",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_0",
            "tgt_ix": "7-103_v2_61",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_61",
            "tgt_ix": "7-103_v2_62",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_61",
            "tgt_ix": "7-103_v2_63",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_61",
            "tgt_ix": "7-103_v2_64",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_0",
            "tgt_ix": "7-103_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_1",
            "tgt_ix": "7-103_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_2",
            "tgt_ix": "7-103_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_3",
            "tgt_ix": "7-103_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_4",
            "tgt_ix": "7-103_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_5",
            "tgt_ix": "7-103_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_6",
            "tgt_ix": "7-103_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_7",
            "tgt_ix": "7-103_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_8",
            "tgt_ix": "7-103_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_11",
            "tgt_ix": "7-103_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_12",
            "tgt_ix": "7-103_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_13",
            "tgt_ix": "7-103_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_14",
            "tgt_ix": "7-103_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_15",
            "tgt_ix": "7-103_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_16",
            "tgt_ix": "7-103_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_18",
            "tgt_ix": "7-103_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_20",
            "tgt_ix": "7-103_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_21",
            "tgt_ix": "7-103_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_22",
            "tgt_ix": "7-103_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_23",
            "tgt_ix": "7-103_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_24",
            "tgt_ix": "7-103_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_25",
            "tgt_ix": "7-103_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_26",
            "tgt_ix": "7-103_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_27",
            "tgt_ix": "7-103_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_28",
            "tgt_ix": "7-103_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_29",
            "tgt_ix": "7-103_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_30",
            "tgt_ix": "7-103_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_31",
            "tgt_ix": "7-103_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_32",
            "tgt_ix": "7-103_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_33",
            "tgt_ix": "7-103_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_34",
            "tgt_ix": "7-103_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_35",
            "tgt_ix": "7-103_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_36",
            "tgt_ix": "7-103_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_37",
            "tgt_ix": "7-103_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_38",
            "tgt_ix": "7-103_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_40",
            "tgt_ix": "7-103_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_41",
            "tgt_ix": "7-103_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_43",
            "tgt_ix": "7-103_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_44",
            "tgt_ix": "7-103_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_45",
            "tgt_ix": "7-103_v2_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_46",
            "tgt_ix": "7-103_v2_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_47",
            "tgt_ix": "7-103_v2_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_48",
            "tgt_ix": "7-103_v2_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_50",
            "tgt_ix": "7-103_v2_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_51",
            "tgt_ix": "7-103_v2_52",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_52",
            "tgt_ix": "7-103_v2_53",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_53",
            "tgt_ix": "7-103_v2_54",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_54",
            "tgt_ix": "7-103_v2_55",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_56",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_56",
            "tgt_ix": "7-103_v2_57",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_57",
            "tgt_ix": "7-103_v2_58",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_58",
            "tgt_ix": "7-103_v2_59",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_59",
            "tgt_ix": "7-103_v2_60",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_60",
            "tgt_ix": "7-103_v2_61",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_61",
            "tgt_ix": "7-103_v2_62",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_62",
            "tgt_ix": "7-103_v2_63",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_63",
            "tgt_ix": "7-103_v2_64",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_7",
            "tgt_ix": "7-103_v2_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_7",
            "tgt_ix": "7-103_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_8",
            "tgt_ix": "7-103_v2_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_8",
            "tgt_ix": "7-103_v2_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_51",
            "tgt_ix": "7-103_v2_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_13",
            "tgt_ix": "7-103_v2_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_15",
            "tgt_ix": "7-103_v2_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_50",
            "tgt_ix": "7-103_v2_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_51",
            "tgt_ix": "7-103_v2_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_54",
            "tgt_ix": "7-103_v2_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_54",
            "tgt_ix": "7-103_v2_90",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_91",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_92",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_93",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_94",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_95",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_96",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_97",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_56",
            "tgt_ix": "7-103_v2_98",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_56",
            "tgt_ix": "7-103_v2_99",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_57",
            "tgt_ix": "7-103_v2_100",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_57",
            "tgt_ix": "7-103_v2_101",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_57",
            "tgt_ix": "7-103_v2_102",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_24",
            "tgt_ix": "7-103_v2_26",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_27",
            "tgt_ix": "7-103_v2_29",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-103_v2_0",
            "tgt_ix": "7-103_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_1",
            "tgt_ix": "7-103_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_2",
            "tgt_ix": "7-103_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_2",
            "tgt_ix": "7-103_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_2",
            "tgt_ix": "7-103_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_2",
            "tgt_ix": "7-103_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_3",
            "tgt_ix": "7-103_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_3",
            "tgt_ix": "7-103_v2_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_4",
            "tgt_ix": "7-103_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_4",
            "tgt_ix": "7-103_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_5",
            "tgt_ix": "7-103_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_6",
            "tgt_ix": "7-103_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_7",
            "tgt_ix": "7-103_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_7",
            "tgt_ix": "7-103_v2_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_7",
            "tgt_ix": "7-103_v2_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_8",
            "tgt_ix": "7-103_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_8",
            "tgt_ix": "7-103_v2_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_8",
            "tgt_ix": "7-103_v2_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_8",
            "tgt_ix": "7-103_v2_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_9@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_9",
            "tgt_ix": "7-103_v2_9@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_10@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_10@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_10@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_10",
            "tgt_ix": "7-103_v2_10@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_11",
            "tgt_ix": "7-103_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_12",
            "tgt_ix": "7-103_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_13",
            "tgt_ix": "7-103_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_13",
            "tgt_ix": "7-103_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_14",
            "tgt_ix": "7-103_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_15",
            "tgt_ix": "7-103_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_15",
            "tgt_ix": "7-103_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_15",
            "tgt_ix": "7-103_v2_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_15",
            "tgt_ix": "7-103_v2_15@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_16",
            "tgt_ix": "7-103_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_17",
            "tgt_ix": "7-103_v2_17@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_18",
            "tgt_ix": "7-103_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_19",
            "tgt_ix": "7-103_v2_19@14",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_20",
            "tgt_ix": "7-103_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_21",
            "tgt_ix": "7-103_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_21",
            "tgt_ix": "7-103_v2_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_22",
            "tgt_ix": "7-103_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_22",
            "tgt_ix": "7-103_v2_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_22",
            "tgt_ix": "7-103_v2_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_23",
            "tgt_ix": "7-103_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_24",
            "tgt_ix": "7-103_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_24",
            "tgt_ix": "7-103_v2_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_24",
            "tgt_ix": "7-103_v2_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_24",
            "tgt_ix": "7-103_v2_24@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_24",
            "tgt_ix": "7-103_v2_24@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_24",
            "tgt_ix": "7-103_v2_24@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_25",
            "tgt_ix": "7-103_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_27",
            "tgt_ix": "7-103_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_28",
            "tgt_ix": "7-103_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_30",
            "tgt_ix": "7-103_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_31",
            "tgt_ix": "7-103_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_31",
            "tgt_ix": "7-103_v2_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_31",
            "tgt_ix": "7-103_v2_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_32",
            "tgt_ix": "7-103_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_32",
            "tgt_ix": "7-103_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_32",
            "tgt_ix": "7-103_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_33",
            "tgt_ix": "7-103_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_34",
            "tgt_ix": "7-103_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_35",
            "tgt_ix": "7-103_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_35",
            "tgt_ix": "7-103_v2_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_36",
            "tgt_ix": "7-103_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_36",
            "tgt_ix": "7-103_v2_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_37",
            "tgt_ix": "7-103_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_37",
            "tgt_ix": "7-103_v2_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_38",
            "tgt_ix": "7-103_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_39",
            "tgt_ix": "7-103_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_40",
            "tgt_ix": "7-103_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_40",
            "tgt_ix": "7-103_v2_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_40",
            "tgt_ix": "7-103_v2_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_40",
            "tgt_ix": "7-103_v2_40@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_40",
            "tgt_ix": "7-103_v2_40@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_41",
            "tgt_ix": "7-103_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_41",
            "tgt_ix": "7-103_v2_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_41",
            "tgt_ix": "7-103_v2_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_41",
            "tgt_ix": "7-103_v2_41@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_42",
            "tgt_ix": "7-103_v2_42@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_43",
            "tgt_ix": "7-103_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_43",
            "tgt_ix": "7-103_v2_43@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_43",
            "tgt_ix": "7-103_v2_43@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_43",
            "tgt_ix": "7-103_v2_43@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_43",
            "tgt_ix": "7-103_v2_43@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_44",
            "tgt_ix": "7-103_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_44",
            "tgt_ix": "7-103_v2_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_44",
            "tgt_ix": "7-103_v2_44@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_44",
            "tgt_ix": "7-103_v2_44@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_45",
            "tgt_ix": "7-103_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_45",
            "tgt_ix": "7-103_v2_45@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_45",
            "tgt_ix": "7-103_v2_45@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_45",
            "tgt_ix": "7-103_v2_45@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_45",
            "tgt_ix": "7-103_v2_45@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_46",
            "tgt_ix": "7-103_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_46",
            "tgt_ix": "7-103_v2_46@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_46",
            "tgt_ix": "7-103_v2_46@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_46",
            "tgt_ix": "7-103_v2_46@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_46",
            "tgt_ix": "7-103_v2_46@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_47",
            "tgt_ix": "7-103_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_47",
            "tgt_ix": "7-103_v2_47@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_48",
            "tgt_ix": "7-103_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_48",
            "tgt_ix": "7-103_v2_48@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_48",
            "tgt_ix": "7-103_v2_48@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_48",
            "tgt_ix": "7-103_v2_48@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_48",
            "tgt_ix": "7-103_v2_48@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_48",
            "tgt_ix": "7-103_v2_48@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_49",
            "tgt_ix": "7-103_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_50",
            "tgt_ix": "7-103_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_50",
            "tgt_ix": "7-103_v2_50@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_51",
            "tgt_ix": "7-103_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_51",
            "tgt_ix": "7-103_v2_51@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_51",
            "tgt_ix": "7-103_v2_51@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_51",
            "tgt_ix": "7-103_v2_51@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_51",
            "tgt_ix": "7-103_v2_51@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_51",
            "tgt_ix": "7-103_v2_51@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_52",
            "tgt_ix": "7-103_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_52",
            "tgt_ix": "7-103_v2_52@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_53",
            "tgt_ix": "7-103_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_53",
            "tgt_ix": "7-103_v2_53@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_53",
            "tgt_ix": "7-103_v2_53@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_54",
            "tgt_ix": "7-103_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_54",
            "tgt_ix": "7-103_v2_54@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_54",
            "tgt_ix": "7-103_v2_54@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_54",
            "tgt_ix": "7-103_v2_54@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_54",
            "tgt_ix": "7-103_v2_54@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_55@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_55@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_55@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_55@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_55",
            "tgt_ix": "7-103_v2_55@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_56",
            "tgt_ix": "7-103_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_56",
            "tgt_ix": "7-103_v2_56@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_56",
            "tgt_ix": "7-103_v2_56@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_56",
            "tgt_ix": "7-103_v2_56@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_56",
            "tgt_ix": "7-103_v2_56@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_57",
            "tgt_ix": "7-103_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_57",
            "tgt_ix": "7-103_v2_57@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_57",
            "tgt_ix": "7-103_v2_57@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_57",
            "tgt_ix": "7-103_v2_57@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_57",
            "tgt_ix": "7-103_v2_57@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_57",
            "tgt_ix": "7-103_v2_57@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_58",
            "tgt_ix": "7-103_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_58",
            "tgt_ix": "7-103_v2_58@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_58",
            "tgt_ix": "7-103_v2_58@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_58",
            "tgt_ix": "7-103_v2_58@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_59",
            "tgt_ix": "7-103_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_59",
            "tgt_ix": "7-103_v2_59@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_60",
            "tgt_ix": "7-103_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_60",
            "tgt_ix": "7-103_v2_60@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_60",
            "tgt_ix": "7-103_v2_60@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_60",
            "tgt_ix": "7-103_v2_60@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_61",
            "tgt_ix": "7-103_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_62",
            "tgt_ix": "7-103_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_63",
            "tgt_ix": "7-103_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_64",
            "tgt_ix": "7-103_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_64",
            "tgt_ix": "7-103_v2_64@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_64",
            "tgt_ix": "7-103_v2_64@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_65",
            "tgt_ix": "7-103_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_66",
            "tgt_ix": "7-103_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_67",
            "tgt_ix": "7-103_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_68",
            "tgt_ix": "7-103_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_69",
            "tgt_ix": "7-103_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_70",
            "tgt_ix": "7-103_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_71",
            "tgt_ix": "7-103_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_72",
            "tgt_ix": "7-103_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_73",
            "tgt_ix": "7-103_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_74",
            "tgt_ix": "7-103_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_75",
            "tgt_ix": "7-103_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_76",
            "tgt_ix": "7-103_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_77",
            "tgt_ix": "7-103_v2_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_78",
            "tgt_ix": "7-103_v2_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_79",
            "tgt_ix": "7-103_v2_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_80",
            "tgt_ix": "7-103_v2_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_81",
            "tgt_ix": "7-103_v2_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_82",
            "tgt_ix": "7-103_v2_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_83",
            "tgt_ix": "7-103_v2_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_84",
            "tgt_ix": "7-103_v2_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_85",
            "tgt_ix": "7-103_v2_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_86",
            "tgt_ix": "7-103_v2_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_87",
            "tgt_ix": "7-103_v2_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_88",
            "tgt_ix": "7-103_v2_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_89",
            "tgt_ix": "7-103_v2_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_90",
            "tgt_ix": "7-103_v2_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_91",
            "tgt_ix": "7-103_v2_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_92",
            "tgt_ix": "7-103_v2_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_93",
            "tgt_ix": "7-103_v2_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_94",
            "tgt_ix": "7-103_v2_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_95",
            "tgt_ix": "7-103_v2_95@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_96",
            "tgt_ix": "7-103_v2_96@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_97",
            "tgt_ix": "7-103_v2_97@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_98",
            "tgt_ix": "7-103_v2_98@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_99",
            "tgt_ix": "7-103_v2_99@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_100",
            "tgt_ix": "7-103_v2_100@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_101",
            "tgt_ix": "7-103_v2_101@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-103_v2_102",
            "tgt_ix": "7-103_v2_102@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "7-103_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.13394.2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Positive Mental Health from the perspective of Iranian society: A qualitative study",
        "abstract": "Background : According to the World Health Organization, mental health relates, not only to the absence of mental disorder, but also to Positive Mental Health. Studies have shown that promoting positive mental health, not only reduces the prevalence and incidence of mental disorders, but also affects the process of treatment and reduces related burden. However, this concept has different interpretations in different cultures, and in many societies, mental health is still considered the absence of mental illness. Thus, the present study was conducted to provide an in-depth understanding of Iranian adults` perspective towards the concept of positive mental health. Materials and Methods : In the present qualitative study, eight focus group discussions (6 to 8 adults in each session) were held consisting of 30 to 60 year-old men and women from Tehran. Data were analyzed in \"DeDoose\" qualitative software using content analysis. Results : According to the data obtained, participants found no difference between positive mental health and mental health, mostly equating it to the absence of mental disorders and having positive energy, peace in and satisfaction with life. According to the results, positive mental health has four domains of emotional/psychological, spiritual, social, and life skills. Conclusion : Understanding an individual’s positive mental health concepts culturally and providing appropriate community based programs can significantly promote the mental health of the community.",
        "contributors": [
            {
                "surname": "Mirabzadeh",
                "given-names": "Arash"
            },
            {
                "surname": "Baradaran Eftekhari",
                "given-names": "Monir"
            },
            {
                "surname": "Falahat",
                "given-names": "Katayoun"
            },
            {
                "surname": "Sajjadi",
                "given-names": "Homeira"
            },
            {
                "surname": "Vameghi",
                "given-names": "Meroe"
            },
            {
                "surname": "Ghaedamini Harouni",
                "given-names": "Gholamreza"
            }
        ],
        "url": "https://f1000research.com/articles/7-103/v2/",
        "doc_id": "7-103",
        "version": 2,
        "ix_counter": 447,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}