{
    "nodes": [
        {
            "ix": "7-1359_v2_0",
            "content": "Virologic failure and HIV drug resistance on simplified, dolutegravir-based maintenance therapy: Systematic review and meta-analysis",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_2",
            "content": "Background: Dolutegravir-containing maintenance therapy is a promising simplification strategy for virologically suppressed HIV-infected individuals. However, most of the available data to inform this strategy come from small, uncontrolled studies. We estimated the proportion of HIV-infected patients experiencing virological failure (VF) and developing drug resistance on dolutegravir (DTG)-based maintenance therapy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_3",
            "content": "Methods: We searched Medline, Embase, Cochrane Central, Web of Science, and conference abstracts for studies assessing VF on DTG-based maintenance therapy. Studies including ≥5 adults with an undetectable viral load on antiretroviral therapy (ART) who switched to a DTG-based mono- or dual therapy were included. Pooled proportions of VF were estimated using random-intercept logistic meta-regression and acquired drug resistance mutations described for each strategy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_4",
            "content": "Results : Of 1719 studies considered, 21 met our selection criteria, including seven interventional and 14 observational studies. Eight studies including 251 patients assessed VF on DTG monotherapy and fourteen studies including 1670 participants VF on dual therapy. The participant’s median age ranged from 43 to 63 years, their median nadir CD4 count from 90 to 399 cells/µl, and 27.6% were female. The proportion of participants experiencing VF on DTG-monotherapy was 3.6% (95% confidence interval [CI] 1.9-6.7) at 24 weeks and 8.9% (95% CI 4.7-16.2) at 48 weeks. Resistance mutations developed in seven (3.6%) participants on DTG-monotherapy. Among patients on dual therapy, ten (0.7%, 95% CI 0.4-1.3) experienced VF by 48 weeks and none developed resistance to DTG. In adjusted analyses, VF at 24 weeks was less likely on dual therapy than on monotherapy (adjusted odds ratio: 0.10, 95% CI 0.03-0.30).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_5",
            "content": "Conclusions: Whereas VF is relatively common on DTG maintenance monotherapy, DTG-based dual therapy appears to be a promising simplification strategy for individuals with a suppressed HIV viral load on triple-ART.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_6",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_7",
            "content": "The concept of combination antiretroviral therapy (ART) for the treatment of HIV infection was established twenty years ago, when the results of the first studies evaluating protease inhibitor-based regimens were published <REF-1> . In recent years, several strategies of treatment optimization and simplification gained interest, with the objectives of improving quality of life, minimizing ART-related toxicity and drug-drug interactions (DDI), as well as reducing health-related costs. So far, ART de-escalation from three to one (mono-) or two drugs (dual-) therapies has mainly been evaluated in virologically suppressed patients. The first simplified maintenance strategy studied included a boosted protease inhibitor (bPI), with the hope that the high genetic barrier to resistance would help achieve durable virological suppression. In a meta-analysis including ten studies, bPI monotherapy was found to be inferior to triple ART for the maintenance of viral suppression <REF-2> , but non-inferior with regards to loss of future treatment options <REF-3> . In contrast, dual therapy with bPI and lamivudine (3TC) was found to be non-inferior to triple ART <REF-4> – <REF-6> and is now recognized as a valid switch strategy by current HIV treatment guidelines in selected situations <REF-7> . However, bPI-based maintenance strategies are not widely applicable because of cost, toxicity and DDI.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_8",
            "content": "Due to its interesting pharmacokinetic profile, good tolerability and high barrier to resistance, dolutegravir (DTG), a new integrase strand transfer inhibitor (InSTI), has attracted much interest for its use in simplified treatment regimens. While preliminary analyses of a Dutch DTG monotherapy simplification trial seemed encouraging at 24 weeks, rates of virological failures increased significantly by week 48, suggesting a sub-optimal potency of this regimen <REF-8> . On the other hand, several studies evaluating DTG-based dual therapy with either 3TC or rilpivirine (RPV), showed a high virological efficacy <REF-9> – <REF-12> . However, most reports were from small, observational cohort studies, with the exception of one DTG-RPV industry-sponsored randomized controlled trial (RCT) <REF-11> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_9",
            "content": "We performed a systematic review of the literature and a meta-analysis to provide precise estimates of the rate of virological failure (VF) and drug resistance in patients switched to a DTG-based maintenance mono- or dual therapy, and to clarify which drugs or combinations should be evaluated in further studies and implemented in clinical practice.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_10",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_11",
            "content": "The protocol for this systematic review was written and registered with the International Prospective Register of Systematic Reviews (PROSPERO registration number CRD42017070045 ) <REF-13> . The reporting of the review followed the PRISMA guidelines <REF-14> ( Supplementary File 1 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_12",
            "content": "Search strategy and selection criteria",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_13",
            "content": "We searched Medline, EMBASE, Cochrane Central and Web of Science, as well as abstracts of major HIV conferences (CROI, AIDS, HIV Glasgow, AFRAVIH, IAS and EACS between 2013 and 2017) on 4. January 2018 for studies assessing the proportion of individuals developing VF on DTG-based maintenance therapy. In Medline we combined free text words and medical subject headings (MESH) describing the study population and the outcome ( Supplementary File 2 ). This search strategy was adapted for the other databases. We considered RCTs, single-arm clinical trials, cohort studies, and case-series that included at least five HIV-infected adults (≥18 years) on DTG-based simplified therapy. No language restrictions were applied. Studies had to report on virological outcomes of patients who switched to a DTG monotherapy or dual therapy after having an undetectable VL on triple ART. We excluded studies that only reported in vitro data and those selecting participants based on the outcome during DTG-based maintenance therapy. Two investigators (MB and GW) independently selected studies based on titles and abstracts, and, in a second step, based on the full text of potentially eligible articles. Discrepancies in study selection were resolved through discussions with a third investigator (AC).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_14",
            "content": "Data extraction",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_15",
            "content": "The following data were extracted independently for each study by two reviewers (GW and MB), using a standardized spreadsheet: bibliographic details, study design, inclusion and exclusion criteria, definitions of outcomes, country, number of participants and their main demographic and clinical characteristics, including duration since HIV diagnosis, ART history, immunological status (CD4 cell count at switch and nadir) and virological parameters (HIV RNA peak and at baseline, HIV-DNA at baseline and changes during the study, VF as defined by the study, and the presence at drug resistance at switch). Again, discrepancies in data extracted were resolved through discussions with a third investigator (AC).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_16",
            "content": "Assessment of risk of bias",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_17",
            "content": "A checklist for the assessment of risk of bias was designed to ensure data quality assessment for each study was included. The form for RCTs included information on the sequence generation, allocation concealment, blinding (participants, personnel and outcome assessor), incomplete outcome data, selective outcome reporting and other sources of bias. The methodological components of the randomized trials were assessed by two independent authors and classified as high, low or unclear risk of bias, as recommended by the Cochrane collaboration <REF-15> . For observational studies it was not appropriate to use the ROBINS-I tool <REF-16> , as we only considered data from the group of patients on simplified, maintenance therapy. Thus, we assessed the population characteristics and missing outcome data for each study.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_18",
            "content": "Data analysis",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_19",
            "content": "We described the study design as well as the demographic and clinical characteristics of the population from each study by type of maintenance therapy (DTG-based monotherapy or dual therapy). Pooled proportions of VF and treatment failure (VF or departure from simplified strategy due to toxicity, loss to follow-up, patient’s or physician’s decision), and 95% confidence intervals (CI) were estimated using random intercept logistic meta-regression. These analyses were performed separately at 24 weeks and 48 weeks after the switch from triple ART to maintenance therapy. For all models, statistical evidence for heterogeneity between studies was assessed using the tau-squared statistics <REF-17> . Of note, we separated data from Blanco et al. <REF-18> according to the strategy used (DTG-monotherapy and DTG-based dual therapy). We evaluated the association between type of maintenance strategy and VF using random intercept logistic meta-regression (binomial-normal) models. All models were adjusted for potential confounders, including age (median or mean), sex (proportion of female participants) and study type (interventional or observational). Furthermore, the proportion of participants acquiring new drug resistance mutations was assessed for each treatment strategy and the mutations described in detail. Statistical analyses were conducted in STATA version 14.1 (StataCorp, Texas, USA) and R version 3.2.3 (R Core Team, Vienna, Austria).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_20",
            "content": "Role of the funding source",
            "ntype": "title",
            "meta": {
                "section": "2.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_21",
            "content": "The funder of the study had no role in the design, data collection, data analysis, data interpretation of the results or writing of the report. The corresponding author had full access to all the data in the study and had final responsibility for the decision to submit for publication.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_22",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_23",
            "content": "Study and participant characteristics",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_24",
            "content": "Of 1719 single studies identified, 63 remained potentially eligible after the screening of titles and abstracts. Of these, 21 studies, including four RCTs, three single-arm clinical trials and 14 observational studies met our inclusion criteria <REF-8> , <REF-11> , <REF-12> , <REF-18> – <REF-35> ( Figure 1 ). A description of the main study characteristics by type of maintenance strategy is given in Table 1 . Eight studies (two from France, two from The Netherlands, one from Germany, one from Switzerland and two from Spain) including 251 patients assessed the switch to DTG monotherapy and 14 (five from Italy, four from France, three for Spain, one from US, and one multi-country study), including 1670 participants, the switch to DTG-based dual therapy. Dual therapy consisted of DTG + 3TC (seven studies) or RPV (four studies) or atazanavir (ATV, two studies) or darunavir (DRV, one study). Overall, 14 studies allowed the inclusion of patients with previous virological failure, including five monotherapy studies <REF-18> – <REF-20> , <REF-22> – <REF-24> . In one study, patients with previous InSTI failure were also included <REF-12> . Nineteen studies assessed virological outcomes at six months of maintenance therapy, whereas ten of them additionally showed outcomes at one year <REF-8> , <REF-11> , <REF-12> , <REF-24> , <REF-27> , <REF-29> – <REF-33> , <REF-35> . Two studies assessed virological outcomes only at 48 weeks <REF-25> , <REF-27> . Median (or mean) age of participants included in the studies varied from 43 years <REF-11> to 63 years <REF-24> and 27.6% of them were female. 16 studies reported on the median nadir CD4 cell count, which ranged from 90 cells/µl <REF-12> to 399 cells/µl <REF-29> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_25",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Flow chart of study selection process.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/19875/7ac14920-777e-4ffa-8f72-c77cb7dd37d7_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_26",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Flow chart of study selection process.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/19875/7ac14920-777e-4ffa-8f72-c77cb7dd37d7_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Flow chart of study selection process.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/19875/7ac14920-777e-4ffa-8f72-c77cb7dd37d7_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_27",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Study characteristics, by treatment group.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_28",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Study characteristics, by treatment group.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" rowspan=\"2\" valign=\"top\">Study</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">Country</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">Patients <break/>included <break/>(N)</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">Median/ <break/>mean age <break/>(years)</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">Female <break/>(%)</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">VF definition</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">Study <break/>type</th> <th align=\"center\" colspan=\"6\" valign=\"top\">Eligibility criteria</th> </tr> <tr> <th align=\"center\" valign=\"top\">Previous <break/>VF allowed</th> <th align=\"center\" valign=\"top\">Previous <break/>resistances <break/>allowed</th> <th align=\"center\" valign=\"top\">Months <break/>of stable <break/>ART</th> <th align=\"center\" valign=\"top\">Months <break/>with <break/>HIV <break/>VL&lt;50</th> <th align=\"center\" valign=\"top\">CD4 <break/>nadir <break/>(cells/ <break/>&#181;l)</th> <th align=\"center\" valign=\"top\">Other</th> </tr> </thead> <tbody> <tr> <td align=\"left\" valign=\"top\"> <bold> <underline>DTG-Mono</underline> </bold> </td> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Katlama <italic>et al</italic>. <break/> <italic>JAC 2016</italic> </td> <td align=\"center\" valign=\"top\">F</td> <td align=\"center\" valign=\"top\">28</td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">46.4</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml or <break/>1&#215; &gt; 200 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 12</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Wijting <italic>et al</italic>. <break/> <italic>Lancet HIV</italic> </td> <td align=\"center\" valign=\"top\">NL</td> <td align=\"center\" valign=\"top\">96</td> <td align=\"center\" valign=\"top\">45.5</td> <td align=\"center\" valign=\"top\">8.5</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 200 cp/ml</td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">No</td> <td align=\"center\" valign=\"top\">No</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 6</td> <td align=\"center\" valign=\"top\">&gt;200</td> <td align=\"center\" valign=\"top\">VL zenith &lt;100.000</td> </tr> <tr> <td align=\"left\" valign=\"top\">Gubavu <italic>et al</italic>. <break/> <italic>JAC 2016</italic> </td> <td align=\"center\" valign=\"top\">F</td> <td align=\"center\" valign=\"top\">21</td> <td align=\"center\" valign=\"top\">47</td> <td align=\"center\" valign=\"top\">38</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Oldenb&#252;ttel <italic>et al</italic>. <break/> <italic>AVT 2016</italic> </td> <td align=\"center\" valign=\"top\">D</td> <td align=\"center\" valign=\"top\">31</td> <td align=\"center\" valign=\"top\">44.5</td> <td align=\"center\" valign=\"top\">32</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 20 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">Not to InSTI</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 6</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">no AIDS history</td> </tr> <tr> <td align=\"left\" valign=\"top\">Rokx <italic>et al</italic>. <break/> <italic>JAC 2016</italic> </td> <td align=\"center\" valign=\"top\">NL</td> <td align=\"center\" valign=\"top\">5</td> <td align=\"center\" valign=\"top\">63</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 12</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Rojas <italic>et al</italic>. <break/> <italic>JAC 2016</italic> </td> <td align=\"center\" valign=\"top\">E</td> <td align=\"center\" valign=\"top\">31</td> <td align=\"center\" valign=\"top\">56</td> <td align=\"center\" valign=\"top\">55</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 37 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Lecompte <italic>et al</italic>. <break/> <italic>IAS 2017</italic> </td> <td align=\"center\" valign=\"top\">CH</td> <td align=\"center\" valign=\"top\">8</td> <td align=\"center\" valign=\"top\">44.5</td> <td align=\"center\" valign=\"top\">28.5</td> <td align=\"center\" valign=\"top\">1&#215; &#8805; 200cp/ml </td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">No</td> <td align=\"center\" valign=\"top\">No</td> <td align=\"center\" valign=\"top\">&#8805; 24</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Blanco <italic>et al</italic>. <break/> <italic>JAC 2018</italic> </td> <td align=\"center\" valign=\"top\">E</td> <td align=\"center\" valign=\"top\">31</td> <td align=\"center\" valign=\"top\">47</td> <td align=\"center\" valign=\"top\">10</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml or <break/>1&#215; &gt; 1000 cp/ml</td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 12</td> <td align=\"center\" valign=\"top\">&gt;200</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold> <underline>DTG-3TC</underline> </bold> </td> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Borghetti <italic>et al</italic>. <break/> <italic>JAC 2016</italic> </td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">36</td> <td align=\"center\" valign=\"top\">53</td> <td align=\"center\" valign=\"top\">19.4</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Maggiolo <italic>et al</italic>. <break/> <italic>BMC ID 2017</italic> </td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">94</td> <td align=\"center\" valign=\"top\">52</td> <td align=\"center\" valign=\"top\">32.3</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">Not to 3TC <break/>or InSTI</td> <td align=\"center\" valign=\"top\">&gt; 6</td> <td align=\"center\" valign=\"top\">&#8805; 6</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Joly <italic>et al</italic>. <break/> <italic>CROI 2017</italic> </td> <td align=\"center\" valign=\"top\">F</td> <td align=\"center\" valign=\"top\">104</td> <td align=\"center\" valign=\"top\">45</td> <td align=\"center\" valign=\"top\">14.4</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">No</td> <td align=\"center\" valign=\"top\">No</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 24</td> <td align=\"center\" valign=\"top\">&gt;200</td> <td align=\"center\" valign=\"top\">no HIV encephalitis <sup> <xref ref-type=\"other\" rid=\"TF1\">&#163;</xref> </sup> </td> </tr> <tr> <td align=\"left\" valign=\"top\">Reynes <italic>et al</italic>. <break/> <italic>HIV Glasgow</italic> <break/> <italic>2016</italic> </td> <td align=\"center\" valign=\"top\">F</td> <td align=\"center\" valign=\"top\">27</td> <td align=\"center\" valign=\"top\">59</td> <td align=\"center\" valign=\"top\">25.9</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">Not to InSTI</td> <td align=\"center\" valign=\"top\">&gt; 12</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Blanco <italic>et al</italic>. <break/> <italic>JAC 2018</italic> </td> <td align=\"center\" valign=\"top\">E</td> <td align=\"center\" valign=\"top\">29</td> <td align=\"center\" valign=\"top\">44</td> <td align=\"center\" valign=\"top\">21</td> <td/> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 12</td> <td align=\"center\" valign=\"top\">&gt;200</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Maggiolo <italic>et al</italic>. <break/> <italic>EACS 2017</italic> </td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">203</td> <td align=\"center\" valign=\"top\">52</td> <td align=\"center\" valign=\"top\">24.6</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">No M184V</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 6</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Taiwo <italic>et al</italic>. <break/> <italic>CID 2017</italic> </td> <td align=\"center\" valign=\"top\">US</td> <td align=\"center\" valign=\"top\">44</td> <td align=\"center\" valign=\"top\">46</td> <td align=\"center\" valign=\"top\">17</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">No</td> <td align=\"center\" valign=\"top\">No</td> <td align=\"center\" valign=\"top\">&#8805; 12</td> <td align=\"center\" valign=\"top\">&#8805; 12</td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold> <underline>DTG-RPV</underline> </bold> </td> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Llibre <italic>et al</italic>. <break/> <italic>Lancet 2018</italic> </td> <td align=\"center\" valign=\"top\">Multi- <break/>country</td> <td align=\"center\" valign=\"top\">513</td> <td align=\"center\" valign=\"top\">43</td> <td align=\"center\" valign=\"top\">23</td> <td align=\"center\" valign=\"top\">1&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">No</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&gt; 6</td> <td align=\"center\" valign=\"top\">&#8805; 12</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Gantner <italic>et al</italic>. <break/> <italic>HIV Med 2017</italic> </td> <td align=\"center\" valign=\"top\">F</td> <td align=\"center\" valign=\"top\">116</td> <td align=\"center\" valign=\"top\">55</td> <td align=\"center\" valign=\"top\">44</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml or <break/>1&#215; &#8805; 1,000 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Bonijoly <italic>et al</italic>. <break/> <italic>EACS 2017</italic> </td> <td align=\"center\" valign=\"top\">F</td> <td align=\"center\" valign=\"top\">268</td> <td align=\"center\" valign=\"top\">55</td> <td align=\"center\" valign=\"top\">44</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 6</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">On ART for &#8805; 12 <break/>months</td> </tr> <tr> <td align=\"left\" valign=\"top\">Revuelta <italic>et al</italic>. <break/> <italic>Ann pharmacol</italic> <break/> <italic>2018</italic> </td> <td align=\"center\" valign=\"top\">E</td> <td align=\"center\" valign=\"top\">32</td> <td align=\"center\" valign=\"top\">49</td> <td align=\"center\" valign=\"top\">37</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">Not to InSTI <break/>or RPV</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold> <underline>DTG-ATV</underline> </bold> </td> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Riva <italic>et al</italic>. <break/> <italic>HIV Glasgow</italic> <break/> <italic>2016</italic> </td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">61</td> <td align=\"center\" valign=\"top\">52.1</td> <td align=\"center\" valign=\"top\">39</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\">Castagna <italic>et al</italic>. <break/> <italic>EACS 2017</italic> </td> <td align=\"center\" valign=\"top\">I</td> <td align=\"center\" valign=\"top\">116</td> <td align=\"center\" valign=\"top\">53</td> <td align=\"center\" valign=\"top\">13</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 12</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold> <underline>DTG-DRV</underline> </bold> </td> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Navarro <italic>et al</italic>. <break/> <italic>EACS 2017</italic> </td> <td align=\"center\" valign=\"top\">E</td> <td align=\"center\" valign=\"top\">27</td> <td align=\"center\" valign=\"top\">52</td> <td align=\"center\" valign=\"top\">30</td> <td align=\"center\" valign=\"top\">2&#215; &#8805; 50 cp/ml</td> <td align=\"center\" valign=\"top\">O</td> <td align=\"center\" valign=\"top\">Yes</td> <td align=\"center\" valign=\"top\">Only to one <break/>ART class</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">&#8805; 6</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> </tr> </tbody> </table> <table-wrap-foot> <fn> <p>Abbreviations: VF: virologic failure, ART: antiretroviral therapy, DTG: dolutegravir, 3TC: lamivudine, FTC: emtricitabine, RPV: rilpivirine, ATV: atazanavir, InSTI: integrase stand transfert inhibitor, F: France, NL: The Netherlands, D: Germany, E: Spain, CH: Switzerland, I: Italy, USA: United States of America, O: observational study; I: interventional study</p> <p id=\"TF1\">&#163;:&#160;&#160;&#160;&#160;&#160;&#160;no abnormal standard biological parameter</p> </fn> </table-wrap-foot> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Study characteristics, by treatment group.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_29",
            "content": "Risk of bias",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_30",
            "content": "All RCTs were open-label non-inferiority trials <REF-8> , <REF-18> , <REF-35> , of which one was a single center trial <REF-18> and three were multicenter trials <REF-8> , <REF-11> , <REF-35> . They reported adequate generation of random allocation sequences and allocation concealment. Three single-arm trials were included, of which two included less than 10 patients <REF-21> , <REF-24> , <REF-29> . All interventional studies adequately addressed incomplete outcome data: proportions of drop-outs were low and outcome data were missing for less than 20% of participants in all studies. Five of seven trials reported on virological outcomes at both time-points of interest for this study (24 and 48 weeks) <REF-8> , <REF-11> , <REF-24> , <REF-29> , <REF-35> . There was no evidence of selective reporting in any of the studies. In each of the 14 observational studies included in this review, the main demographic and clinical characteristics of the study populations were similar and patients were followed for 24 weeks in most studies. Among the observational studies, the majority did not report detailed inclusion and exclusion criteria. Five observational studies reported virological outcomes at both time-points <REF-12> , <REF-30> – <REF-33> . Amplification for drug resistance testing was successful for 19 of the 27 (70%) patients with VF. Finally, patient retention was over 90% in all 14 cohort studies.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_31",
            "content": "Virological and treatment failure",
            "ntype": "title",
            "meta": {
                "section": "3.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_32",
            "content": "The pooled estimate of the proportion of participants who experienced a VF on DTG-based monotherapy was 3.6% (95% CI 1.9-6.7) at 24 weeks and 8.9% (95% CI 4.7-16.2) at 48 weeks ( Figure 2 ). The high proportion of treatment failures among patients on monotherapy at 48 weeks was driven by the two studies from the Netherlands, which observed between 8 and 20% of VF <REF-8> , <REF-24> . Among patients on dual therapy, an estimated 0.4% (95% CI 0.2-0.9) experienced a VF at 24 weeks and 0.7% (95% CI 0.4-1.3) at 48 weeks. Independently of the combination used (DTG/3TC, DTG/RPV, DTG/ATV or DTG/DRV), 11 of 14 studies evaluating the effectiveness of dual therapy had less than 1% of patients developing VF. Compared to patients on monotherapy, those on dual therapy were less likely to experience VF by 24 weeks (odds ratio [OR] 0.10, 95% CI 0.03-0.32, p<0.001) and 48 weeks (OR 0.07, 95% CI 0.03-0.18, p<0.001). In analyses adjusted for study type (interventional or observational), age (median or mean) and sex (proportion of female participants), the OR for VF at 24 weeks and 48 weeks were very similar to the unadjusted estimates (aOR 0.10, 95% CI 0.03-0.30 for 24 weeks and aOR 0.06, 95% CI 0.01-0.30 for 48 weeks, respectively). The only variable that contributed to explaining the between-study heterogeneity in both the 24 and 48-week analyses was treatment strategy. When including this variable, the tau-squared were reduced from 1.17 (95% CI 0.33-2.19) to 0.00 (95% CI 0.00-1.11) in the 24 week analysis and from 1.37 (95% CI 0.54-2.15) to 0.00 (95% CI 0.00-1.00) in the 48 week analysis. The inclusion of other variables did not impact the estimates of tau-squared.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_33",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Meta-analysis of virological failure among patients on single or dual DTG-based simplification therapy.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/19875/7ac14920-777e-4ffa-8f72-c77cb7dd37d7_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_34",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Meta-analysis of virological failure among patients on single or dual DTG-based simplification therapy.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/19875/7ac14920-777e-4ffa-8f72-c77cb7dd37d7_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Meta-analysis of virological failure among patients on single or dual DTG-based simplification therapy.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/19875/7ac14920-777e-4ffa-8f72-c77cb7dd37d7_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_35",
            "content": "Treatment failure occurred in 5.2% (2.0–12.9) of patients at 24 weeks and 12.3% (4.5–29.4) at 48 weeks on DTG-monotherapy, whereas this outcome was observed in 2.8% (1.4–5.7) of patients at 24 weeks and 6.5% (4.3–9.6) at 48 weeks on DTG-based dual therapy. At 24 weeks, patients on dual therapy tended to be less likely to experience treatment failure compared to those on monotherapy (aOR 0.52, 95% CI 0.15-1.85). Due to multi-collinearity in the model, we were not able to report on multivariable analyses comparing treatment failure between mono and dual therapy at 48 weeks.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_36",
            "content": "Drug resistance",
            "ntype": "title",
            "meta": {
                "section": "3.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_37",
            "content": "Acquired resistance mutations to InSTI developed in 9/251 (3.6%) participants on DTG-based monotherapy, which corresponded to 56% of the cases of VF ( Table 2 ). Three individuals developed the Q148R or Q148H mutation in combination with other resistance mutations, conferring high-level resistance to DTG <REF-20> , <REF-22> . Two of these three patients were previously exposed to InSTI and none had a history of previous VF. They all had a suppressed HIV viral load for several years before switching to DTG-monotherapy. No InSTI resistance mutations developed in patients on dual therapy. Of 962 patients on RPV/DTG, only one developed a major drug resistance mutation to non-nucleoside reverse transcriptase inhibitors (K101E). No resistance was observed in plasma among 237 individuals on DTG/3TC.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_38",
            "content": "Table 2.",
            "ntype": "label",
            "meta": {
                "id": "T2",
                "caption": "Virological outcomes and drug resistance, by study.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_39",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T2\" position=\"anchor\"> <caption> <title>Virological outcomes and drug resistance, by study.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" rowspan=\"2\" valign=\"top\">Study</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">Follow-up <break/>(weeks)</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">N&#176; <break/>patients</th> <th align=\"center\" colspan=\"2\" valign=\"top\"> <underline>N&#176; treatment</underline> <break/> <underline>failures (%)</underline> </th> <th align=\"center\" colspan=\"2\" valign=\"top\"> <underline>N&#176; virological</underline> <break/> <underline>failures (%)</underline> </th> <th align=\"center\" rowspan=\"2\" valign=\"top\">N&#176; <break/>amplified</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">N&#176; patients <break/>with <break/>resistance</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">Resistance patterns <break/>(one line <break/>per patient) <xref ref-type=\"other\" rid=\"TFN2\">*</xref> </th> </tr> <tr> <th align=\"center\" valign=\"top\">24 <break/>weeks</th> <th align=\"center\" valign=\"top\">48 <break/>weeks</th> <th align=\"center\" valign=\"top\">24 <break/>weeks</th> <th align=\"center\" valign=\"top\">48 <break/>weeks</th> </tr> </thead> <tbody> <tr> <td align=\"left\" valign=\"top\"> <bold> <underline>DTG-Mono</underline> </bold> </td> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Katlama <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">28</td> <td align=\"center\" valign=\"top\">4 (14.3)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">3 (10.7)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">3</td> <td align=\"center\" valign=\"top\"> <bold>3</bold> </td> <td align=\"center\" valign=\"top\"> <bold>E138K,G140A, Q148R</bold> <break/> <bold>E92Q</bold> <break/> <bold>N155H</bold> </td> </tr> <tr> <td align=\"left\" valign=\"top\">Wijting <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">96</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">11 (11.5)</td> <td align=\"center\" valign=\"top\">2 (2.1)</td> <td align=\"center\" valign=\"top\">8 (8.3)</td> <td align=\"center\" valign=\"top\">6</td> <td align=\"center\" valign=\"top\"> <bold>3</bold> </td> <td align=\"center\" valign=\"top\"> <bold>S230R</bold> <break/> <bold>R263K</bold> <break/> <bold>N155H</bold> </td> </tr> <tr> <td align=\"left\" valign=\"top\">Gubavu <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">21</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Oldenb&#252;ttel <break/> <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">31</td> <td align=\"center\" valign=\"top\">2 (6.5)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">1 (3.2)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">1</td> <td align=\"center\" valign=\"top\"> <bold>1</bold> </td> <td align=\"center\" valign=\"top\"> <bold>Q148H, G140S</bold> </td> </tr> <tr> <td align=\"left\" valign=\"top\">Rokx <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">5</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">1 (20)</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">1 (20.0)</td> <td align=\"center\" valign=\"top\">1</td> <td align=\"center\" valign=\"top\">0</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Rojas <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">31</td> <td align=\"center\" valign=\"top\">1 (3.2)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">1 (3.2)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">1</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">118R <xref ref-type=\"other\" rid=\"TFN3\">**</xref> </td> </tr> <tr> <td align=\"left\" valign=\"top\">Lecompte <italic>et al</italic>.</td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">8</td> <td align=\"center\" valign=\"top\">1 (12.5)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Blanco <italic>et al</italic>.</td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">31</td> <td align=\"center\" valign=\"top\">2 (6.5)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">2 (6.4)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">2</td> <td align=\"center\" valign=\"top\"> <bold>2</bold> </td> <td align=\"center\" valign=\"top\"> <bold>E138A, S147G, N155H,</bold> <break/> <bold>Q148R</bold> <break/> <bold>138K, 155H, 140S</bold> </td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold> <underline>DTG-3TC</underline> </bold> </td> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Borghetti <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">36</td> <td align=\"center\" valign=\"top\">3 (8.3)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Maggiolo <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">94</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">3 (3.2)</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Joly <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">104</td> <td align=\"center\" valign=\"top\">1 (1.0)</td> <td align=\"center\" valign=\"top\">3 (2.9)</td> <td align=\"center\" valign=\"top\">1 (1.0)</td> <td align=\"center\" valign=\"top\">1 (1.0)</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Reynes <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">27</td> <td align=\"center\" valign=\"top\">3 (11.1)</td> <td align=\"center\" valign=\"top\">3 (11.1)</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Blanco <italic>et al</italic>.</td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">29</td> <td align=\"center\" valign=\"top\">1 (3.5)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">1 (3.4)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">1</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">K70E <xref ref-type=\"other\" rid=\"TFN4\">***</xref>, K219E <xref ref-type=\"other\" rid=\"TFN4\">***</xref>, <break/>G190R <sup> <xref ref-type=\"other\" rid=\"TFN5\">$</xref> </sup>, M230I <sup> <xref ref-type=\"other\" rid=\"TFN5\">$</xref> </sup> </td> </tr> <tr> <td align=\"left\" valign=\"top\">Maggiolo <italic>et al</italic>.</td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">203</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">12 (6.0)</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Taiwo <italic>et al</italic>.</td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">44</td> <td align=\"center\" valign=\"top\">1 (2.3)</td> <td align=\"center\" valign=\"top\">3 (6.9)</td> <td align=\"center\" valign=\"top\">1</td> <td align=\"center\" valign=\"top\">1</td> <td align=\"center\" valign=\"top\">1</td> <td align=\"center\" valign=\"top\">0</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold> <underline>DTG-RPV</underline> </bold> </td> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Llibre <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">513</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">27 (5.3)</td> <td align=\"center\" valign=\"top\">1 (0.2)</td> <td align=\"center\" valign=\"top\">2 (0.4)</td> <td align=\"center\" valign=\"top\">2</td> <td align=\"center\" valign=\"top\">1</td> <td align=\"center\" valign=\"top\">K101K/E</td> </tr> <tr> <td align=\"left\" valign=\"top\">Gantner <italic>et al</italic>.</td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">116</td> <td align=\"center\" valign=\"top\">11 (9.5)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">1 (0.9)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Bonijoly <italic>et al</italic>.</td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">268</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">51 (19.0)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">4 (1.5)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Revuelta <italic>et al</italic>.</td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">32</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">2 (6.5)</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold> <underline>DTG-ATV</underline> </bold> </td> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Riva <italic>et al</italic>. </td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">61</td> <td align=\"center\" valign=\"top\">3 (4.9)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Castagna <italic>et al</italic>.</td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">116</td> <td align=\"center\" valign=\"top\">5 (4.3)</td> <td align=\"center\" valign=\"top\">6 (5.2)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">1 (0.9)</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">-</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold> <underline>DTG-DRV</underline> </bold> </td> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Navarro <italic>et al</italic>.</td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">27</td> <td align=\"center\" valign=\"top\">-</td> <td align=\"center\" valign=\"top\">2 (7.4)</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">1 (3.7)</td> <td align=\"center\" valign=\"top\">1</td> <td align=\"center\" valign=\"top\">0</td> <td/> </tr> </tbody> </table> <table-wrap-foot> <fn> <p id=\"TFN2\">*bold: InSTI resistance</p> </fn> <fn> <p id=\"TFN3\">**in 7% of integrated DNA in PBMC</p> </fn> <fn> <p id=\"TFN4\">*** in &#8804;1.5% of integrated DNA in PBMC</p> </fn> <fn> <p id=\"TFN5\"> <sup>$</sup> in integrated DNA in PBMC</p> </fn> </table-wrap-foot> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T2",
                "caption": "Virological outcomes and drug resistance, by study.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_40",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS0\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/15995/ac97e706-e48e-4415-9993-ef82d20186e8_Dataset_1.xls\"> <label>Dolutegravir meta-analysis summary data</label> <caption> <p>This table shows summary measures, including the number of virological and treatment failures in each study.</p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_41",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_42",
            "content": "We performed a comprehensive systematic review of studies that reported on VF among patients switched to DTG-based maintenance therapy. Our meta-analysis shows that DTG-based dual therapy is successful in sustaining virological control in ART-experienced HIV-infected patients: only 12 of 1670 (0.7%) experienced a VF and none of them developed resistance mutations to DTG. On the contrary, 16 of 251 (6.4%) individuals switched to DTG monotherapy had a VF, of which more than one-half developed resistance to DTG. In comparison, recent trials evaluating InSTI-based triple maintenance combinations showed a similar virological failure rates <REF-36> , <REF-37> . Although the proportion of patients experiencing a confirmed viral rebound on DTG-monotherapy does not seem to be higher than in patients on PI-monotherapy, the risk of losing future treatment options is higher with DTG-monotherapy <REF-3> . Overall, our findings suggest that DTG-based monotherapy is not an appropriate simplification strategy and that further studies are urgently needed to confirm the long-term efficacy of DTG-based dual therapy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_43",
            "content": "DTG-based dual therapy is a promising simplification strategy, especially when combined with 3TC, as the likelihood of developing toxicity events and DDI on such regimens is very low. No drug resistance mutations to DTG developed among more than 1600 patients on dual therapy followed for 24 to 48 weeks and only one had a resistance mutation to another drug class. Although based on very few patients, the results seemed to be independent of previous virological failures. For instance, no virological failures were noted among patients on DTG/3TC despite the presence of a 184V mutation at the time of simplification in several studies. The impact of the latter mutation on viral fitness has been extensively described both in vitro <REF-38> and in vivo <REF-39> , and could also potentially explain the improved treatment outcomes in these patients compared to those switched to DTG-monotherapy without any previous failures. Interestingly, similar observations were made for bPI-based regimens, for which efficacy was improved when 3TC was added, despite the presence of the 184V mutation <REF-39> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_44",
            "content": "We also report on estimates of treatment failure, which includes other reasons for treatment interruptions, such as toxicity or loss to follow-up. In our meta-analysis, the proportion of patients experiencing this combined outcome was more than twice as high among patients on monotherapy compared to those on DTG-based dual therapy. Although this outcome is important in evaluating the clinical efficacy of a novel ART strategy, our capacity to analyze this outcome in detail was limited by the missing information on the specific reasons for treatment interruptions in many studies and by the small number of events, especially at 48 weeks of therapy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_45",
            "content": "Of all simplification strategies evaluated to date, the DTG/3TC combination could be the one most readily accessible for patients in low- and middle-income countries: both DTG and 3TC are available and prequalified by stringent regulatory authorities in generic formulations. In order to be widely implemented, the efficacy of this dual combination should first be evaluated in large studies among different patient populations. The results from the studies included in our meta-analysis are mainly based on selected populations of HIV-infected individuals from European cohorts, and are not generalizable. Furthermore, long-term data are needed, as most treatment failures occurred after the first 24 weeks in several monotherapy studies. Recently, results from the only study which assessed 96-week outcomes with this regimen to date were reported: among 27 ART-experienced individuals with previous VF, DTG/3TC was 100% efficacious virologically <REF-12> . However, despite these encouraging results, data from larger studies are needed. In addition, more data on the activity of DTG-based simplified regimens in compartments other than blood are needed. Letendre et al . showed that DTG achieved therapeutic concentrations in the central nervous system (CNS), with a CNS penetration effectiveness score of four <REF-40> . In the MONODO study, all patients had an undetectable plasma HIV viral load at week 24 on DTG maintenance monotherapy, whereas only one had a detectable viral load in the cerebrospinal fluid <REF-21> . Moreover, levels of HIV-RNA in the genital tract on DTG monotherapy <REF-41> and on DTG-3TC <REF-42> were comparable to those on standard cART. However, these results were based on a very small sample of patients and data from individuals on simplified, DTG-based therapies are lacking.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_46",
            "content": "As a wealth of data on the efficacy of DTG-maintenance strategies from small studies are being disseminated at a fast pace, this systematic review is the first analysis to provide comparative estimates of virological failure between DTG-based monotherapy and dual therapy. More than 1700 studies were screened, including abstracts from all important HIV conferences in the past years. As our meta-analysis included studies with diverse study designs and populations, it could be argued that the comparison of studies with such differences might be problematic. However, the estimates of VF were very similar across studies, especially in the DTG-based dual therapy arm. This finding highlights the potency of this combination, even in the presence of previous drug resistance mutations or multiple co-morbidities. Unfortunately, only studies including low numbers of patients reported outcomes from individuals on DTG-monotherapy, and data on dual therapy was dominated by one large study that assessed the efficacy of the DTG/RPV combination. As a consequence, the comparison of DTG-monotherapy vs. DTG/3TC, which would have been the most interesting one, was not possible. Furthermore, the lack of availability of individual data from the different studies precluded the analysis of risk factors of VF in the different simplification regimens. As most studies were observational, it is possible that the investigators mainly included patients with good adherence, which may have limited the generalizability of their findings. Finally, our results might have slightly under-estimated the proportion of patients with VF as individuals who were lost to follow-up might have experienced this outcome without them being accounted for. However, our treatment failure estimates showed that even when other reasons of treatment failure were considered, DTG-based dual therapy was superior to monotherapy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_47",
            "content": "In summary, DTG-based dual maintenance therapy seems to be a promising simplification strategy with high virological efficacy and low potential for DDI and toxicity. Such a treatment regimen could be an interesting alternative to classical triple-ART in selected patients. Furthermore, dual therapy might be a cost-effective global ART strategy <REF-43> . A number of large prospective studies evaluating the efficacy of DTG-based dual therapy are under way and will inform its potential implementation at a large scale. In addition to the studies using DTG-emtricitabine(FTC <REF-44> ) and DTG-3TC <REF-45> maintenance therapy, clinical trials are also assessing the efficacy of DTG/3TC in treatment-naïve patients <REF-46> . Furthermore, it will be critical to evaluate the efficacy of DTG-3TC or FTC dual therapy in specific sub-groups such as pregnant and breast-feeding women, adolescents, patients with previous failure to standard triple regimens and harboring the M184V resistance mutation, as well as in patients with HIV associated neurocognitive disorder and tuberculosis coinfection.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_48",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_49",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2019 Wandeler G et al.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_50",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_51",
            "content": "F1000Research: Dataset 1. Dolutegravir meta-analysis summary data. 10.5256/f1000research.15995.d215724 <REF-47>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_52",
            "content": "<REF-1> Gulick RM Mellors JW Havlir D : Treatment with indinavir, zidovudine, and lamivudine in adults with human immunodeficiency virus infection and prior antiretroviral therapy. N Engl J Med. 1997 ; 337 ( 11 ): 734 – 9 . 9287228 10.1056/NEJM199709113371102",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_53",
            "content": "<REF-2> Mathis S Khanlari B Pulido F : Effectiveness of protease inhibitor monotherapy versus combination antiretroviral maintenance therapy: a meta-analysis. PLoS One. 2011 ; 6 ( 7 ): e22003 . 21811554 10.1371/journal.pone.0022003 3139616",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_54",
            "content": "<REF-3> Paton NI Stöhr W Arenas-Pinto A : Protease inhibitor monotherapy for long-term management of HIV infection: a randomised, controlled, open-label, non-inferiority trial. Lancet HIV. 2015 ; 2 ( 10 ): e417 – 26 . 26423649 10.1016/S2352-3018(15)00176-9 4765553",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_55",
            "content": "<REF-4> Pulido F Ribera E Lagarde M : Non-inferiority of dual-therapy (DT) with darunavir/ritonavir (DRV/r) plus 3TC versus triple-therapy (TT) with DRV/r plus TDF/FTC or ABC/3TC for maintenance of viral suppression: 48-week results of the DUAL-GESIDA 8014 trial - abstract n°: 0331 . HIV Glasgow Conference . Glasgow, 23–26 October 2016. 2016 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_56",
            "content": "<REF-6> Perez-Molina JA Rubio R Rivero A : Dual treatment with atazanavir-ritonavir plus lamivudine versus triple treatment with atazanavir-ritonavir plus two nucleos(t)ides in virologically stable patients with HIV-1 (SALT): 48 week results from a randomised, open-label, non-inferiority trial. Lancet Infect Dis. 2015 ; 15 ( 7 ): 775 – 84 . 26062881 10.1016/S1473-3099(15)00097-3",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_57",
            "content": "<REF-7> EACS Guidelines version 9.0 . 2017 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_58",
            "content": "<REF-8> Wijting I Rokx C Boucher C : Dolutegravir as maintenance monotherapy for HIV (DOMONO): a phase 2, randomised non-inferiority trial. Lancet HIV. 2017 ; 4 ( 12 ): e547 – e554 . 29107562 10.1016/S2352-3018(17)30152-2",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_59",
            "content": "<REF-9> Cahn P Rolón MJ Figueroa MI : Dolutegravir-lamivudine as initial therapy in HIV-1 infected, ARV-naive patients, 48-week results of the PADDLE (Pilot Antiretroviral Design with Dolutegravir LamivudinE) study. J Int AIDS Soc. 2017 ; 20 ( 1 ): 21678 . 28537061 10.7448/IAS.20.01.21678 5515053",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_60",
            "content": "<REF-11> Llibre JM Hung CC Brinson C : Efficacy, safety, and tolerability of dolutegravir-rilpivirine for the maintenance of virological suppression in adults with HIV-1: phase 3, randomised, non-inferiority SWORD-1 and SWORD-2 studies. Lancet. 2018 ; 391 ( 10123 ): 839 – 49 . 29310899 10.1016/S0140-6736(17)33095-7",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_61",
            "content": "<REF-12> Reynes J Meftah N Tuaillon E : Dual regimen with dolutegravir and lamivudine maintains virologic suppression even in heavily treatment experienced HIV-infected patients: 96 weeks results from maintenance DOLULAM study . Abstract n°: MOPEB0322. International AIDS Society (IAS) conference . Paris, 23–26 July 2017. 2017 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_62",
            "content": "<REF-13> Booth A Clarke M Dooley G : The nuts and bolts of PROSPERO: an international prospective register of systematic reviews. Syst Rev. 2012 ; 1 : 2 . 22587842 10.1186/2046-4053-1-2 3348673",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_63",
            "content": "<REF-14> Liberati A Altman DG Tetzlaff J : The PRISMA statement for reporting systematic reviews and meta-analyses of studies that evaluate health care interventions: explanation and elaboration. PLoS Med. 2009 ; 6 ( 7 ): e1000100 . 19621070 10.1371/journal.pmed.1000100 2707010",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_64",
            "content": "<REF-15> Higgins JP Altman DG Gøtzsche PC : The Cochrane Collaboration's tool for assessing risk of bias in randomised trials. BMJ. 2011 ; 343 : d5928 . 22008217 10.1136/bmj.d5928 3196245",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_65",
            "content": "<REF-16> Sterne JA Hernán MA Reeves BC : ROBINS-I: a tool for assessing risk of bias in non-randomised studies of interventions. BMJ. 2016 ; 355 : i4919 . 27733354 10.1136/bmj.i4919 5062054",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_66",
            "content": "<REF-17> Higgins JP Thompson SG Deeks JJ : Measuring inconsistency in meta-analyses. BMJ. 2003 ; 327 ( 7414 ): 557 – 60 . 12958120 10.1136/bmj.327.7414.557 192859",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_67",
            "content": "<REF-18> Blanco JL Rojas J Paredes R : Dolutegravir-based maintenance monotherapy versus dual therapy with lamivudine: a planned 24 week analysis of the DOLAM randomized clinical trial. J Antimicrob Chemother. 2018 ; 73 ( 7 ): 1965 – 1971 . 29608685 10.1093/jac/dky093",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_68",
            "content": "<REF-20> Katlama C Soulié C Caby F : Dolutegravir as monotherapy in HIV-1-infected individuals with suppressed HIV viraemia. J Antimicrob Chemother. 2016 ; 71 ( 9 ): 2646 – 50 . 27287235 10.1093/jac/dkw186",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_69",
            "content": "<REF-21> Sculier D Doco-Lecompte T Yerly S : Stable HIV-1 reservoirs on dolutegravir maintenance monotherapy: the MONODO study. HIV Med. 2018 ; 19 ( 8 ): 572 – 577 . 29932298 10.1111/hiv.12626",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_70",
            "content": "<REF-22> Oldenbuettel C Wolf E Ritter A : Dolutegravir monotherapy as treatment de-escalation in HIV-infected adults with virological control: DoluMono cohort results. Antivir Ther. 2017 ; 22 ( 2 ): 169 – 72 . 27588613 10.3851/IMP3082",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_71",
            "content": "<REF-24> Rokx C Schurink CA Boucher CA : Dolutegravir as maintenance monotherapy: first experiences in HIV-1 patients. J Antimicrob Chemother. 2016 ; 71 ( 6 ): 1632 – 6 . 26888910 10.1093/jac/dkw011",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_72",
            "content": "<REF-25> Bonijoly T CA Cheret A Cotte L : Week-48 efficacy and safety of dolutegravir + rilpivirine dual therapy as switch strategy in a real-life cohort study. Abstract n°: PE9/15 European AIDS Clinical Society (EACS) conference , Milano, 25–27 October 2017. 2017 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_73",
            "content": "<REF-27> Castagna AGR Rusconi S Riva A : Durability and Safety of a Dual Antiretroviral Regimen with Dolutegravir and Unboosted Atazanavir in HIV-1 Infected Patients with Virological Suppression . Abstract n°: PE9/63. European AIDS Clinical Society (EACS) conference , Milano, 25–27 October 2017. 2017 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_74",
            "content": "<REF-29> Joly V Burdet C Landman R : Promising Results of Lamivudine + DolutegravirMaintenance Therapy in ANRS 167 Lamidol Trial. Abstract number: 458. Conference on Retrovirus and Opportunistic Infections (CROI), Seattle, 13–16 February 2017. 2017 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_75",
            "content": "<REF-30> Maggiolo F Gulminetti R Pagnucco L : Lamivudine/dolutegravir dual therapy in HIV-infected, virologically suppressed patients. BMC Infect Dis. 2017 ; 17 ( 1 ): 215 . 28302065 10.1186/s12879-017-2311-2 5356275",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_76",
            "content": "<REF-33> Revuelta-Herrero JL Chamorro-de-Vega E Rodríguez-González CG : Effectiveness, Safety, and Costs of a Treatment Switch to Dolutegravir Plus Rilpivirine Dual Therapy in Treatment-Experienced HIV Patients. Ann Pharmacother. 2018 ; 52 ( 1 ): 11 – 8 . 28836468 10.1177/1060028017728294",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_77",
            "content": "<REF-35> Taiwo BO Marconi VC Berzins B : Dolutegravir Plus Lamivudine Maintains Human Immunodeficiency Virus-1 Suppression Through Week 48 in a Pilot Randomized Trial. Clin Infect Dis. 2018 ; 66 ( 11 ): 1794 – 1797 . 29293895 10.1093/cid/cix1131 5961309",
            "ntype": "ref",
            "meta": {
                "id": "ref-35",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_78",
            "content": "<REF-36> Arribas JR Pialoux G Gathe J : Simplification to coformulated elvitegravir, cobicistat, emtricitabine, and tenofovir versus continuation of ritonavir-boosted protease inhibitor with emtricitabine and tenofovir in adults with virologically suppressed HIV (STRATEGY-PI): 48 week results of a randomised, open-label, phase 3b, non-inferiority trial. Lancet Infect Dis. 2014 ; 14 ( 7 ): 581 – 9 . 24908551 10.1016/S1473-3099(14)70782-0",
            "ntype": "ref",
            "meta": {
                "id": "ref-36",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_79",
            "content": "<REF-37> Pozniak A Markowitz M Mills A : Switching to coformulated elvitegravir, cobicistat, emtricitabine, and tenofovir versus continuation of non-nucleoside reverse transcriptase inhibitor with emtricitabine and tenofovir in virologically suppressed adults with HIV (STRATEGY-NNRTI): 48 week results of a randomised, open-label, phase 3b non-inferiority trial. Lancet Infect Dis. 2014 ; 14 ( 7 ): 590 – 9 . 24908550 10.1016/S1473-3099(14)70796-0",
            "ntype": "ref",
            "meta": {
                "id": "ref-37",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_80",
            "content": "<REF-38> Oliveira M Ibanescu RI Pham HT : The M184I/V and K65R nucleoside resistance mutations in HIV-1 prevent the emergence of resistance mutations against dolutegravir. AIDS. 2016 ; 30 ( 15 ): 2267 – 73 . 27367488 10.1097/QAD.0000000000001191",
            "ntype": "ref",
            "meta": {
                "id": "ref-38",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_81",
            "content": "<REF-39> Ciaffi L Koulla-Shiro S Sawadogo AB : Boosted protease inhibitor monotherapy versus boosted protease inhibitor plus lamivudine dual therapy as second-line maintenance treatment for HIV-1-infected patients in sub-Saharan Africa (ANRS12 286/MOBIDIP): a multicentre, randomised, parallel, open-label, superiority trial. Lancet HIV. 2017 ; 4 ( 9 ): e384 – e92 . 28566227 10.1016/S2352-3018(17)30069-3",
            "ntype": "ref",
            "meta": {
                "id": "ref-39",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_82",
            "content": "<REF-40> Letendre SL Mills AM Tashima KT : ING116070: a study of the pharmacokinetics and antiviral activity of dolutegravir in cerebrospinal fluid in HIV-1-infected, antiretroviral therapy-naive subjects. Clin Infect Dis. 2014 ; 59 ( 7 ): 1032 – 7 . 24944232 10.1093/cid/ciu477 4166983",
            "ntype": "ref",
            "meta": {
                "id": "ref-40",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_83",
            "content": "<REF-41> Hocqueloux L Gubavu C Lefeuvre S : HIV-1-infected patients under successful less-drug regimens have similar genital shedding and residual viremia than those under triple therapy . International AIDS Society (IAS) conference, Paris, 23–26 July 2017 . 2017 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-41",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_84",
            "content": "<REF-42> Gianella S Wilkin T Berzins B : Genital HIV-1 shedding with Dolutegravir (DTG) plus Lamivudine (3TC) dual therapy . International AIDS Conference, Amsterdam, 23–27 Juy 2018 . 2018 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-42",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_85",
            "content": "<REF-43> Girouard MP Sax PE Parker RA : The Cost-effectiveness and Budget Impact of 2-Drug Dolutegravir-Lamivudine Regimens for the Treatment of HIV Infection in the United States. Clin Infect Dis. 2016 ; 62 ( 6 ): 784 – 91 . 26658053 10.1093/cid/civ981 4772845",
            "ntype": "ref",
            "meta": {
                "id": "ref-43",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_86",
            "content": "<REF-44> Camly A BM Sculier D Wandeler G : Evaluation of a simplified strategy for the long-term management of HIV infection: a non-inferiority, randomized, controlled, open-label clinical trial: The Simpl'HIV Trial . NCT03160105.",
            "ntype": "ref",
            "meta": {
                "id": "ref-44",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_87",
            "content": "<REF-45> E. M. Dolutegravir-based Simplification Strategies: DOLAM . EudraCT 2015-000274-35.",
            "ntype": "ref",
            "meta": {
                "id": "ref-45",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_88",
            "content": "<REF-46> Taiwo BO Zheng L Stefanescu A : ACTG A5353: A Pilot Study of Dolutegravir Plus Lamivudine for Initial Treatment of Human Immunodeficiency Virus-1 (HIV-1)-infected Participants With HIV-1 RNA <500000 Copies/mL. Clin Infect Dis. 2018 ; 66 ( 11 ): 1689 – 1697 . 29253097 10.1093/cid/cix1083 5961075",
            "ntype": "ref",
            "meta": {
                "id": "ref-46",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1359_v2_89",
            "content": "<REF-47> Wandeler G Buzzi M Anderegg N : Dataset 1 in: Virologic failure and HIV drug resistance on simplified, dolutegravir-based maintenance therapy: Systematic review and meta-analysis. F1000Research. 2018 . http://www.doi.org/10.5256/f1000research.15995.d215724",
            "ntype": "ref",
            "meta": {
                "id": "ref-47",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "7-1359_v2_0@0",
            "content": "Virologic failure and HIV drug resistance on simplified, dolutegravir-based maintenance therapy: Systematic review and meta-analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_0",
            "start": 0,
            "end": 131,
            "label": {}
        },
        {
            "ix": "7-1359_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-1359_v2_2@0",
            "content": "Background: Dolutegravir-containing maintenance therapy is a promising simplification strategy for virologically suppressed HIV-infected individuals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_2",
            "start": 0,
            "end": 148,
            "label": {}
        },
        {
            "ix": "7-1359_v2_2@1",
            "content": "However, most of the available data to inform this strategy come from small, uncontrolled studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_2",
            "start": 150,
            "end": 247,
            "label": {}
        },
        {
            "ix": "7-1359_v2_2@2",
            "content": "We estimated the proportion of HIV-infected patients experiencing virological failure (VF) and developing drug resistance on dolutegravir (DTG)-based maintenance therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_2",
            "start": 249,
            "end": 418,
            "label": {}
        },
        {
            "ix": "7-1359_v2_3@0",
            "content": "Methods: We searched Medline, Embase, Cochrane Central, Web of Science, and conference abstracts for studies assessing VF on DTG-based maintenance therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_3",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "7-1359_v2_3@1",
            "content": "Studies including ≥5 adults with an undetectable viral load on antiretroviral therapy (ART) who switched to a DTG-based mono- or dual therapy were included.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_3",
            "start": 156,
            "end": 311,
            "label": {}
        },
        {
            "ix": "7-1359_v2_3@2",
            "content": "Pooled proportions of VF were estimated using random-intercept logistic meta-regression and acquired drug resistance mutations described for each strategy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_3",
            "start": 313,
            "end": 467,
            "label": {}
        },
        {
            "ix": "7-1359_v2_4@0",
            "content": "Results : Of 1719 studies considered, 21 met our selection criteria, including seven interventional and 14 observational studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_4",
            "start": 0,
            "end": 128,
            "label": {}
        },
        {
            "ix": "7-1359_v2_4@1",
            "content": "Eight studies including 251 patients assessed VF on DTG monotherapy and fourteen studies including 1670 participants VF on dual therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_4",
            "start": 130,
            "end": 265,
            "label": {}
        },
        {
            "ix": "7-1359_v2_4@2",
            "content": "The participant’s median age ranged from 43 to 63 years, their median nadir CD4 count from 90 to 399 cells/µl, and 27.6% were female.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_4",
            "start": 267,
            "end": 399,
            "label": {}
        },
        {
            "ix": "7-1359_v2_4@3",
            "content": "The proportion of participants experiencing VF on DTG-monotherapy was 3.6% (95% confidence interval [CI] 1.9-6.7) at 24 weeks and 8.9% (95% CI 4.7-16.2) at 48 weeks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_4",
            "start": 401,
            "end": 565,
            "label": {}
        },
        {
            "ix": "7-1359_v2_4@4",
            "content": "Resistance mutations developed in seven (3.6%) participants on DTG-monotherapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_4",
            "start": 567,
            "end": 645,
            "label": {}
        },
        {
            "ix": "7-1359_v2_4@5",
            "content": "Among patients on dual therapy, ten (0.7%, 95% CI 0.4-1.3) experienced VF by 48 weeks and none developed resistance to DTG.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_4",
            "start": 647,
            "end": 769,
            "label": {}
        },
        {
            "ix": "7-1359_v2_4@6",
            "content": "In adjusted analyses, VF at 24 weeks was less likely on dual therapy than on monotherapy (adjusted odds ratio: 0.10, 95% CI 0.03-0.30).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_4",
            "start": 771,
            "end": 905,
            "label": {}
        },
        {
            "ix": "7-1359_v2_5@0",
            "content": "Conclusions: Whereas VF is relatively common on DTG maintenance monotherapy, DTG-based dual therapy appears to be a promising simplification strategy for individuals with a suppressed HIV viral load on triple-ART.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_5",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "7-1359_v2_6@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_6",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "7-1359_v2_7@0",
            "content": "The concept of combination antiretroviral therapy (ART) for the treatment of HIV infection was established twenty years ago, when the results of the first studies evaluating protease inhibitor-based regimens were published <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_7",
            "start": 0,
            "end": 231,
            "label": {}
        },
        {
            "ix": "7-1359_v2_7@1",
            "content": "In recent years, several strategies of treatment optimization and simplification gained interest, with the objectives of improving quality of life, minimizing ART-related toxicity and drug-drug interactions (DDI), as well as reducing health-related costs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_7",
            "start": 233,
            "end": 487,
            "label": {}
        },
        {
            "ix": "7-1359_v2_7@2",
            "content": "So far, ART de-escalation from three to one (mono-) or two drugs (dual-) therapies has mainly been evaluated in virologically suppressed patients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_7",
            "start": 489,
            "end": 634,
            "label": {}
        },
        {
            "ix": "7-1359_v2_7@3",
            "content": "The first simplified maintenance strategy studied included a boosted protease inhibitor (bPI), with the hope that the high genetic barrier to resistance would help achieve durable virological suppression.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_7",
            "start": 636,
            "end": 839,
            "label": {}
        },
        {
            "ix": "7-1359_v2_7@4",
            "content": "In a meta-analysis including ten studies, bPI monotherapy was found to be inferior to triple ART for the maintenance of viral suppression <REF-2> , but non-inferior with regards to loss of future treatment options <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_7",
            "start": 841,
            "end": 1063,
            "label": {}
        },
        {
            "ix": "7-1359_v2_7@5",
            "content": "In contrast, dual therapy with bPI and lamivudine (3TC) was found to be non-inferior to triple ART <REF-4> – <REF-6> and is now recognized as a valid switch strategy by current HIV treatment guidelines in selected situations <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_7",
            "start": 1065,
            "end": 1298,
            "label": {}
        },
        {
            "ix": "7-1359_v2_7@6",
            "content": "However, bPI-based maintenance strategies are not widely applicable because of cost, toxicity and DDI.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_7",
            "start": 1300,
            "end": 1401,
            "label": {}
        },
        {
            "ix": "7-1359_v2_8@0",
            "content": "Due to its interesting pharmacokinetic profile, good tolerability and high barrier to resistance, dolutegravir (DTG), a new integrase strand transfer inhibitor (InSTI), has attracted much interest for its use in simplified treatment regimens.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_8",
            "start": 0,
            "end": 241,
            "label": {}
        },
        {
            "ix": "7-1359_v2_8@1",
            "content": "While preliminary analyses of a Dutch DTG monotherapy simplification trial seemed encouraging at 24 weeks, rates of virological failures increased significantly by week 48, suggesting a sub-optimal potency of this regimen <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_8",
            "start": 243,
            "end": 473,
            "label": {}
        },
        {
            "ix": "7-1359_v2_8@2",
            "content": "On the other hand, several studies evaluating DTG-based dual therapy with either 3TC or rilpivirine (RPV), showed a high virological efficacy <REF-9> – <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_8",
            "start": 475,
            "end": 636,
            "label": {}
        },
        {
            "ix": "7-1359_v2_8@3",
            "content": "However, most reports were from small, observational cohort studies, with the exception of one DTG-RPV industry-sponsored randomized controlled trial (RCT) <REF-11> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_8",
            "start": 638,
            "end": 803,
            "label": {}
        },
        {
            "ix": "7-1359_v2_9@0",
            "content": "We performed a systematic review of the literature and a meta-analysis to provide precise estimates of the rate of virological failure (VF) and drug resistance in patients switched to a DTG-based maintenance mono- or dual therapy, and to clarify which drugs or combinations should be evaluated in further studies and implemented in clinical practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_9",
            "start": 0,
            "end": 349,
            "label": {}
        },
        {
            "ix": "7-1359_v2_10@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_10",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "7-1359_v2_11@0",
            "content": "The protocol for this systematic review was written and registered with the International Prospective Register of Systematic Reviews (PROSPERO registration number CRD42017070045 ) <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_11",
            "start": 0,
            "end": 189,
            "label": {}
        },
        {
            "ix": "7-1359_v2_11@1",
            "content": "The reporting of the review followed the PRISMA guidelines <REF-14> ( Supplementary File 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_11",
            "start": 191,
            "end": 283,
            "label": {}
        },
        {
            "ix": "7-1359_v2_12@0",
            "content": "Search strategy and selection criteria",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_12",
            "start": 0,
            "end": 37,
            "label": {}
        },
        {
            "ix": "7-1359_v2_13@0",
            "content": "We searched Medline, EMBASE, Cochrane Central and Web of Science, as well as abstracts of major HIV conferences (CROI, AIDS, HIV Glasgow, AFRAVIH, IAS and EACS between 2013 and 2017) on 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_13",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "7-1359_v2_13@1",
            "content": "January 2018 for studies assessing the proportion of individuals developing VF on DTG-based maintenance therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_13",
            "start": 189,
            "end": 300,
            "label": {}
        },
        {
            "ix": "7-1359_v2_13@2",
            "content": "In Medline we combined free text words and medical subject headings (MESH) describing the study population and the outcome ( Supplementary File 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_13",
            "start": 302,
            "end": 449,
            "label": {}
        },
        {
            "ix": "7-1359_v2_13@3",
            "content": "This search strategy was adapted for the other databases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_13",
            "start": 451,
            "end": 507,
            "label": {}
        },
        {
            "ix": "7-1359_v2_13@4",
            "content": "We considered RCTs, single-arm clinical trials, cohort studies, and case-series that included at least five HIV-infected adults (≥18 years) on DTG-based simplified therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_13",
            "start": 509,
            "end": 680,
            "label": {}
        },
        {
            "ix": "7-1359_v2_13@5",
            "content": "No language restrictions were applied.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_13",
            "start": 682,
            "end": 719,
            "label": {}
        },
        {
            "ix": "7-1359_v2_13@6",
            "content": "Studies had to report on virological outcomes of patients who switched to a DTG monotherapy or dual therapy after having an undetectable VL on triple ART.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_13",
            "start": 721,
            "end": 874,
            "label": {}
        },
        {
            "ix": "7-1359_v2_13@7",
            "content": "We excluded studies that only reported in vitro data and those selecting participants based on the outcome during DTG-based maintenance therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_13",
            "start": 876,
            "end": 1019,
            "label": {}
        },
        {
            "ix": "7-1359_v2_13@8",
            "content": "Two investigators (MB and GW) independently selected studies based on titles and abstracts, and, in a second step, based on the full text of potentially eligible articles.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_13",
            "start": 1021,
            "end": 1191,
            "label": {}
        },
        {
            "ix": "7-1359_v2_13@9",
            "content": "Discrepancies in study selection were resolved through discussions with a third investigator (AC).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_13",
            "start": 1193,
            "end": 1290,
            "label": {}
        },
        {
            "ix": "7-1359_v2_14@0",
            "content": "Data extraction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_14",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "7-1359_v2_15@0",
            "content": "The following data were extracted independently for each study by two reviewers (GW and MB), using a standardized spreadsheet: bibliographic details, study design, inclusion and exclusion criteria, definitions of outcomes, country, number of participants and their main demographic and clinical characteristics, including duration since HIV diagnosis, ART history, immunological status (CD4 cell count at switch and nadir) and virological parameters (HIV RNA peak and at baseline, HIV-DNA at baseline and changes during the study, VF as defined by the study, and the presence at drug resistance at switch).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_15",
            "start": 0,
            "end": 605,
            "label": {}
        },
        {
            "ix": "7-1359_v2_15@1",
            "content": "Again, discrepancies in data extracted were resolved through discussions with a third investigator (AC).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_15",
            "start": 607,
            "end": 710,
            "label": {}
        },
        {
            "ix": "7-1359_v2_16@0",
            "content": "Assessment of risk of bias",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_16",
            "start": 0,
            "end": 25,
            "label": {}
        },
        {
            "ix": "7-1359_v2_17@0",
            "content": "A checklist for the assessment of risk of bias was designed to ensure data quality assessment for each study was included.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_17",
            "start": 0,
            "end": 121,
            "label": {}
        },
        {
            "ix": "7-1359_v2_17@1",
            "content": "The form for RCTs included information on the sequence generation, allocation concealment, blinding (participants, personnel and outcome assessor), incomplete outcome data, selective outcome reporting and other sources of bias.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_17",
            "start": 123,
            "end": 349,
            "label": {}
        },
        {
            "ix": "7-1359_v2_17@2",
            "content": "The methodological components of the randomized trials were assessed by two independent authors and classified as high, low or unclear risk of bias, as recommended by the Cochrane collaboration <REF-15> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_17",
            "start": 351,
            "end": 554,
            "label": {}
        },
        {
            "ix": "7-1359_v2_17@3",
            "content": "For observational studies it was not appropriate to use the ROBINS-I tool <REF-16> , as we only considered data from the group of patients on simplified, maintenance therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_17",
            "start": 556,
            "end": 729,
            "label": {}
        },
        {
            "ix": "7-1359_v2_17@4",
            "content": "Thus, we assessed the population characteristics and missing outcome data for each study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_17",
            "start": 731,
            "end": 819,
            "label": {}
        },
        {
            "ix": "7-1359_v2_18@0",
            "content": "Data analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_18",
            "start": 0,
            "end": 12,
            "label": {}
        },
        {
            "ix": "7-1359_v2_19@0",
            "content": "We described the study design as well as the demographic and clinical characteristics of the population from each study by type of maintenance therapy (DTG-based monotherapy or dual therapy).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_19",
            "start": 0,
            "end": 190,
            "label": {}
        },
        {
            "ix": "7-1359_v2_19@1",
            "content": "Pooled proportions of VF and treatment failure (VF or departure from simplified strategy due to toxicity, loss to follow-up, patient’s or physician’s decision), and 95% confidence intervals (CI) were estimated using random intercept logistic meta-regression.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_19",
            "start": 192,
            "end": 449,
            "label": {}
        },
        {
            "ix": "7-1359_v2_19@2",
            "content": "These analyses were performed separately at 24 weeks and 48 weeks after the switch from triple ART to maintenance therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_19",
            "start": 451,
            "end": 572,
            "label": {}
        },
        {
            "ix": "7-1359_v2_19@3",
            "content": "For all models, statistical evidence for heterogeneity between studies was assessed using the tau-squared statistics <REF-17> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_19",
            "start": 574,
            "end": 700,
            "label": {}
        },
        {
            "ix": "7-1359_v2_19@4",
            "content": "Of note, we separated data from Blanco et al. <REF-18> according to the strategy used (DTG-monotherapy and DTG-based dual therapy).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_19",
            "start": 702,
            "end": 832,
            "label": {}
        },
        {
            "ix": "7-1359_v2_19@5",
            "content": "We evaluated the association between type of maintenance strategy and VF using random intercept logistic meta-regression (binomial-normal) models.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_19",
            "start": 834,
            "end": 979,
            "label": {}
        },
        {
            "ix": "7-1359_v2_19@6",
            "content": "All models were adjusted for potential confounders, including age (median or mean), sex (proportion of female participants) and study type (interventional or observational).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_19",
            "start": 981,
            "end": 1153,
            "label": {}
        },
        {
            "ix": "7-1359_v2_19@7",
            "content": "Furthermore, the proportion of participants acquiring new drug resistance mutations was assessed for each treatment strategy and the mutations described in detail.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_19",
            "start": 1155,
            "end": 1317,
            "label": {}
        },
        {
            "ix": "7-1359_v2_19@8",
            "content": "Statistical analyses were conducted in STATA version 14.1 (StataCorp, Texas, USA) and R version 3.2.3 (R Core Team, Vienna, Austria).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_19",
            "start": 1319,
            "end": 1451,
            "label": {}
        },
        {
            "ix": "7-1359_v2_20@0",
            "content": "Role of the funding source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_20",
            "start": 0,
            "end": 25,
            "label": {}
        },
        {
            "ix": "7-1359_v2_21@0",
            "content": "The funder of the study had no role in the design, data collection, data analysis, data interpretation of the results or writing of the report.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_21",
            "start": 0,
            "end": 142,
            "label": {}
        },
        {
            "ix": "7-1359_v2_21@1",
            "content": "The corresponding author had full access to all the data in the study and had final responsibility for the decision to submit for publication.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_21",
            "start": 144,
            "end": 285,
            "label": {}
        },
        {
            "ix": "7-1359_v2_22@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_22",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "7-1359_v2_23@0",
            "content": "Study and participant characteristics",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_23",
            "start": 0,
            "end": 36,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@0",
            "content": "Of 1719 single studies identified, 63 remained potentially eligible after the screening of titles and abstracts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 0,
            "end": 111,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@1",
            "content": "Of these, 21 studies, including four RCTs, three single-arm clinical trials and 14 observational studies met our inclusion criteria <REF-8> , <REF-11> , <REF-12> , <REF-18> – <REF-35> ( Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 113,
            "end": 309,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@2",
            "content": "A description of the main study characteristics by type of maintenance strategy is given in Table 1 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 311,
            "end": 411,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@3",
            "content": "Eight studies (two from France, two from The Netherlands, one from Germany, one from Switzerland and two from Spain) including 251 patients assessed the switch to DTG monotherapy and 14 (five from Italy, four from France, three for Spain, one from US, and one multi-country study), including 1670 participants, the switch to DTG-based dual therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 413,
            "end": 760,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@4",
            "content": "Dual therapy consisted of DTG + 3TC (seven studies) or RPV (four studies) or atazanavir (ATV, two studies) or darunavir (DRV, one study).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 762,
            "end": 898,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@5",
            "content": "Overall, 14 studies allowed the inclusion of patients with previous virological failure, including five monotherapy studies <REF-18> – <REF-20> , <REF-22> – <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 900,
            "end": 1066,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@6",
            "content": "In one study, patients with previous InSTI failure were also included <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 1068,
            "end": 1147,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@7",
            "content": "Nineteen studies assessed virological outcomes at six months of maintenance therapy, whereas ten of them additionally showed outcomes at one year <REF-8> , <REF-11> , <REF-12> , <REF-24> , <REF-27> , <REF-29> – <REF-33> , <REF-35> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 1149,
            "end": 1380,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@8",
            "content": "Two studies assessed virological outcomes only at 48 weeks <REF-25> , <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 1382,
            "end": 1461,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@9",
            "content": "Median (or mean) age of participants included in the studies varied from 43 years <REF-11> to 63 years <REF-24> and 27.6% of them were female.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 1463,
            "end": 1604,
            "label": {}
        },
        {
            "ix": "7-1359_v2_24@10",
            "content": "16 studies reported on the median nadir CD4 cell count, which ranged from 90 cells/µl <REF-12> to 399 cells/µl <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_24",
            "start": 1606,
            "end": 1726,
            "label": {}
        },
        {
            "ix": "7-1359_v2_25@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_25",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "7-1359_v2_27@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_27",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-1359_v2_29@0",
            "content": "Risk of bias",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_29",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@0",
            "content": "All RCTs were open-label non-inferiority trials <REF-8> , <REF-18> , <REF-35> , of which one was a single center trial <REF-18> and three were multicenter trials <REF-8> , <REF-11> , <REF-35> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@1",
            "content": "They reported adequate generation of random allocation sequences and allocation concealment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 194,
            "end": 285,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@2",
            "content": "Three single-arm trials were included, of which two included less than 10 patients <REF-21> , <REF-24> , <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 287,
            "end": 401,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@3",
            "content": "All interventional studies adequately addressed incomplete outcome data: proportions of drop-outs were low and outcome data were missing for less than 20% of participants in all studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 403,
            "end": 588,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@4",
            "content": "Five of seven trials reported on virological outcomes at both time-points of interest for this study (24 and 48 weeks) <REF-8> , <REF-11> , <REF-24> , <REF-29> , <REF-35> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 590,
            "end": 761,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@5",
            "content": "There was no evidence of selective reporting in any of the studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 763,
            "end": 829,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@6",
            "content": "In each of the 14 observational studies included in this review, the main demographic and clinical characteristics of the study populations were similar and patients were followed for 24 weeks in most studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 831,
            "end": 1039,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@7",
            "content": "Among the observational studies, the majority did not report detailed inclusion and exclusion criteria.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 1041,
            "end": 1143,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@8",
            "content": "Five observational studies reported virological outcomes at both time-points <REF-12> , <REF-30> – <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 1145,
            "end": 1253,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@9",
            "content": "Amplification for drug resistance testing was successful for 19 of the 27 (70%) patients with VF.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 1255,
            "end": 1351,
            "label": {}
        },
        {
            "ix": "7-1359_v2_30@10",
            "content": "Finally, patient retention was over 90% in all 14 cohort studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_30",
            "start": 1353,
            "end": 1417,
            "label": {}
        },
        {
            "ix": "7-1359_v2_31@0",
            "content": "Virological and treatment failure",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_31",
            "start": 0,
            "end": 32,
            "label": {}
        },
        {
            "ix": "7-1359_v2_32@0",
            "content": "The pooled estimate of the proportion of participants who experienced a VF on DTG-based monotherapy was 3.6% (95% CI 1.9-6.7) at 24 weeks and 8.9% (95% CI 4.7-16.2) at 48 weeks ( Figure 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_32",
            "start": 0,
            "end": 189,
            "label": {}
        },
        {
            "ix": "7-1359_v2_32@1",
            "content": "The high proportion of treatment failures among patients on monotherapy at 48 weeks was driven by the two studies from the Netherlands, which observed between 8 and 20% of VF <REF-8> , <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_32",
            "start": 191,
            "end": 385,
            "label": {}
        },
        {
            "ix": "7-1359_v2_32@2",
            "content": "Among patients on dual therapy, an estimated 0.4% (95% CI 0.2-0.9) experienced a VF at 24 weeks and 0.7% (95% CI 0.4-1.3) at 48 weeks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_32",
            "start": 387,
            "end": 520,
            "label": {}
        },
        {
            "ix": "7-1359_v2_32@3",
            "content": "Independently of the combination used (DTG/3TC, DTG/RPV, DTG/ATV or DTG/DRV), 11 of 14 studies evaluating the effectiveness of dual therapy had less than 1% of patients developing VF.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_32",
            "start": 522,
            "end": 704,
            "label": {}
        },
        {
            "ix": "7-1359_v2_32@4",
            "content": "Compared to patients on monotherapy, those on dual therapy were less likely to experience VF by 24 weeks (odds ratio [OR] 0.10, 95% CI 0.03-0.32, p<0.001) and 48 weeks (OR 0.07, 95% CI 0.03-0.18, p<0.001).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_32",
            "start": 706,
            "end": 910,
            "label": {}
        },
        {
            "ix": "7-1359_v2_32@5",
            "content": "In analyses adjusted for study type (interventional or observational), age (median or mean) and sex (proportion of female participants), the OR for VF at 24 weeks and 48 weeks were very similar to the unadjusted estimates (aOR 0.10, 95% CI 0.03-0.30 for 24 weeks and aOR 0.06, 95% CI 0.01-0.30 for 48 weeks, respectively).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_32",
            "start": 912,
            "end": 1233,
            "label": {}
        },
        {
            "ix": "7-1359_v2_32@6",
            "content": "The only variable that contributed to explaining the between-study heterogeneity in both the 24 and 48-week analyses was treatment strategy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_32",
            "start": 1235,
            "end": 1374,
            "label": {}
        },
        {
            "ix": "7-1359_v2_32@7",
            "content": "When including this variable, the tau-squared were reduced from 1.17 (95% CI 0.33-2.19) to 0.00 (95% CI 0.00-1.11) in the 24 week analysis and from 1.37 (95% CI 0.54-2.15) to 0.00 (95% CI 0.00-1.00) in the 48 week analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_32",
            "start": 1376,
            "end": 1598,
            "label": {}
        },
        {
            "ix": "7-1359_v2_32@8",
            "content": "The inclusion of other variables did not impact the estimates of tau-squared.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_32",
            "start": 1600,
            "end": 1676,
            "label": {}
        },
        {
            "ix": "7-1359_v2_33@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_33",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "7-1359_v2_35@0",
            "content": "Treatment failure occurred in 5.2% (2.0–12.9) of patients at 24 weeks and 12.3% (4.5–29.4) at 48 weeks on DTG-monotherapy, whereas this outcome was observed in 2.8% (1.4–5.7) of patients at 24 weeks and 6.5% (4.3–9.6) at 48 weeks on DTG-based dual therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_35",
            "start": 0,
            "end": 255,
            "label": {}
        },
        {
            "ix": "7-1359_v2_35@1",
            "content": "At 24 weeks, patients on dual therapy tended to be less likely to experience treatment failure compared to those on monotherapy (aOR 0.52, 95% CI 0.15-1.85).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_35",
            "start": 257,
            "end": 413,
            "label": {}
        },
        {
            "ix": "7-1359_v2_35@2",
            "content": "Due to multi-collinearity in the model, we were not able to report on multivariable analyses comparing treatment failure between mono and dual therapy at 48 weeks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_35",
            "start": 415,
            "end": 577,
            "label": {}
        },
        {
            "ix": "7-1359_v2_36@0",
            "content": "Drug resistance",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_36",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "7-1359_v2_37@0",
            "content": "Acquired resistance mutations to InSTI developed in 9/251 (3.6%) participants on DTG-based monotherapy, which corresponded to 56% of the cases of VF ( Table 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_37",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "7-1359_v2_37@1",
            "content": "Three individuals developed the Q148R or Q148H mutation in combination with other resistance mutations, conferring high-level resistance to DTG <REF-20> , <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_37",
            "start": 162,
            "end": 326,
            "label": {}
        },
        {
            "ix": "7-1359_v2_37@2",
            "content": "Two of these three patients were previously exposed to InSTI and none had a history of previous VF.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_37",
            "start": 328,
            "end": 426,
            "label": {}
        },
        {
            "ix": "7-1359_v2_37@3",
            "content": "They all had a suppressed HIV viral load for several years before switching to DTG-monotherapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_37",
            "start": 428,
            "end": 522,
            "label": {}
        },
        {
            "ix": "7-1359_v2_37@4",
            "content": "No InSTI resistance mutations developed in patients on dual therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_37",
            "start": 524,
            "end": 591,
            "label": {}
        },
        {
            "ix": "7-1359_v2_37@5",
            "content": "Of 962 patients on RPV/DTG, only one developed a major drug resistance mutation to non-nucleoside reverse transcriptase inhibitors (K101E).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_37",
            "start": 593,
            "end": 731,
            "label": {}
        },
        {
            "ix": "7-1359_v2_37@6",
            "content": "No resistance was observed in plasma among 237 individuals on DTG/3TC.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_37",
            "start": 733,
            "end": 802,
            "label": {}
        },
        {
            "ix": "7-1359_v2_38@0",
            "content": "Table 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_38",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-1359_v2_41@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_41",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "7-1359_v2_42@0",
            "content": "We performed a comprehensive systematic review of studies that reported on VF among patients switched to DTG-based maintenance therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_42",
            "start": 0,
            "end": 134,
            "label": {}
        },
        {
            "ix": "7-1359_v2_42@1",
            "content": "Our meta-analysis shows that DTG-based dual therapy is successful in sustaining virological control in ART-experienced HIV-infected patients: only 12 of 1670 (0.7%) experienced a VF and none of them developed resistance mutations to DTG.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_42",
            "start": 136,
            "end": 372,
            "label": {}
        },
        {
            "ix": "7-1359_v2_42@2",
            "content": "On the contrary, 16 of 251 (6.4%) individuals switched to DTG monotherapy had a VF, of which more than one-half developed resistance to DTG.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_42",
            "start": 374,
            "end": 513,
            "label": {}
        },
        {
            "ix": "7-1359_v2_42@3",
            "content": "In comparison, recent trials evaluating InSTI-based triple maintenance combinations showed a similar virological failure rates <REF-36> , <REF-37> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_42",
            "start": 515,
            "end": 662,
            "label": {}
        },
        {
            "ix": "7-1359_v2_42@4",
            "content": "Although the proportion of patients experiencing a confirmed viral rebound on DTG-monotherapy does not seem to be higher than in patients on PI-monotherapy, the risk of losing future treatment options is higher with DTG-monotherapy <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_42",
            "start": 664,
            "end": 904,
            "label": {}
        },
        {
            "ix": "7-1359_v2_42@5",
            "content": "Overall, our findings suggest that DTG-based monotherapy is not an appropriate simplification strategy and that further studies are urgently needed to confirm the long-term efficacy of DTG-based dual therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_42",
            "start": 906,
            "end": 1113,
            "label": {}
        },
        {
            "ix": "7-1359_v2_43@0",
            "content": "DTG-based dual therapy is a promising simplification strategy, especially when combined with 3TC, as the likelihood of developing toxicity events and DDI on such regimens is very low.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_43",
            "start": 0,
            "end": 182,
            "label": {}
        },
        {
            "ix": "7-1359_v2_43@1",
            "content": "No drug resistance mutations to DTG developed among more than 1600 patients on dual therapy followed for 24 to 48 weeks and only one had a resistance mutation to another drug class.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_43",
            "start": 184,
            "end": 364,
            "label": {}
        },
        {
            "ix": "7-1359_v2_43@2",
            "content": "Although based on very few patients, the results seemed to be independent of previous virological failures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_43",
            "start": 366,
            "end": 472,
            "label": {}
        },
        {
            "ix": "7-1359_v2_43@3",
            "content": "For instance, no virological failures were noted among patients on DTG/3TC despite the presence of a 184V mutation at the time of simplification in several studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_43",
            "start": 474,
            "end": 637,
            "label": {}
        },
        {
            "ix": "7-1359_v2_43@4",
            "content": "The impact of the latter mutation on viral fitness has been extensively described both in vitro <REF-38> and in vivo <REF-39> , and could also potentially explain the improved treatment outcomes in these patients compared to those switched to DTG-monotherapy without any previous failures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_43",
            "start": 639,
            "end": 927,
            "label": {}
        },
        {
            "ix": "7-1359_v2_43@5",
            "content": "Interestingly, similar observations were made for bPI-based regimens, for which efficacy was improved when 3TC was added, despite the presence of the 184V mutation <REF-39> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_43",
            "start": 929,
            "end": 1102,
            "label": {}
        },
        {
            "ix": "7-1359_v2_44@0",
            "content": "We also report on estimates of treatment failure, which includes other reasons for treatment interruptions, such as toxicity or loss to follow-up.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_44",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "7-1359_v2_44@1",
            "content": "In our meta-analysis, the proportion of patients experiencing this combined outcome was more than twice as high among patients on monotherapy compared to those on DTG-based dual therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_44",
            "start": 147,
            "end": 332,
            "label": {}
        },
        {
            "ix": "7-1359_v2_44@2",
            "content": "Although this outcome is important in evaluating the clinical efficacy of a novel ART strategy, our capacity to analyze this outcome in detail was limited by the missing information on the specific reasons for treatment interruptions in many studies and by the small number of events, especially at 48 weeks of therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_44",
            "start": 334,
            "end": 652,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@0",
            "content": "Of all simplification strategies evaluated to date, the DTG/3TC combination could be the one most readily accessible for patients in low- and middle-income countries: both DTG and 3TC are available and prequalified by stringent regulatory authorities in generic formulations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 0,
            "end": 274,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@1",
            "content": "In order to be widely implemented, the efficacy of this dual combination should first be evaluated in large studies among different patient populations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 276,
            "end": 427,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@2",
            "content": "The results from the studies included in our meta-analysis are mainly based on selected populations of HIV-infected individuals from European cohorts, and are not generalizable.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 429,
            "end": 605,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@3",
            "content": "Furthermore, long-term data are needed, as most treatment failures occurred after the first 24 weeks in several monotherapy studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 607,
            "end": 738,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@4",
            "content": "Recently, results from the only study which assessed 96-week outcomes with this regimen to date were reported: among 27 ART-experienced individuals with previous VF, DTG/3TC was 100% efficacious virologically <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 740,
            "end": 958,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@5",
            "content": "However, despite these encouraging results, data from larger studies are needed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 960,
            "end": 1039,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@6",
            "content": "In addition, more data on the activity of DTG-based simplified regimens in compartments other than blood are needed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 1041,
            "end": 1156,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@7",
            "content": "Letendre et al . showed that DTG achieved therapeutic concentrations in the central nervous system (CNS), with a CNS penetration effectiveness score of four <REF-40> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 1158,
            "end": 1324,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@8",
            "content": "In the MONODO study, all patients had an undetectable plasma HIV viral load at week 24 on DTG maintenance monotherapy, whereas only one had a detectable viral load in the cerebrospinal fluid <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 1326,
            "end": 1526,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@9",
            "content": "Moreover, levels of HIV-RNA in the genital tract on DTG monotherapy <REF-41> and on DTG-3TC <REF-42> were comparable to those on standard cART.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 1528,
            "end": 1670,
            "label": {}
        },
        {
            "ix": "7-1359_v2_45@10",
            "content": "However, these results were based on a very small sample of patients and data from individuals on simplified, DTG-based therapies are lacking.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_45",
            "start": 1672,
            "end": 1813,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@0",
            "content": "As a wealth of data on the efficacy of DTG-maintenance strategies from small studies are being disseminated at a fast pace, this systematic review is the first analysis to provide comparative estimates of virological failure between DTG-based monotherapy and dual therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 0,
            "end": 271,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@1",
            "content": "More than 1700 studies were screened, including abstracts from all important HIV conferences in the past years.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 273,
            "end": 383,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@2",
            "content": "As our meta-analysis included studies with diverse study designs and populations, it could be argued that the comparison of studies with such differences might be problematic.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 385,
            "end": 559,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@3",
            "content": "However, the estimates of VF were very similar across studies, especially in the DTG-based dual therapy arm.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 561,
            "end": 668,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@4",
            "content": "This finding highlights the potency of this combination, even in the presence of previous drug resistance mutations or multiple co-morbidities.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 670,
            "end": 812,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@5",
            "content": "Unfortunately, only studies including low numbers of patients reported outcomes from individuals on DTG-monotherapy, and data on dual therapy was dominated by one large study that assessed the efficacy of the DTG/RPV combination.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 814,
            "end": 1042,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@6",
            "content": "As a consequence, the comparison of DTG-monotherapy vs. DTG/3TC, which would have been the most interesting one, was not possible.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 1044,
            "end": 1173,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@7",
            "content": "Furthermore, the lack of availability of individual data from the different studies precluded the analysis of risk factors of VF in the different simplification regimens.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 1175,
            "end": 1344,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@8",
            "content": "As most studies were observational, it is possible that the investigators mainly included patients with good adherence, which may have limited the generalizability of their findings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 1346,
            "end": 1527,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@9",
            "content": "Finally, our results might have slightly under-estimated the proportion of patients with VF as individuals who were lost to follow-up might have experienced this outcome without them being accounted for.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 1529,
            "end": 1731,
            "label": {}
        },
        {
            "ix": "7-1359_v2_46@10",
            "content": "However, our treatment failure estimates showed that even when other reasons of treatment failure were considered, DTG-based dual therapy was superior to monotherapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_46",
            "start": 1733,
            "end": 1898,
            "label": {}
        },
        {
            "ix": "7-1359_v2_47@0",
            "content": "In summary, DTG-based dual maintenance therapy seems to be a promising simplification strategy with high virological efficacy and low potential for DDI and toxicity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_47",
            "start": 0,
            "end": 164,
            "label": {}
        },
        {
            "ix": "7-1359_v2_47@1",
            "content": "Such a treatment regimen could be an interesting alternative to classical triple-ART in selected patients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_47",
            "start": 166,
            "end": 271,
            "label": {}
        },
        {
            "ix": "7-1359_v2_47@2",
            "content": "Furthermore, dual therapy might be a cost-effective global ART strategy <REF-43> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_47",
            "start": 273,
            "end": 354,
            "label": {}
        },
        {
            "ix": "7-1359_v2_47@3",
            "content": "A number of large prospective studies evaluating the efficacy of DTG-based dual therapy are under way and will inform its potential implementation at a large scale.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_47",
            "start": 356,
            "end": 519,
            "label": {}
        },
        {
            "ix": "7-1359_v2_47@4",
            "content": "In addition to the studies using DTG-emtricitabine(FTC <REF-44> ) and DTG-3TC <REF-45> maintenance therapy, clinical trials are also assessing the efficacy of DTG/3TC in treatment-naïve patients <REF-46> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_47",
            "start": 521,
            "end": 725,
            "label": {}
        },
        {
            "ix": "7-1359_v2_47@5",
            "content": "Furthermore, it will be critical to evaluate the efficacy of DTG-3TC or FTC dual therapy in specific sub-groups such as pregnant and breast-feeding women, adolescents, patients with previous failure to standard triple regimens and harboring the M184V resistance mutation, as well as in patients with HIV associated neurocognitive disorder and tuberculosis coinfection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_47",
            "start": 727,
            "end": 1094,
            "label": {}
        },
        {
            "ix": "7-1359_v2_48@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_48",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "7-1359_v2_49@0",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2019 Wandeler G et al.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_49",
            "start": 0,
            "end": 132,
            "label": {}
        },
        {
            "ix": "7-1359_v2_50@0",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_50",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "7-1359_v2_51@0",
            "content": "F1000Research: Dataset 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_51",
            "start": 0,
            "end": 24,
            "label": {}
        },
        {
            "ix": "7-1359_v2_51@1",
            "content": "Dolutegravir meta-analysis summary data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_51",
            "start": 26,
            "end": 65,
            "label": {}
        },
        {
            "ix": "7-1359_v2_51@2",
            "content": "10.5256/f1000research.15995.d215724 <REF-47>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_51",
            "start": 67,
            "end": 110,
            "label": {}
        },
        {
            "ix": "7-1359_v2_52@0",
            "content": "<REF-1> Gulick RM Mellors JW Havlir D : Treatment with indinavir, zidovudine, and lamivudine in adults with human immunodeficiency virus infection and prior antiretroviral therapy. N Engl J Med. 1997 ; 337 ( 11 ): 734 – 9 . 9287228 10.1056/NEJM199709113371102",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_52",
            "start": 0,
            "end": 258,
            "label": {}
        },
        {
            "ix": "7-1359_v2_53@0",
            "content": "<REF-2> Mathis S Khanlari B Pulido F : Effectiveness of protease inhibitor monotherapy versus combination antiretroviral maintenance therapy: a meta-analysis. PLoS One. 2011 ; 6 ( 7 ): e22003 . 21811554 10.1371/journal.pone.0022003 3139616",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_53",
            "start": 0,
            "end": 238,
            "label": {}
        },
        {
            "ix": "7-1359_v2_54@0",
            "content": "<REF-3> Paton NI Stöhr W Arenas-Pinto A : Protease inhibitor monotherapy for long-term management of HIV infection: a randomised, controlled, open-label, non-inferiority trial. Lancet HIV. 2015 ; 2 ( 10 ): e417 – 26 . 26423649 10.1016/S2352-3018(15)00176-9 4765553",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_54",
            "start": 0,
            "end": 263,
            "label": {}
        },
        {
            "ix": "7-1359_v2_55@0",
            "content": "<REF-4> Pulido F Ribera E Lagarde M : Non-inferiority of dual-therapy (DT) with darunavir/ritonavir (DRV/r) plus 3TC versus triple-therapy (TT) with DRV/r plus TDF/FTC or ABC/3TC for maintenance of viral suppression: 48-week results of the DUAL-GESIDA 8014 trial - abstract n°: 0331 . HIV Glasgow Conference . Glasgow, 23–26 October 2016. 2016 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_55",
            "start": 0,
            "end": 361,
            "label": {}
        },
        {
            "ix": "7-1359_v2_56@0",
            "content": "<REF-6> Perez-Molina JA Rubio R Rivero A : Dual treatment with atazanavir-ritonavir plus lamivudine versus triple treatment with atazanavir-ritonavir plus two nucleos(t)ides in virologically stable patients with HIV-1 (SALT): 48 week results from a randomised, open-label, non-inferiority trial. Lancet Infect Dis. 2015 ; 15 ( 7 ): 775 – 84 . 26062881 10.1016/S1473-3099(15)00097-3",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_56",
            "start": 0,
            "end": 380,
            "label": {}
        },
        {
            "ix": "7-1359_v2_57@0",
            "content": "<REF-7> EACS Guidelines version 9.0 . 2017 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_57",
            "start": 0,
            "end": 60,
            "label": {}
        },
        {
            "ix": "7-1359_v2_58@0",
            "content": "<REF-8> Wijting I Rokx C Boucher C : Dolutegravir as maintenance monotherapy for HIV (DOMONO): a phase 2, randomised non-inferiority trial. Lancet HIV. 2017 ; 4 ( 12 ): e547 – e554 . 29107562 10.1016/S2352-3018(17)30152-2",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_58",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "7-1359_v2_59@0",
            "content": "<REF-9> Cahn P Rolón MJ Figueroa MI : Dolutegravir-lamivudine as initial therapy in HIV-1 infected, ARV-naive patients, 48-week results of the PADDLE (Pilot Antiretroviral Design with Dolutegravir LamivudinE) study. J Int AIDS Soc. 2017 ; 20 ( 1 ): 21678 . 28537061 10.7448/IAS.20.01.21678 5515053",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_59",
            "start": 0,
            "end": 296,
            "label": {}
        },
        {
            "ix": "7-1359_v2_60@0",
            "content": "<REF-11> Llibre JM Hung CC Brinson C : Efficacy, safety, and tolerability of dolutegravir-rilpivirine for the maintenance of virological suppression in adults with HIV-1: phase 3, randomised, non-inferiority SWORD-1 and SWORD-2 studies. Lancet. 2018 ; 391 ( 10123 ): 839 – 49 . 29310899 10.1016/S0140-6736(17)33095-7",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_60",
            "start": 0,
            "end": 315,
            "label": {}
        },
        {
            "ix": "7-1359_v2_61@0",
            "content": "<REF-12> Reynes J Meftah N Tuaillon E : Dual regimen with dolutegravir and lamivudine maintains virologic suppression even in heavily treatment experienced HIV-infected patients: 96 weeks results from maintenance DOLULAM study . Abstract n°: MOPEB0322. International AIDS Society (IAS) conference . Paris, 23–26 July 2017. 2017 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_61",
            "start": 0,
            "end": 345,
            "label": {}
        },
        {
            "ix": "7-1359_v2_62@0",
            "content": "<REF-13> Booth A Clarke M Dooley G : The nuts and bolts of PROSPERO: an international prospective register of systematic reviews. Syst Rev. 2012 ; 1 : 2 . 22587842 10.1186/2046-4053-1-2 3348673",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_62",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "7-1359_v2_63@0",
            "content": "<REF-14> Liberati A Altman DG Tetzlaff J : The PRISMA statement for reporting systematic reviews and meta-analyses of studies that evaluate health care interventions: explanation and elaboration. PLoS Med. 2009 ; 6 ( 7 ): e1000100 . 19621070 10.1371/journal.pmed.1000100 2707010",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_63",
            "start": 0,
            "end": 277,
            "label": {}
        },
        {
            "ix": "7-1359_v2_64@0",
            "content": "<REF-15> Higgins JP Altman DG Gøtzsche PC : The Cochrane Collaboration's tool for assessing risk of bias in randomised trials. BMJ. 2011 ; 343 : d5928 . 22008217 10.1136/bmj.d5928 3196245",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_64",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "7-1359_v2_65@0",
            "content": "<REF-16> Sterne JA Hernán MA Reeves BC : ROBINS-I: a tool for assessing risk of bias in non-randomised studies of interventions. BMJ. 2016 ; 355 : i4919 . 27733354 10.1136/bmj.i4919 5062054",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_65",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "7-1359_v2_66@0",
            "content": "<REF-17> Higgins JP Thompson SG Deeks JJ : Measuring inconsistency in meta-analyses. BMJ. 2003 ; 327 ( 7414 ): 557 – 60 . 12958120 10.1136/bmj.327.7414.557 192859",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_66",
            "start": 0,
            "end": 161,
            "label": {}
        },
        {
            "ix": "7-1359_v2_67@0",
            "content": "<REF-18> Blanco JL Rojas J Paredes R : Dolutegravir-based maintenance monotherapy versus dual therapy with lamivudine: a planned 24 week analysis of the DOLAM randomized clinical trial. J Antimicrob Chemother. 2018 ; 73 ( 7 ): 1965 – 1971 . 29608685 10.1093/jac/dky093",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_67",
            "start": 0,
            "end": 267,
            "label": {}
        },
        {
            "ix": "7-1359_v2_68@0",
            "content": "<REF-20> Katlama C Soulié C Caby F : Dolutegravir as monotherapy in HIV-1-infected individuals with suppressed HIV viraemia. J Antimicrob Chemother. 2016 ; 71 ( 9 ): 2646 – 50 . 27287235 10.1093/jac/dkw186",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_68",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "7-1359_v2_69@0",
            "content": "<REF-21> Sculier D Doco-Lecompte T Yerly S : Stable HIV-1 reservoirs on dolutegravir maintenance monotherapy: the MONODO study. HIV Med. 2018 ; 19 ( 8 ): 572 – 577 . 29932298 10.1111/hiv.12626",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_69",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "7-1359_v2_70@0",
            "content": "<REF-22> Oldenbuettel C Wolf E Ritter A : Dolutegravir monotherapy as treatment de-escalation in HIV-infected adults with virological control: DoluMono cohort results. Antivir Ther. 2017 ; 22 ( 2 ): 169 – 72 . 27588613 10.3851/IMP3082",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_70",
            "start": 0,
            "end": 233,
            "label": {}
        },
        {
            "ix": "7-1359_v2_71@0",
            "content": "<REF-24> Rokx C Schurink CA Boucher CA : Dolutegravir as maintenance monotherapy: first experiences in HIV-1 patients. J Antimicrob Chemother. 2016 ; 71 ( 6 ): 1632 – 6 . 26888910 10.1093/jac/dkw011",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_71",
            "start": 0,
            "end": 197,
            "label": {}
        },
        {
            "ix": "7-1359_v2_72@0",
            "content": "<REF-25> Bonijoly T CA Cheret A Cotte L : Week-48 efficacy and safety of dolutegravir + rilpivirine dual therapy as switch strategy in a real-life cohort study. Abstract n°: PE9/15 European AIDS Clinical Society (EACS) conference , Milano, 25–27 October 2017. 2017 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_72",
            "start": 0,
            "end": 265,
            "label": {}
        },
        {
            "ix": "7-1359_v2_73@0",
            "content": "<REF-27> Castagna AGR Rusconi S Riva A : Durability and Safety of a Dual Antiretroviral Regimen with Dolutegravir and Unboosted Atazanavir in HIV-1 Infected Patients with Virological Suppression . Abstract n°: PE9/63. European AIDS Clinical Society (EACS) conference , Milano, 25–27 October 2017. 2017 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_73",
            "start": 0,
            "end": 302,
            "label": {}
        },
        {
            "ix": "7-1359_v2_74@0",
            "content": "<REF-29> Joly V Burdet C Landman R : Promising Results of Lamivudine + DolutegravirMaintenance Therapy in ANRS 167 Lamidol Trial. Abstract number: 458. Conference on Retrovirus and Opportunistic Infections (CROI), Seattle, 13–16 February 2017. 2017 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_74",
            "start": 0,
            "end": 266,
            "label": {}
        },
        {
            "ix": "7-1359_v2_75@0",
            "content": "<REF-30> Maggiolo F Gulminetti R Pagnucco L : Lamivudine/dolutegravir dual therapy in HIV-infected, virologically suppressed patients. BMC Infect Dis. 2017 ; 17 ( 1 ): 215 . 28302065 10.1186/s12879-017-2311-2 5356275",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_75",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "7-1359_v2_76@0",
            "content": "<REF-33> Revuelta-Herrero JL Chamorro-de-Vega E Rodríguez-González CG : Effectiveness, Safety, and Costs of a Treatment Switch to Dolutegravir Plus Rilpivirine Dual Therapy in Treatment-Experienced HIV Patients. Ann Pharmacother. 2018 ; 52 ( 1 ): 11 – 8 . 28836468 10.1177/1060028017728294",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_76",
            "start": 0,
            "end": 288,
            "label": {}
        },
        {
            "ix": "7-1359_v2_77@0",
            "content": "<REF-35> Taiwo BO Marconi VC Berzins B : Dolutegravir Plus Lamivudine Maintains Human Immunodeficiency Virus-1 Suppression Through Week 48 in a Pilot Randomized Trial. Clin Infect Dis. 2018 ; 66 ( 11 ): 1794 – 1797 . 29293895 10.1093/cid/cix1131 5961309",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_77",
            "start": 0,
            "end": 252,
            "label": {}
        },
        {
            "ix": "7-1359_v2_78@0",
            "content": "<REF-36> Arribas JR Pialoux G Gathe J : Simplification to coformulated elvitegravir, cobicistat, emtricitabine, and tenofovir versus continuation of ritonavir-boosted protease inhibitor with emtricitabine and tenofovir in adults with virologically suppressed HIV (STRATEGY-PI): 48 week results of a randomised, open-label, phase 3b, non-inferiority trial. Lancet Infect Dis. 2014 ; 14 ( 7 ): 581 – 9 . 24908551 10.1016/S1473-3099(14)70782-0",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_78",
            "start": 0,
            "end": 439,
            "label": {}
        },
        {
            "ix": "7-1359_v2_79@0",
            "content": "<REF-37> Pozniak A Markowitz M Mills A : Switching to coformulated elvitegravir, cobicistat, emtricitabine, and tenofovir versus continuation of non-nucleoside reverse transcriptase inhibitor with emtricitabine and tenofovir in virologically suppressed adults with HIV (STRATEGY-NNRTI): 48 week results of a randomised, open-label, phase 3b non-inferiority trial. Lancet Infect Dis. 2014 ; 14 ( 7 ): 590 – 9 . 24908550 10.1016/S1473-3099(14)70796-0",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_79",
            "start": 0,
            "end": 447,
            "label": {}
        },
        {
            "ix": "7-1359_v2_80@0",
            "content": "<REF-38> Oliveira M Ibanescu RI Pham HT : The M184I/V and K65R nucleoside resistance mutations in HIV-1 prevent the emergence of resistance mutations against dolutegravir. AIDS. 2016 ; 30 ( 15 ): 2267 – 73 . 27367488 10.1097/QAD.0000000000001191",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_80",
            "start": 0,
            "end": 244,
            "label": {}
        },
        {
            "ix": "7-1359_v2_81@0",
            "content": "<REF-39> Ciaffi L Koulla-Shiro S Sawadogo AB : Boosted protease inhibitor monotherapy versus boosted protease inhibitor plus lamivudine dual therapy as second-line maintenance treatment for HIV-1-infected patients in sub-Saharan Africa (ANRS12 286/MOBIDIP): a multicentre, randomised, parallel, open-label, superiority trial. Lancet HIV. 2017 ; 4 ( 9 ): e384 – e92 . 28566227 10.1016/S2352-3018(17)30069-3",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_81",
            "start": 0,
            "end": 404,
            "label": {}
        },
        {
            "ix": "7-1359_v2_82@0",
            "content": "<REF-40> Letendre SL Mills AM Tashima KT : ING116070: a study of the pharmacokinetics and antiviral activity of dolutegravir in cerebrospinal fluid in HIV-1-infected, antiretroviral therapy-naive subjects. Clin Infect Dis. 2014 ; 59 ( 7 ): 1032 – 7 . 24944232 10.1093/cid/ciu477 4166983",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_82",
            "start": 0,
            "end": 285,
            "label": {}
        },
        {
            "ix": "7-1359_v2_83@0",
            "content": "<REF-41> Hocqueloux L Gubavu C Lefeuvre S : HIV-1-infected patients under successful less-drug regimens have similar genital shedding and residual viremia than those under triple therapy . International AIDS Society (IAS) conference, Paris, 23–26 July 2017 . 2017 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_83",
            "start": 0,
            "end": 281,
            "label": {}
        },
        {
            "ix": "7-1359_v2_84@0",
            "content": "<REF-42> Gianella S Wilkin T Berzins B : Genital HIV-1 shedding with Dolutegravir (DTG) plus Lamivudine (3TC) dual therapy . International AIDS Conference, Amsterdam, 23–27 Juy 2018 . 2018 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_84",
            "start": 0,
            "end": 206,
            "label": {}
        },
        {
            "ix": "7-1359_v2_85@0",
            "content": "<REF-43> Girouard MP Sax PE Parker RA : The Cost-effectiveness and Budget Impact of 2-Drug Dolutegravir-Lamivudine Regimens for the Treatment of HIV Infection in the United States. Clin Infect Dis. 2016 ; 62 ( 6 ): 784 – 91 . 26658053 10.1093/cid/civ981 4772845",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_85",
            "start": 0,
            "end": 260,
            "label": {}
        },
        {
            "ix": "7-1359_v2_86@0",
            "content": "<REF-44> Camly A BM Sculier D Wandeler G : Evaluation of a simplified strategy for the long-term management of HIV infection: a non-inferiority, randomized, controlled, open-label clinical trial: The Simpl'HIV Trial . NCT03160105.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_86",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "7-1359_v2_87@0",
            "content": "<REF-45> E. M. Dolutegravir-based Simplification Strategies: DOLAM . EudraCT 2015-000274-35.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_87",
            "start": 0,
            "end": 91,
            "label": {}
        },
        {
            "ix": "7-1359_v2_88@0",
            "content": "<REF-46> Taiwo BO Zheng L Stefanescu A : ACTG A5353: A Pilot Study of Dolutegravir Plus Lamivudine for Initial Treatment of Human Immunodeficiency Virus-1 (HIV-1)-infected Participants With HIV-1 RNA <500000 Copies/mL. Clin Infect Dis. 2018 ; 66 ( 11 ): 1689 – 1697 . 29253097 10.1093/cid/cix1083 5961075",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_88",
            "start": 0,
            "end": 303,
            "label": {}
        },
        {
            "ix": "7-1359_v2_89@0",
            "content": "<REF-47> Wandeler G Buzzi M Anderegg N : Dataset 1 in: Virologic failure and HIV drug resistance on simplified, dolutegravir-based maintenance therapy: Systematic review and meta-analysis. F1000Research. 2018 . http://www.doi.org/10.5256/f1000research.15995.d215724",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1359_v2_89",
            "start": 0,
            "end": 264,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "7-1359_v2_0",
            "tgt_ix": "7-1359_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_1",
            "tgt_ix": "7-1359_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_1",
            "tgt_ix": "7-1359_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_1",
            "tgt_ix": "7-1359_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_1",
            "tgt_ix": "7-1359_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_0",
            "tgt_ix": "7-1359_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_6",
            "tgt_ix": "7-1359_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_6",
            "tgt_ix": "7-1359_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_6",
            "tgt_ix": "7-1359_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_0",
            "tgt_ix": "7-1359_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_10",
            "tgt_ix": "7-1359_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_10",
            "tgt_ix": "7-1359_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_12",
            "tgt_ix": "7-1359_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_10",
            "tgt_ix": "7-1359_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_14",
            "tgt_ix": "7-1359_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_10",
            "tgt_ix": "7-1359_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_16",
            "tgt_ix": "7-1359_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_10",
            "tgt_ix": "7-1359_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_18",
            "tgt_ix": "7-1359_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_10",
            "tgt_ix": "7-1359_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_20",
            "tgt_ix": "7-1359_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_0",
            "tgt_ix": "7-1359_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_22",
            "tgt_ix": "7-1359_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_23",
            "tgt_ix": "7-1359_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_23",
            "tgt_ix": "7-1359_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_25",
            "tgt_ix": "7-1359_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_23",
            "tgt_ix": "7-1359_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_27",
            "tgt_ix": "7-1359_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_22",
            "tgt_ix": "7-1359_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_29",
            "tgt_ix": "7-1359_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_22",
            "tgt_ix": "7-1359_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_31",
            "tgt_ix": "7-1359_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_31",
            "tgt_ix": "7-1359_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_33",
            "tgt_ix": "7-1359_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_31",
            "tgt_ix": "7-1359_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_22",
            "tgt_ix": "7-1359_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_36",
            "tgt_ix": "7-1359_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_36",
            "tgt_ix": "7-1359_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_38",
            "tgt_ix": "7-1359_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_36",
            "tgt_ix": "7-1359_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_0",
            "tgt_ix": "7-1359_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_41",
            "tgt_ix": "7-1359_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_41",
            "tgt_ix": "7-1359_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_41",
            "tgt_ix": "7-1359_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_41",
            "tgt_ix": "7-1359_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_41",
            "tgt_ix": "7-1359_v2_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_41",
            "tgt_ix": "7-1359_v2_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_0",
            "tgt_ix": "7-1359_v2_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_48",
            "tgt_ix": "7-1359_v2_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_48",
            "tgt_ix": "7-1359_v2_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_48",
            "tgt_ix": "7-1359_v2_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_0",
            "tgt_ix": "7-1359_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_1",
            "tgt_ix": "7-1359_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_2",
            "tgt_ix": "7-1359_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_3",
            "tgt_ix": "7-1359_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_4",
            "tgt_ix": "7-1359_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_5",
            "tgt_ix": "7-1359_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_6",
            "tgt_ix": "7-1359_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_8",
            "tgt_ix": "7-1359_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_9",
            "tgt_ix": "7-1359_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_10",
            "tgt_ix": "7-1359_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_11",
            "tgt_ix": "7-1359_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_12",
            "tgt_ix": "7-1359_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_14",
            "tgt_ix": "7-1359_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_15",
            "tgt_ix": "7-1359_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_16",
            "tgt_ix": "7-1359_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_17",
            "tgt_ix": "7-1359_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_18",
            "tgt_ix": "7-1359_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_20",
            "tgt_ix": "7-1359_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_21",
            "tgt_ix": "7-1359_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_22",
            "tgt_ix": "7-1359_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_23",
            "tgt_ix": "7-1359_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_25",
            "tgt_ix": "7-1359_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_26",
            "tgt_ix": "7-1359_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_27",
            "tgt_ix": "7-1359_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_28",
            "tgt_ix": "7-1359_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_29",
            "tgt_ix": "7-1359_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_31",
            "tgt_ix": "7-1359_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_33",
            "tgt_ix": "7-1359_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_34",
            "tgt_ix": "7-1359_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_35",
            "tgt_ix": "7-1359_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_36",
            "tgt_ix": "7-1359_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_37",
            "tgt_ix": "7-1359_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_38",
            "tgt_ix": "7-1359_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_39",
            "tgt_ix": "7-1359_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_40",
            "tgt_ix": "7-1359_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_41",
            "tgt_ix": "7-1359_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_42",
            "tgt_ix": "7-1359_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_43",
            "tgt_ix": "7-1359_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_44",
            "tgt_ix": "7-1359_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_48",
            "tgt_ix": "7-1359_v2_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_49",
            "tgt_ix": "7-1359_v2_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_50",
            "tgt_ix": "7-1359_v2_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_8",
            "tgt_ix": "7-1359_v2_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_8",
            "tgt_ix": "7-1359_v2_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_8",
            "tgt_ix": "7-1359_v2_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_8",
            "tgt_ix": "7-1359_v2_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_11",
            "tgt_ix": "7-1359_v2_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_11",
            "tgt_ix": "7-1359_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_17",
            "tgt_ix": "7-1359_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_17",
            "tgt_ix": "7-1359_v2_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_42",
            "tgt_ix": "7-1359_v2_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_42",
            "tgt_ix": "7-1359_v2_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_43",
            "tgt_ix": "7-1359_v2_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_43",
            "tgt_ix": "7-1359_v2_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_51",
            "tgt_ix": "7-1359_v2_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_26",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_28",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_34",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_37",
            "tgt_ix": "7-1359_v2_39",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1359_v2_0",
            "tgt_ix": "7-1359_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_1",
            "tgt_ix": "7-1359_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_2",
            "tgt_ix": "7-1359_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_2",
            "tgt_ix": "7-1359_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_2",
            "tgt_ix": "7-1359_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_3",
            "tgt_ix": "7-1359_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_3",
            "tgt_ix": "7-1359_v2_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_3",
            "tgt_ix": "7-1359_v2_3@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_4",
            "tgt_ix": "7-1359_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_4",
            "tgt_ix": "7-1359_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_4",
            "tgt_ix": "7-1359_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_4",
            "tgt_ix": "7-1359_v2_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_4",
            "tgt_ix": "7-1359_v2_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_4",
            "tgt_ix": "7-1359_v2_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_4",
            "tgt_ix": "7-1359_v2_4@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_5",
            "tgt_ix": "7-1359_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_6",
            "tgt_ix": "7-1359_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_7@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_7@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_7@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_7",
            "tgt_ix": "7-1359_v2_7@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_8",
            "tgt_ix": "7-1359_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_8",
            "tgt_ix": "7-1359_v2_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_8",
            "tgt_ix": "7-1359_v2_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_8",
            "tgt_ix": "7-1359_v2_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_9",
            "tgt_ix": "7-1359_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_10",
            "tgt_ix": "7-1359_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_11",
            "tgt_ix": "7-1359_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_11",
            "tgt_ix": "7-1359_v2_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_12",
            "tgt_ix": "7-1359_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_13@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_13@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_13@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_13@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_13@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_13",
            "tgt_ix": "7-1359_v2_13@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_14",
            "tgt_ix": "7-1359_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_15",
            "tgt_ix": "7-1359_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_15",
            "tgt_ix": "7-1359_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_16",
            "tgt_ix": "7-1359_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_17",
            "tgt_ix": "7-1359_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_17",
            "tgt_ix": "7-1359_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_17",
            "tgt_ix": "7-1359_v2_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_17",
            "tgt_ix": "7-1359_v2_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_17",
            "tgt_ix": "7-1359_v2_17@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_18",
            "tgt_ix": "7-1359_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_19@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_19@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_19@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_19@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_19",
            "tgt_ix": "7-1359_v2_19@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_20",
            "tgt_ix": "7-1359_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_21",
            "tgt_ix": "7-1359_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_21",
            "tgt_ix": "7-1359_v2_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_22",
            "tgt_ix": "7-1359_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_23",
            "tgt_ix": "7-1359_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_24",
            "tgt_ix": "7-1359_v2_24@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_25",
            "tgt_ix": "7-1359_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_27",
            "tgt_ix": "7-1359_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_29",
            "tgt_ix": "7-1359_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_30",
            "tgt_ix": "7-1359_v2_30@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_31",
            "tgt_ix": "7-1359_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_32@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_32@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_32@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_32@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_32",
            "tgt_ix": "7-1359_v2_32@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_33",
            "tgt_ix": "7-1359_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_35",
            "tgt_ix": "7-1359_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_35",
            "tgt_ix": "7-1359_v2_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_35",
            "tgt_ix": "7-1359_v2_35@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_36",
            "tgt_ix": "7-1359_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_37",
            "tgt_ix": "7-1359_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_37",
            "tgt_ix": "7-1359_v2_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_37",
            "tgt_ix": "7-1359_v2_37@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_37",
            "tgt_ix": "7-1359_v2_37@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_37",
            "tgt_ix": "7-1359_v2_37@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_37",
            "tgt_ix": "7-1359_v2_37@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_37",
            "tgt_ix": "7-1359_v2_37@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_38",
            "tgt_ix": "7-1359_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_41",
            "tgt_ix": "7-1359_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_42",
            "tgt_ix": "7-1359_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_42",
            "tgt_ix": "7-1359_v2_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_42",
            "tgt_ix": "7-1359_v2_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_42",
            "tgt_ix": "7-1359_v2_42@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_42",
            "tgt_ix": "7-1359_v2_42@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_42",
            "tgt_ix": "7-1359_v2_42@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_43",
            "tgt_ix": "7-1359_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_43",
            "tgt_ix": "7-1359_v2_43@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_43",
            "tgt_ix": "7-1359_v2_43@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_43",
            "tgt_ix": "7-1359_v2_43@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_43",
            "tgt_ix": "7-1359_v2_43@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_43",
            "tgt_ix": "7-1359_v2_43@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_44",
            "tgt_ix": "7-1359_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_44",
            "tgt_ix": "7-1359_v2_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_44",
            "tgt_ix": "7-1359_v2_44@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_45",
            "tgt_ix": "7-1359_v2_45@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_46",
            "tgt_ix": "7-1359_v2_46@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_47@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_47@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_47@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_47@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_47",
            "tgt_ix": "7-1359_v2_47@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_48",
            "tgt_ix": "7-1359_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_49",
            "tgt_ix": "7-1359_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_50",
            "tgt_ix": "7-1359_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_51",
            "tgt_ix": "7-1359_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_51",
            "tgt_ix": "7-1359_v2_51@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_51",
            "tgt_ix": "7-1359_v2_51@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_52",
            "tgt_ix": "7-1359_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_53",
            "tgt_ix": "7-1359_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_54",
            "tgt_ix": "7-1359_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_55",
            "tgt_ix": "7-1359_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_56",
            "tgt_ix": "7-1359_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_57",
            "tgt_ix": "7-1359_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_58",
            "tgt_ix": "7-1359_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_59",
            "tgt_ix": "7-1359_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_60",
            "tgt_ix": "7-1359_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_61",
            "tgt_ix": "7-1359_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_62",
            "tgt_ix": "7-1359_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_63",
            "tgt_ix": "7-1359_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_64",
            "tgt_ix": "7-1359_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_65",
            "tgt_ix": "7-1359_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_66",
            "tgt_ix": "7-1359_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_67",
            "tgt_ix": "7-1359_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_68",
            "tgt_ix": "7-1359_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_69",
            "tgt_ix": "7-1359_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_70",
            "tgt_ix": "7-1359_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_71",
            "tgt_ix": "7-1359_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_72",
            "tgt_ix": "7-1359_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_73",
            "tgt_ix": "7-1359_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_74",
            "tgt_ix": "7-1359_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_75",
            "tgt_ix": "7-1359_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_76",
            "tgt_ix": "7-1359_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_77",
            "tgt_ix": "7-1359_v2_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_78",
            "tgt_ix": "7-1359_v2_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_79",
            "tgt_ix": "7-1359_v2_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_80",
            "tgt_ix": "7-1359_v2_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_81",
            "tgt_ix": "7-1359_v2_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_82",
            "tgt_ix": "7-1359_v2_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_83",
            "tgt_ix": "7-1359_v2_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_84",
            "tgt_ix": "7-1359_v2_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_85",
            "tgt_ix": "7-1359_v2_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_86",
            "tgt_ix": "7-1359_v2_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_87",
            "tgt_ix": "7-1359_v2_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_88",
            "tgt_ix": "7-1359_v2_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1359_v2_89",
            "tgt_ix": "7-1359_v2_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "7-1359_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.15995.2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Virologic failure and HIV drug resistance on simplified, dolutegravir-based maintenance therapy: Systematic review and meta-analysis",
        "abstract": "Background: Dolutegravir-containing maintenance therapy is a promising simplification strategy for virologically suppressed HIV-infected individuals. However, most of the available data to inform this strategy come from small, uncontrolled studies. We estimated the proportion of HIV-infected patients experiencing virological failure (VF) and developing drug resistance on dolutegravir (DTG)-based maintenance therapy. Methods: We searched Medline, Embase, Cochrane Central, Web of Science, and conference abstracts for studies assessing VF on DTG-based maintenance therapy. Studies including ≥5 adults with an undetectable viral load on antiretroviral therapy (ART) who switched to a DTG-based mono- or dual therapy were included. Pooled proportions of VF were estimated using random-intercept logistic meta-regression and acquired drug resistance mutations described for each strategy. Results : Of 1719 studies considered, 21 met our selection criteria, including seven interventional and 14 observational studies. Eight studies including 251 patients assessed VF on DTG monotherapy and fourteen studies including 1670 participants VF on dual therapy. The participant’s median age ranged from 43 to 63 years, their median nadir CD4 count from 90 to 399 cells/µl, and 27.6% were female. The proportion of participants experiencing VF on DTG-monotherapy was 3.6% (95% confidence interval [CI] 1.9-6.7) at 24 weeks and 8.9% (95% CI 4.7-16.2) at 48 weeks. Resistance mutations developed in seven (3.6%) participants on DTG-monotherapy. Among patients on dual therapy, ten (0.7%, 95% CI 0.4-1.3) experienced VF by 48 weeks and none developed resistance to DTG. In adjusted analyses, VF at 24 weeks was less likely on dual therapy than on monotherapy (adjusted odds ratio: 0.10, 95% CI 0.03-0.30). Conclusions: Whereas VF is relatively common on DTG maintenance monotherapy, DTG-based dual therapy appears to be a promising simplification strategy for individuals with a suppressed HIV viral load on triple-ART.",
        "contributors": [
            {
                "surname": "Wandeler",
                "given-names": "Gilles"
            },
            {
                "surname": "Buzzi",
                "given-names": "Marta"
            },
            {
                "surname": "Anderegg",
                "given-names": "Nanina"
            },
            {
                "surname": "Sculier",
                "given-names": "Delphine"
            },
            {
                "surname": "Béguelin",
                "given-names": "Charles"
            },
            {
                "surname": "Egger",
                "given-names": "Matthias"
            },
            {
                "surname": "Calmy",
                "given-names": "Alexandra"
            }
        ],
        "url": "https://f1000research.com/articles/7-1359/v2/",
        "doc_id": "7-1359",
        "version": 2,
        "ix_counter": 382,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}