{"doc_id":2010.12008,"context":"We propose a simple method to generate multilingual question and answer pairs on a large scale through the use of a single generative model. These synthetic samples can be used to improve the zero-shot performance of multilingual QA models on target languages. Our proposed multi-task training of the generative model only requires the  training samples in English, thus removing the need for labeled samples in the target languages, making it applicable to far more languages than those with labeled data.  Experimental results show our proposed approach achieves significant gains on several multilingual QA benchmarks , reducing the gap between zero-shot and supervised performance of  QA models on various languages.","domain":"arxiv","before_edit":"  Experimental results show our proposed approach achieves significant gains on several multilingual QA benchmarks , reducing the gap between zero-shot and supervised performance of  QA models on various languages.","after_edit":" Human evaluations indicate the majority of such samples are grammatically correct and sensible. Experimental results show our proposed approach achieves significant gains on several multilingual QA benchmarks , reducing the gap between zero-shot and supervised performance of  QA models on various languages.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":2010.12873,"context":"Recently, neural-symbolic models have achieved noteworthy success in leveraging knowledge graphs (KGs) for commonsense reasoning tasks , like question answering (QA) . However, fact sparsity, inherent in human-annotated KGs, can hinder such models from retrieving task-relevant knowledge . To address these issues, we propose  Hybrid Graph Network (HGN) , a neural-symbolic model that reasons over both extracted (human-labeled) and generated facts within the same learned graph structure. Given a KG subgraphof extracted facts , HGN is jointly trained to generate complementary facts, encode relational information in the resulting \"hybrid\" subgraph, and filter out task-irrelevant facts . We demonstrate HGN's ability to produce contextually pertinent subgraphs by showing considerable performance gains across four commonsense reasoning benchmarks and a user study of fact validness and helpfulness.","domain":"arxiv","before_edit":" Given a KG subgraphof extracted facts , HGN is jointly trained to generate complementary facts, encode relational information in the resulting \"hybrid\" subgraph, and filter out task-irrelevant facts .","after_edit":" Given a KG subgraphof extracted facts , HGN is jointly trained to generate embeddings for the subgraph's missing edges to form a \"hybrid\" subgraph, and filter out task-irrelevant facts .","label":"meaning-changed","raw_intents":["clarity","meaning-changed","meaning-changed"]}
{"doc_id":2001.05272,"context":"Chinese NER is a challenging task. As pictographs, Chinese characters contain latent glyph information , which is often overlooked. We propose the FGN , Fusion Glyph Network for Chinese NER. This method may offer glyph informationfor fusion representation learning with BERT . The major innovations of FGN include: (1) a novel CNN structure called CGS-CNN is proposed to capture glyph information from both character graphs and their neighboring graphs . (2) we provide a method with sliding window and Slice-Attention to extract interactive information between BERT representation and glyph representation  . Experiments are conducted on four NER datasets, showing that FGN with LSTM-CRF as tagger achieves new state-of-the-arts performance for Chinese NER. Further, more experiments are conducted to investigate the influences of various components and settings in FGN.","domain":"arxiv","before_edit":" Further, more experiments are conducted to investigate the influences of various components and settings in FGN.","after_edit":" Further, more experiments are conducted to inves-tigate the influences of various components and settings in FGN.","label":"others","raw_intents":["others","others","others"]}
{"doc_id":2006.06814,"context":"Designing task-oriented dialogue systems is a challenging research topic, since it needs not only to generate utterances fulfilling user requests but also to guarantee the comprehensibility. Many previous works trained end-to-end (E2E) models with supervised learning (SL), however, the bias in annotated system utterances remains as a bottleneck. Reinforcement learning (RL) deals with the problem through using non-differentiable evaluation metrics (e.g., the success rate) as rewards. Nonetheless, existing works with RL showed that the comprehensibility of generated system utterances could be corrupted when improving the performance on fulfilling user requests. In our work, we (1) propose modelling the hierarchical structure between dialogue policy and natural language generator (NLG) with the option framework, called HDNO  ; (2) train HDNO with hierarchical reinforcement learning (HRL), as well as suggest alternating updates between dialogue policy and NLG during HRL inspired by fictitious play, to preserve the comprehensibility of generated system utterances while improving fulfilling user requests ; and (3) propose using a discriminator modelled with language models as an additional reward to further improve the comprehensibility. We test HDNO on MultiWoz 2.0 and MultiWoz 2.1, the datasets on multi-domain dialogues, in comparison with word-level E2E model trained with RL, LaRL and HDSA, showing a significant improvement on the total performance evaluated with automatic metrics .","domain":"arxiv","before_edit":" In our work, we (1) propose modelling the hierarchical structure between dialogue policy and natural language generator (NLG) with the option framework, called HDNO  ;","after_edit":" In o gur work, we (1) propose modelling the hierarchical structure between dialogue policy and natural language generator (NLG) with the option framework, called HDNO  ;","label":"others","raw_intents":["others","others","others"]}
{"doc_id":2010.12789,"context":"Natural language is one of the ways information is encoded and it has highly abstracted and conceptualized the information. This paper disassembles the information represented by natural language , analyzes the classification coding system of attribute information  and the abstraction relation between attribute information and entities in the real world , constructs the storage model of information, and simulate the attribute information precessing process in one of the attribute spaces, interprets how the relations which represented by \"Be\", \"Of\", \"Have\", and so on are embodied in the information storage data structures and the corresponding data reading modes , reclassifies the sentences types from the perspective of task types and data reading modes. Then, simulated the understanding process (the information processing process) on a dialogue example. Finally, the author summarizes the basic conditions of understanding and gives out the definition of understanding from a personal point of view. The study in this paper provides a practical, theoretical basis and research methods for NLU.It also can be applied in large-scale, multi-type information processing in the artificial intelligence (AI) area .","domain":"arxiv","before_edit":" This paper disassembles the information represented by natural language , analyzes the classification coding system of attribute information  and the abstraction relation between attribute information and entities in the real world ,","after_edit":" This paper disassembles the information represented by natural language and then discovered the classification coding system of attribute information  and the abstraction relation between attribute information and entities in the real world ,","label":"style","raw_intents":["style","style","clarity"]}
{"doc_id":2006.00119,"context":" We present ExplainIt, a review summarization system centered around opinion explainability: the simple notion of high-level opinions (e.g. \"noisy room\") being explainable by lower-level ones (e.g., \"loud fridge\"). ExplainIt utilizes a combination of supervised and unsupervised components to mine the opinion phrasesfrom reviews URLanize them in an Opinion Causality Graph (OCG), a novel semi-structured representation which summarizes causal relations. To construct an OCG, we cluster semantically similar opinions in single nodes, thus canonicalizing opinion paraphrases, and draw directed edges between node pairs that are likely connected by a causal relation. OCGs can be used to generate structured summaries at different levels of granularity and for certain aspects of interest, while simultaneously providing explanations . In this paper, we present the system's individual components and evaluate their effectiveness on their respective sub-tasks, where we report substantial improvements over baselines across two domains. Finally, we validate these results with a user study, showing that ExplainIt produces reasonable opinion explanations according to human judges .","domain":"arxiv","before_edit":" To construct an OCG, we cluster semantically similar opinions in single nodes, thus canonicalizing opinion paraphrases, and draw directed edges between node pairs that are likely connected by a causal relation. OCGs can be used to generate structured summaries at different levels of granularity and for certain aspects of interest, while simultaneously providing explanations . In this paper, we present the system's individual components and evaluate their effectiveness on their respective sub-tasks, where we report substantial improvements over baselines across two domains. Finally, we validate these results with a user study, showing that ExplainIt produces reasonable opinion explanations according to human judges .","after_edit":" To construct an OCG, we cluster semantically similar opinions extracted from reviews and an edge between two nodes signifies that one node explains the other. ExplainIt mines explanations in a supervised method and groups similar opinions together in a weakly supervised way before combining the clusters of opinions together with their explanation relationships into an opinion graph. We experimentally demonstrate that the explanation relationships generated in the opinion graph are of good quality and our labeled datasets for explanation mining and grouping opinions are publicly available .","label":"style","raw_intents":["style","coherence","style"]}
{"doc_id":56727.0,"context":"An investigation is currently happening by the New Zealand Department of Corrections to see if the allegations that prison guards at Rimutaka prison are accepting monetary bribes from prisoners in exchange for drugs and cellphones , are correct . Rimutaka prison is one of New Zealand's largest prions which caters for minimum to high-medium security male prisoners. It is located in Wellington, New Zealand. Two former officers, Ingrid and Mark Rijniers, have handed over a collection of documents on their encounters while working at Rimutaka prison. The pair, who were transferred from Holland, claim that Rimutaka prison is run by gang members who dominate the prison guards. They also claim that if the gang members don't get what they want they will intimidate and threaten the guards with their lives. However Ingrid Rijniers is refusing to co-operate with the department as they refused to give her the money to go back to Holland. The New Zealand Corrections Department confirm that they are investigating the serious claims and are taking them seriously but say that they have not found sufficient evidence yet to back up the claims. Twelve percent of 1,043 prisoners who were tested for drugs from the start of this year until June, tested positive for drugs. Most of the drugs taken was marijuana while fourteen tested positive for \"P\". These claims also come as teenage prisoner, Liam Ashley was strangled to death in a prison van by a much older adult prisoner. Mr Power said that with all these new claims emerging  Mr O'Conner should resign as the minister of corrections.","domain":"news","before_edit":" These claims also come as teenage prisoner, Liam Ashley was strangled to death in a prison van by a much older adult prisoner.","after_edit":" These claims also come as teenage prisoner, Liam Ashley , was recently strangled to death in a prison van by a much older adult prisoner.","label":"clarity","raw_intents":["clarity","style","clarity"]}
{"doc_id":106096.0,"context":"noicon|Launch of the Opening Ceremony. 2008 The 27th Young Designers' Exhibition, opened on May 15 at the Taipei World Trade Center and will close at Sunday May 18. It features participation by 87 academic groups in Taiwan and 20 groups from United States, United Kingdom, Italy, Netherlands, New Zealand, and Australia to showcase various achievements in industrial design. It is recognized by the International Council of Societies of Industrial Design (ICSID) as the largest show of student creations. Not only several design competitions, sponsors like International Forum Design (iF), EPSON, MUJI (in Japanese: 無印良品, Mujirushi Ryōhin), Tsann Kuen Trans-nation Group will also showcase different solutions for  design, creative, and cultural industries. In addition , Taiwan Design Center, the show organizer, also designed several site events like \"On-line Graduate Season Show\", \" Carrer Match-up\", \"Creative and Cultural Showcase and Performance\", \"Seminars of YODEX 2008\" to link the actual exhibition with  on-line exhibition. Besides of the early-announced \"Wow! Taiwan Design Award\", winners from \"2008 Young Designers' Competition\" and \"2008 YODEX Interior Design Competition\" will also be announced this Saturday(May 17).","domain":"news","before_edit":" Besides of the early-announced \"Wow!","after_edit":" Besides of the previously announced \"Wow!","label":"clarity","raw_intents":["clarity","clarity","clarity"]}
{"doc_id":71098.0,"context":"President Bush and President Putin sign the Strategic Offensive Reductions Treaty in 2002. Just one day before the G8 summit, a testy situation involving Russian President Vladimir Putin and United States President URLe W. Bush has flared up yet again with President Bush criticizing Russia for \"derailing\" its promised democratic reforms. President Bush also attacked China in this speech, saying that \"[China's leaders] believe that they can continue to open the nation's economy without also opening its political system\". Kremlin spokesman Dmitry Peskovsaid that Russia \"cannot agree on his declaration about the derailing of democratic reforms\", adding that \"Russia is a democratic country that shares common world and common European values.\" Bush has stated that Russia is not an enemy and that \"the Cold War is over.\"","domain":"news","before_edit":" Bush has stated that Russia is not an enemy and that \"the Cold War is over.\"","after_edit":" Bush  stated that Russia is not an enemy and that \"the Cold War is over.\"","label":"coherence","raw_intents":["coherence","fluency","coherence"]}
{"doc_id":2795820.0,"context":"The for by reports disputed by the Russian Consul  shot and killed an attacker on Thursday, after two individuals attempted to commit a robbery. As reported, lawyer Marcos Cesar Feres Braga so-named by the newspaper working for the , was driving with his family through the suburb of near the main complex when the incident occurred. According to reports from the Rio newspaper , the 60-year-old man, his wife, and his daughter were stopped in traffic  due to the procession in a nearby neighbourhood. Two individuals on motorbikes approached and used a gun to smash the car window. Braga, trained and considered an expert according to reports in , took control of the attacker's firearm and proceeded to shoot dead the alleged attacker, while the second suspect fled the scene. Rio de Janeiro's homicide branch has released a statement in relation to the incident. \"The vice consul got into a physical struggle with the assailant  and during the fight the aggressor's weapon fired shots. The assailant died of his wounds on the spot.\" However, Russia's Consul General Vladimir Tokmakov has released a statement claiming no Russian diplomats or employees of the consulate general were involved in the incident. \"Information circulating in the Brazilian press about the alleged shooting [...] of a Brazilian national by a Russian diplomat during an armed robbery does not reflect reality \".","domain":"news","before_edit":" However, Russia's Consul General Vladimir Tokmakov has released a statement claiming no Russian diplomats or employees of the consulate general were involved in the incident.","after_edit":"  Russia's Consul General Vladimir Tokmakov has released a statement claiming no Russian diplomats or employees of the consulate general were involved in the incident.","label":"coherence","raw_intents":["clarity","coherence","coherence"]}
{"doc_id":74857.0,"context":"The political involvement of most media and other factors are causing contradictions among official sources that are making press work extremely hard. Moreover, nobody is permitted to reach the accident location. The site of the accident was closed to visitors following the intoxication of three TV journalists who got too close. Location of the cloud Map highlighting Lviv, the site of the derailment, in the Lviv Oblast. TV channel Novyj Kanal translated a telephonic interview with officers from the Ministry of Internal Affairs  during which the existence of any cloud whatsoever is firmly denied. Immediately after the interview  a press conference by Kiev mayor , Mr. Leonid Chernovezkij, announces that starting next Monday a daily report about the movements of the same cloud will be available to the population. The service will be provided by the Kiev administration. In an interview to TV channel UT-1  an officer of the ecological service admitted that they have no real data about the area closer to the accident, because not even government officers are permitted to reach it. The officer said that most data about the hypothetical movements of the cloud (if the cloud exists) are made based on computer simulations they receive from Russian vendors, because no such simulation model is currently available in the Ukraine. The closest available on spot measures are related to areas located several kilometers away from the epicentre. Removal operation In the same press release  the Mayor of Kiev also announced that no transport of whatever dangerous material will be allowed in the town area. The removal by railway of the phosphor containers involved in the accident was originally planned for today. Its unclear how Kievs transit refusal may affect the operationand whether the mayor has the authority to block national traffic on the railways. According to the Press Manager of the Ministery for Emergency Situations, Mr. Igor Krol', four containers will be lifted and put back on the rails today. Five containers have already been lifted. Yet the weather may affect the operations, as violent storms and very strong winds are expected in the area. This is going to introduce a serious risk factor for the phosphor that still remains on the ground. The contaminating products are in fact insulated from the air by means of pillows made of air and foam; a strong wind may cause new emergencies by even just partially removing such insulation structures. Yushchenko issued an official call to speed up the closure of the Chernobyl atomic power plants on July , 20. Immediately after he left the country with his family for an unofficial visit to Poland, that will be followed by an official visit to Germany. He is expected to travel to Germany on the evening of July 21. The Ukraine Procuror General, Mr. Aleksandr Medvedenko, declares to the press that he has visited the accident site together with the President, and that all necessary measures are being taken, both for the liquidation of the accident and the defense of the civilian population. He notes that \"it takes courage to work there, for the personnel of the Ministry for Emergency Situations\". He announces that a complex cycle of medical care is being planned for about 1500 children of the affected area. In the same interview  the Procuror General announces that the Government of Kazakhstan will accept being returned the phosphor left (the goods were originally from Kazakhstan). Yet in the same hours the director of Kazphosphat (the vendor ) declares in an interview to the newspaper Segodnja that he gathers that \"the phosphor will be stocked in the Ukraine, because it makes no sense to transfer it back. Moreover, you can hardly imagine that Russia would accept the passage of such a dangerous damaged load on their railways\".","domain":"news","before_edit":" Yushchenko issued an official call to speed up the closure of the Chernobyl atomic power plants on July , 20. Immediately after he left the country with his family for an unofficial visit to Poland, that will be followed by an official visit to Germany.","after_edit":" Yushchenko issued an official call to speed up the closure of the Chernobyl atomic power plants on July  20. Immediately after he left the country with his family for an unofficial visit to Poland, that will be followed by an official visit to Germany.","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":15757.0,"context":"Today the Hewlett-Packard Co. has announced that it will be cutting 10\\% or 14,500 of it's full-time staff wil be cut over the course of the next six quarters. HP CEO Mark Hurd, who 's had office for just about three months now , has decided that he wishes to simplify HP's operations by combining sales and marketing directly into business units. The job cuts are expected to save HP  $1.9 billion US annually. These cuts are all part of HP's new restructuring plan, the savings from this restructuring will primarily be  to offset market forces or in other words, to strengthen HP's competitiveness in the market. The job cuts come after prolonged analyst speculation that HP would be announcing between 10,000 and 25,000 losses. Few losses are expected in the areas of Sales nor in Research & Development. The media in Ireland, where HP has over 4,000 employees across seven business units, has reacted cautiously to the announcement urging that more details should be waited for before making any comments. The news however has made national headlines and workers are understandably anxious to find out more details.","domain":"news","before_edit":" The job cuts are expected to save HP  $1.9 billion US annually.","after_edit":" The job cuts are expected to save HP  $1.9 billion  annually.","label":"fluency","raw_intents":["fluency","fluency","coherence"]}
{"doc_id":99200.0,"context":"The ruins of a Palestinian village. The town of Kiryat Yam in Israel is suing Internet corporation Google over an alleged inaccuracy in its Google Earth software, which claims the town was built over the ruins of an Arab village. However, town official Naty Keyzilberman says this \"obviously cannot be true, because Kiryat Yam was founded in 1945\". The Palestinian exodus, in which hundreds of thousands of Arabs abandoned their villages due to the Arab-Israeli War, occurred in 1948, three years after Keyzilberman says the town was founded. The town filed a slander complaint with Israel police, he says. The town 's claim is supported by Yossi Ben-Artzi, a history professor at the University of Haifa, who said, \"Kiryat Yam was built on sand dunes, and there wasn't any Palestinian village in the area. The lands were bought in 1939 by the Gav Yam construction company.\"","domain":"news","before_edit":" The town filed a slander complaint with Israel police, he says.","after_edit":" The city filed a slander complaint with Israel police, he says.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","clarity"]}
{"doc_id":78730.0,"context":"At the annual European Society of Cardiology Summit in Vienna, Austria, a female cardiologist has suffered a heart attack in front of her colleagues . The 46-year-old Italian woman collapsed on Sunday and was immediately revived by one of her fellow heart specialists . The woman was transferred to the general hospital in Vienna, where she  died later that day . Reinhard Krepler, chief doctor of the hospital, stated that her death was due to a congenital heart problem .","domain":"news","before_edit":" The 46-year-old Italian woman collapsed on Sunday and was immediately revived by one of her fellow heart specialists .","after_edit":" The 46-year-old Italian woman collapsed on Sunday and was immediately revived using a defibrillator .","label":"meaning-changed","raw_intents":["meaning-changed","style","meaning-changed"]}
{"doc_id":33229.0,"context":"Neil Entwistle, 27, appeared before a Magistrates' court today and agreed to be extradited to the United States to face double-murder  charges. Entwistle is now the prime suspect in the murders of his wife Rachel, 27, and nine-month old baby daughter Lillian. Both were shot to death and left under a pile of blankets in the bedroom of their home in Hopkinton, Massachusetts  . Entwistle was reportedly planning a murder suicide, but decided not to kill himself and instead bought a one-way ticket to England where he was with family  .","domain":"news","before_edit":"Neil Entwistle, 27, appeared before a Magistrates' court today and agreed to be extradited to the United States to face double-murder  charges.","after_edit":"Neil Entwistle, 27, appeared before a Magistrates' court today and agreed to extradition to the United States to face double-murder  charges.","label":"others","raw_intents":["others","clarity","fluency"]}
{"doc_id":2795820.0,"context":"The for by reports disputed by the Russian Consul  shot and killed an attacker on Thursday, after two individuals attempted to commit a robbery. As reported, lawyer Marcos Cesar Feres Braga so-named by the newspaper working for the , was driving with his family through the suburb of near the main complex when the incident occurred. According to reports from the Rio newspaper , the 60-year-old man, his wife, and his daughter were stopped in traffic  due to the procession in a nearby neighbourhood. Two individuals on motorbikes approached and used a gun to smash the car window. Braga, trained and considered an expert according to reports in , took control of the attacker's firearm and proceeded to shoot dead the alleged attacker, while the second suspect fled the scene. Rio de Janeiro's homicide branch has released a statement in relation to the incident. \"The vice consul got into a physical struggle with the assailant  and during the fight the aggressor's weapon fired shots. The assailant died of his wounds on the spot.\" However, Russia's Consul General Vladimir Tokmakov has released a statement claiming no Russian diplomats or employees of the consulate general were involved in the incident. \"Information circulating in the Brazilian press about the alleged shooting [...] of a Brazilian national by a Russian diplomat during an armed robbery does not reflect reality \".","domain":"news","before_edit":" According to reports from the Rio newspaper , the 60-year-old man, his wife, and his daughter were stopped in traffic  due to the procession in a nearby neighbourhood.","after_edit":" According to reports from the Rio newspaper , a 60-year-old man, his wife, and his daughter were stopped in traffic  due to the procession in a nearby neighbourhood.","label":"others","raw_intents":["others","others","others"]}
{"doc_id":10439.0,"context":"Italian police officers and guardians are going on trial for alleged abuse of anti-globalization protesters during the G8 meeting in Genoa in 2001. Reports made by over 250 participants in the event detail verbal and physical abuse. The police allegedly took detainees to a holding center outside the city, where they say they were verbally and physically abused,  threatened with rape , and spat at . In one alleged incident, the guards forced a woman's head down a toilet. Another allegation is that asphyxiating gas was sprayed at protesters in their cells. Over 60 people were injured while being taken into custody, three critically. One 23-year old protester was shot dead. Twenty-five of the 250 were brought up on minor charges of looting and ransacking. The police alleged that 93 protesters were in possession of dangerous weapons and resisted arrest, yet Genoa prosecutors  dropped all charges against them. Meanwhile, the police face accusations of planting evidence , and fabricating charges against the demonstrators. Unfortunately, due to delays in bringing the authorities to justice, the 5-year statute of limitations has expired on the major charges .","domain":"news","before_edit":" Reports made by over 250 participants in the event detail verbal and physical abuse.","after_edit":" Reports made by over 250 people people who attended the event have detailed verbal and physical abuse.","label":"style","raw_intents":["style","style","clarity"]}
{"doc_id":10439.0,"context":"Italian police officers and guardians are going on trial for alleged abuse of anti-globalization protesters during the G8 meeting in Genoa in 2001. Reports made by over 250 participants in the event detail verbal and physical abuse. The police allegedly took detainees to a holding center outside the city, where they say they were verbally and physically abused,  threatened with rape , and spat at . In one alleged incident, the guards forced a woman's head down a toilet. Another allegation is that asphyxiating gas was sprayed at protesters in their cells. Over 60 people were injured while being taken into custody, three critically. One 23-year old protester was shot dead. Twenty-five of the 250 were brought up on minor charges of looting and ransacking. The police alleged that 93 protesters were in possession of dangerous weapons and resisted arrest, yet Genoa prosecutors  dropped all charges against them. Meanwhile, the police face accusations of planting evidence , and fabricating charges against the demonstrators. Unfortunately, due to delays in bringing the authorities to justice, the 5-year statute of limitations has expired on the major charges .","domain":"news","before_edit":" Meanwhile, the police face accusations of planting evidence , and fabricating charges against the demonstrators.","after_edit":" Meanwhile, the police have been charged with planting evidence and fabricating charges against the demonstrators.","label":"style","raw_intents":["style","style","style"]}
{"doc_id":55503854.0,"context":"Relation to traditional epistemology Traditional epistemology and Bayesian epistemology are both forms of epistemology, but they differ in various respects, for example, concerning their methodology, their interpretation of belief , the role justification or confirmation plays in them and some of their research interests. Traditional epistemology focuses on topics such as the analysis of the nature of knowledge, usually in terms of justified true beliefs , the sources of knowledge , like perception or testimony, the structure of a body of knowledge, for example in the form of foundationalismor coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all . These inquiries are usually based on epistemic intuitions and regard beliefs as either present or absent . Bayesian epistemology, on the other hand, works by formalizing concepts and problems, which are often vague in the traditional approach. It thereby focuses more on mathematical intuitions and promises a higher degree of precision. It sees belief as a continuous phenomenon that comes in various degrees, so-called credences. Some Bayesians have even suggested that the regular notion of belief should be abandoned. But there are also proposals to connect the two, for example, the Lockean thesis, which defines belief as credence above a certain threshold. Justification plays a central role in traditional epistemology while Bayesians have focused on the related notions of confirmation and disconfirmation through evidence. The notion of evidence is important for both approaches but only the traditional approach has been interested in studying the sources of evidence, like perception and memory. Bayesianism, on the other hand, has focused on the role of evidence for rationality: how someone's credence should be adjusted upon receiving new evidence. There is an analogy between the Bayesian norms of rationality in terms of probabilistic laws and the traditional norms of rationality in terms of deductive consistency. Certain traditional problems, like the topic of skepticism about our knowledge of the external world, are difficult to express in Bayesian terms.","domain":"wiki","before_edit":" Traditional epistemology focuses on topics such as the analysis of the nature of knowledge, usually in terms of justified true beliefs , the sources of knowledge , like perception or testimony, the structure of a body of knowledge, for example in the form of foundationalismor coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all .","after_edit":" Traditional epistemology focuses on topics such as the analysis of the nature of knowledge, usually in terms of justified true beliefs . They then seek to understand what counts as knowledge and how to evaluate one's beliefs (see foundationalism, coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all .","label":"clarity","raw_intents":["clarity","coherence","clarity"]}
{"doc_id":560813.0,"context":"In its purest form, Civil libertarianism is a political philosophy supporting civil liberties, or which emphasize individual rights and personal freedoms over authorities - such as governments , a corporation and\/or social peer pressures . Civil libertarianism is not limited to an individual ideology, rather, it is a philosophy based on a strict interpretation of the Constitution's civil liberties and the many civil rightslaws enacted since . In the libertarian movement The primary concern of most Civil Libertarians is the government's reach over the individual. In theory, the civil libertarian seeks to reduce the role of government to a minimum - preferring private businesses to fill the many social needs for most Americans. Under the control of elected officials, the government is only relied upon for regulation, without excessively interfering in the lives of its citizens. The Civil Libertarian sees the government's role as critical - supporting free enterprise and the privatization of government programs wherever improvements are possible. One of the central pillars of Civil Libertarianism is free speech. In many cases Civil Libertarians oppose bans on hate speech and obscenity. Although they may or may not personally condone behaviors associated with these issues, civil libertarians hold that the advantages of unfettered public discourse outweigh all disadvantages. With the advent of personal computers, the Internet, email, cell phones and other information technology advances a subset of civil libertarianism has arisen that focuses on protecting individuals' digital rights and privacy . Just as acting Democrats and Republicans hold varying degrees of left and right-leaning beliefs; few Civil Libertarians, if any, hold all of the views defined by this philosophy .","domain":"wiki","before_edit":" In theory, the civil libertarian seeks to reduce the role of government to a minimum - preferring private businesses to fill the many social needs for most Americans. Under the control of elected officials, the government is only relied upon for regulation, without excessively interfering in the lives of its citizens.","after_edit":" In theory, the civil libertarian seeks to restrict this relationship to an absolute minimum in which the state can function and provide basic services and securities without excessively interfering in the lives of its citizens.","label":"clarity","raw_intents":["clarity","clarity","meaning-changed"]}
{"doc_id":40918428.0,"context":"The Brussels Agreement ( \/ Briselski sporazum, ), formally the First Agreement of Principles Governing the Normalisation of Relations, was a multilateral treaty proposed to normalize relations between the nations of Serbia and KosovoAs to the agreement not having been signed, see text of agreement. . The agreement was negotiated and concluded in Brussels under the auspices of the European Union and signed on 19 April 2013. Negotiations were led by Serbian Prime Minister Ivica Dai and Kosovo Prime Minister Hashim Thai and mediated by EU High Representative Catherine Ashton. The government of Serbia does not recognize Kosovo as a sovereign state, but began normalizing relations with the government of Kosovo nonetheless, in accordance with the Brussels URL Background Following the Kosovo War and NATO bombing of Yugoslavia in 1999, Kosovo, as part of Serbia and Federal Republic of Yugoslavia, was placed under United Nations administration under UNSC Resolution 1244. In 2008, Kosovo declared independence and has since been recognized by 96 countries. However, Serbia maintains that Kosovo continues to be its territory. Kosovo has become a member of several URLanizations, while according to Serbia and about half of the UN member states, Resolution 1244 remains legally binding on all parties. The EU-mediated dialogue between Kosovo and Serbia was launched in March 2011, three years after Kosovo declared URL Belgrade and Pristina were urged to continue talks in Brussels, but Serbia was not obliged to recognize Kosovo at any point in the URL Talks Until preset, ten rounds of talks have been held at the European External Action Service office in Brussels. Baroness Ashton, the EU High Representative, had been chairing talks for two years, followed by Federica Mogherini. Normalization of relations with neighboring states is a key precondition for states wishing to join the EU; the Brussels Agreement brought Serbia close to EU accession talks and Kosovo to initialing a Stabilisation and Association Agreement (SAA). The SAA was signed by HR Mogherini and PM Mustafa in October 2015. Removing the parallel Serbian structures in the Northern part of Kosovo remains challenging. 330px|Ivica Dai, Prime Minister of Serbia (left), Catherine Ashton (middle), and Hashim Thai, Prime Minister of Kosovo (right) in Munich, 2014. United States diplomats have supported the EU-led dialogue from the beginning. U.S. Secretary of State Hillary Clinton invited Baroness Ashton to undertake joint travel in the Balkans, and the two made joint visits to Belgrade and Pristina (as well as Sarajevo) in October 2012. Clinton assigned Deputy Assistant Secretary of State ambassador Philip Reeker to support Ashton's efforts. Reeker and his team coordinated closely with EU colleagues and met with Serbian and Kosovar representatives on the margins of every dialogue session in Brussels, and during visits to the region. The result was the 15-point \"First Agreement of Principles Governing the Normalisation of Relations\", initialed but not signed on 19 April 2013. After the agreement was concluded, the European Commission officially advised that work start on an SAA with Kosovo, and accession negotiations began with Serbia. The agreement was supported by the European Union, NATO, the OSCE, and the United Nations. In October 2013, arrangements were made for Serbian officials to visit North Kosovo. It was agreed that electoral bodies in Kosovo would include Kosovo Serb representatives and that international dialing code +383 would be attributed to Kosovo. The new code was expected to go into effect in late 2015 but has again been delayed by Serbia until March 2016. The geographic phone code was implemented in December 2016. The National Assembly of Serbia has not treated the agreement as international and has not ratified it into a binding law, which is a procedure required for international agreements in Serbia.Zakon o zakljucivanju i izvrsenju medjunarodnih ugovora It has, however, merely accepted the government report about the \"hitherto process of political and technical dialog with the temporary institutions in Pristina with the mediation of EU, including the process of implementation of the achieved agreements\".O PRIHVATANjU IZVETAJA O DOSADANjEM PROCESS POLITIKOG I TEHNIKOG DIJALOGA SA PRIVREMENIM INSTITUCIJAMA SAMOUPRAVE U PRITINI UZ POSREDOVANjE EVROPSKE UNIJE, UKLjUUJUI PROCES IMPLEMENTACIJE POSTIGNUTIH DOGOVORA The constitutional court in Belgrade did not answer the question about constitutionality of the agreement, stating in December 2014 that the issue raised is a political question, and not a legal one. Serbia has accepted, however, that progress in implementing the Brussels agreement is a prerequisite for EU accession talks within the opening of Chapter 35 negotiations in December 2015.","domain":"wiki","before_edit":" The result was the 15-point \"First Agreement of Principles Governing the Normalisation of Relations\", initialed but not signed on 19 April 2013.","after_edit":" ","label":"coherence","raw_intents":["coherence","coherence","clarity"]}
{"doc_id":20529614.0,"context":"Post-trial commutation of death sentence  Peterson maintains his innocence. Peterson was granted post-conviction relief and re-sentenced to  120 years in prison December 12, 2004. His sentence was later commuted to 120 years in prison. He is scheduled for release on April 16th, 2051 according to the Indiana Department of Corrections .","domain":"wiki","before_edit":" His sentence was later commuted to 120 years in prison.","after_edit":" ","label":"coherence","raw_intents":["coherence","clarity","coherence"]}
{"doc_id":22062208.0,"context":"Discovery-driven planning is a planning technique first introduced in a Harvard Business Review article by Rita Gunther McGrath and Ian C. MacMillan in 1995 McGrath , R. G. & MacMillan, I. C. 1995. Discovery Driven Planning . Harvard Business Review, 73(4): 4454 and subsequently referenced in a number of books and articles.McGrath, R. G. & MacMillan, I. C. 2009. Discovery Driven Growth: A Breakthrough Process to Reduce Risk and Seize Opportunity . Boston: Harvard Business Publishing ; Christensen, C. M. 1997. The innovator's dilemma: When new technologies cause great firms to fail. Boston , Mass. : Harvard Business School Press  Its main thesis is that when one is operating in arenas with significant amounts of uncertainty, that a different approach  than is normally used in conventional planning applies . In conventional planning, the correctness of a plan is generally judged by how close outcomes come to projections. In discovery-driven planning, it is assumed that plan parameters may change as new information is revealed. With conventional planning, it is considered appropriate to fund the entire project  as the expectation is that one can predict a positive outcome. In discovery driven planning, funds are released based on the accomplishment of key milestones or checkpoints, at which point additional funding can be made available predicated on reasonable expectations for future success.Block, Z. & MacMillan, I. C. 1985. Milestones for successful venture planning. Harvard Business Review, 63(5): 8490 Conventional project management tools, such as stage-gate models or the use of financial tools to assess innovation  have been found to be flawed in that they are not well suited for the uncertainty of innovation-oriented projects Rajesh, S. & Zafar, I. 2008. Stage-Gate Controls, Learning Failure, and Adverse Effect on Novel New Products . Journal of Marketing, 72(1): 118. Christensen, C., Kaufman, S., & Shih, W. 2008. Innovation killers: how financial tools destroy your capacity to do new things. Harvard Business Review, 86(1): 98105, 137 Discovery-driven planning has been widely used in entrepreneurship curricula and has recently been cited by Steven G. Blank as a foundational idea in the lean startup methodology Blank, S. (2013). \"Why the Lean Start-Up Changes Everything. \" Harvard Business Review  91(5): 63-72. A discovery driven plan incorporates five disciplines or plan elements: Definition of success for the plan or initiative, including a 'reverse' income statement Benchmarking against market and competitive parameters Specification of operational requirements Documentation of assumptions Specification of key checkpoints Using discovery-driven planning, it is often possible to iterate the ideas in a plan, encouraging experimentation at lowest possible cost. The methodology is consistent with the application of real options reasoning to business planning, in which ventures are considered 'real' options. A real option is a small investment made today which buys the right, but not the obligation to make further investments.McGrath, R. G. 1997. A real options logic for initiating technology positioning investments. Academy of Management Review, 22(4): 974996van Putten, A. B. & MacMillan, I. C. 2004. Making Real Options Really Work . Harvard Business Review, 82(12): 134Dixit , A. K. & Pindyck, R. S. 1994. Investment Under Uncertainty. Princeton, New Jersey : Princeton University Press ","domain":"wiki","before_edit":" With conventional planning, it is considered appropriate to fund the entire project  as the expectation is that one can predict a positive outcome.","after_edit":" With conventional planning, it is considered appropriate to fund the entire project , as the expectation is that one can predict a positive outcome.","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":6853425.0,"context":"URLe Lilanga (1934 27 June 2005) was a Tanzanian painter and sculptor, active from the late 1970s and until the early years of the 21st century. He belonged to the Makonde people and lived most of his life in Dar es Salaam, the largest city in Tanzania. The main gate of the Nyumba ya Sanaa cultural centre in Dar es Salaam has decorations by Lilanga URLe Lilanga (right) and fellow painter Patrick Francis Imanjama outside Nyumba ya Sanaa In 1970, Lilanga decided to move to Dar es Salaam, where there were greater opportunities for selling sculptures and practising contemporary art. In 1971, he found his first employment, thanks to his uncle, Augustino Malaba, an already well-known sculptor, who would be his future collaborator. He worked as a night guard at the House of Art (Nyumba ya Sanaa), a  centre for the development of African art and craftsmanship in Dar es Salaam. Lilanga's talents were soon recognized by Jean Pruitt, an American aid worker promoting Tanzanian art. Lilanga welcomed  other artists like Robino Ntila, Augustino Malaba and Patrick Francis Imanjama to join Nyumba ya Sanaa . He also began to create paintings on batik cloth, on goatskin and on metal sheets for the finishing of railings and gates of the centre.  In 1977, he made his first journey outside Africa, travelling to New York, where he had a show at the Maryknoll Sisters Ossining Center . He stayed for a brief time in Manhattan, selling prints made on paper or cardboard, standing on street corners. Artistic development & success Shortly after beginning grammar school, Lilanga had his first contact with sculpture ( roots, softwood and, later, hard ebony), working in the Makonde tradition. He dedicated himself almost exclusively to this technique from 1961 until 1972. He showed his first works to Europeans who worked in the refugee camps during Mozambique's war of independence. Following their advice, in 1970 Lilanga decided to move to Dar es Salaam, where there were greater opportunities for selling sculptures. A lot of URLe Lilanga's lifetime art works can be found in leading international collections like The Contemporary African Art Collection (CAAC) of Jean Pigozzi or the Hamburg Mawingu Collection HMC of German collector Peter-Andreas Kamphausen. Directly after the death of the artist, the HMC: URLe Lilanga Collection presented the first systematically and thematically complete catalogue of Lilanga's work. In addition, the book explores the traditional roots of East African Makonde art, as well as four decades of Lilanga's artistic development with different materials and techniques, including sculpture, paintings, etchings, drawings and metal works. Currently the HMC publish the URLe Lilanga News as an online blog with information about the artist, his art works, exhibitions and other interesting background material. Also in 2005, the African Collection series (Skira Editore, Milan) published a well-illustrated book on Lilanga's work with useful information.","domain":"wiki","before_edit":" A lot of URLe Lilanga's lifetime art works can be found in leading international collections like The Contemporary African Art Collection (CAAC) of Jean Pigozzi or the Hamburg Mawingu Collection HMC of German collector Peter-Andreas Kamphausen.","after_edit":" A lot of URLe Lilanga's lifetime art works can be found in leading international collections like The Contemporary African Art Collection (CAAC) of Jean Pigozzi or the Hamburg Mawingu Collection (HMC) of German collector Peter-Andreas Kamphausen.","label":"fluency","raw_intents":["others","fluency","fluency"]}
{"doc_id":17250911.0,"context":"Early life Benjamin Thomas Atkins was born on August 26, 1968 in Detroit, the younger of two sons. His family lived in a poor neighborhood, and both of his parents were drug and alcohol abusers. Shortly after his birth, Tony's father left the family. In 1970, Benjamin ran away from home, and without parental supervision, wound up in an orphanage, where he spent his childhood and youth. While living there, he was physically assaulted by other children, and at the age of 10, was raped by one of the employees. Over the next five years, he was continuously subjected to sexual harassment by other boys, until he eventually escaped and reunited with his mother. For sometime, he lived together with her and his older brother, but  realised that his mother worked as a prostitute. Both Atkins and his brother saw her have sex with clients at the house on several occasions. Atkins left the house again in the late 1980s, living on the streets and doing drugs, and eventually developed a drug addiction. Because he lacked formal education, Atkins was forced to work in low-skilled labor jobs for low wages, and spent the nights at homeless shelters. Acquaintances claimed to be very fond of him, but at the same time noted that when drunk or on drugs, he showed signs of an antisocial personality and displayed misogynistic behavior. Murders As victims, Atkins chose vulnerable women, often prostitutes or drug addicts. He would lure them to abandoned buildings and houses, where he sexually assaulted  them. After strangling his victims, he would leave the bodies at the crime scenes, with some of them discovered months after their deaths. The first victim to be discovered was 30-year-old Debbie Ann Friday, found on December 14, 1991, after she had gone missing on December 8th. A few days later, on December 30th, the body of 26-year-old Bertha Jean Mason was found. She had gone missing on December 11th, and was last seen leaving her home and entering a store, after which she was never seen alive again. On January 3, 1992, while demolishing an abandoned house, workmen discovered the body of 36-year-old prostitute and drug addict Patricia Cannon URLe, who had been put on a wanted list in early December 1991 following a drug den bust within Woodward Corridor. On January 25th, the body of 39-year-old Vickie Truelove was located: like the other victims, she had been sodomized, raped and strangled. At the end of January, Atkins was arrested at an abandoned building and taken to the police station for interrogation. Due to lack of evidence to prove his guilt in the murders, he was released. On February 17th, the corpses of three women were found in three separate rooms in the former Monterey Hotel in Highland Park: they were 34-year-old Valerie Chalk, 23-year-old Juanita Hardy and a Jane Doe whose identity remains unknown. All of them had been raped and strangled . Relatives of Chalk told the police that after she was put on a wanted list in early November 1991, Valerie went missing. On April 9th, the body of 28-year-old Brenda Mitchell was found in an abandoned house, after she had gone missing four days earlier . Despite the fact Mitchell was found almost completely naked with a scarf wrapped around her neck , her death was originally classified as an overdose. %DIFDELCMD < %DIFDELCMD < %%% A few days later, on the 15th, the partially decomposed corpse of 27-year-old Vicki Beasley-Brown, who was last seen alive on March 25th, was discovered. On June 15th, the body of 45-year-old Joanne O'Rourke was found. Arrest Atkins was arrested on rape charges on August 21, 1992, after he was identified on a Detroit street by 34-year-old Darlene Saunders, who had been sodomized and raped by him in October 1991. %DIFDELCMD < %DIFDELCMD < %%% He was questioned again, but categorically denied any involvement, claiming that he had no interest in women and was a homosexual. After further interrogations, the police officers familiarized him with the psychological portrait they had compiled of the killer, which, after 12 hours, caused Atkins to admit to the murders of 11 women. He described in detail the appearance and clothing of the victims, and even indicated the whereabouts of the bodies of the 10th and 11th victims, 21-year-old Ocinena Waymer and 29-year-old LaTanya Showanda Smith. Their disappearances were not connected to the murders until Atkins' confession, and the bodies were found on the indicated place that same day. During the interrogation, Atkins said that the motive for the murders was his misogynistic views against girls and women engaged in prostitution.  Contrary to the official version of the investigation, Atkins revealed that the first victim had actually been Patricia URLe, whom he killed in the fall of 1991. According to his testimony, he didn't plan on killing the woman, but simply planned to smoke crack cocaine with her. When she decided to leave him, he flew into a rage and killed her. In several cases, he was unable to explain why he committed the murders: this was the case with Hardy, with whom Benjamin had an intimate relationship, but after doing drugs together, he said he strangled her for no apparent reason.","domain":"wiki","before_edit":"  Contrary to the official version of the investigation, Atkins revealed that the first victim had actually been Patricia URLe, whom he killed in the fall of 1991.","after_edit":" He stated that he lured his victims into abandoned houses by offering them drugs and alcohol, in addition to paying for their sexual services. Contrary to the official version of the investigation, Atkins revealed that the first victim had actually been Patricia URLe, whom he killed in the fall of 1991.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":55503854.0,"context":"Relation to traditional epistemology Traditional epistemology and Bayesian epistemology are both forms of epistemology, but they differ in various respects, for example, concerning their methodology, the propositional attitudes they study , the role justification or confirmation plays in them and some of their research interests. Bayesian epistemology focuses on degrees of belief, also often called credences. On the other hand, Traditional epistemology focuses on knowledge, analyzed by Plato as being justified true beliefs . They then seek to understand what counts as knowledgeand how to evaluate one's beliefs (see foundationalism, coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all ) . Bayesian epistemology, on the other hand, works by formalizing concepts and problems, which are often vague in the traditional approach. It thereby focuses more on mathematical intuitions and promises a higher degree of precision. It sees belief as a continuous phenomenon that comes in various degrees, so-called credences. Some Bayesians have even suggested that the regular notion of belief should be abandoned. But there are also proposals to connect the two, for example, the Lockean thesis, which defines belief as credence above a certain threshold. Justification plays a central role in traditional epistemology while Bayesians have focused on the related notions of confirmation and disconfirmation through evidence. The notion of evidence is important for both approaches but only the traditional approach has been interested in studying the sources of evidence, like perception and memory. Bayesianism, on the other hand, has focused on the role of evidence for rationality: how someone's credence should be adjusted upon receiving new evidence. There is an analogy between the Bayesian norms of rationality in terms of probabilistic laws and the traditional norms of rationality in terms of deductive consistency. Certain traditional problems, like the topic of skepticism about our knowledge of the external world, are difficult to express in Bayesian terms.","domain":"wiki","before_edit":" On the other hand, Traditional epistemology focuses on knowledge, analyzed by Plato as being justified true beliefs . They then seek to understand what counts as knowledgeand how to evaluate one's beliefs (see foundationalism, coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all ) . Bayesian epistemology, on the other hand, works by formalizing concepts and problems, which are often vague in the traditional approach.","after_edit":" On the other hand, Traditional epistemology focuses on knowledge, analyzed by Plato as being justified true beliefs , the sources of knowledge, like perception or testimony, the structure of a body of knowledge, for example in the form of foundationalism or coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all ) . Bayesian epistemology, on the other hand, works by formalizing concepts and problems, which are often vague in the traditional approach.","label":"meaning-changed","raw_intents":["meaning-changed","coherence","meaning-changed"]}
{"doc_id":22062208.0,"context":"Discovery-driven planning is a planning technique first introduced in a Harvard Business Review article by Rita Gunther McGrath and Ian C. MacMillan in 1995 McGrath , R. G. & MacMillan, I. C. 1995. Discovery Driven Planning . Harvard Business Review, 73(4): 4454 and subsequently referenced in a number of books and articles.McGrath, R. G. & MacMillan, I. C. 2009. Discovery Driven Growth: A Breakthrough Process to Reduce Risk and Seize Opportunity . Boston: Harvard Business Publishing ; Christensen, C. M. 1997. The innovator's dilemma: When new technologies cause great firms to fail. Boston , Mass. : Harvard Business School Press  Its main thesis is that when one is operating in arenas with significant amounts of uncertainty, that a different approach  than is normally used in conventional planning applies . In conventional planning, the correctness of a plan is generally judged by how close outcomes come to projections. In discovery-driven planning, it is assumed that plan parameters may change as new information is revealed. With conventional planning, it is considered appropriate to fund the entire project  as the expectation is that one can predict a positive outcome. In discovery driven planning, funds are released based on the accomplishment of key milestones or checkpoints, at which point additional funding can be made available predicated on reasonable expectations for future success.Block, Z. & MacMillan, I. C. 1985. Milestones for successful venture planning. Harvard Business Review, 63(5): 8490 Conventional project management tools, such as stage-gate models or the use of financial tools to assess innovation  have been found to be flawed in that they are not well suited for the uncertainty of innovation-oriented projects Rajesh, S. & Zafar, I. 2008. Stage-Gate Controls, Learning Failure, and Adverse Effect on Novel New Products . Journal of Marketing, 72(1): 118. Christensen, C., Kaufman, S., & Shih, W. 2008. Innovation killers: how financial tools destroy your capacity to do new things. Harvard Business Review, 86(1): 98105, 137 Discovery-driven planning has been widely used in entrepreneurship curricula and has recently been cited by Steven G. Blank as a foundational idea in the lean startup methodology Blank, S. (2013). \"Why the Lean Start-Up Changes Everything. \" Harvard Business Review  91(5): 63-72. A discovery driven plan incorporates five disciplines or plan elements: Definition of success for the plan or initiative, including a 'reverse' income statement Benchmarking against market and competitive parameters Specification of operational requirements Documentation of assumptions Specification of key checkpoints Using discovery-driven planning, it is often possible to iterate the ideas in a plan, encouraging experimentation at lowest possible cost. The methodology is consistent with the application of real options reasoning to business planning, in which ventures are considered 'real' options. A real option is a small investment made today which buys the right, but not the obligation to make further investments.McGrath, R. G. 1997. A real options logic for initiating technology positioning investments. Academy of Management Review, 22(4): 974996van Putten, A. B. & MacMillan, I. C. 2004. Making Real Options Really Work . Harvard Business Review, 82(12): 134Dixit , A. K. & Pindyck, R. S. 1994. Investment Under Uncertainty. Princeton, New Jersey : Princeton University Press ","domain":"wiki","before_edit":"Discovery-driven planning is a planning technique first introduced in a Harvard Business Review article by Rita Gunther McGrath and Ian C. MacMillan in 1995 McGrath , R. G. & MacMillan, I. C. 1995.","after_edit":"Discovery-driven planning is a planning technique first introduced in a Harvard Business Review article by Rita Gunther McGrath and Ian C. MacMillan in 1995McGrath , R. G. & MacMillan, I. C. 1995.","label":"others","raw_intents":["others","fluency","others"]}
{"doc_id":564429.0,"context":"The Wlastkwewiyik, or Maliseet (,Erickson, Vincent O. (1978). \"Maliseet-Passamaquoddy.\" In Northeast, ed. Bruce G. Trigger. Vol. 15 of Handbook of North American Indians, ed. William C. Sturtevant. Washington, D.C.: Smithsonian Institution, pg. 123. also spelled Malecite), are an Algonquian-speaking First Nation of the Wabanaki Confederacy. They are the indigenous people of the Wlastk River (Saint John River) valley and its tributaries , and their territory extends across the current borders of New Brunswick and Quebec in Canada, and parts of Maine in the United States. The Houlton Band of Maliseet Indians, based on the Meduxnekeag River in the Maine portion of their traditional homeland, are since 19 July 1776, the first foreign Treaty allies with the United States of America and a federally recognized tribe of Maliseet people by the United States . Today Maliseet people have also migrated to other parts of the world. Maliseets are forest, river and coastal people within their 20,000, 000 acre, 200 mile wide, and 600 mile long Saint John river watershed homeland . Name The people call themselves Wlastkwewiyik after the Wlastkw River at the heart of their expansive territory in what is now New Brunswick and Maine. Wlastkw means \"Beautiful River.\" English colonists later named it the Saint John River. Wlastkwewiyik means \"People of the Beautiful River,\" in Maliseet.LeSourd, Philip, ed. 2007. Tales from Maliseet Country: The Maliseet Texts of Karl V. Teeter, Lincoln, Nebraska: University of Nebraska Press, p. 17, fnote 4 The Maliseet (Malecite) have long been associated with the Saint John  . Their territory still extends as far as the Saint Lawrence River. Their lands and resources are bounded on the east by the Mikmaq people, on the west by the Penobscot people , and on the south by the Passamaquoddy people , who also still speak related Algonquian languages. Malesse'jik was a Mikmaq word believed to mean \"He speaks slowly,\" or differently  by which the Mikmaq people contrasted the other tribe's language to their own. The meaning of the word today is unknown but  is commonly mistranslated to \"he speaks badly, lazy, or broken\"  Erickson 1978, pg. 135 This term is the exonym by which the Mikmaq people referred to this group when speaking to early Europeans. The Europeans met the Mikmaq people before the Wlastkwewiyik, and adopted Malesse'jik as Malcite in French for the people, not understanding that it was not their true name. The later English colonists anglicized this term as Maliseet, in another transliteration of sound  . 17th century At the time of European encounter, the Wlastkwewiyik were living in walled villages and practicing horticulture (corn, beans, squash and tobacco). In addition to  growing crops, the women gathered and processed fruits, berries, nuts and natural produce. The men contributed by fishing and hunting  . Written accounts in the early 17th century, such as those of Samuel de Champlain and Marc LesCarbot, refer to a large Malecite village at the mouth of the Saint John River. Later in the century, sources indicate their headquarters had shifted upriver to Meductic, on the middle reaches of the Saint John River. The French explorers were the first to establish a fur trade with the Wlastkwewiyik, which became important in their territory. Some European goods were desired because they were useful to Wlastkwewiyik subsistence and culture. The French Jesuits also established missions  where some Wlastkwewiyik converted to Catholicism. With years of colonialism, many learned the French language. The French called them Malcite, a transliteration of the Mi'kmaq name for the people. Local histories depict many encounters with the Iroquois, five powerful nations based south and east of the Great Lakes, and the Innu  . Contact with European fisher-traders in the early 17th century and with specialized fur traders developed into a stable relationship which lasted for nearly 100 years. Despite devastating population losses to European infectious diseases, to which they had no immunity, these Atlantic First Nations held on to their traditional coastal or river locations for hunting, fishing and gathering , and were concentrated along river valleys for trapping.","domain":"wiki","before_edit":" Their lands and resources are bounded on the east by the Mikmaq people, on the west by the Penobscot people , and on the south by the Passamaquoddy people , who also still speak related Algonquian languages.","after_edit":" Their lands and resources are bounded on the east by the Mikmaq people, on the west by the Penobscot people , and on the south by the Passamaquoddy  , who also still speak related Algonquian languages.","label":"others","raw_intents":["others","style","clarity"]}
{"doc_id":8556500.0,"context":"Practitioners of oil pulling claim it is capable of improving oral and whole-body health, including a benefit in conditions such as headaches, migraines, diabetes mellitus, asthma, and acne, as well as whitening teeth. Its promoters claim it works by pulling out toxins, which are known as ama in Ayurveda, but there is no credible evidence to support some of these claims and only limited and inconclusive evidence to support other some of these claims, primarily having to do with oral health.  A review of the evidence published in the scientific journal Heliyon (august 7, 2020) URL found \"The limited evidence suggests that oil pulling with coconut oil may have a beneficial effect on improving oral health and dental hygiene. Future clinical trials are of merit considering the universal availability of the intervention. Prospective research should have a robust design with rigorous execution to provide a higher quality of evidence... Oil pulling with coconut oil could be used as a adjunct to normal preventative regimes to improve oral health and dental hygiene although further studies are needed to determine the level of effectiveness.\" This article was deemed significant enought for the toothpaste maker Colgate to cite it on its website URL","domain":"wiki","before_edit":" Its promoters claim it works by pulling out toxins, which are known as ama in Ayurveda, but there is no credible evidence to support some of these claims and only limited and inconclusive evidence to support other some of these claims, primarily having to do with oral health.","after_edit":" Some of its promoters claim it works by pulling out toxins, which are known as ama in Ayurveda, but there is no credible evidence to support some of these claims and only limited and inconclusive evidence to support other some of these claims, primarily having to do with oral health.","label":"style","raw_intents":["style","coherence","style"]}
{"doc_id":2882854.0,"context":"Noon sights obtain the observer's Latitude. It is impossible to determine longitude with an accuracy better than 10nmi by means of a noon sight. A noon sight is called a Meridian Altitude.Basic Principles of Marine Navigation by D A Moore Published by Kandy p81 While it is very easy to determine the observer's latitude at noon without knowing the exact time, longitude cannot accurately be measured at noon. At noon the sun's change of altitude is very slow, so determining the exact time that the sun is at its zenith by direct observation is impossible, and therefore it is impossible to obtain an accurate longitude at the moment of Zenith . However, it is possible to determine the time of zenith for longitude with a useful accuracy by performing a mean time of observation when the sun is on its ascent and descent prior to and following its moment of Zenith . By taking a sextant reading within 15 to 30 minutes prior to local noon ( zenith ) and noting the time, then leaving the sextant set to the same angle and subsequently observing the moment in time at which the sun passes through the sight tube on its descent from Zenith between a half-hour and hour later, the two times can be averaged to obtain a longitude sufficiently accurate for navigation (within 2nmi).American Practical Navigator (bowditch) by Nathanial Bowditch p253","domain":"wiki","before_edit":" However, it is possible to determine the time of zenith for longitude with a useful accuracy by performing a mean time of observation when the sun is on its ascent and descent prior to and following its moment of Zenith .","after_edit":" However, it is possible to determine the time of culmination for longitude with a useful accuracy by performing a mean time of observation when the sun is on its ascent and descent prior to and following its moment of Zenith .","label":"style","raw_intents":["style","others","clarity"]}
