{"doc_id":102922.0,"context":"Nicholas Sarkozy  On the first day of his state visit to Great Britain, in a Presidential speech French President Nicolas Sarkozy praised the British nation and called for an \"entente amicale\" between Great Britain and France, in place of the existing, more formal entente cordiale agreement. Speaking, unusually, to both Houses of Parliament, Mr Sarkozy went on to praise the help Britain gave to France during both World Wars and said that \"France would never URLet\" and that it owed Britain a debt of gratitude. As well as praising Great Britain, Mr Sarkozy also promised to propose sending more French troops to Afghanistan at the Bucharest Summit, to be held later this year, although he did not specify the number of troops he was planning to send. During his two-day state visit, Mr Sarkozy will meet with British Prime Minister Gordon Brown and they are expected to discuss many different issues, from global finance to Afghanistan.","domain":"news","before_edit":" During his two-day state visit, Mr Sarkozy will meet with British Prime Minister Gordon Brown and they are expected to discuss many different issues, from global finance to Afghanistan.","after_edit":" During his two-day state visit,  Sarkozy will meet with British Prime Minister Gordon Brown and they are expected to discuss many different issues, from global finance to Afghanistan.","label":"style","raw_intents":["clarity","style","style"]}
{"doc_id":113572.0,"context":"On Monday night, Australian Football player Adam Cooney won the Australian Football League's most prestigious award, the Brownlow Medal, awarded to the AFL's best and fairest. He received 24 votes, behind Simon Black with 23 votes and Gary Ablett and Matthew Richardson with 22 votes. Cooney took the lead after 20 rounds of votes has been cast ( out of twenty-two), and is the first Western Bulldogs player to win the medal since 1992. It should also be noted that AFL CEO, Andrew Demitriew mistakenly started calling out Round 2 's votes at the start of the count, when Round 1's votes should have been called out.","domain":"news","before_edit":" Cooney took the lead after 20 rounds of votes has been cast ( out of twenty-two), and is the first Western Bulldogs player to win the medal since 1992.","after_edit":" Cooney took the lead after 20 rounds of votes has been cast ( from twenty-two), and is the first Western Bulldogs player to win the medal since 1992.","label":"style","raw_intents":["style","style","style"]}
{"doc_id":33559.0,"context":"A group of former senior Communist Party officials in China have denounced the recent closure of BingDian (Freezing Point ), an investigative newspaper, along with the state of government censorship in that country. The group includes Li Rui, a former aid to Chairman Mao Zedong, Hu Jiwei, a former newspaper editor, and Zhu Houze, an ex-propaganda chief. In the letter, signed on February 2nd but released on Tuesday, the group called current censorship methods overly restrictive and unnecessary for the modern China: \"History has shown that only a totalitarian system needs news censorship, out of the delusion that it can keep the people locked in ignorance.\" Freezing Point was a supplement of the China Youth Daily and was allegedly shut down due to the publication on 11 January of an article by Zhongshan University professor Yuan Weishi regarding the way history is currently taught in China, although the papers editor, Li Datong, says that it has experienced difficulties with the government on several occasions in the past. Mr. Yuan's article was critical of Chinese text books, which never admit the culpability of the government and instead shift the blame to other nations.","domain":"news","before_edit":" In the letter, signed on February 2nd but released on Tuesday, the group called current censorship methods overly restrictive and unnecessary for the modern China: \"History has shown that only a totalitarian system needs news censorship, out of the delusion that it can keep the people locked in ignorance.\"","after_edit":" In the letter, signed on February 2 but released on Tuesday, the group called current censorship methods overly restrictive and unnecessary for the modern China: \"History has shown that only a totalitarian system needs news censorship, out of the delusion that it can keep the people locked in ignorance.\"","label":"style","raw_intents":["fluency","style","style"]}
{"doc_id":71813.0,"context":"Graham had grown noticeably weaker over the course of the past several weeks, suffering from degenerative osteoarthritis of the back and neck . She also underwent treatment for pneumonia two weeks ago. She asked for her feeding tube to be removed Wednesday; following her request, and after consultation with her family, she ceased to receive further nutrients. Billy Graham made a mention of her during the dedication of his library, saying that she was bedridden, and that she was \"getting closer to meeting God in heaven .\" He also announced that the couple will be buried at the library.","domain":"news","before_edit":"Graham had grown noticeably weaker over the course of the past several weeks, suffering from degenerative osteoarthritis of the back and neck .","after_edit":"She had grown noticeably weaker over the course of the past several weeks, suffering from degenerative osteoarthritis of the back and neck .","label":"style","raw_intents":["meaning-changed","style","style"]}
{"doc_id":2799495.0,"context":"UWS operator Haw Par Corporation described Chan as a \"veteran diver, aquarist and animal caregiver who had been caring for the aquatic animals at UWS since its opening in 1991 \" . Ten staff, including Chan, remained at UWS after its closure on June 27 to facilitate care for its animals until they could be suitably relocated. In addition to assisting the (MOM) Occupational Safety and Health Inspectorate with their investigations, Haw Par has pledged Chan's family \"all possible support and assistance\". Due to Chan's death, MOM has ordered the cessation of animal transfers from UWS while investigations are pending. In an interview with The New Paper at the time of UWS' closure in June, Chan said of the animals he worked with, whom he described as his \"band of friends\", \"They are so quietly tame. [...] We intend to find them the best homes and environment. The next time I see them, I might not recognise them any more but if I dive, they might recognise me.\" MOM stated of Chan's death, \"The Ministry of Manpower was informed about an incident that took place at Underwater World Singapore Pte Ltd’s premises at Siloso Road on 4 October 2016. Officers from MOM's Occupational Safety and Health Inspectorate responded to the scene immediately and commenced investigations. Preliminary findings indicate that a worker was pierced in his chest by the barb of a stingray while he was in the midst of transferring the stingray from its tank. He was conveyed to hospital where he subsequently succumbed to this injuries. MOM has instructed the occupier to stop all activities associated with the transferring of sea animals. Investigations are ongoing.\"","domain":"news","before_edit":"UWS operator Haw Par Corporation described Chan as a \"veteran diver, aquarist and animal caregiver who had been caring for the aquatic animals at UWS since its opening in 1991 \" . Ten staff, including Chan, remained at UWS after its closure on June 27 to facilitate care for its animals until they could be suitably relocated.","after_edit":"UWS operator Haw Par Corporation described Chan as a \"veteran diver, aquarist and animal caregiver who had been caring for the aquatic animals at UWS since its opening in 1991 (jobs) . Ten staff, including Chan, remained at UWS after its closure on June 27 to facilitate care for its animals until they could be suitably relocated.","label":"style","raw_intents":["style","style","style"]}
{"doc_id":560813.0,"context":"In its purest form, Civil libertarianism is a political philosophy supporting civil liberties, or which emphasize individual rights and personal freedoms over authorities - such as governments , a corporation and\/or social peer pressures . Civil libertarianism is not limited to an individual ideology, rather, it is a philosophy based on a strict interpretation of the Constitution's civil liberties and the many civil rightslaws enacted since . In the libertarian movement The primary concern of most Civil Libertarians is the government's reach over the individual. In theory, the civil libertarian seeks to reduce the role of government to a minimum - preferring private businesses to fill the many social needs for most Americans. Under the control of elected officials, the government is only relied upon for regulation, without excessively interfering in the lives of its citizens. The Civil Libertarian sees the government's role as critical - supporting free enterprise and the privatization of government programs wherever improvements are possible. One of the central pillars of Civil Libertarianism is free speech. In many cases Civil Libertarians oppose bans on hate speech and obscenity. Although they may or may not personally condone behaviors associated with these issues, civil libertarians hold that the advantages of unfettered public discourse outweigh all disadvantages. With the advent of personal computers, the Internet, email, cell phones and other information technology advances a subset of civil libertarianism has arisen that focuses on protecting individuals' digital rights and privacy . Just as acting Democrats and Republicans hold varying degrees of left and right-leaning beliefs; few Civil Libertarians, if any, hold all of the views defined by this philosophy .","domain":"wiki","before_edit":"In its purest form, Civil libertarianism is a political philosophy supporting civil liberties, or which emphasize individual rights and personal freedoms over authorities - such as governments , a corporation and\/or social peer pressures . Civil libertarianism is not limited to an individual ideology, rather, it is a philosophy based on a strict interpretation of the Constitution's civil liberties and the many civil rightslaws enacted since .","after_edit":"In its purest form, Civil libertarianism is a strain of political thought that supports civil liberties, or which emphasize individual rights and personal freedoms over authorities - such as governments , a corporation and\/or social peer pressures . Civil libertarianism is not limited to an individual ideology, rather, it is a philosophy based on a strict interpretation of the Constitution's civil liberties and the many civil rightslaws enacted since .","label":"clarity","raw_intents":["clarity","clarity","clarity"]}
{"doc_id":49949965.0,"context":"Kulbhushan Sudhir Jadhav (also spelled Kulbhushan Yadav, alleged alias Hussain Mubarak Patel) (born 16 April 1970) is an Indian national. It is alleged by the Pakistani government that he was arrested in the Pakistani province of Balochistan on charges of terrorism and spying for India's  Research and Analysis Wing. On 10 April 2017, India's Ministry of External Affairs stated that he had been \"kidnapped last year from Iran and his subsequent presence in Pakistan has never been explained credibly\". The Pakistani government claimed that he was a commander in the Indian Navy who was involved in subversive activities inside Pakistan and was arrested on 3 March 2016 during a counter-intelligence operation in Balochistan. The Indian government recognised Jadhav as a former naval officer but denied any current links with him and maintained that he took premature retirement and operated a business in Iranian city of Chabahar and was abducted from there .Revealed: 'Spy' Kulbhushan Yadav not caught but abducted by extremist Sunni group Jaishul Adil , India Today, 30 March 2016. Pakistani security forces reported Jadhav as a serving officer in the Indian Navy and stated that he was commissioned to the Research and Analysis Wing  , India's external intelligence agency. They believed him to be involved in subversive activities in Balochistan and Karachi. Jadhav was soon shifted to Islamabad for interrogation. While according to Indian sources, Jadhav was kidnapped by Mullah Shahozi of Jaish ul-Adl from Chabahar and was transported via Sarbaz to IranPakistan border and where he handed Jadhav over to the Pakistani Army. In a statement issued in the Parliament of India on 11 April 2017, Rajnath Singh, India's Minister of Home Affairs, reiterated that Jadhav was kidnapped by Pakistani agencies from Iran and put through trial as a R AW agent. Sushma Swaraj, India's Minister of External Affairs said there was no evidence of any wrongdoing by Jadhav and termed his sentencing an act of \"premeditated murder\". Swaraj said that if Pakistan implemented the death sentence, the bilateral relations between both countries would face dire consequences. The ICJ proceedings began in The Hague on 15 May to review the case. India and Pakistan both sent their legal teams to put forward their arguments, led by Harish Salve and Khawar Qureshi QC respectively. On 18 May 2017, the International Court of Justice stayed the hanging of Jadhav by Pakistan . On 22 June 2017, Pakistani sources confirmed that Jadhav had sought clemency from the country's army chief following his conviction. Pakistan also released a new confessional video of Jadhav, in which he stated that he visited Karachi twice for gathering intelligence on naval facilities. He also admitted to supporting and funding, on behalf of R AW , Baloch militants affiliated with the BLA and BRA, in addition to infiltrating and establishing \"30 to 40 R AW operatives along the Makran Coast\" for involvement in terrorist activities. Jadhav said that R AW 's activities in Balochistan and Sindh were conducted under the direction of Anil Kumar Dhasmana. India's Foreign Ministry again dismissed the confession as \"false propaganda\", stating that Pakistan was trying to influence ICJ proceedings while denying the consular rights to Jadhav. ICJ did not allow Pakistan to play the video during the hearing. On 17 July 2019, the ICJ, in its verdict, rejected India's appeal for Jadhav's release and directed Pakistan to allow consular access and effectively Stayed the death sentence. The court ordered that Pakistan should grant consular access to Jhadav. Pakistan and India both claimed victory and welcomed the judgement of ICJ.","domain":"wiki","before_edit":" On 10 April 2017, India's Ministry of External Affairs stated that he had been \"kidnapped last year from Iran and his subsequent presence in Pakistan has never been explained credibly\".","after_edit":" On 10 April 2017, Indian foreign ministry alleged he had been \"kidnapped last year from Iran and his subsequent presence in Pakistan has never been explained credibly\".","label":"clarity","raw_intents":["style","clarity","clarity"]}
{"doc_id":66550186.0,"context":"Farzi refers to an outer garment of the Mughal court. It was a short coat with half sleeves and fur collars, opened in front similar to Jama. Farzi was essentially fastened with a decorated piece of cloth, i.e., Katzeb around the waist area with loosely hanging ends. Farzi was a winter's garment. Mughal emperors and courtiers were wearing it. Farzi was one of the costumes given in Khilat ( awards to the Mughal nobles and other courtiers ) . The coat was very much famous in the 17th century among the royals.","domain":"wiki","before_edit":" It was a short coat with half sleeves and fur collars, opened in front similar to Jama.","after_edit":" It was a coat with short sleeves and fur collars, opened in front similar to Jama.","label":"clarity","raw_intents":["clarity","clarity","clarity"]}
{"doc_id":6970425.0,"context":"In matrilineal succession (also known as Marumakathayam), practiced in Kerala by the Nair nobility and royal families, a man's wealth and title is inherited by his sister's children, and his own children receive their inheritance from their own maternal uncles.  The Maharajah of Travancore is therefore succeeded by his sister's son, and his own son receives a courtesy title but has no place in the line of succession. Since Indian Independence and the passing of several acts such as the Hindu Succession Act (1956), this form of inheritance is no longer recognised by law. Regardless, the pretender to the Travancore throne is still determined by matrilinear succession. The Akans of Ghana and the Ivory Coast, West Africa have similar matrilineal succession and as such Otumfour Osei-Tutu II, Asantehene inherited the Golden Stool  through his mother (the Asantehemaa) Nana Afia Kobi Serwaa Ampem II.","domain":"wiki","before_edit":"In matrilineal succession (also known as Marumakathayam), practiced in Kerala by the Nair nobility and royal families, a man's wealth and title is inherited by his sister's children, and his own children receive their inheritance from their own maternal uncles.","after_edit":"In matrilineal succession (also known as Marumakathayam), practiced in Kerala by the Nair nobility and royal families, a man's wealth and title is inherited by his sister's children, and his  children receive their inheritance from their own maternal uncles.","label":"clarity","raw_intents":["clarity","fluency","clarity"]}
{"doc_id":60043236.0,"context":"Brig. Pritam Singh is an Indian Army Officer, born in Dina Village in Ferozpur, Punjab, India. He fought in the battle in Singapore in 1942. After the war, he promoted to Lt. Colonel. In 1947, he fought against Pakistan in Poonch. Army Life and Struggle Operation Easy. Poonch link-up 1 November 1948 - 26 November 1948 As a young officer, Brig Pritam Singh fought  the battle of Singapore in 1942 and he wounded badly. Opponent Army prisoned Pritam Singh. Somehow he escaped from the prison of the army campand after, six months he reached , Manipur, India. Later, he was awarded the coveted Military Cross for his great show of bravery. Lt Col Pritam Singh was promoted to the rank of Brigadier in December 1948. Poonch withstood a siege by the Pakistanis from November 1947 till relieved by an Indian offensive, Operation Easy on 20 November 1948. The besieged garrison , commanded by Brig. Pritam Singh , was maintained by air supply. Military operations ended with Poonch town and the eastern part of Poonch district in Indian hands and western Poonch in Pakistani hands. In 1951, he faced a court-martial.","domain":"wiki","before_edit":" Later, he was awarded the coveted Military Cross for his great show of bravery.","after_edit":" Later, he was awarded the coveted Military Cross for his  bravery.","label":"clarity","raw_intents":["clarity","clarity","clarity"]}
{"doc_id":1556660.0,"context":"Gray death is a slang term used for a potent mixture of synthetic opioids. Samples have been found to contain the designer drug U-47700, heroin, fentanyl, and carfentanil . It is taken by injection, smoking, snorting, or oral ingestion. It was first discovered in the United States and was thought to be a unique chemical compound before being identified as a mixture of drugs. In addition to containing powerful opioids, what makes gray death an extremely dangerous drug is the fact that the constituent drugs' identities, their overall ratios in the product, and their uneven distribution within the productare completely unknown to the user. This means that the user cannot predict what dose to safely take; even two identical doses by mass may contain more or less of an unknown substance due to uneven physical distribution, as seen with heroin and fentanyl mixes. Opioid addicts tend to be more susceptible to the drug . They may think they are buying heroin, unaware that it is actually gray death. Reversing a gray death overdose frequently requires multiple doses of naloxone , whereas a typical overdose of heroin (which is much less potent) typically needs only one dose. This is consistent with the difficulty of overdose reversal seen with high-affinity opioids in the fentanyl chemical family or with buprenorphine. The greater affinity of these substances for the -opioid receptor causes less naloxoneto bind to receptors, increasing the dosage necessary to counteract the resulting respiratory depression. The difficulty in reversing an overdose of gray death is likely due to the presence of a fentanyl analogue, which reporting seems to corroborate as of December 2018.","domain":"wiki","before_edit":" Samples have been found to contain the designer drug U-47700, heroin, fentanyl, and carfentanil .","after_edit":" Samples have been found to contain  heroin, fentanyl, and carfentanil .","label":"coherence","raw_intents":["coherence","coherence","clarity"]}
{"doc_id":5929171.0,"context":"Singapore in the Straits Settlements refers to a period in the history of Singapore from 1826 to 1942, during which Singapore was part of the Straits Settlements together with Penang and Malacca. Previously a residency, or subdivision, of the Presidency of Bengal (officially the Presidency of Fort William), in  1867  the Straits Settlements became a separate crown colony, mainly due to ethnic and linguistic differences, and became directly overseen by the Colonial Office in Whitehall in London. The period saw Singapore establish itself as an important trading port and developed into a major city with a rapid increase in population. British rule was suspended in February 1942, when the Imperial Japanese Army of the Japanese Empire had invaded Singapore during the Pacific Front of World War II and renamed it Syonan-to . After the war, Singapore was returned to British rule. It subsequently separated from the Straits Settlements itself, and became its own standalone crown colony with its own governor. Beginning of British rule in Singapore An 1888 German map of Singapore. In 1819, British official Stamford Raffles landed in Singapore to establish a trading port. The island's status as a British outpost was initially in doubt, as the Dutch government soon issued bitter protests to the British government, arguing that their sphere of influence had been violated. The British government and the East India Company were initially worried about the potential liability of this new outpost, but that was soon overshadowed by Singapore's rapid growth as an important trading post. By 1822, it was made clear to the Dutch that the British had no intention of giving up the island. In these early decades, the island was riddled with opium houses and prostitution, and came to be widely monikered as \"Sin-galore\" . IT Figures S4 - Toggle, 28 December 2015","domain":"wiki","before_edit":" British rule was suspended in February 1942, when the Imperial Japanese Army of the Japanese Empire had invaded Singapore during the Pacific Front of World War II and renamed it Syonan-to . After the war, Singapore was returned to British rule.","after_edit":" British rule was suspended in February 1942, when the Imperial Japanese Army of the Japanese Empire had invaded Singapore during the Pacific Front of World War II  . After the war, Singapore was returned to British rule.","label":"coherence","raw_intents":["coherence","coherence","clarity"]}
{"doc_id":38306871.0,"context":"He got married in 1982 and had three sons (Tahir, Abdullah Saqib and Muaz) and four daughters. He was a Multilingual (able to speak many languages); in addition to his native language of Hindko language and the Arabiclanguage from his graduate study, He was also fluent in English, Urdu, Pashto and Greek, and could read and understand Persian.Who is Zubair Alizai, his family, his sons - URL Death Hafiz Zubair Alizai died on the 10th of November 2013 after short admission in Benazir Bhutto Hospital  Rawalpindi, Pakistan , and the cause of his death was lung failure.","domain":"wiki","before_edit":"Who is Zubair Alizai, his family, his sons - URL Death Hafiz Zubair Alizai died on the 10th of November 2013 after short admission in Benazir Bhutto Hospital  Rawalpindi, Pakistan , and the cause of his death was lung failure.","after_edit":"Who is Zubair Alizai, his family, his sons - URL Death Hafiz Zubair Alizai died on the 10th of November 2013  in Benazir Bhutto Hospital  Rawalpindi, Pakistan , and the cause of his death was lung failure.","label":"coherence","raw_intents":["clarity","coherence","coherence"]}
{"doc_id":564429.0,"context":"The Wlastkwewiyik, or Maliseet (,Erickson, Vincent O. (1978). \"Maliseet-Passamaquoddy.\" In Northeast, ed. Bruce G. Trigger. Vol. 15 of Handbook of North American Indians, ed. William C. Sturtevant. Washington, D.C.: Smithsonian Institution, pg. 123. also spelled Malecite), are an Algonquian-speaking First Nation of the Wabanaki Confederacy. They are the indigenous people of the Wlastk River (Saint John River) valley and its tributaries , and their territory extends across the current borders of New Brunswick and Quebec in Canada, and parts of Maine in the United States. The Houlton Band of Maliseet Indians, based on the Meduxnekeag River in the Maine portion of their traditional homeland, are since 19 July 1776, the first foreign Treaty allies with the United States of America and a federally recognized tribe of Maliseet people by the United States . Today Maliseet people have also migrated to other parts of the world. Maliseets are forest, river and coastal people within their 20,000, 000 acre, 200 mile wide, and 600 mile long Saint John river watershed homeland . Name The people call themselves Wlastkwewiyik after the Wlastkw River at the heart of their expansive territory in what is now New Brunswick and Maine. Wlastkw means \"Beautiful River.\" English colonists later named it the Saint John River. Wlastkwewiyik means \"People of the Beautiful River,\" in Maliseet.LeSourd, Philip, ed. 2007. Tales from Maliseet Country: The Maliseet Texts of Karl V. Teeter, Lincoln, Nebraska: University of Nebraska Press, p. 17, fnote 4 The Maliseet (Malecite) have long been associated with the Saint John  . Their territory still extends as far as the Saint Lawrence River. Their lands and resources are bounded on the east by the Mikmaq people, on the west by the Penobscot people , and on the south by the Passamaquoddy people , who also still speak related Algonquian languages. Malesse'jik was a Mikmaq word believed to mean \"He speaks slowly,\" or differently  by which the Mikmaq people contrasted the other tribe's language to their own. The meaning of the word today is unknown but  is commonly mistranslated to \"he speaks badly, lazy, or broken\"  Erickson 1978, pg. 135 This term is the exonym by which the Mikmaq people referred to this group when speaking to early Europeans. The Europeans met the Mikmaq people before the Wlastkwewiyik, and adopted Malesse'jik as Malcite in French for the people, not understanding that it was not their true name. The later English colonists anglicized this term as Maliseet, in another transliteration of sound  . 17th century At the time of European encounter, the Wlastkwewiyik were living in walled villages and practicing horticulture (corn, beans, squash and tobacco). In addition to  growing crops, the women gathered and processed fruits, berries, nuts and natural produce. The men contributed by fishing and hunting  . Written accounts in the early 17th century, such as those of Samuel de Champlain and Marc LesCarbot, refer to a large Malecite village at the mouth of the Saint John River. Later in the century, sources indicate their headquarters had shifted upriver to Meductic, on the middle reaches of the Saint John River. The French explorers were the first to establish a fur trade with the Wlastkwewiyik, which became important in their territory. Some European goods were desired because they were useful to Wlastkwewiyik subsistence and culture. The French Jesuits also established missions  where some Wlastkwewiyik converted to Catholicism. With years of colonialism, many learned the French language. The French called them Malcite, a transliteration of the Mi'kmaq name for the people. Local histories depict many encounters with the Iroquois, five powerful nations based south and east of the Great Lakes, and the Innu  . Contact with European fisher-traders in the early 17th century and with specialized fur traders developed into a stable relationship which lasted for nearly 100 years. Despite devastating population losses to European infectious diseases, to which they had no immunity, these Atlantic First Nations held on to their traditional coastal or river locations for hunting, fishing and gathering , and were concentrated along river valleys for trapping.","domain":"wiki","before_edit":" The Houlton Band of Maliseet Indians, based on the Meduxnekeag River in the Maine portion of their traditional homeland, are since 19 July 1776, the first foreign Treaty allies with the United States of America and a federally recognized tribe of Maliseet people by the United States .","after_edit":" The Houlton Band of Maliseet Indians, based on the Meduxnekeag River in the Maine portion of their traditional homeland, are since 19 July 1776, the first foreign Treaty allies with the United States of America . They are a federally recognized tribe of Maliseet people by the United States .","label":"coherence","raw_intents":["coherence","clarity","coherence"]}
{"doc_id":60043236.0,"context":"Brig. Pritam Singh is an Indian Army Officer, born in Dina Village in Ferozpur, Punjab, India. He fought in the battle in Singapore in 1942. After the war, he promoted to Lt. Colonel. In 1947, he fought against Pakistan in Poonch. Army Life and Struggle Operation Easy. Poonch link-up 1 November 1948 - 26 November 1948 As a young officer, Brig Pritam Singh fought  the battle of Singapore in 1942 and he wounded badly. Opponent Army prisoned Pritam Singh. Somehow he escaped from the prison of the army campand after, six months he reached , Manipur, India. Later, he was awarded the coveted Military Cross for his great show of bravery. Lt Col Pritam Singh was promoted to the rank of Brigadier in December 1948. Poonch withstood a siege by the Pakistanis from November 1947 till relieved by an Indian offensive, Operation Easy on 20 November 1948. The besieged garrison , commanded by Brig. Pritam Singh , was maintained by air supply. Military operations ended with Poonch town and the eastern part of Poonch district in Indian hands and western Poonch in Pakistani hands. In 1951, he faced a court-martial.","domain":"wiki","before_edit":" Opponent Army prisoned Pritam Singh. Somehow he escaped from the prison of the army campand after, six months he reached , Manipur, India.","after_edit":" He was imprisoned by the enemy, but escaped from the prison of the army campand after, six months he reached , Manipur, India.","label":"coherence","raw_intents":["coherence","clarity","coherence"]}
{"doc_id":8150951.0,"context":"Plant perception or biocommunication is the paranormal idea that plants are sentient, that they respond to humans in a manner that amounts to ESP, and that they experience pain and fear. The idea is not accepted by the scientific community, as plants lack nervous systems . Galston, Arthur W; Slayman, Clifford L. Plant Sensitivity and Sensation. In URLe Ogden Abell, Barry Singer. (1981). Science and the Paranormal: Probing the Existence of the Supernatural. Junction Books. pp. 40-55. Tittle, Peg. (2011). Critical Thinking: An Appeal to Reason. Routledge. p. 317. Jong, Tom de; Klinkhamer, Peter. (2005). Evolutionary Ecology of Plant Reproductive Strategies. Cambridge University Press. p. 2. \"Plants do not have a nervous system and certainly do not make conscious decisions about what to do next.\" Paranormal claims in regard to plant perception are considered to be pseudoscience by the scientific community.Audus, Leslie. (1974). Roots of Absurdity. New Scientist. 17 October. p. 207Galston, Arthur W; Slayman, Clifford L. (1979). The Not-So-Secret Life of Plants: In Which the Historical and Experimental Myths About Emotional Communication Between Animal and Vegetable Are Put to Rest. American Scientist 67 (3): 337-344. The idea is distinct from measured plant perception and chemical communication .","domain":"wiki","before_edit":" The idea is not accepted by the scientific community, as plants lack nervous systems . Galston, Arthur W;","after_edit":" The idea is not accepted by the scientific community, as plants lack nervous systems , Galston, Arthur W;","label":"fluency","raw_intents":["fluency","fluency","style"]}
{"doc_id":51488038.0,"context":"The vulture and the little girl, also known as \"The Struggling Girl\", is a famous photograph by Kevin Carter which first appeared in The New York Times on 26 March 1993. It is a photograph of a frail famine-stricken boy, initially believed to be a girl, who had collapsed in the foreground with a hooded vulture eyeing him from nearby. The child was reported to be attempting to reach a United Nations feeding center about a half mile away in Ayod, Sudan (now South Sudan), in March 1993, and to have survived the incident. The picture won the Pulitzer Prize for Feature Photography award in 1994. Carter took his own life four months after winning the prize. Background The Hunger Triangle, a name URLanisations used in the 1990s for the area defined by the southern Sudan communities Kongor, Ayod, and Waat, was dependent on UNESCO and other URLanisations to fight famine. Forty percent of the area's children under 5 years old were malnourished as of January 1993, and an estimated 10 to 13 adults died of starvation daily in Ayod alone. To raise awareness of the situation, Operation Lifeline Sudan invited photojournalists and others, previously excluded from entering the country, to report on conditions. In March 1993, the government began granting visas to journalists for a 24-hour stay with severe restrictions on their travel within the country, including government supervision at all times. Joo Silva and Kevin Carter in Sudan Invitation by UN Operation Lifeline Sudan In March 1993, Robert Hadley, a former photographer and at this time the information officer for the UN Operation Lifeline Sudan, offered Joo Silva and Kevin Carter to come to Sudan and report about the famine in southern Sudan. It was an offer to go into southern Sudan with the rebels. Silva saw this as a chance to work more as a war-photographer in the future. He started the arrangements and secured assignments for the expenses of the travel. Silva told Carter about the offer and Carter was also interested in going. According to fellow war photographer Greg Marinovich, Carter saw the trip as an opportunity to fix some problems \"he felt trapped in\". To take photos in Sudan was an opportunity for a better career as freelancer, and Kevin was apparently \"on a high, motivated and enthusiastic about the trip\". To pay for the travel  Carter secured some money from the Associated Press and others, but needed to borrow money from Marinovich, for commitments back at home too. Not known to Carter and Silva was all the time that the UN Operation Lifeline Sudan did have \"great difficulties in securing funding for Sudan pancake\", explains Marinovich. Marinovich wrote further: \"The UN hoped to publish the famine Without publicity to show the need, it was difficult for URLanisations to sustain funding\". About the political differences and fighting \"Joo and Kevin knew none of this they just wanted to get in and shoot pictures\". Waiting in Nairobi Silva and Carter had prepared carefully for the trip. They stopped in Nairobi on their way to Sudan. The new fighting in Sudan forced them to wait in Nairobi for an unspecified period of time. In between Carter was flying with the UN for one day to Juba in south Sudan to take photos of a barge, with food aid for the region . But soon the situation changed again. The UN received permission from a rebel group to fly food aid to Ayod. Also Rob Hadley was flying on a UN light plane in and invited Silva and Carter to fly with him to Ayod. In Ayod The next day  their light aircraft touched down in the tiny hamlet of Ayod with the cargo aircraft landing shortly afterwards. The residents of the hamlet have been looked after by the UN aid station for some time. Greg Marinovich and Joo Silva described that in the book The Bang Bang Club, Chapter 10 \"Flies and Hungry People\". The child was already cared for before Kevin Carter and Joo Silva landed there and Carter took his famous picture. Marinovich wrote that the villagers were already waiting next to the runway to get the food as quickly as possible: \"Mothers who had joined the throng waiting for food left their children on the sandy ground nearby.\" Silva and Carter separated to take pictures of both children and adults, both the living and dead, all victims of the catastrophic famine that had arisen through the war. Carter went several times to Silva to tell him about the shocking situation he had just photographed. Witnessing the famine affected him emotionally. Silva was searching for rebel soldiers who could take him to someone in authority and when he found some soldiers Carter joined him. The soldiers did not speak English, but one was interested in Carter's watch. Carter gave him his cheap wristwatch as a gift. The soldiers became their bodyguards and followed them for their protection. To stay a week with the rebels they needed the permission of a rebel commander. Their plane was due to depart in an hour and without the permission to stay they would be forced to fly out. Again they separated and Silva went to the clinic complex to ask for the rebel commander and he was told the commander was in Kongor, South Sudan. This was good news for Silva, as \"their little UN plane was heading there next\". He left the clinic and went back to the runway, taking pictures of children and adults on his way. He came across a child lying on his face in the hot sun he took a picture. In 2011, the child's father revealed the child was actually a boy, Kong Nyong, and had been taken care of by the UN food aid station. Nyong had died four years prior, c. 2007, of \"fevers\", according to his family.","domain":"wiki","before_edit":" In Ayod The next day  their light aircraft touched down in the tiny hamlet of Ayod with the cargo aircraft landing shortly afterwards.","after_edit":" In Ayod The next day , their light aircraft touched down in the tiny hamlet of Ayod with the cargo aircraft landing shortly afterwards.","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":6970425.0,"context":"Lateral succession Lateral or fraternal system of succession mandates principles of seniority among members of a dynasty or dynastic clan, with a purpose of election a best qualified candidate for the leadership. The leaders are elected as being the most mature elders of the clan, already in possession of military power and competence. Fraternal succession is preferred to ensure that mature leaders are in charge, removing a need for regents. The lateral system of succession may or may not exclude male descendants in the female line from succession. In practice, when no male heir is mature enough, a female heir is usually determined \"pragmatically\", by proximity to the last monarch, like Boariks of the Caucasian Huns or Tamiris of Massagetes in Middle Asia  . The lateral monarch is generally elected after the leadership throne becomes vacant. In the early years of the Mongol empire, the death of the ruling monarchs, Genghis Khan and gedei Khan, immediately stopped the Mongol western campaigns because of the upcoming elections. A drawback of the lateral succession is that, while ensuring a most competent leadership for the moment, the system inherently created derelict prince lines not eligible for succession. Any scion of an eligible heir that did not live long enough to ascend to the throne was cast aside as not eligible, creating a pool of discontented pretenders called Tegin in Turkic and Izgoi in Rus dynastic lines. The unsettled pool of derelict princes would eventually bring havoc to the succession order and dismemberment to the state.","domain":"wiki","before_edit":" A drawback of the lateral succession is that, while ensuring a most competent leadership for the moment, the system inherently created derelict prince lines not eligible for succession.","after_edit":" A drawback of the lateral succession is that, while ensuring a most competent leadership for the moment, the system inherently created derelict princely lines not eligible for succession.","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":292089.0,"context":"Marlet 3B The Martlet 3B was similar to the Martlet 3A but using steel casings and attempting to solve some of the 3A model's other problems. The casings survived , but the propellant failed at . This was solved for later rockets by filling the propellant cavity with liquid, but only after development of the 3B model had ended. Martlet 3E The Martlet 3E was a suborbital solid rocket designed to be fired from a smaller, 7-inch (180mm) cannon used in the HARP project. Its basic concept revolved around packaging the rocket grain in a case with elastic properties to transmit the lateral strain to the gun tube. The 3E model utilized a new technique of rocket grain construction  that consisted of laminating sheet double-base propellant grain under hydraulic pressure. Martlet 4 By July 1964, the Marlet 4 program pursued the development of an orbit capable multi-stage rocket system to be launched from the 16\" Barbados gun. Two versions of full-scale orbital launch vehicle projectiles were proposed in the Martlet 4 series. The first was to have used three solid rocket motor stages and was planned to orbit approximately 50 pounds of payload. The second used liquid rocket motors and was planned to have orbited 200 pounds of payload. Both were about long and in diameter, weighing about at launch. However, no Martlet 4 vehicles were built; the project was halted before the design was completed. Martlet 4 Control Systems A guidance and control system was developed for the orbital mission by Aviation Electric Limited of Montreal under the direction of McGill-BRL-Harry Diamond Laboratory group. Infrared horizon sensors and sun sensors were included to calculate vehicle attitude. Information for on-board sensors was to be processed by the logic module  which provided commands to a cold gas thruster system which in turn adjusted the orientation of the vehicle . The components of the guidance and control assembly were integrated into a 6.25 inch diameter test projectile. Sun sensors, horizon sensors, telemetry packs, receiving\/transmitting antenna, hydraulic systems, logic modules, and gas thruster attitude control systems were all test fired to approximately 10,000 g's.","domain":"wiki","before_edit":" Martlet 4 Control Systems A guidance and control system was developed for the orbital mission by Aviation Electric Limited of Montreal under the direction of McGill-BRL-Harry Diamond Laboratory group.","after_edit":" Martlet 4 Control Systems A guidance and control system were developed for the orbital mission by Aviation Electric Limited of Montreal under the direction of McGill-BRL-Harry Diamond Laboratory group.","label":"fluency","raw_intents":["fluency","style","fluency"]}
{"doc_id":564429.0,"context":"The Wlastkwewiyik, or Maliseet (,Erickson, Vincent O. (1978). \"Maliseet-Passamaquoddy.\" In Northeast, ed. Bruce G. Trigger. Vol. 15 of Handbook of North American Indians, ed. William C. Sturtevant. Washington, D.C.: Smithsonian Institution, pg. 123. also spelled Malecite), are an Algonquian-speaking First Nation of the Wabanaki Confederacy. They are the indigenous people of the Wlastk River (Saint John River) valley and its tributaries , and their territory extends across the current borders of New Brunswick and Quebec in Canada, and parts of Maine in the United States. The Houlton Band of Maliseet Indians, based on the Meduxnekeag River in the Maine portion of their traditional homeland, are since 19 July 1776, the first foreign Treaty allies with the United States of America and a federally recognized tribe of Maliseet people by the United States . Today Maliseet people have also migrated to other parts of the world. Maliseets are forest, river and coastal people within their 20,000, 000 acre, 200 mile wide, and 600 mile long Saint John river watershed homeland . Name The people call themselves Wlastkwewiyik after the Wlastkw River at the heart of their expansive territory in what is now New Brunswick and Maine. Wlastkw means \"Beautiful River.\" English colonists later named it the Saint John River. Wlastkwewiyik means \"People of the Beautiful River,\" in Maliseet.LeSourd, Philip, ed. 2007. Tales from Maliseet Country: The Maliseet Texts of Karl V. Teeter, Lincoln, Nebraska: University of Nebraska Press, p. 17, fnote 4 The Maliseet (Malecite) have long been associated with the Saint John  . Their territory still extends as far as the Saint Lawrence River. Their lands and resources are bounded on the east by the Mikmaq people, on the west by the Penobscot people , and on the south by the Passamaquoddy people , who also still speak related Algonquian languages. Malesse'jik was a Mikmaq word believed to mean \"He speaks slowly,\" or differently  by which the Mikmaq people contrasted the other tribe's language to their own. The meaning of the word today is unknown but  is commonly mistranslated to \"he speaks badly, lazy, or broken\"  Erickson 1978, pg. 135 This term is the exonym by which the Mikmaq people referred to this group when speaking to early Europeans. The Europeans met the Mikmaq people before the Wlastkwewiyik, and adopted Malesse'jik as Malcite in French for the people, not understanding that it was not their true name. The later English colonists anglicized this term as Maliseet, in another transliteration of sound  . 17th century At the time of European encounter, the Wlastkwewiyik were living in walled villages and practicing horticulture (corn, beans, squash and tobacco). In addition to  growing crops, the women gathered and processed fruits, berries, nuts and natural produce. The men contributed by fishing and hunting  . Written accounts in the early 17th century, such as those of Samuel de Champlain and Marc LesCarbot, refer to a large Malecite village at the mouth of the Saint John River. Later in the century, sources indicate their headquarters had shifted upriver to Meductic, on the middle reaches of the Saint John River. The French explorers were the first to establish a fur trade with the Wlastkwewiyik, which became important in their territory. Some European goods were desired because they were useful to Wlastkwewiyik subsistence and culture. The French Jesuits also established missions  where some Wlastkwewiyik converted to Catholicism. With years of colonialism, many learned the French language. The French called them Malcite, a transliteration of the Mi'kmaq name for the people. Local histories depict many encounters with the Iroquois, five powerful nations based south and east of the Great Lakes, and the Innu  . Contact with European fisher-traders in the early 17th century and with specialized fur traders developed into a stable relationship which lasted for nearly 100 years. Despite devastating population losses to European infectious diseases, to which they had no immunity, these Atlantic First Nations held on to their traditional coastal or river locations for hunting, fishing and gathering , and were concentrated along river valleys for trapping.","domain":"wiki","before_edit":" Malesse'jik was a Mikmaq word believed to mean \"He speaks slowly,\" or differently  by which the Mikmaq people contrasted the other tribe's language to their own.","after_edit":" Malesse'jik was a Mikmaq word believed to mean \"He speaks slowly,\" or differently , by which the Mikmaq people contrasted the other tribe's language to their own.","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":51908.0,"context":"Publicity and witness accounts Multiple news reports would have details of family, friends, and acquaintances calling him normal and without a propensity to hurt people, not believing the bombings were an \" anti-government \" message, as speculated by the magnitude of the attacks and Helder's manifesto. Helder also reportedly asked for a Bible to look through the contents of the pages. Helder was notably a major fan of Kurt Cobain , even after Cobain committed suicide, having posters and merchandise of Cobain and his band, Nirvana, in his room when he was arrested. A bandmate in Apathy remarked Helder had \"an interesting style of singing\" and would write much of the lyrics of the group's tracks, not having a full understanding of their meaning.","domain":"wiki","before_edit":"Publicity and witness accounts Multiple news reports would have details of family, friends, and acquaintances calling him normal and without a propensity to hurt people, not believing the bombings were an \" anti-government \" message, as speculated by the magnitude of the attacks and Helder's manifesto. Helder also reportedly asked for a Bible to look through the contents of the pages.","after_edit":"Publicity and witness accounts Multiple news reports would have details of family, friends, and acquaintances calling him normal and without a propensity to hurt people, not believing the bombings were an \" anti-government message. Though the same articles mentioned his roommate noting he had become obsessed with death and astral projection, and had begun telling them extended monologues about his new spiritual beliefs.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":49907.0,"context":"Provincial tour 350px|The Roman Empire during the reign of Caracalla In spring 214, Caracalla departed for the eastern provinces, travelling through the Danubian provinces and arriving in Asia and Bithynia. The winter of 214\/215 he spent at Nicomedia. Before 4 April 214 he had left Nicomedia, and in the summer he was at Antioch on the Orontes. From December 215 he was at Alexandria in the Nile Delta, where he stayed until March or April 216. When the inhabitants of Alexandria heard of Caracalla's claims that he had killed his brother Geta in self-defence, they produced a satire mocking this as well as Caracalla's other pretensions. In 215 Caracalla travelled to Alexandria and responded to this insult by slaughtering the deputation of leading citizens who had unsuspectingly assembled before the city to greet his arrival  , before setting his troops against Alexandria for several days of looting and plunder. In spring 216 he arrived again at Antioch and before 27 May had set out for his Persian War. For the winter of 215\/216 he was at Edessa. Caracalla  moved east into Armenia. By 216 he had pushed through Armenia and south into Parthia.","domain":"wiki","before_edit":"Provincial tour 350px|The Roman Empire during the reign of Caracalla In spring 214, Caracalla departed for the eastern provinces, travelling through the Danubian provinces and arriving in Asia and Bithynia.","after_edit":"Provincial tour 350px|The Roman Empire during the reign of Caracalla In spring 214, Caracalla departed for the eastern provinces, travelling through the Danubian provinces and the Anatolian provinces of Asia and Bithynia.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":12940645.0,"context":"Mor Themotheos Thomas has a significant role in the development of the present Jacobite Syrian Orthodox Church in India, especially in the outside dioceses. Mor Themotheos ordained 6 present metropolitans of the church into the priesthood \" Kassiso\". No other bishop in the Jacobite church has that record as of now. Priests ordained by Mor Themotheos serving as Bishops are Mor Osthatheos Pathrose (Bangalore), Mor Eusebious Kuriakose (Delhi), Mor Coorilose Geevargese (Niranam), Mor Phelexinos Zacharias (Idukki), Mor Alexandrios Thomas (Mumbai), and Mor Thimotheos Matthew  Mor Themotheos is the founder of a pre-marital counseling program in the Jacobite church. First, he started this in his diocese, and later it was added to the whole church. Mor Themotheos served as the President and resident metropolitan of M.S.O.T seminary for 9 years ( 19912000) and a faculty of the seminary.Later on, Dr. Mor Theophilose Kuriakose succeeded him.  Mor Themotheos is presently the \"Secretary\" to the Holy Episcopal Synod of the Jacobite Syrian Orthodox Church  by the regional synod  on 2018 December held at Puthencruz .","domain":"wiki","before_edit":" Mor Themotheos ordained 6 present metropolitans of the church into the priesthood \" Kassiso\".","after_edit":" The \"Greater Indian Outside Arch diocese\" under his jurisdiction is divided into 4 separate dioceses called Mumbai, Bangalore, Delhi and Mylapore (Chennai) which are administered by different metropolitans now. The efforts and labor of Mor Themotheos significantly helped the present growth of outside Kerala Jacobite dioceses into a worth position. Mor Themotheos ordained 6 present metropolitans of the church into the priesthood \" Kassiso\".","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":33605176.0,"context":"The Sullubawa are a Fulani clan in Northern Nigeria, the current ruling houses of Kano, Ringim and Katsina belong to the clan and another amongst the four ruling Houses of Zazzau Emirate . They are also found in Kano, Jigawa, Katsina and Sokoto states. They are said to have originated from Futa Toro, in what is now Senegal, and are associated with the Torodbe (Toronkawa) , the Sullubawa originated from Sissilo the husband of Cippowo  a sister of Uthman Toroddo ancestor of Usman dan Fodio as such they are regarded as the cousins of Toronkawa, they initially belong to the Wangarawa stock, they had Mandigo element in their ancestry and they were related to the Mandika, mandika are the  descendants of the Mali Empire , the Sullubawa spoke Wakore before they became absorbed into the Fulani group losing their original language and adopting the Fulani language. They played a key role in the Fulani Jihad led by Usman dan Fodio, which founded the Sokoto Caliphate. Sullubawa became \"hereditary beneficiaries of all positions of authority in all but one Hausa state\". In the 19th century, the Sullubawa controlled many of the fiefdoms of the Kano Emirate. The clan benefitted from British colonization and indirect rule which saw their influence increase. Sullubawa clansmen later attained positions of power following the fall of the first republic ; with one of them Umaru Musa Yar'Adua becoming President of Nigeria.","domain":"wiki","before_edit":" , the Sullubawa originated from Sissilo the husband of Cippowo  a sister of Uthman Toroddo ancestor of Usman dan Fodio as such they are regarded as the cousins of Toronkawa, they initially belong to the Wangarawa stock, they had Mandigo element in their ancestry and they were related to the Mandika, mandika are the  descendants of the Mali Empire , the Sullubawa spoke Wakore before they became absorbed into the Fulani group losing their original language and adopting the Fulani language.","after_edit":" , the Sullubawa originated from Sissilo the husband of Cippowo  a sister of Uthman Toroddo ancestor of Usman dan Fodio as such they are regarded as the cousins of Toronkawa, they initially belong to the Wangarawa stock, they had Mandigo element in their ancestry and they were related to the Mandika, mandika are the Sullubawa is bild as-sdn ( ) and they are descendants of the Mali Empire , the Sullubawa spoke Wakore before they became absorbed into the Fulani group losing their original language and adopting the Fulani language.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","clarity"]}
{"doc_id":1809568.0,"context":"Death and legacy Syed Kamal died on 1 October 2009 at Karachi after a lingering illness at age 72. He had been a heart patient for many years and had fallen accidentally at his home about a month ago. He was bedridden since his fall. His survivors include his wife, his son Ghalib Kamal and three daughters. Retrieved 23 February 2019Film star Syed Kamal passes away Dawn (newspaper), Published 2 Oct 2009, Retrieved 23 February 2019 Filmography Syed Kamal's notable films as an actor : Thandi Sarak (1957)Actor Kamal dies The Nation (newspaper), Published 2 October 2009, Retrieved 24 February 2019 Sawera (1959) Apna Paraya (1959) Banjaran (1962) Tauba (1963) Aashiana (1964) Aisa Bhi Hota Hai (1965) Behan Bhai (1968) Nai Laila Naya Majnoon (1969) Road To Swat (1970) Insan Aur Gadha (1973) The following films were directed by Syed Kamal: Shehnai (1968) starring (Syed Kamal-Deeba) Insaan Aur Gadha (1973) starring (Syed Kamal-Nisho-Rozina) Yahan Say Wahan Tak starring (Syed Kamal-Mumtaz) Honeymoon (1970) starring (Syed Kamal-Husna-Rozina) Roop Behroop starring (producer-director-actor Syed Kamal opposite Nisho) Doosri Maan starring (Syed Kamal-Shamim Ara) Meray Bacchay Meri Aankhein starring (Syed Kamal-Deeba) Dard-E-Dil starring (Syed Kamal and Zeba) Aaliya starring (Syed Kamal and Shamim Ara) Jatt Kurrian Taun Darda (1976) A Punjabi film, starring Syed Kamal, Neelo and Aslam Pervaiz Ajj Dian Kurrian (1977) A Punjabi film, starring Syed Kamal and Neelo Kal De Munday (1978) Jat Kamala Gaya Dubai (1984) Siyasat (1986)","domain":"wiki","before_edit":" Retrieved 23 February 2019Film star Syed Kamal passes away Dawn (newspaper), Published 2 Oct 2009, Retrieved 23 February 2019 Filmography Syed Kamal's notable films as an actor :","after_edit":" Retrieved 23 February 2019Film star Syed Kamal passes away Dawn (newspaper), Published 2 Oct 2009, Retrieved 3 July 2021 Filmography Syed Kamal's notable films as an actor :","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":513965.0,"context":" In the 1800s, rammed earth was popularized in the United States by the book Rural Economy by S. W. Johnson. The technique was used to construct the Borough House Plantation and the Church of the Holy Cross in Stateburg, South Carolina, both being National Historic Landmarks. From the 1920s through the 1940s rammed-earth construction in the US was studied. South Dakota State College extensively researched and constructed almost one hundred weathering walls of rammed earth. For over 30 years the college investigated the use of paints and plasters in relation to colloids in soil. In 1945, Clemson Agricultural College of South Carolina published the results of their research of rammed earth in a pamphlet titled \"Rammed Earth Building Construction\". In 1936, on a homestead near Gardendale, Alabama, the United States Department of Agriculture constructed an experimental community of rammed-earth edifices with architect Thomas Hibben. The houses were inexpensively constructed and were sold to the public along with sufficient land for gardens and small plots for livestock. The project successfully provided valuable homes to low-income families. The US Agency for International Development is working with undeveloped countries to improve the engineering of rammed-earth houses. It also financed the authorship of the Handbook of Rammed Earth by Texas A&M University and the Texas Transportation Institute. The Handbook was unavailable for purchase by the public until the Rammed Earth Institute International gained permission to reprint it.","domain":"wiki","before_edit":" The project successfully provided valuable homes to low-income families.","after_edit":" The project was successful provided homes to low-income families.","label":"others","raw_intents":["clarity","others","others"]}
{"doc_id":60043236.0,"context":"Brig. Pritam Singh is an Indian Army Officer, born in Dina Village in Ferozpur, Punjab, India. He fought in the battle in Singapore in 1942. After the war, he promoted to Lt. Colonel. In 1947, he fought against Pakistan in Poonch. Army Life and Struggle Operation Easy. Poonch link-up 1 November 1948 - 26 November 1948 As a young officer, Brig Pritam Singh fought  the battle of Singapore in 1942 and he wounded badly. Opponent Army prisoned Pritam Singh. Somehow he escaped from the prison of the army campand after, six months he reached , Manipur, India. Later, he was awarded the coveted Military Cross for his great show of bravery. Lt Col Pritam Singh was promoted to the rank of Brigadier in December 1948. Poonch withstood a siege by the Pakistanis from November 1947 till relieved by an Indian offensive, Operation Easy on 20 November 1948. The besieged garrison , commanded by Brig. Pritam Singh , was maintained by air supply. Military operations ended with Poonch town and the eastern part of Poonch district in Indian hands and western Poonch in Pakistani hands. In 1951, he faced a court-martial.","domain":"wiki","before_edit":" Army Life and Struggle Operation Easy.","after_edit":" Army career Operation Easy.","label":"others","raw_intents":["others","others","clarity"]}
{"doc_id":60043236.0,"context":"Brig. Pritam Singh is an Indian Army Officer, born in Dina Village in Ferozpur, Punjab, India. He fought in the battle in Singapore in 1942. After the war, he promoted to Lt. Colonel. In 1947, he fought against Pakistan in Poonch. Army Life and Struggle Operation Easy. Poonch link-up 1 November 1948 - 26 November 1948 As a young officer, Brig Pritam Singh fought  the battle of Singapore in 1942 and he wounded badly. Opponent Army prisoned Pritam Singh. Somehow he escaped from the prison of the army campand after, six months he reached , Manipur, India. Later, he was awarded the coveted Military Cross for his great show of bravery. Lt Col Pritam Singh was promoted to the rank of Brigadier in December 1948. Poonch withstood a siege by the Pakistanis from November 1947 till relieved by an Indian offensive, Operation Easy on 20 November 1948. The besieged garrison , commanded by Brig. Pritam Singh , was maintained by air supply. Military operations ended with Poonch town and the eastern part of Poonch district in Indian hands and western Poonch in Pakistani hands. In 1951, he faced a court-martial.","domain":"wiki","before_edit":" Somehow he escaped from the prison of the army campand after, six months he reached , Manipur, India.","after_edit":" Somehow he escaped from the army camp, and after six months reached Manipur, India.","label":"others","raw_intents":["others","others","clarity"]}
{"doc_id":6069126.0,"context":"Time perception is usually categorized under the following three distinct ranges, because different ranges of durations are processed in different parts of the brain . There are many theories and computational models for time perception mechanisms in the brain. William J. Friedman (1993) contrasted two theories for a sense of time: Another theory involves the brain's subconscious tallying of \"pulses\" during a specific interval, forming a biological stopwatch. This theory proposes that the brain can run multiple biological stopwatches at one time depending on the type of task one is involved in. The location of these pulses and what these pulses actually consist of is unclear. This model is only a metaphor and does not stand up in terms of brain physiology or anatomy .","domain":"wiki","before_edit":"Time perception is usually categorized under the following three distinct ranges, because different ranges of durations are processed in different parts of the brain .","after_edit":"Time perception is usually categorized under the following three distinct ranges, because different ranges of durations are processed in different parts of the brain :","label":"others","raw_intents":["others","coherence","others"]}
{"doc_id":49949965.0,"context":"Kulbhushan Sudhir Jadhav (also spelled Kulbhushan Yadav, alleged alias Hussain Mubarak Patel) (born 16 April 1970) is an Indian national. It is alleged by the Pakistani government that he was arrested in the Pakistani province of Balochistan on charges of terrorism and spying for India's  Research and Analysis Wing. On 10 April 2017, India's Ministry of External Affairs stated that he had been \"kidnapped last year from Iran and his subsequent presence in Pakistan has never been explained credibly\". The Pakistani government claimed that he was a commander in the Indian Navy who was involved in subversive activities inside Pakistan and was arrested on 3 March 2016 during a counter-intelligence operation in Balochistan. The Indian government recognised Jadhav as a former naval officer but denied any current links with him and maintained that he took premature retirement and operated a business in Iranian city of Chabahar and was abducted from there .Revealed: 'Spy' Kulbhushan Yadav not caught but abducted by extremist Sunni group Jaishul Adil , India Today, 30 March 2016. Pakistani security forces reported Jadhav as a serving officer in the Indian Navy and stated that he was commissioned to the Research and Analysis Wing  , India's external intelligence agency. They believed him to be involved in subversive activities in Balochistan and Karachi. Jadhav was soon shifted to Islamabad for interrogation. While according to Indian sources, Jadhav was kidnapped by Mullah Shahozi of Jaish ul-Adl from Chabahar and was transported via Sarbaz to IranPakistan border and where he handed Jadhav over to the Pakistani Army. In a statement issued in the Parliament of India on 11 April 2017, Rajnath Singh, India's Minister of Home Affairs, reiterated that Jadhav was kidnapped by Pakistani agencies from Iran and put through trial as a R AW agent. Sushma Swaraj, India's Minister of External Affairs said there was no evidence of any wrongdoing by Jadhav and termed his sentencing an act of \"premeditated murder\". Swaraj said that if Pakistan implemented the death sentence, the bilateral relations between both countries would face dire consequences. The ICJ proceedings began in The Hague on 15 May to review the case. India and Pakistan both sent their legal teams to put forward their arguments, led by Harish Salve and Khawar Qureshi QC respectively. On 18 May 2017, the International Court of Justice stayed the hanging of Jadhav by Pakistan . On 22 June 2017, Pakistani sources confirmed that Jadhav had sought clemency from the country's army chief following his conviction. Pakistan also released a new confessional video of Jadhav, in which he stated that he visited Karachi twice for gathering intelligence on naval facilities. He also admitted to supporting and funding, on behalf of R AW , Baloch militants affiliated with the BLA and BRA, in addition to infiltrating and establishing \"30 to 40 R AW operatives along the Makran Coast\" for involvement in terrorist activities. Jadhav said that R AW 's activities in Balochistan and Sindh were conducted under the direction of Anil Kumar Dhasmana. India's Foreign Ministry again dismissed the confession as \"false propaganda\", stating that Pakistan was trying to influence ICJ proceedings while denying the consular rights to Jadhav. ICJ did not allow Pakistan to play the video during the hearing. On 17 July 2019, the ICJ, in its verdict, rejected India's appeal for Jadhav's release and directed Pakistan to allow consular access and effectively Stayed the death sentence. The court ordered that Pakistan should grant consular access to Jhadav. Pakistan and India both claimed victory and welcomed the judgement of ICJ.","domain":"wiki","before_edit":" In a statement issued in the Parliament of India on 11 April 2017, Rajnath Singh, India's Minister of Home Affairs, reiterated that Jadhav was kidnapped by Pakistani agencies from Iran and put through trial as a R AW agent.","after_edit":" In a statement issued in the Parliament of India on 11 April 2017, Rajnath Singh, India's Minister of Home Affairs, reiterated that Jadhav was kidnapped by Pakistani agencies from Iran and put through trial as a R RAW agent.","label":"others","raw_intents":["others","others","others"]}
{"doc_id":8150951.0,"context":"Plant perception or biocommunication is the paranormal idea that plants are sentient, that they respond to humans in a manner that amounts to ESP, and that they experience pain and fear. The idea is not accepted by the scientific community, as plants lack nervous systems . Galston, Arthur W; Slayman, Clifford L. Plant Sensitivity and Sensation. In URLe Ogden Abell, Barry Singer. (1981). Science and the Paranormal: Probing the Existence of the Supernatural. Junction Books. pp. 40-55. Tittle, Peg. (2011). Critical Thinking: An Appeal to Reason. Routledge. p. 317. Jong, Tom de; Klinkhamer, Peter. (2005). Evolutionary Ecology of Plant Reproductive Strategies. Cambridge University Press. p. 2. \"Plants do not have a nervous system and certainly do not make conscious decisions about what to do next.\" Paranormal claims in regard to plant perception are considered to be pseudoscience by the scientific community.Audus, Leslie. (1974). Roots of Absurdity. New Scientist. 17 October. p. 207Galston, Arthur W; Slayman, Clifford L. (1979). The Not-So-Secret Life of Plants: In Which the Historical and Experimental Myths About Emotional Communication Between Animal and Vegetable Are Put to Rest. American Scientist 67 (3): 337-344. The idea is distinct from measured plant perception and chemical communication .","domain":"wiki","before_edit":"Plant perception or biocommunication is the paranormal idea that plants are sentient, that they respond to humans in a manner that amounts to ESP, and that they experience pain and fear. The idea is not accepted by the scientific community, as plants lack nervous systems . Galston, Arthur W;","after_edit":"Plant perception or biocommunication is the paranormal idea that plants are sentient, that they respond to humans in a manner that amounts to ESP, and that they experience a range of emotions or parapsychological states. Since plants lack nervous systems . Galston, Arthur W;","label":"style","raw_intents":["style","others","clarity"]}
{"doc_id":4409682.0,"context":"Saraswata was brought up by Sage Dadhichi who found him as a child floating in the Saraswati River . Deva king Indra made a weapon named the Vajra using the skeleton of Dadhichi, which he used in his battle against his enemies, the Asuras. In this battle 99 heroes in the army of the Daityas, (a clan of Asuras) were slain. After this great war there was a drought extending for 12 years. During that drought extending for twelve years, the great sages (who practiced Vedic traditions and who were settled on the banks of Saraswati River) for the sake of sustenance, migrated from the river valley (9:51). However, Sage Saraswata continued to live on the banks of the Saraswati. After the drought of 12 years had died, the great sages solicited one another for lectures on the Vedas. While wandering with famished stomachs, the sages had lost the knowledge of the Vedas. There was, indeed, not one amongst them that could understand the scriptures. It chanced that someone amongst them encountered Saraswata, that foremost of sages, while the latter was reading the Vedas with concentrated attention. Coming back to the conclave of rishis, he spoke to them of Saraswata, of unrivalled splendour and god-like form engaged in reading the Vedas in a solitary forest. Then all the great Rishis came to that spot, and jointly asked him to teach them the Vedas. Those sages duly became his disciples and obtaining from him their knowledge of the Vedas, once more began to practice their rites. A total of 60,000 sages became disciples of the venerable Rishi Saraswata for the sake of acquiring their knowledge of the Vedas from him (9:51). The present day Goud Saraswat Brahmins who are Goud saraswat , Shenvis, Chitrapur saraswats, bhalvalikar, Rajapur Saraswats, and pednekars, have this event as part of their culture. This event is repeated again at (3:85):- At the forest of Tungaka in olden days sage Saraswata taught the Vedas to the ascetics. When the Vedas had been lost in consequence of the sages having URLotten them. Here (3:85) he is mentioned as the son of Angirasa. The asylum of Aditya, the place of Soma and the hermitage of Dadhichi were mentioned as adjacent places on the banks of Saraswati at (3:83). Here it is mentioned that Angirasa - a great sage belonging to the Saraswata race - was born in the ashram of Dadhichi . At (13:50) Saraswata is  mentioned as Sage Atris son. Saraswata is mentioned as a sage from the western regions of India at (12:207, 13:165).","domain":"wiki","before_edit":"Saraswata was brought up by Sage Dadhichi who found him as a child floating in the Saraswati River . Deva king Indra made a weapon named the Vajra using the skeleton of Dadhichi, which he used in his battle against his enemies, the Asuras.","after_edit":"Saraswata was born to family of sage brighu his father was sage (some time prince) dhadichi ( not one who donate his bones for vajra) . Deva king Indra made a weapon named the Vajra using the skeleton of Dadhichi, which he used in his battle against his enemies, the Asuras.","label":"style","raw_intents":["style","style","clarity"]}
{"doc_id":23427012.0,"context":"Another source of dispute has been the Baghdad stone i ption in a Turkish script , which some interpret saying Baba Nanak Fakir was there in 15111512 , while some state 15211522 (and that he lived in the Middle East for 11 years away from his family). Others, particularly Western scholars, argue that the stone inscription is from the 19th century and the stone is not a reliable evidence that Guru Nanak visited Baghdad in early 16th century. Moreover, beyond the stone, no evidence or mention of Guru Nanak's journey in the Middle East has been found in any other Middle Eastern textual or epigraphical records. Claims have been asserted of additional inscriptions, but no one has been able to locate and verify them.","domain":"wiki","before_edit":"Another source of dispute has been the Baghdad stone i ption in a Turkish script , which some interpret saying Baba Nanak Fakir was there in 15111512 , while some state 15211522 (and that he lived in the Middle East for 11 years away from his family).","after_edit":"Another source of dispute has been the Baghdad stone i ption in a Turkish script , which some interpret saying Baba Nanak Fakir was there in 15111512 ; others read it as saying 15211522 (and that he lived in the Middle East for 11 years away from his family).","label":"style","raw_intents":["style","style","coherence"]}
{"doc_id":54114327.0,"context":"Comparison with American flag 205px|The Grand Union Flag, 1775 The flag of the East India Company is considered to have inspired the 1775 Grand Union Flag, the first flag of the United States, as the two flags were of the same design. This connection is attributed to numerous sources. Benjamin Franklin of Pennsylvania once gave a speech endorsing the adoption of the Company's flag by the United States as their national flag. He said to George Washington of Virginia, \"While the field of your flag must be new in the details of its design, it need not be entirely new in its elements. There is already in use a flag, I refer to the flag of the East India Company.\" This was a way of symbolising American loyalty to the Crown as well as the United States' aspirations to be self-governing, as was the East India Company. Some colonists also felt that the Company could be a powerful ally in the American War of Independence, as they shared similar aims and grievances against Crown tax policies. Colonists therefore flew the Company's flag, to endorse the Company. However, the theory that the Grand Union Flag was a direct descendant of the flag of the East India Company has been criticised as lacking written evidence. On the other hand, the resemblance is obvious, and a number of the Founding Fathers of the United States were aware of the East India Company 's activities and of their free administration of India under Company rule.","domain":"wiki","before_edit":"Comparison with American flag 205px|The Grand Union Flag, 1775 The flag of the East India Company is considered to have inspired the 1775 Grand Union Flag, the first flag of the United States, as the two flags were of the same design.","after_edit":"Comparison with American flag 205px|The Grand Union Flag, 1775 The flag of the East India Company may or may not have have inspired the 1775 Grand Union Flag, the first flag of the United States, as the two flags were of the same design.","label":"style","raw_intents":["style","style","style"]}
{"doc_id":38569161.0,"context":"170px|Textile doll (cotton, wool, wood) The Chancay were a pre-Columbian archeological civilization which developed between the valleys of Fortaleza, Pativilca, Supe, Huaura, Chancay, Chilln, Rimac and Lurn, on the central coast of Peru, from about CE 1000 to 1470. History 200px|Llama effigy (earthenware, slip paint) Not much is known about the Chancay civilization, which developed in the later part of the Inca Empire. This culture emerged after the fall of the Wari civilization. Parts of the southern Chancay area were conquered by the Chim in the early fifteenth century and in about 1450 A.D. the Incas were occupying both areas. It is believed that the Chancay had a centralized political structure , forming a small regional state. Thus the Chancay culture declined in the fifteenth centuryto make way for the territorial expansion of the Inca Empire . The settlements in Lauri, Lumbra, Tambo Blanco, Handrail, Pisquillo Chico and Tronconal focused mainly on artisans producing large-scale ceramics and textiles. The Chancay culture is the first of the Peruvian cultures that had mass production of ceramics, textiles and metals such as gold and silver which were ritualistic and domestic goods. They were also noted for their wood carved items. In type of fabric used include llama wool, cotton, chiffon  and feathers. Their technique involved were decorated open weave, brocade, embroidery, and painting. Brushes were used to paint anthropomorphic, zoomorphic, geometric and other creative designs directly on the canvases. The Chancay are known for the quality of their painted tapestries. The typically geometric designs also included drawings of plants, animals such as fish, cats, birds, monkeys and dogs (most notably the hairless Peruvian dog) as well as human figures. Some of the human fiber sculptures are elaborate and include such scenes as a mother teaching her daughter to weave on a backstrap loom. Birds and deities wearing crescent-like headdresses were one of the more common decorative features. They produced a variety of goods such as clothing, bags, and funeral masks.","domain":"wiki","before_edit":" It is believed that the Chancay had a centralized political structure , forming a small regional state.","after_edit":" The Chancay likely had a centralized political structure , forming a small regional state.","label":"style","raw_intents":["style","style","clarity"]}
