{"doc_id":1912.11602,"context":"Lead bias is a common phenomenon in news summarization, where early parts of an article often contain the most salient information . While many algorithms exploit this fact in summary generation , it has a detrimental effect on teaching the model to discriminate and extract important information in general. We propose that the lead bias can be leveraged in our favor in a simple and effective way to pre-train abstractive news summarization models on large-scale unlabeled news corpora: predicting the leading sentences using the rest of an article. We collect a massive news corpus and conduct data cleaning and filtering via statistical analysis. We then apply the proposed self-supervised pre-training  to existing generation models BART and T5 for domain adaptation. Via extensive experiments on six benchmark datasets, we show that this approach can dramatically improve the summarization quality and achieve state-of-the-art results for zero-shot news summarization without any fine-tuning. For example, in the DUC2003 dataset, the ROUGE-1 score of BART increases 13.7\\% after the lead-bias pre-training. We deploy the model in Microsoft News and provide public APIs as well as a demo website for multi-lingual news summarization.","domain":"arxiv","before_edit":" While many algorithms exploit this fact in summary generation , it has a detrimental effect on teaching the model to discriminate and extract important information in general.","after_edit":" While many algorithms exploit this fact in summary generation , it has a detrimental effect on teaching a model to discriminate and extract important information in general.","label":"clarity","raw_intents":["fluency","clarity","clarity"]}
{"doc_id":2009.09704,"context":"An end-to-end speech-to-text translation (ST) takes audio in a source language and outputs the text in a target language. Inspired by neuroscience, humans have perception systems and cognitive systems to process different information , we propose LUT, Listen-Understand-Translate,  a unified framework with triple supervision  to decouple the end-to-end speech-to-text translation task. In addition to the target language sentence translation loss, LUT includes two auxiliary supervising signals to guide the acoustic encoder to extracts acoustic features from the input, and the semantic encoder to extract semantic features relevant to the source transcription text. We do experiments on English-French,  English-German and  English-Chinese speech translation benchmarks and the results demonstrate the reasonability of LUT . Our code is available at URL","domain":"arxiv","before_edit":" Inspired by neuroscience, humans have perception systems and cognitive systems to process different information , we propose LUT, Listen-Understand-Translate,  a unified framework with triple supervision  to decouple the end-to-end speech-to-text translation task.","after_edit":" Inspired by neuroscience, humans have perception systems and cognitive systems to process different information , we propose LUT, Listen-Understand-Translate,  a unified framework with triple supervision signals to decouple the end-to-end speech-to-text translation task.","label":"clarity","raw_intents":["clarity","clarity","meaning-changed"]}
{"doc_id":2004.15003,"context":"One key principle for assessing semantic similarity between texts is to measure the degree of semantic overlap of them by considering word-by-word alignment. However, alignment-based approaches are inferior to the generic sentence vectorsin terms of performance. We hypothesize that the reason for the inferiority of alignment-based methods is due to the fact that they do not distinguish word importance and word meaning. To solve this , we propose to separate word importance and word meaning by decomposing word vectors into their norm and direction , then compute the alignment-based similarity with the help of earth mover's distance . We call the method word rotator's distance (WRD) because direction vectors are aligned by rotation on the unit hypersphere. In addition, to incorporate the advance of cutting edge additive sentence encoders, we propose to re-decompose such sentence vectors into word vectors and use them as inputs to WRD. Empirically, the proposed method outperforms current methods considering the word-by-word alignment including word mover's distance with a big difference; moreover, our method outperforms state-of-the-art additive sentence encoders on the most competitive dataset, STS-benchmark .","domain":"arxiv","before_edit":" To solve this , we propose to separate word importance and word meaning by decomposing word vectors into their norm and direction , then compute the alignment-based similarity with the help of earth mover's distance .","after_edit":" To solve this , we propose to decouple word vectors into their norm and direction , then compute the alignment-based similarity with the help of earth mover's distance .","label":"clarity","raw_intents":["clarity","clarity","style"]}
{"doc_id":2103.09474,"context":"Previous works on neural text-to-speech (TTS) have been tackled on limited speed in training and inference time, robustness for difficult synthesis conditions, expressiveness, and controllability. Although several approaches resolve some limitations, none of them has resolved all weaknesses at once. In this paper, we propose STYLER, an expressive and controllable text-to-speech model with robust speech synthesisand high speed. Excluding autoregressive decoding and introducing a novel audio-text aligning method called Mel Calibrator leads speech synthesis more robust on long, unseen data. Disentangled style factor modeling under supervision enlarges the controllability of synthesizing speech with fruitful expressivity. Moreover, our novel noise modeling pipeline using domain adversarial training and Residual Decoding enables noise-robust style transfer, decomposing the noise without any additional label. Our extensive and various experiments demonstrate STYLER's effectiveness in the aspects of speed , robustness, expressiveness, and controllability by comparison with existing neural TTS models and ablation studies . Synthesis samples of our model and experiment results are provided via our demo page  .","domain":"arxiv","before_edit":" Disentangled style factor modeling under supervision enlarges the controllability of synthesizing speech with fruitful expressivity. Moreover, our novel noise modeling pipeline using domain adversarial training and Residual Decoding enables noise-robust style transfer, decomposing the noise without any additional label.","after_edit":" Disentangled style factor modeling under supervision enlarges the controllability in synthesizing process leading to expressive TTS. On top of it, a novel noise modeling pipeline using domain adversarial training and Residual Decoding enables noise-robust style transfer, decomposing the noise without any additional label.","label":"clarity","raw_intents":["clarity","meaning-changed","clarity"]}
{"doc_id":2010.12873,"context":"Recently, neural-symbolic models have achieved noteworthy success in leveraging knowledge graphs (KGs) for commonsense reasoning tasks , like question answering (QA) . However, fact sparsity, inherent in human-annotated KGs, can hinder such models from retrieving task-relevant knowledge . To address these issues, we propose  Hybrid Graph Network (HGN) , a neural-symbolic model that reasons over both extracted (human-labeled) and generated facts within the same learned graph structure. Given a KG subgraphof extracted facts , HGN is jointly trained to generate complementary facts, encode relational information in the resulting \"hybrid\" subgraph, and filter out task-irrelevant facts . We demonstrate HGN's ability to produce contextually pertinent subgraphs by showing considerable performance gains across four commonsense reasoning benchmarks and a user study of fact validness and helpfulness.","domain":"arxiv","before_edit":" Given a KG subgraphof extracted facts , HGN is jointly trained to generate complementary facts, encode relational information in the resulting \"hybrid\" subgraph, and filter out task-irrelevant facts .","after_edit":" Given a KG subgraphof extracted facts , HGN is jointly trained to generate complementary facts, encode relational information in the resulting \"hybrid\" graph, then reason over the hybrid graph while filtering out context-irrelevant edges .","label":"clarity","raw_intents":["meaning-changed","clarity","clarity"]}
{"doc_id":2009.05166,"context":"Large-scale cross-lingual language models (LM), such as mBERT, Unicoder and XLM, have achieved great success in cross-lingual representation learning. However, when applied to zero-shot cross-lingual transfer tasks, most existing methods use only single-language input for LM finetuning, without leveraging the intrinsic cross-lingual alignment between different languages that is essential for multilingual tasks. In this paper, we propose FILTER, an enhanced fusion method that takes cross-lingual data as input for XLM finetuning. Specifically, FILTER first encodes text input in the source language and its translation in the target language independently in the shallow layers, then performs cross-lingual fusion to extract multilingual knowledge in the intermediate layers, and finally performs further language-specific encoding. During inference, the model makes predictions based on the text input in the target language and its translation in the source language. For simple tasks such as classification, translated text in the target language shares the same label as the source language. However, this shared label becomes less accurate or even unavailable for more complex tasks such as question answering, NER and POS tagging. For better model scalability , we further propose an additional KL-divergence self-teaching loss for model training, based on auto-generated soft pseudo-labels for translated text in the target language. Extensive experiments demonstrate that FILTER achieves new state of the art on two challenging multilingual multi-task benchmarks, XTREME and XGLUE.","domain":"arxiv","before_edit":" For better model scalability , we further propose an additional KL-divergence self-teaching loss for model training, based on auto-generated soft pseudo-labels for translated text in the target language.","after_edit":" To tackle this issue , we further propose an additional KL-divergence self-teaching loss for model training, based on auto-generated soft pseudo-labels for translated text in the target language.","label":"coherence","raw_intents":["coherence","clarity","coherence"]}
{"doc_id":2007.00576,"context":"To combat COVID-19,  clinicians and scientists all need to digest the vast amount of relevant biomedical knowledge in literature to understand the disease mechanism and the related biological functions. We have developed a novel and comprehensive knowledge discovery framework, COVID-KG, which leverages novel semantic representation and external ontologies to represent text and images in the input literature data, and then performs various extraction components to  extract fine-grained multimedia knowledge elements (entities, relations and events)  . We then exploit the constructed multimedia KGs for question answering and report generation, using drug repurposing as a case study. Our framework also provides detailed contextual sentences, subfigures and knowledge subgraphs as evidence. All of the data, KGs, resources, and shared services are publicly available.","domain":"arxiv","before_edit":"To combat COVID-19,  clinicians and scientists all need to digest the vast amount of relevant biomedical knowledge in literature to understand the disease mechanism and the related biological functions.","after_edit":"To combat COVID-19, both clinicians and scientists all need to digest the vast amount of relevant biomedical knowledge in literature to understand the disease mechanism and the related biological functions.","label":"coherence","raw_intents":["coherence","clarity","coherence"]}
{"doc_id":2011.11465,"context":"Sentiment analysis of social media comments is very important for review analysis. Many online reviews are sarcastic , humorous, or hateful. This sarcastic nature of these short texts change the actual sentiments of the review as predicted by a machine learning model that attempts to detect sentiment alone. Thus, having a model that is explicitly aware of these features should help it perform better on reviews that are characterized by them. Several research has already been done in this field. This paper deals with sarcasm detection on reddit comments. Several machine learning and deep learning algorithms have been applied for the same but each of these models only take into account the initial text instead of the conversation which serves as a better measure to determine sarcasm . The other shortcoming these papers have is they rely on word embedding for representing comments and thus do not take into account the problem of polysemy(A word can have multiple meanings based on the context in which it appears). These existing modules were able to solve the problem of capturing inter sentence contextual information but not the intra sentence contextual information . So we propose a novel architecture which solves the problem of sarcasm detection by capturing intra sentence contextual information using a novel contextual attention mechanism . The proposed model solves the problem of polysemy also by using context enriched language modules like ELMO and BERT in its first component. This model comprises a total of three major components which takes into account inter sentence, intra sentence contextual information and at last use a convolutional neural network for capturing global contextual information for sarcasm detection. The proposed model was able to generate decent results and cleared showed potential to perform state of the art if trained on a larger dataset  .","domain":"arxiv","before_edit":" Many online reviews are sarcastic , humorous, or hateful. This sarcastic nature of these short texts change the actual sentiments of the review as predicted by a machine learning model that attempts to detect sentiment alone.","after_edit":" Many online reviews are sarcastic , humorous, or sarcastic. The sarcastic nature of these short texts change the actual sentiments of the review as predicted by a machine learning model that attempts to detect sentiment alone.","label":"coherence","raw_intents":["coherence","clarity","coherence"]}
{"doc_id":2104.12265,"context":"This paper presents a new approach for offensive language and hate speech detection on social media. Our approach incorporate an offensive lexicon composed by implicit and explicit offensive and swearing expressions annotated with binary classes: context-dependent and context-independent offensive. Due to the severity of the hate speech and offensive comments in Brazil, and the lack of research in Portuguese, Brazilian Portuguese is the language used to validate our method. However, the proposal may be applied to any other language or domain. Based on the obtained results, the proposed approach showed high performance results overcoming the current baselines for European and Brazilian Portuguese.","domain":"arxiv","before_edit":" Due to the severity of the hate speech and offensive comments in Brazil, and the lack of research in Portuguese, Brazilian Portuguese is the language used to validate our method. However, the proposal may be applied to any other language or domain.","after_edit":" Due to the severity of the hate speech and offensive comments in Brazil, and the lack of research in Portuguese, Brazilian Portuguese is the language used to validate the proposed method. Nevertheless, our proposal may be applied to any other language or domain.","label":"coherence","raw_intents":["clarity","coherence","coherence"]}
{"doc_id":2011.02593,"context":"Neural sequence models can generate highly fluent sentences but recent studies have also shown that they are also prone to hallucinate additional content not supported by the input, which can cause a lack of trust in the model. To better assess the faithfulness of the machine outputs, we propose a new task to predict whether each token in the output sequence is hallucinated conditioned on the source input, and collect new manually annotated evaluation sets for this task. We also introduce a novel method for learning to model hallucination detection, based on pretrained language models fine tuned on synthetic data that includes automatically inserted hallucinations. Experiments on machine translation and abstract text summarization demonstrate the effectiveness of our proposed approach -- we obtain an average F1 of around 0.6 across all the benchmark datasets  and achieve significant improvements in sentence-level hallucination scoring compared to baseline methods. We also release our annotated data and code for future researchat URL","domain":"arxiv","before_edit":" We also release our annotated data and code for future researchat URL","after_edit":" We also release our annotated data and code to support future research.","label":"coherence","raw_intents":["coherence","coherence","clarity"]}
{"doc_id":2104.12265,"context":"This paper presents a new approach for offensive language and hate speech detection on social media. Our approach incorporate an offensive lexicon composed by implicit and explicit offensive and swearing expressions annotated with binary classes: context-dependent and context-independent offensive. Due to the severity of the hate speech and offensive comments in Brazil, and the lack of research in Portuguese, Brazilian Portuguese is the language used to validate our method. However, the proposal may be applied to any other language or domain. Based on the obtained results, the proposed approach showed high performance results overcoming the current baselines for European and Brazilian Portuguese.","domain":"arxiv","before_edit":" Based on the obtained results, the proposed approach showed high performance results overcoming the current baselines for European and Brazilian Portuguese.","after_edit":" Based on the obtained results, the proposed approach showed high-performance overcoming the current baselines for European and Brazilian Portuguese.","label":"fluency","raw_intents":["fluency","fluency","clarity"]}
{"doc_id":2001.05272,"context":"Chinese NER is a challenging task. As pictographs, Chinese characters contain latent glyph information , which is often overlooked. We propose the FGN , Fusion Glyph Network for Chinese NER. This method may offer glyph informationfor fusion representation learning with BERT . The major innovations of FGN include: (1) a novel CNN structure called CGS-CNN is proposed to capture glyph information from both character graphs and their neighboring graphs . (2) we provide a method with sliding window and Slice-Attention to extract interactive information between BERT representation and glyph representation  . Experiments are conducted on four NER datasets, showing that FGN with LSTM-CRF as tagger achieves new state-of-the-arts performance for Chinese NER. Further, more experiments are conducted to investigate the influences of various components and settings in FGN.","domain":"arxiv","before_edit":" (1) a novel CNN structure called CGS-CNN is proposed to capture glyph information from both character graphs and their neighboring graphs . (2) we provide a method with sliding window and Slice-Attention to extract interactive information between BERT representation and glyph representation  . Experiments are conducted on four NER datasets, showing that FGN with LSTM-CRF as tagger achieves new state-of-the-arts performance for Chinese NER.","after_edit":" (1) a novel CNN structure called CGS-CNN is proposed to capture glyph information from both character graphs and their neighboring graphs . (2) we provide a method with sliding window and Slice-Attention to extract interactive information between BERT representation and glyph representation  . Experiments are con-ducted on four NER datasets, showing that FGN with LSTM-CRF as tagger achieves new state-of-the-arts performance for Chinese NER.","label":"fluency","raw_intents":["fluency","others","fluency"]}
{"doc_id":2006.01095,"context":"Artificial neural networks ( ANNs ) have shown much empirical success in solving perceptual tasks across various cognitive modalities. While they are only loosely inspired by the biological brain, recent studies report considerable similarities between representation extracted from task-optimized ANNs and neural populations in the brain. ANNs have subsequently become a popular model class to infer computational principles underlying complex cognitive functions, and in turn  they have also emerged as a natural testbed for applying methods originally developed to probe information in neural populations. In this work, we utilize mean-field theoretic manifold analysis, a recent technique from computational neuroscience  , to analyze the high dimensional geometry of language representations from large-scale contextual embedding models. We explore representations from different model families (BERT, RoBERTa, GPT-2 , etc.) and find evidence for emergence of linguistic manifold across layer depth (e.g., manifolds for part-of-speech and combinatory categorical grammar tags). We further observe that different encoding schemes used to obtain the representations lead to differences in whether these linguistic manifolds emerge in earlier or later layers of the network . In addition, we find that the emergence of linear separability in these manifolds is driven by a combined reduction of manifolds  radius, dimensionality and inter-manifold correlations.","domain":"arxiv","before_edit":" In addition, we find that the emergence of linear separability in these manifolds is driven by a combined reduction of manifolds  radius, dimensionality and inter-manifold correlations.","after_edit":" In addition, we find that the emergence of linear separability in these manifolds is driven by a combined reduction of manifolds ' radius, dimensionality and inter-manifold correlations.","label":"fluency","raw_intents":["style","fluency","fluency"]}
{"doc_id":2001.08604,"context":"Recent works have shown that generative data augmentation, where synthetic samples generated from deep generative models are used to augment the training dataset, benefit certain NLP tasks. In this work, we extend this approach to the task of dialogue state tracking for goal-oriented dialogues, in which the data naturally exhibits a hierarchical structure over utterances and related annotations . Deep generative data augmentation for dialogue state tracking requires the generative model to be aware of the hierarchically structured data . We propose  Variational Hierarchical Dialog Autoencoder (VHDA) for modeling various aspects of goal-oriented dialogues , including linguistic and underlying annotation structures. Our experiments show that our  model is able to generate realistic and novel samples that improve the robustness of state-of-the-art dialogue state trackers, ultimately improving their final dialogue state tracking performances on several datasets .","domain":"arxiv","before_edit":" In this work, we extend this approach to the task of dialogue state tracking for goal-oriented dialogues, in which the data naturally exhibits a hierarchical structure over utterances and related annotations . Deep generative data augmentation for dialogue state tracking requires the generative model to be aware of the hierarchically structured data .","after_edit":" In this work, we extend this approach to the task of dialogue state tracking for goal-oriented dialogues, in which the data naturally exhibits a hierarchical structure over utterances and related annotations , deep generative data augmentation for dialogue state tracking requires the generative model to be aware of the hierarchically structured data .","label":"fluency","raw_intents":["fluency","fluency","coherence"]}
{"doc_id":2001.08604,"context":"Recent works have shown that generative data augmentation, where synthetic samples generated from deep generative models are used to augment the training dataset, benefit certain NLP tasks. In this work, we extend this approach to the task of dialogue state tracking for goal-oriented dialogues, in which the data naturally exhibits a hierarchical structure over utterances and related annotations . Deep generative data augmentation for dialogue state tracking requires the generative model to be aware of the hierarchically structured data . We propose  Variational Hierarchical Dialog Autoencoder (VHDA) for modeling various aspects of goal-oriented dialogues , including linguistic and underlying annotation structures. Our experiments show that our  model is able to generate realistic and novel samples that improve the robustness of state-of-the-art dialogue state trackers, ultimately improving their final dialogue state tracking performances on several datasets .","domain":"arxiv","before_edit":" Our experiments show that our  model is able to generate realistic and novel samples that improve the robustness of state-of-the-art dialogue state trackers, ultimately improving their final dialogue state tracking performances on several datasets .","after_edit":" Our experiments show that our  model is able to generate realistic and novel samples that improve the robustness of state-of-the-art dialog state trackers, ultimately improving their final dialogue state tracking performances on several datasets .","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":2005.06377,"context":"ROUGE is the de facto criterion for summarization research. However, its two major drawbackslimit the research and application of automated summarization systems . First, ROUGE favors lexical similarity instead of semantic similarity , making it especially unfit for abstractive summarization . Second, ROUGE cannot function without a reference summary, which is expensive or impossible to obtain in many cases . Therefore , we introduce a new end-to-end metric system for summary quality assessment by leveraging the semantic similarities of words and\/or sentences in deep learning. Models trained in our framework can evaluate a summary directly against the input document , without the need of a reference summary . The proposed approach exhibits very promising results on gold-standard datasets and suggests its great potential to future summarization research. The scores from our models have correlation coefficients up to 0.54 with human evaluations on machine generated summaries in TAC2010. Its performance is also very close to ROUGE metrics' .","domain":"arxiv","before_edit":" Second, ROUGE cannot function without a reference summary, which is expensive or impossible to obtain in many cases . Therefore , we introduce a new end-to-end metric system for summary quality assessment by leveraging the semantic similarities of words and\/or sentences in deep learning.","after_edit":" Second, ROUGE cannot function without a reference summary, which is expensive or impossible to obtain in many cases , is needed. Existing efforts to address the two drawbacks are done separately and have limitations. To holistically address them , we introduce a new end-to-end metric system for summary quality assessment by leveraging the semantic similarities of words and\/or sentences in deep learning.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":2005.07456,"context":"Word embeddings represent words in a numeric space in such a way that semantic relations between words are encoded as distances and directions in the vector space. Cross-lingual word embeddings map words from one language to the vector space of another language, or words from multiple languages to the same vector space where similar words are aligned.  Cross-lingual embeddings can be used to transfer machine learning models between languages and thereby compensate for insufficient data in less-resourced languages. We use cross-lingual word embeddings to transfer machine learning prediction models for Twitter sentiment between 13 languages. We focus on two transfer mechanisms using the joint numerical space for many languages as implemented in the LASER library : the transfer of trained models, and expansion of training sets with instances from other languages . Our experiments show that the transfer of models between similar languages is sensible, while dataset expansion did not increase the predictive performance .","domain":"arxiv","before_edit":" We focus on two transfer mechanisms using the joint numerical space for many languages as implemented in the LASER library : the transfer of trained models, and expansion of training sets with instances from other languages .","after_edit":" We focus on two transfer mechanisms that recently show superior transfer performance. The first mechanism uses the trained models whose input is the joint numerical space for many languages as implemented in the LASER library : the transfer of trained models, and expansion of training sets with instances from other languages .","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","style"]}
{"doc_id":2006.10598,"context":"Fitting a model into GPU memory during training is an increasing concern as models continue to grow. To address this issue, we present Shapeshifter Networks (SSNs), a flexible neural network framework that decouples layers from model weights, enabling us to implement any neural network with an arbitrary number of parameters . In SSNseach layer obtains weights from a parameter store that decides where and how to allocate parameters to layers . This can result in sharing parameters across layers even when they have different sizes or perform different operations. SSNs do not require any modifications to a model's loss function or architecture  , making them easy to use. Our approach can create parameter efficient networks by using a relatively small number of weights, or can improve a model's performance by adding additional model capacity during training without affecting the computational resources required at test time. We evaluate SSNs  using seven network architectures across diverse tasks that include image classification, bidirectional image-sentence retrieval, and phrase grounding, creating high performing models even when using as little as 1\\% of the parameters.","domain":"arxiv","before_edit":" We evaluate SSNs  using seven network architectures across diverse tasks that include image classification, bidirectional image-sentence retrieval, and phrase grounding, creating high performing models even when using as little as 1\\% of the parameters.","after_edit":" We evaluate SSNs in key NPAS settings using seven network architectures across diverse tasks that include image classification, bidirectional image-sentence retrieval, and phrase grounding, creating high performing models even when using as little as 1\\% of the parameters.","label":"meaning-changed","raw_intents":["meaning-changed","clarity","meaning-changed"]}
{"doc_id":2010.12873,"context":"Recently, neural-symbolic models have achieved noteworthy success in leveraging knowledge graphs (KGs) for commonsense reasoning tasks , like question answering (QA) . However, fact sparsity, inherent in human-annotated KGs, can hinder such models from retrieving task-relevant knowledge . To address these issues, we propose  Hybrid Graph Network (HGN) , a neural-symbolic model that reasons over both extracted (human-labeled) and generated facts within the same learned graph structure. Given a KG subgraphof extracted facts , HGN is jointly trained to generate complementary facts, encode relational information in the resulting \"hybrid\" subgraph, and filter out task-irrelevant facts . We demonstrate HGN's ability to produce contextually pertinent subgraphs by showing considerable performance gains across four commonsense reasoning benchmarks and a user study of fact validness and helpfulness.","domain":"arxiv","before_edit":" Given a KG subgraphof extracted facts , HGN is jointly trained to generate complementary facts, encode relational information in the resulting \"hybrid\" subgraph, and filter out task-irrelevant facts .","after_edit":" Given a KG subgraphof extracted facts , HGN is jointly trained to generate embeddings for the subgraph's missing edges to form a \"hybrid\" subgraph, and filter out task-irrelevant facts .","label":"meaning-changed","raw_intents":["clarity","meaning-changed","meaning-changed"]}
{"doc_id":2010.12008,"context":"We propose a simple method to generate multilingual question and answer pairs on a large scale through the use of a single generative model. These synthetic samples can be used to improve the zero-shot performance of multilingual QA models on target languages. Our proposed multi-task training of the generative model only requires the  training samples in English, thus removing the need for labeled samples in the target languages, making it applicable to far more languages than those with labeled data.  Experimental results show our proposed approach achieves significant gains on several multilingual QA benchmarks , reducing the gap between zero-shot and supervised performance of  QA models on various languages.","domain":"arxiv","before_edit":"  Experimental results show our proposed approach achieves significant gains on several multilingual QA benchmarks , reducing the gap between zero-shot and supervised performance of  QA models on various languages.","after_edit":" Human evaluations indicate the majority of such samples are grammatically correct and sensible. Experimental results show our proposed approach achieves significant gains on several multilingual QA benchmarks , reducing the gap between zero-shot and supervised performance of  QA models on various languages.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":2001.05272,"context":"Chinese NER is a challenging task. As pictographs, Chinese characters contain latent glyph information , which is often overlooked. We propose the FGN , Fusion Glyph Network for Chinese NER. This method may offer glyph informationfor fusion representation learning with BERT . The major innovations of FGN include: (1) a novel CNN structure called CGS-CNN is proposed to capture glyph information from both character graphs and their neighboring graphs . (2) we provide a method with sliding window and Slice-Attention to extract interactive information between BERT representation and glyph representation  . Experiments are conducted on four NER datasets, showing that FGN with LSTM-CRF as tagger achieves new state-of-the-arts performance for Chinese NER. Further, more experiments are conducted to investigate the influences of various components and settings in FGN.","domain":"arxiv","before_edit":" (1) a novel CNN structure called CGS-CNN is proposed to capture glyph information from both character graphs and their neighboring graphs . (2) we provide a method with sliding window and Slice-Attention to extract interactive information between BERT representation and glyph representation  . Experiments are conducted on four NER datasets, showing that FGN with LSTM-CRF as tagger achieves new state-of-the-arts performance for Chinese NER.","after_edit":" (1) a novel CNN struc-ture called CGS-CNN is proposed to capture glyph information from both character graphs and their neighboring graphs . (2) we provide a method with sliding window and Slice-Attention to extract interactive information between BERT representation and glyph representation  . Experiments are conducted on four NER datasets, showing that FGN with LSTM-CRF as tagger achieves new state-of-the-arts performance for Chinese NER.","label":"others","raw_intents":["others","fluency","others"]}
{"doc_id":2001.05272,"context":"Chinese NER is a challenging task. As pictographs, Chinese characters contain latent glyph information , which is often overlooked. We propose the FGN , Fusion Glyph Network for Chinese NER. This method may offer glyph informationfor fusion representation learning with BERT . The major innovations of FGN include: (1) a novel CNN structure called CGS-CNN is proposed to capture glyph information from both character graphs and their neighboring graphs . (2) we provide a method with sliding window and Slice-Attention to extract interactive information between BERT representation and glyph representation  . Experiments are conducted on four NER datasets, showing that FGN with LSTM-CRF as tagger achieves new state-of-the-arts performance for Chinese NER. Further, more experiments are conducted to investigate the influences of various components and settings in FGN.","domain":"arxiv","before_edit":" Further, more experiments are conducted to investigate the influences of various components and settings in FGN.","after_edit":" Further, more experiments are conducted to inves-tigate the influences of various components and settings in FGN.","label":"others","raw_intents":["others","others","others"]}
{"doc_id":2006.06814,"context":"Designing task-oriented dialogue systems is a challenging research topic, since it needs not only to generate utterances fulfilling user requests but also to guarantee the comprehensibility. Many previous works trained end-to-end (E2E) models with supervised learning (SL), however, the bias in annotated system utterances remains as a bottleneck. Reinforcement learning (RL) deals with the problem through using non-differentiable evaluation metrics (e.g., the success rate) as rewards. Nonetheless, existing works with RL showed that the comprehensibility of generated system utterances could be corrupted when improving the performance on fulfilling user requests. In our work, we (1) propose modelling the hierarchical structure between dialogue policy and natural language generator (NLG) with the option framework, called HDNO  ; (2) train HDNO with hierarchical reinforcement learning (HRL), as well as suggest alternating updates between dialogue policy and NLG during HRL inspired by fictitious play, to preserve the comprehensibility of generated system utterances while improving fulfilling user requests ; and (3) propose using a discriminator modelled with language models as an additional reward to further improve the comprehensibility. We test HDNO on MultiWoz 2.0 and MultiWoz 2.1, the datasets on multi-domain dialogues, in comparison with word-level E2E model trained with RL, LaRL and HDSA, showing a significant improvement on the total performance evaluated with automatic metrics .","domain":"arxiv","before_edit":" In our work, we (1) propose modelling the hierarchical structure between dialogue policy and natural language generator (NLG) with the option framework, called HDNO  ;","after_edit":" In o gur work, we (1) propose modelling the hierarchical structure between dialogue policy and natural language generator (NLG) with the option framework, called HDNO  ;","label":"others","raw_intents":["others","others","others"]}
{"doc_id":2006.03654,"context":"Recent progress in pre-trained neural language models has significantly improved the performance of many natural language processing (NLP) tasks. In this paper we propose a new model architecture DeBERTa(Decoding-enhanced BERT with disentangled attention) that improves the BERT and RoBERTa models using two novel techniques. The first is the disentangled attention mechanism, where each word is represented using two vectors that encode its content and position, respectively, and the attention weights among words are computed using disentangled matrices on their contents and relative positions. Second, an enhanced mask decoder is used to replace the output softmax layer to predict the masked tokens for model pretraining . We show that these two techniques significantly improve the efficiency of model pre-training and performance of downstream tasks. Compared to RoBERTa-Large, a DeBERTa model trained on half of the training data performs consistently better on a wide range of NLP tasks, achieving improvements on MNLI by +0.9\\% (90.2\\% vs. 91.1\\%), on SQuAD v2.0 by +2.3\\% (88.4\\% vs. 90.7\\%) and RACE by +3.6\\% (83.2\\% vs. 86.8\\%). The DeBERTa code and pre-trained models will be made publicly available at URL","domain":"arxiv","before_edit":" In this paper we propose a new model architecture DeBERTa(Decoding-enhanced BERT with disentangled attention) that improves the BERT and RoBERTa models using two novel techniques.","after_edit":" In this paper wepropose a new model architecture DeBERTa(Decoding-enhanced BERT with disentangled attention) that improves the BERT and RoBERTa models using two novel techniques.","label":"others","raw_intents":["others","others","others"]}
{"doc_id":1912.13318,"context":"Pre-training techniques have been verified successfully in a variety of NLP tasks in recent years. Despite the wide spread of pre-training models for NLP applications, they almost focused on text-level manipulation, while neglecting the layout and style information that is vital for document image understanding. In this paper, we propose textbf LayoutLM to jointly model the interaction between text and layout information across scanned document images, which is beneficial for a great number of real-world document image understanding tasks such as information extraction from scanned documents. We also leverage the image features to incorporate the style information of words in LayoutLM. To the best of our knowledge, this is the first time that text and layout are jointly learned in a single framework for document-level pre-training , leading to significant performance improvement in downstream tasks for document image understanding.","domain":"arxiv","before_edit":" In this paper, we propose textbf LayoutLM to jointly model the interaction between text and layout information across scanned document images, which is beneficial for a great number of real-world document image understanding tasks such as information extraction from scanned documents.","after_edit":" In this paper, we propose  LayoutLM to jointly model the interaction between text and layout information across scanned document images, which is beneficial for a great number of real-world document image understanding tasks such as information extraction from scanned documents.","label":"others","raw_intents":["others","others","others"]}
{"doc_id":2009.06891,"context":"Inspired by Google's Neural Machine Translation (NMT) \\mbox{%DIFAUXCMD Wu2016Google that models the one-to-one alignment in translation tasks with an optimal uniform attention distribution during the inference, this study proposes an attention-aware inference algorithm for Neural Abstractive Summarization (NAS) to regulate generated summaries to attend to source paragraphs\/sentences with the optimal coverage. Unlike NMT, the attention-aware inference of NAS requires the prediction of the optimal attention distribution. Therefore, an attention-prediction model is constructed to learn the dependency between attention weights and sources. To apply the attention-aware inference on multi-document summarization, a Hierarchical Transformer (HT) is developed to accept lengthy inputs at the same time project cross-document information. Experiments on WikiSum \\mbox{%DIFAUXCMD liu2018generating By refining the regular beam search with the attention-aware inference , significant improvements on the quality of summaries could be further observed. Last but not the least, the attention-aware inference could be adopted to single-document summarization with straightforward modifications according to the model architecture .","domain":"arxiv","before_edit":" Experiments on WikiSum \\mbox{%DIFAUXCMD liu2018generating By refining the regular beam search with the attention-aware inference , significant improvements on the quality of summaries could be further observed.","after_edit":" Experiments on WikiSum \\mbox{%DIFAUXCMD liu2018generating By refining the regular beam search with the attention-aware mechanism , significant improvements on the quality of summaries could be further observed.","label":"style","raw_intents":["style","style","style"]}
{"doc_id":2010.12789,"context":"Natural language is one of the ways information is encoded and it has highly abstracted and conceptualized the information. This paper disassembles the information represented by natural language , analyzes the classification coding system of attribute information  and the abstraction relation between attribute information and entities in the real world , constructs the storage model of information, and simulate the attribute information precessing process in one of the attribute spaces, interprets how the relations which represented by \"Be\", \"Of\", \"Have\", and so on are embodied in the information storage data structures and the corresponding data reading modes , reclassifies the sentences types from the perspective of task types and data reading modes. Then, simulated the understanding process (the information processing process) on a dialogue example. Finally, the author summarizes the basic conditions of understanding and gives out the definition of understanding from a personal point of view. The study in this paper provides a practical, theoretical basis and research methods for NLU.It also can be applied in large-scale, multi-type information processing in the artificial intelligence (AI) area .","domain":"arxiv","before_edit":" This paper disassembles the information represented by natural language , analyzes the classification coding system of attribute information  and the abstraction relation between attribute information and entities in the real world ,","after_edit":" This paper disassembles the information represented by natural language and then discovered the classification coding system of attribute information  and the abstraction relation between attribute information and entities in the real world ,","label":"style","raw_intents":["style","style","clarity"]}
{"doc_id":2006.00119,"context":" We present ExplainIt, a review summarization system centered around opinion explainability: the simple notion of high-level opinions (e.g. \"noisy room\") being explainable by lower-level ones (e.g., \"loud fridge\"). ExplainIt utilizes a combination of supervised and unsupervised components to mine the opinion phrasesfrom reviews URLanize them in an Opinion Causality Graph (OCG), a novel semi-structured representation which summarizes causal relations. To construct an OCG, we cluster semantically similar opinions in single nodes, thus canonicalizing opinion paraphrases, and draw directed edges between node pairs that are likely connected by a causal relation. OCGs can be used to generate structured summaries at different levels of granularity and for certain aspects of interest, while simultaneously providing explanations . In this paper, we present the system's individual components and evaluate their effectiveness on their respective sub-tasks, where we report substantial improvements over baselines across two domains. Finally, we validate these results with a user study, showing that ExplainIt produces reasonable opinion explanations according to human judges .","domain":"arxiv","before_edit":" To construct an OCG, we cluster semantically similar opinions in single nodes, thus canonicalizing opinion paraphrases, and draw directed edges between node pairs that are likely connected by a causal relation. OCGs can be used to generate structured summaries at different levels of granularity and for certain aspects of interest, while simultaneously providing explanations . In this paper, we present the system's individual components and evaluate their effectiveness on their respective sub-tasks, where we report substantial improvements over baselines across two domains. Finally, we validate these results with a user study, showing that ExplainIt produces reasonable opinion explanations according to human judges .","after_edit":" To construct an OCG, we cluster semantically similar opinions extracted from reviews and an edge between two nodes signifies that one node explains the other. ExplainIt mines explanations in a supervised method and groups similar opinions together in a weakly supervised way before combining the clusters of opinions together with their explanation relationships into an opinion graph. We experimentally demonstrate that the explanation relationships generated in the opinion graph are of good quality and our labeled datasets for explanation mining and grouping opinions are publicly available .","label":"style","raw_intents":["style","coherence","style"]}
{"doc_id":2004.14974,"context":"We introduce the task of scientific fact-checking. Given a corpus of scientific articles and a claim about a scientific finding, a fact-checking model must identify abstracts that support or refute the claim. In addition, it must provide rationales for its predictions in the form of evidentiary sentences from the retrieved abstracts. For this task, we introduce SciFact, a dataset of 1.4K expert-written scientific claims paired with evidence-containing abstracts , and annotated with labels and rationales. We present a baseline model and assess its performance on SciFact. We observe that, while fact-checking models trained on Wikipedia articles or political news have difficulty generalizing to our task, simple domain adaptation techniques represent a promising avenue for improvement. Finally, we provide initial results showing how our model can be used to verify claims relevant to COVID-19 on the CORD-19 corpus. Our dataset will be made publicly available at URL","domain":"arxiv","before_edit":" For this task, we introduce SciFact, a dataset of 1.4K expert-written scientific claims paired with evidence-containing abstracts , and annotated with labels and rationales.","after_edit":" For this task, we construct SciFact, a dataset of 1.4K expert-written scientific claims paired with evidence-containing abstracts , and annotated with labels and rationales.","label":"style","raw_intents":["clarity","style","style"]}
{"doc_id":2009.06891,"context":"Inspired by Google's Neural Machine Translation (NMT) \\mbox{%DIFAUXCMD Wu2016Google that models the one-to-one alignment in translation tasks with an optimal uniform attention distribution during the inference, this study proposes an attention-aware inference algorithm for Neural Abstractive Summarization (NAS) to regulate generated summaries to attend to source paragraphs\/sentences with the optimal coverage. Unlike NMT, the attention-aware inference of NAS requires the prediction of the optimal attention distribution. Therefore, an attention-prediction model is constructed to learn the dependency between attention weights and sources. To apply the attention-aware inference on multi-document summarization, a Hierarchical Transformer (HT) is developed to accept lengthy inputs at the same time project cross-document information. Experiments on WikiSum \\mbox{%DIFAUXCMD liu2018generating By refining the regular beam search with the attention-aware inference , significant improvements on the quality of summaries could be further observed. Last but not the least, the attention-aware inference could be adopted to single-document summarization with straightforward modifications according to the model architecture .","domain":"arxiv","before_edit":" Last but not the least, the attention-aware inference could be adopted to single-document summarization with straightforward modifications according to the model architecture .","after_edit":" Last but not the least, the attention-aware inference has strong universality that can be easily adopted to different hierarchical summarization models to promote the models' performance .","label":"style","raw_intents":["style","style","style"]}
{"doc_id":100809.0,"context":"Oil in productionCrude oil prices in New York rose to a new record of  $102.59 per barrel on Thursday, although the figure increased even more during after hours trading. In less than a month, prices have risen $10, leading the figures to above the record highs set during the 1980s (taking inflation into account) . Information provided by the International Energy Agency has said that the previous record was $102.53, with the figures being adjusted according to inflation levels. The weak dollar is seen as a major cause of this rise . Congressman Ron Paul of Texas, pointed out to Federal Reserve chairman Ben Bernanke in a committee meeting this week that despite the  price of oil 's rapid ascent , it had remained flat when compared to the price of gold.  Increasing demand for oil has also been cited as the cause for this increase. Violence in Nigeria earlier this year has led to a drop the country's production by almost a quarter. The most recent information produced by the Energy Information Administration has shown an increase in gasoline prices for all but one of the areas surveyed. A graph to show the increase in gasoline pricesThere have also been suggestions that reports of a fire at a National Gas Terminal may have contributed to the rising oil price. Time Evans from Citigroup Futures has stated he believes that this fire at the UK natural gas terminal is creating a strong push in the European market, and that is translating here [the US].\"","domain":"news","before_edit":"Oil in productionCrude oil prices in New York rose to a new record of  $102.59 per barrel on Thursday, although the figure increased even more during after hours trading.","after_edit":"An oil refineryCrude oil prices in New York rose to a new record of  $102.59 per barrel on Thursday, although the figure increased even more during after hours trading.","label":"clarity","raw_intents":["clarity","others","clarity"]}
{"doc_id":56727.0,"context":"An investigation is currently happening by the New Zealand Department of Corrections to see if the allegations that prison guards at Rimutaka prison are accepting monetary bribes from prisoners in exchange for drugs and cellphones , are correct . Rimutaka prison is one of New Zealand's largest prions which caters for minimum to high-medium security male prisoners. It is located in Wellington, New Zealand. Two former officers, Ingrid and Mark Rijniers, have handed over a collection of documents on their encounters while working at Rimutaka prison. The pair, who were transferred from Holland, claim that Rimutaka prison is run by gang members who dominate the prison guards. They also claim that if the gang members don't get what they want they will intimidate and threaten the guards with their lives. However Ingrid Rijniers is refusing to co-operate with the department as they refused to give her the money to go back to Holland. The New Zealand Corrections Department confirm that they are investigating the serious claims and are taking them seriously but say that they have not found sufficient evidence yet to back up the claims. Twelve percent of 1,043 prisoners who were tested for drugs from the start of this year until June, tested positive for drugs. Most of the drugs taken was marijuana while fourteen tested positive for \"P\". These claims also come as teenage prisoner, Liam Ashley was strangled to death in a prison van by a much older adult prisoner. Mr Power said that with all these new claims emerging  Mr O'Conner should resign as the minister of corrections.","domain":"news","before_edit":" These claims also come as teenage prisoner, Liam Ashley was strangled to death in a prison van by a much older adult prisoner.","after_edit":" These claims also come as teenage prisoner, Liam Ashley , was recently strangled to death in a prison van by a much older adult prisoner.","label":"clarity","raw_intents":["clarity","style","clarity"]}
{"doc_id":106096.0,"context":"noicon|Launch of the Opening Ceremony. 2008 The 27th Young Designers' Exhibition, opened on May 15 at the Taipei World Trade Center and will close at Sunday May 18. It features participation by 87 academic groups in Taiwan and 20 groups from United States, United Kingdom, Italy, Netherlands, New Zealand, and Australia to showcase various achievements in industrial design. It is recognized by the International Council of Societies of Industrial Design (ICSID) as the largest show of student creations. Not only several design competitions, sponsors like International Forum Design (iF), EPSON, MUJI (in Japanese: 無印良品, Mujirushi Ryōhin), Tsann Kuen Trans-nation Group will also showcase different solutions for  design, creative, and cultural industries. In addition , Taiwan Design Center, the show organizer, also designed several site events like \"On-line Graduate Season Show\", \" Carrer Match-up\", \"Creative and Cultural Showcase and Performance\", \"Seminars of YODEX 2008\" to link the actual exhibition with  on-line exhibition. Besides of the early-announced \"Wow! Taiwan Design Award\", winners from \"2008 Young Designers' Competition\" and \"2008 YODEX Interior Design Competition\" will also be announced this Saturday(May 17).","domain":"news","before_edit":" Besides of the early-announced \"Wow!","after_edit":" Besides of the previously announced \"Wow!","label":"clarity","raw_intents":["clarity","clarity","clarity"]}
{"doc_id":23643.0,"context":"An independent investigation ( headed by former Victorian Police Commissioner , Neil Comrie) has revealed that Australian immigration department officials wrongfully deported the Australian citizen Vivian Solon to the Philipines. Ms Solon was deported in March 2001 despite being severly injured after an accident (just before she was found), while her child waited to be picked up from school . The mistake was not officially recognised until April 2005. This incident is on top of the illegal detention of Cornelia Rau, an Australian citizen who was accidentally imprisoned in a detention centre when the immigration department suspected her of being an illegal immigrant. The report indicates that 20 other Australian citizens have also been falsely imprisoned by the immigration department.","domain":"news","before_edit":" The report indicates that 20 other Australian citizens have also been falsely imprisoned by the immigration department.","after_edit":" The report indicates that 20 other Australian citizens have also been unjustly imprisoned by the immigration department.","label":"clarity","raw_intents":["clarity","clarity","meaning-changed"]}
{"doc_id":71477.0,"context":" Memorial's gray panels rise above the crowd. The Minnesota World War II Veterans Memorial was dedicated Saturday on in front of the State Capitol. The memorial features ten glass panels etched with text and scenes from World War II, within a plaza area at the foot of a mall leading to the front entrance to the Capitol. The glass panels are three feet wide, eight feet tall, and mounted on Minnesota granite. Well over twelve thousand people attended. Stan Turner was the Master of Ceremonies during the dedication. The keynote speaker was General John Vessey(Ret. ). Among the many veterans honored were Stan Kowalski and \"Chuck\" Lindberg; the latter was one of those who raised the first flag over Iwo Jima. Contruction was authorized by the State Legislature in 2000.","domain":"news","before_edit":" The keynote speaker was General John Vessey(Ret. ).","after_edit":" The keynote speaker was retired general John Vessey.","label":"clarity","raw_intents":["clarity","clarity","clarity"]}
{"doc_id":51762.0,"context":"Sports presenter for 3 News has given an unsatisfactory letter of apology after he abused a taxi driver in Taupo while he was drunk. The taxi driver, Mere Wall, was verbally abused by Brown on September 13 where he, allegedly, called Wall a \"Tuwharetoa whore and bitch,\" and a \"Tainui whore and bitch.\" Brown was then punched by the partner of a woman he had insulted.  Brown sent an unsigned letter of apology to Wall, which Wall said she received last week , she had asked for one after the incident occurred . Wall said she was unhappy with the letter  and has written to TV3 to complain. Wall said that the letter was two paragraphs long and said that due to a concussion Brown cannot remember the incident  but if he did do something wrong then he is sorry. The letter contained no return address but she said: \"I have written to TV3 [about the letter].\" Wall hopes to get a better apology. However Wall has admitted that she did make some comments about Brown after the incident, Wall said: \"But it has gone on and on.\" Brown was stood down after the incident by TV3 and Roger Beaumont, a spokesman for TV3, said that he is still not back at work and it is unsure when,  if, he returns . \"The investigation is still continuing. TV3 and police were investigating the incident but it is not known how long the investigation would take.\" TV3 was also conducting their own investigation of which included hiring a private investigator. They said that they are not ruling out any disciplinary action if the allegations are proved to be correct.","domain":"news","before_edit":" Wall hopes to get a better apology.","after_edit":" ","label":"coherence","raw_intents":["coherence","clarity","coherence"]}
{"doc_id":71098.0,"context":"President Bush and President Putin sign the Strategic Offensive Reductions Treaty in 2002. Just one day before the G8 summit, a testy situation involving Russian President Vladimir Putin and United States President URLe W. Bush has flared up yet again with President Bush criticizing Russia for \"derailing\" its promised democratic reforms. President Bush also attacked China in this speech, saying that \"[China's leaders] believe that they can continue to open the nation's economy without also opening its political system\". Kremlin spokesman Dmitry Peskovsaid that Russia \"cannot agree on his declaration about the derailing of democratic reforms\", adding that \"Russia is a democratic country that shares common world and common European values.\" Bush has stated that Russia is not an enemy and that \"the Cold War is over.\"","domain":"news","before_edit":" Bush has stated that Russia is not an enemy and that \"the Cold War is over.\"","after_edit":" Bush  stated that Russia is not an enemy and that \"the Cold War is over.\"","label":"coherence","raw_intents":["coherence","fluency","coherence"]}
{"doc_id":2795820.0,"context":"The for by reports disputed by the Russian Consul  shot and killed an attacker on Thursday, after two individuals attempted to commit a robbery. As reported, lawyer Marcos Cesar Feres Braga so-named by the newspaper working for the , was driving with his family through the suburb of near the main complex when the incident occurred. According to reports from the Rio newspaper , the 60-year-old man, his wife, and his daughter were stopped in traffic  due to the procession in a nearby neighbourhood. Two individuals on motorbikes approached and used a gun to smash the car window. Braga, trained and considered an expert according to reports in , took control of the attacker's firearm and proceeded to shoot dead the alleged attacker, while the second suspect fled the scene. Rio de Janeiro's homicide branch has released a statement in relation to the incident. \"The vice consul got into a physical struggle with the assailant  and during the fight the aggressor's weapon fired shots. The assailant died of his wounds on the spot.\" However, Russia's Consul General Vladimir Tokmakov has released a statement claiming no Russian diplomats or employees of the consulate general were involved in the incident. \"Information circulating in the Brazilian press about the alleged shooting [...] of a Brazilian national by a Russian diplomat during an armed robbery does not reflect reality \".","domain":"news","before_edit":" However, Russia's Consul General Vladimir Tokmakov has released a statement claiming no Russian diplomats or employees of the consulate general were involved in the incident.","after_edit":"  Russia's Consul General Vladimir Tokmakov has released a statement claiming no Russian diplomats or employees of the consulate general were involved in the incident.","label":"coherence","raw_intents":["clarity","coherence","coherence"]}
{"doc_id":62050.0,"context":"The Agency's electronic systems apparently transposed the birth date and the user's Social Insurance Number (the Canadian equivalent to the U.S. Social Security Number) and thus corrupted all electronic databases. A reference to the incident in the news aggregator site Slashdot%DIFDELCMD < %DIFDELCMD < %%% states that no returns - not even paper ones - can be accepted, \" paper based returns will be stacking up in the mail room, as returns cannot be filed at all until the problem is fixed. \" This could be inferred from the first paragraph of the article in the Star, which reads \"a problem with electronic filing is making it impossible even to submit tax returns to the Canada Revenue Agency.\" The remainder of the article in the Star says nothing about their system for accepting paperreturns, only about the on-line and telephone systems. A check of the taxing authority's website regarding the issue states \"We have temporarily shut down public access to electronic services to ensure the integrity of taxpayer information.\" and that \"We have now traced the source of the problem to software maintenance conducted on March 4, 2007. We are currently working to bring all systems back online gradually.\" Again, while this may imply that the agency is unable to process all returns - even ones filed on paper - that is not explicitly stated, i.e. don't get your hopes up that you'll get away with a long delay in filing. An article in The Globe and Mail states that taxpayers \"can wait for Netfile to return to service, or they can print their returns and mail them to the CRA\" which indicates that the paper-based systems are unaffected . The deadline for Canadians to submit tax returns is April 30. CRA IT specialists are working on the computer system and have traced the source of the problem to software maintenance conducted on March 4, 2007. The CRA indicates it is too soon to speculate on whether the filing deadline will be extended. They expect to restore all services, including EFile and Netfile, well in advance of the filing deadline.","domain":"news","before_edit":"The Agency's electronic systems apparently transposed the birth date and the user's Social Insurance Number (the Canadian equivalent to the U.S. Social Security Number) and thus corrupted all electronic databases.","after_edit":"","label":"coherence","raw_intents":["clarity","coherence","coherence"]}
{"doc_id":106096.0,"context":"noicon|Launch of the Opening Ceremony. 2008 The 27th Young Designers' Exhibition, famed as the largest show of students' creations, recognized by International Council of Societies of Industrial Design (ICSID) since last year, started at Taipei World Trade Center today and will close at Sunday (May 18) with participations from 87 academical and industrial units in Taiwan and 20 units from United States, United Kingdom, Italy, Netherlands, New Zealand, and Australia to showcase varied achievements from design industry. Besides for the early-announced \"Wow! Taiwan Design Award\", winners from \"2008 Young Designers  Competition\" and \"2008 YODEX Interior Design Competition\" will also be announced in this Saturday (May 17).","domain":"news","before_edit":" 2008 The 27th Young Designers' Exhibition, famed as the largest show of students' creations, recognized by International Council of Societies of Industrial Design (ICSID) since last year, started at Taipei World Trade Center today and will close at Sunday (May 18) with participations from 87 academical and industrial units in Taiwan and 20 units from United States, United Kingdom, Italy, Netherlands, New Zealand, and Australia to showcase varied achievements from design industry.","after_edit":" 2008 The 27th Young Designers' Exhibition, famed as the largest show of students' creations, recognized by International Council of Societies of Industrial Design (ICSID) since last year, started at Taipei World Trade Center today and will close at Sunday (May 18) with participations from 87 academical  units in Taiwan and 20 units from United States, United Kingdom, Italy, Netherlands, New Zealand, and Australia to showcase varied achievements from design industry.","label":"coherence","raw_intents":["coherence","coherence","coherence"]}
{"doc_id":34841.0,"context":"\"Truth is - it may have very little to do with Bush's visit,\" writes Indian blogger Neha Viswanathan on the Global Voices email list, run by the Harvard Berkman Center for Law & Society  . \"The anti-Bush protest has hardly found a voice online. I really do think this might be the first of other blocks. This might be on a very experimental basis to see how far they go. The Pakistani govt has hardly had any dialogue with bloggers at all. \" Other bloggers see a more direct connection with the Bush visit. \"I have communicated with several bloggers and friends back in Pak[istan],\" writes UAE-based Pakistani blogger Omer Alvie. \"So far there's no resolution to this problem. Bush's visit in Pakistan is resulting in protests, strike (in Lahore city) and curfew areas in Islamabad. The feeling among bloggers is this is all rather suspect. Neha, might be right this might be on experimental basis. I feel this a a precursor to what the government can do in the future.\"","domain":"news","before_edit":"\"Truth is - it may have very little to do with Bush's visit,\" writes Indian blogger Neha Viswanathan on the Global Voices email list, run by the Harvard Berkman Center for Law & Society  . \"The anti-Bush protest has hardly found a voice online.","after_edit":"\"Truth is  it may have very little to do with Bush's visit,\" writes Indian blogger Neha Viswanathan on the Global Voices email list, run by the Harvard Berkman Center for Law & Society  . \"The anti-Bush protest has hardly found a voice online.","label":"fluency","raw_intents":["others","fluency","fluency"]}
{"doc_id":74857.0,"context":"The political involvement of most media and other factors are causing contradictions among official sources that are making press work extremely hard. Moreover, nobody is permitted to reach the accident location. The site of the accident was closed to visitors following the intoxication of three TV journalists who got too close. Location of the cloud Map highlighting Lviv, the site of the derailment, in the Lviv Oblast. TV channel Novyj Kanal translated a telephonic interview with officers from the Ministry of Internal Affairs  during which the existence of any cloud whatsoever is firmly denied. Immediately after the interview  a press conference by Kiev mayor , Mr. Leonid Chernovezkij, announces that starting next Monday a daily report about the movements of the same cloud will be available to the population. The service will be provided by the Kiev administration. In an interview to TV channel UT-1  an officer of the ecological service admitted that they have no real data about the area closer to the accident, because not even government officers are permitted to reach it. The officer said that most data about the hypothetical movements of the cloud (if the cloud exists) are made based on computer simulations they receive from Russian vendors, because no such simulation model is currently available in the Ukraine. The closest available on spot measures are related to areas located several kilometers away from the epicentre. Removal operation In the same press release  the Mayor of Kiev also announced that no transport of whatever dangerous material will be allowed in the town area. The removal by railway of the phosphor containers involved in the accident was originally planned for today. Its unclear how Kievs transit refusal may affect the operationand whether the mayor has the authority to block national traffic on the railways. According to the Press Manager of the Ministery for Emergency Situations, Mr. Igor Krol', four containers will be lifted and put back on the rails today. Five containers have already been lifted. Yet the weather may affect the operations, as violent storms and very strong winds are expected in the area. This is going to introduce a serious risk factor for the phosphor that still remains on the ground. The contaminating products are in fact insulated from the air by means of pillows made of air and foam; a strong wind may cause new emergencies by even just partially removing such insulation structures. Yushchenko issued an official call to speed up the closure of the Chernobyl atomic power plants on July , 20. Immediately after he left the country with his family for an unofficial visit to Poland, that will be followed by an official visit to Germany. He is expected to travel to Germany on the evening of July 21. The Ukraine Procuror General, Mr. Aleksandr Medvedenko, declares to the press that he has visited the accident site together with the President, and that all necessary measures are being taken, both for the liquidation of the accident and the defense of the civilian population. He notes that \"it takes courage to work there, for the personnel of the Ministry for Emergency Situations\". He announces that a complex cycle of medical care is being planned for about 1500 children of the affected area. In the same interview  the Procuror General announces that the Government of Kazakhstan will accept being returned the phosphor left (the goods were originally from Kazakhstan). Yet in the same hours the director of Kazphosphat (the vendor ) declares in an interview to the newspaper Segodnja that he gathers that \"the phosphor will be stocked in the Ukraine, because it makes no sense to transfer it back. Moreover, you can hardly imagine that Russia would accept the passage of such a dangerous damaged load on their railways\".","domain":"news","before_edit":" Yushchenko issued an official call to speed up the closure of the Chernobyl atomic power plants on July , 20. Immediately after he left the country with his family for an unofficial visit to Poland, that will be followed by an official visit to Germany.","after_edit":" Yushchenko issued an official call to speed up the closure of the Chernobyl atomic power plants on July  20. Immediately after he left the country with his family for an unofficial visit to Poland, that will be followed by an official visit to Germany.","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":15757.0,"context":"Today the Hewlett-Packard Co. has announced that it will be cutting 10\\% or 14,500 of it's full-time staff wil be cut over the course of the next six quarters. HP CEO Mark Hurd, who 's had office for just about three months now , has decided that he wishes to simplify HP's operations by combining sales and marketing directly into business units. The job cuts are expected to save HP  $1.9 billion US annually. These cuts are all part of HP's new restructuring plan, the savings from this restructuring will primarily be  to offset market forces or in other words, to strengthen HP's competitiveness in the market. The job cuts come after prolonged analyst speculation that HP would be announcing between 10,000 and 25,000 losses. Few losses are expected in the areas of Sales nor in Research & Development. The media in Ireland, where HP has over 4,000 employees across seven business units, has reacted cautiously to the announcement urging that more details should be waited for before making any comments. The news however has made national headlines and workers are understandably anxious to find out more details.","domain":"news","before_edit":" The job cuts are expected to save HP  $1.9 billion US annually.","after_edit":" The job cuts are expected to save HP  $1.9 billion  annually.","label":"fluency","raw_intents":["fluency","fluency","coherence"]}
{"doc_id":2785753.0,"context":"Official Presidential portrait. , former President of , was detained yesterday as part of ongoing investigations into a corruption related to , the state-run oil company. A raid occurred at 06:00 local time ( 09:00 ) at a number of locations including President Lula's house in , near . Following the occurrence, president Lula was held for questioning for three hours before being released. The former president allegedly has been involved in the corruption at the state oil company including kickbacks from suppliers including both cash payments and property. The current president, , said Lula's detention was \"unnecessary\". President Rousseff is currently under threat of impeachment and is alleged by her opponents to also be involved in the Petrobras bribery accusations under investigation by (Operation Car Wash).","domain":"news","before_edit":" , former President of , was detained yesterday as part of ongoing investigations into a corruption related to , the state-run oil company.","after_edit":" , former President of , was detained yesterday as part of ongoing investigations into  corruption related to , the state-run oil company.","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":57047.0,"context":"New Zealand has been given extra time to prepare for the two week event  with the postponement of the championships start until November instead of the planned date of July . New Zealand's netball team,  Silver Ferns, coach, Ruth Aitken, said that the time they have to prepare is usually when the team has its rest period. However she is delighted  New Zealand is the hosts . Netball New Zealand has not yet announced the venue where the championships will be played but have announced that it will be either Auckland or Christchurch. Don Mackinnon, chair of the Netball New Zealand board, said that other venues are not being considered because it would become too difficult because of the time constraints. The decision will be announced in a couple of weeks. New Zealand are the current world champions as they won the last championships held in Jamaica. New Zealand had held a championship in 1999. Australia was unable to host the championships as they could not prepare in the allocated time. Jamacia and England both showed interest in hosting the championships.","domain":"news","before_edit":"New Zealand has been given extra time to prepare for the two week event  with the postponement of the championships start until November instead of the planned date of July .","after_edit":"New Zealand has been given extra time to prepare for the two week event , with the postponement of the championships start until November instead of the planned date of July .","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":111017.0,"context":"200px|Map of the Menominee River. Scott J. Johnson, 38, of Kingsford, Michigan was charged on Wednesday with killing three teenagers in a shooting on the Menominee River near Niagara, Wisconsin. Johnson was charged with first-degree intentional homicide. Authorities say he went to the popular bathing spot near the East Kingsford Railroad Bridge on July 31 and opened fire with a military-style rifle, killing three and injuring one. The Associated Press reports that he faces life in prison without parole if convicted . Wisconsin does not have the death penalty. However, as one of the bodies was found on the Michigan side of the border, he could potentially face charges there, or perhaps even in federal court. He is being represented by a public defender, Len Kachinsky. Local teens said Johnson often was seen at the site, but mostly kept to himself. On July 31, the Associated Press reports  he emerged from the woods wearing camouflage clothing and opened fire without saying a word. Johnson fled and surrendered the next day after a multi-agency manhunt. Johnson had been accused of a sexual assault, and his mother speculated he may have panicked after hearing police wanted to speak with him. The Detroit Free Press reports that  in a confession to police, Johnson said the shooting was set in motion when Johnson lured the woman to the bridge the day before and sexually assaulted her. Worried that he would be arrested, Johnson returned to the woods, planning to ambush law enforcement officers coming to find him. After he spent a night in the woods and no officers came, he returned home at 10 a.m.  on July 31, asked his mother if police had been looking for him, then left at 3:00 p.m. He says he then got his weapons and returned to the woods. Johnson said he planned to wait for the teens to reach the Michigan side of the river so he could kill them all and use them as \"bait\" to lure police into his ambush. However, Spigarelli and Pohlson unexpectedly approached his position, and he said he felt trapped and he opened fire. Spigarelli and Pohlson were both shot in the head and died instantly. Johnson then reloaded and fired across the river, killing Bryan Mort.","domain":"news","before_edit":" After he spent a night in the woods and no officers came, he returned home at 10 a.m.  on July 31, asked his mother if police had been looking for him, then left at 3:00 p.m.","after_edit":" After he spent a night in the woods and no officers came, he returned home at 10 a.m. local time on July 31, asked his mother if police had been looking for him, then left at 3:00 p.m.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":99200.0,"context":"The ruins of a Palestinian village. The town of Kiryat Yam in Israel is suing Internet corporation Google over an alleged inaccuracy in its Google Earth software, which claims the town was built over the ruins of an Arab village. However, town official Naty Keyzilberman says this \"obviously cannot be true, because Kiryat Yam was founded in 1945\". The Palestinian exodus, in which hundreds of thousands of Arabs abandoned their villages due to the Arab-Israeli War, occurred in 1948, three years after Keyzilberman says the town was founded. The town filed a slander complaint with Israel police, he says. The town 's claim is supported by Yossi Ben-Artzi, a history professor at the University of Haifa, who said, \"Kiryat Yam was built on sand dunes, and there wasn't any Palestinian village in the area. The lands were bought in 1939 by the Gav Yam construction company.\"","domain":"news","before_edit":" The town filed a slander complaint with Israel police, he says.","after_edit":" The city filed a slander complaint with Israel police, he says.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","clarity"]}
{"doc_id":78730.0,"context":"At the annual European Society of Cardiology Summit in Vienna, Austria, a female cardiologist has suffered a heart attack in front of her colleagues . The 46-year-old Italian woman collapsed on Sunday and was immediately revived by one of her fellow heart specialists . The woman was transferred to the general hospital in Vienna, where she  died later that day . Reinhard Krepler, chief doctor of the hospital, stated that her death was due to a congenital heart problem .","domain":"news","before_edit":" The 46-year-old Italian woman collapsed on Sunday and was immediately revived by one of her fellow heart specialists .","after_edit":" The 46-year-old Italian woman collapsed on Sunday and was immediately revived using a defibrillator .","label":"meaning-changed","raw_intents":["meaning-changed","style","meaning-changed"]}
{"doc_id":146168.0,"context":"A second day of winter weather and snow has caused further disruption in the UK. At 15:13 GMT  , one Wikinews contributor in West Lothian described the conditions there as 'white-out', although later conditions were reported to have improved. Forecasters have indicated further snow in Scotland later this evening , with some higher ground experiencing as much as 15 centimetres into Sunday  . Heavy snow for parts of Northern England is also forecast.","domain":"news","before_edit":" At 15:13 GMT  , one Wikinews contributor in West Lothian described the conditions there as 'white-out', although later conditions were reported to have improved.","after_edit":" At 15:13 GMT (December 19th) , one Wikinews contributor in West Lothian described the conditions there as 'white-out', although later conditions were reported to have improved.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":100524.0,"context":"360px|Executives at the press conference of 2008 APRICOT (from left to right): Philip Smith, Gaurab Raj Upadhaya (Chairman of Asia & Pacific Internet Association), Tony Teng, and Feipei Lai. The twelfth-annual Asia Pacific Regional Internet Conference on Operational Technologies (a.k.a APRICOT) , returned to Taiwan this year at  Taipei Howard Plaza Hotel ; the first appearance since the 2003 conference held by the Taiwan Network Information Center (TWNIC) at the Taipei International Convention Center and Grand Hyatt Taipei. As Wikinews Journalist Rico Shen reported on the recent \"Edison Chen photo scandal\" incident, he commented: Workshops with varied topics and different technology levels took place from February 20 to 24, while several main seminars and speeches for industry, governmental, and academic executives ran from February 25 to 29. Several industry experts such as Wilfred Kwan (Chief Technology Officer of AsiaNetCom), Chung-laung Liu ( ISOC Taiwan Chapter Chair  ), and Maemura Akinori (EC Chair of APNIC) will give several speeches related to the Internet industry at the conference.","domain":"news","before_edit":" Several industry experts such as Wilfred Kwan (Chief Technology Officer of AsiaNetCom), Chung-laung Liu ( ISOC Taiwan Chapter Chair  ), and Maemura Akinori (EC Chair of APNIC) will give several speeches related to the Internet industry at the conference.","after_edit":" Several industry experts such as Wilfred Kwan (Chief Technology Officer of AsiaNetCom), Chung-laung Liu ( ISOC Taiwan Chapter Chair of ISOC ), and Maemura Akinori (EC Chair of APNIC) will give several speeches related to the Internet industry at the conference.","label":"meaning-changed","raw_intents":["meaning-changed","clarity","meaning-changed"]}
{"doc_id":42007.0,"context":"Blocked Berliner Platz Up to 7,000 people took to the streets in w: Gieen today, protesting the planned introduction of tuition fees at Hessian universities. Beginning at 1pm CEST (1100 UTC), students, pupils and ordinary citizens marched through much of downtown Gieen in the biggest demostration the city has seen in years. Since 4pm , at least 200 people also blocked the Berliner Platz, the most important inner city crossing, bringing most of the downtown bus and car traffic to a standstill. The police has threated to clear the crossing by force.  Sour","domain":"news","before_edit":"Blocked Berliner Platz Up to 7,000 people took to the streets in w: Gieen today, protesting the planned introduction of tuition fees at Hessian universities.","after_edit":"Blocked Berliner Platz Up to 7,000 people took to the streets in  Gieen today, protesting the planned introduction of tuition fees at Hessian universities.","label":"others","raw_intents":["others","others","others"]}
{"doc_id":33229.0,"context":"Neil Entwistle, 27, appeared before a Magistrates' court today and agreed to be extradited to the United States to face double-murder  charges. Entwistle is now the prime suspect in the murders of his wife Rachel, 27, and nine-month old baby daughter Lillian. Both were shot to death and left under a pile of blankets in the bedroom of their home in Hopkinton, Massachusetts  . Entwistle was reportedly planning a murder suicide, but decided not to kill himself and instead bought a one-way ticket to England where he was with family  .","domain":"news","before_edit":"Neil Entwistle, 27, appeared before a Magistrates' court today and agreed to be extradited to the United States to face double-murder  charges.","after_edit":"Neil Entwistle, 27, appeared before a Magistrates' court today and agreed to extradition to the United States to face double-murder  charges.","label":"others","raw_intents":["others","clarity","fluency"]}
{"doc_id":2795820.0,"context":"The for by reports disputed by the Russian Consul  shot and killed an attacker on Thursday, after two individuals attempted to commit a robbery. As reported, lawyer Marcos Cesar Feres Braga so-named by the newspaper working for the , was driving with his family through the suburb of near the main complex when the incident occurred. According to reports from the Rio newspaper , the 60-year-old man, his wife, and his daughter were stopped in traffic  due to the procession in a nearby neighbourhood. Two individuals on motorbikes approached and used a gun to smash the car window. Braga, trained and considered an expert according to reports in , took control of the attacker's firearm and proceeded to shoot dead the alleged attacker, while the second suspect fled the scene. Rio de Janeiro's homicide branch has released a statement in relation to the incident. \"The vice consul got into a physical struggle with the assailant  and during the fight the aggressor's weapon fired shots. The assailant died of his wounds on the spot.\" However, Russia's Consul General Vladimir Tokmakov has released a statement claiming no Russian diplomats or employees of the consulate general were involved in the incident. \"Information circulating in the Brazilian press about the alleged shooting [...] of a Brazilian national by a Russian diplomat during an armed robbery does not reflect reality \".","domain":"news","before_edit":" According to reports from the Rio newspaper , the 60-year-old man, his wife, and his daughter were stopped in traffic  due to the procession in a nearby neighbourhood.","after_edit":" According to reports from the Rio newspaper , a 60-year-old man, his wife, and his daughter were stopped in traffic  due to the procession in a nearby neighbourhood.","label":"others","raw_intents":["others","others","others"]}
{"doc_id":45781.0,"context":"Temperatures are nearing 100F (38C). 80 mph (130 km\/h) winds accompanied by heavy rain caused many tree limbs to fall, some onto cars, some onto thoroughfares, and some on high-tension power lines that supply the city. It also caused at least three building collapses. After 160,000 people have had their power restored,  500,000 people are without power. Three hundred national guardsmen join volunteers, policemen and firefighters in aiding people during the crisis. Vulnerable residents in nursing homes and centers for the elderly are being evacuated. Cookies and water are being distributed to those needing them.  Ice was in short supply as customers grabbed all they could get their hands on. The local power company, AmerenUE, estimated that as of 10:26 p.m. local Central time on the 20th, 418,195 customers had no electricity. Sour","domain":"news","before_edit":" The local power company, AmerenUE, estimated that as of 10:26 p.m. local Central time on the 20th, 418,195 customers had no electricity. Sour","after_edit":" The local power company, AmerenUE, estimated that as of 10:26 p.m. local Central time on the 20th, 418,195 customers had no electricity. ","label":"others","raw_intents":["others","others","others"]}
{"doc_id":2795820.0,"context":"The for by reports disputed by the Russian Consul  shot and killed an attacker on Thursday, after two individuals attempted to commit a robbery. As reported, lawyer Marcos Cesar Feres Braga so-named by the newspaper working for the , was driving with his family through the suburb of near the main complex when the incident occurred. According to reports from the Rio newspaper , the 60-year-old man, his wife, and his daughter were stopped in traffic  due to the procession in a nearby neighbourhood. Two individuals on motorbikes approached and used a gun to smash the car window. Braga, trained and considered an expert according to reports in , took control of the attacker's firearm and proceeded to shoot dead the alleged attacker, while the second suspect fled the scene. Rio de Janeiro's homicide branch has released a statement in relation to the incident. \"The vice consul got into a physical struggle with the assailant  and during the fight the aggressor's weapon fired shots. The assailant died of his wounds on the spot.\" However, Russia's Consul General Vladimir Tokmakov has released a statement claiming no Russian diplomats or employees of the consulate general were involved in the incident. \"Information circulating in the Brazilian press about the alleged shooting [...] of a Brazilian national by a Russian diplomat during an armed robbery does not reflect reality \".","domain":"news","before_edit":" According to reports from the Rio newspaper , the 60-year-old man, his wife, and his daughter were stopped in traffic  due to the procession in a nearby neighbourhood.","after_edit":" According to reports from the Rio newspaper , the 60-year-old man, his wife, and his daughter were stopped in traffic , due to the procession in a nearby neighbourhood.","label":"others","raw_intents":["others","others","others"]}
{"doc_id":70914.0,"context":"\"The dead included a 4-year-old boy, who was sleeping with his mother when the earth-built walls of their house collapsed in the quake and buried him and half of the body of his mother  ,\" the Xinhua News Agency said. \"The mother was rescued but the boy was killed.\" \"The earthquake has left two people dead, 15 seriously injured and 192 slightly hurt in ( Ning'er ) county. Some houses near the county collapsed and roads are destroyed . The communication network, and water and power supplies to the county, are also affected,\" Reuters quoted rescue officials as saying. Ning'er county is home to 190,000 people.","domain":"news","before_edit":" \"The mother was rescued but the boy was killed.\" \"The earthquake has left two people dead, 15 seriously injured and 192 slightly hurt in ( Ning'er ) county.","after_edit":" \"The mother was rescued but the boy was killed.\" \"The earthquake has left two people dead,  seriously injured and 192 slightly hurt in ( Ning'er ) county.","label":"style","raw_intents":["style","style","others"]}
{"doc_id":10439.0,"context":"Italian police officers and guardians are going on trial for alleged abuse of anti-globalization protesters during the G8 meeting in Genoa in 2001. Reports made by over 250 participants in the event detail verbal and physical abuse. The police allegedly took detainees to a holding center outside the city, where they say they were verbally and physically abused,  threatened with rape , and spat at . In one alleged incident, the guards forced a woman's head down a toilet. Another allegation is that asphyxiating gas was sprayed at protesters in their cells. Over 60 people were injured while being taken into custody, three critically. One 23-year old protester was shot dead. Twenty-five of the 250 were brought up on minor charges of looting and ransacking. The police alleged that 93 protesters were in possession of dangerous weapons and resisted arrest, yet Genoa prosecutors  dropped all charges against them. Meanwhile, the police face accusations of planting evidence , and fabricating charges against the demonstrators. Unfortunately, due to delays in bringing the authorities to justice, the 5-year statute of limitations has expired on the major charges .","domain":"news","before_edit":" Reports made by over 250 participants in the event detail verbal and physical abuse.","after_edit":" Reports made by over 250 people people who attended the event have detailed verbal and physical abuse.","label":"style","raw_intents":["style","style","clarity"]}
{"doc_id":10439.0,"context":"Italian police officers and guardians are going on trial for alleged abuse of anti-globalization protesters during the G8 meeting in Genoa in 2001. Reports made by over 250 participants in the event detail verbal and physical abuse. The police allegedly took detainees to a holding center outside the city, where they say they were verbally and physically abused,  threatened with rape , and spat at . In one alleged incident, the guards forced a woman's head down a toilet. Another allegation is that asphyxiating gas was sprayed at protesters in their cells. Over 60 people were injured while being taken into custody, three critically. One 23-year old protester was shot dead. Twenty-five of the 250 were brought up on minor charges of looting and ransacking. The police alleged that 93 protesters were in possession of dangerous weapons and resisted arrest, yet Genoa prosecutors  dropped all charges against them. Meanwhile, the police face accusations of planting evidence , and fabricating charges against the demonstrators. Unfortunately, due to delays in bringing the authorities to justice, the 5-year statute of limitations has expired on the major charges .","domain":"news","before_edit":" Meanwhile, the police face accusations of planting evidence , and fabricating charges against the demonstrators.","after_edit":" Meanwhile, the police have been charged with planting evidence and fabricating charges against the demonstrators.","label":"style","raw_intents":["style","style","style"]}
{"doc_id":85743.0,"context":"Silvio Berlusconi shaking the hand of US President URLe W. Bush. Wiretaps disclosed by Italian daily La Repubblica have upset Italian politics. The conversations suggest that RAI (Italian state television) and private rival Mediaset ( owned by Silvio Berlusconi ) made arrangements to favour Berlusconi himself when he was Prime Minister of Italy. In these conversations  RAI and Mediaset managers discussed how to present Berlusconi's defeat at the last elections in news programmes and talk shows and the decision to delay announcement of the bad results. This is not the first time Berlusconi is accused of controlling the Italy's media. Mr Berlusconi did not comment the allegations but one of his closer men , Renato Schifani, said that \"This is a media operation [...  ] precise objective of destroying Mr Berlusconi's companies\". Moreover Mediaset said it would sue La Repubblica for these allegations. On the other side Walter Veltroni, the leader of the opposing party, said \"What has emerged is extremely serious\" and asked an internal investigation at RAI.","domain":"news","before_edit":" Mr Berlusconi did not comment the allegations but one of his closer men , Renato Schifani, said that \"This is a media operation [...  ] precise objective of destroying Mr Berlusconi's companies\".","after_edit":"  Berlusconi did not comment the allegations but one of his closer men , Renato Schifani, said that \"This is a media operation [...  ] precise objective of destroying Mr Berlusconi's companies\".","label":"style","raw_intents":["clarity","style","style"]}
{"doc_id":57897.0,"context":"Donor highlighted on New Zealand driver licence. Figures released today show that the number URLans donated by New Zealanders in 2006 has decreased by four to the new record low of 25. In 2005 the number URLans donated equalled 29, a previous record low in New Zealand. Doctor Jackie Blue, National member of Parliament, has partnered with Mr Tookey and together they have proposed a change to the current law and is against the current law change proposal by the government, which he claims will give more power to reduce the donor rate . Mr Tookey said that the government's proposal gives the power of other people to \"veto your wish to be a donor.\" New Zealand is in between Iceland and Mexico for the amount URLans donated. Spain, America and the United Kingdom are the top three countries for URLans with 25 donors per million population, 21 donors and 10.7 donors respectively.","domain":"news","before_edit":" New Zealand is in between Iceland and Mexico for the amount URLans donated.","after_edit":" New Zealand is in between Iceland and Mexico for the numbers URLans donated.","label":"style","raw_intents":["style","style","style"]}
{"doc_id":33780062.0,"context":"After the explosion, initial reports indicated that it had happened at a CNG station, but this was later denied. Iranian officials said that the blast at the missile base was an accident, and ruled out any URLanized by the United States and its regional allies. The Army of the Guardians of the Islamic Revolution said that the explosion \"had taken place in an missile arms depot when munitions were being moved\". On the Iranian parliament's website, icana.ir, Parviz Soroori, an Iranian MP, was quoted as saying, \"No sabotage was involved in this incident. It has nothing to do with politics\". However, Time magazine cited a \"western intelligence source\" as saying that Mossad was behind the blast, and other reports, which were attributed to western intelligence services , also mentioned the involvement of Israel's intelligence services. Speaking to The Guardian on condition of anonymity, an official with close links to the Iranian Government in Iran said that he believed the Bid Kaneh explosion was \"part of the covert war against Iran, led by Israel\".","domain":"wiki","before_edit":" However, Time magazine cited a \"western intelligence source\" as saying that Mossad was behind the blast, and other reports, which were attributed to western intelligence services , also mentioned the involvement of Israel's intelligence services.","after_edit":" However, Time magazine cited a \"western intelligence source\" that Israeli intelligence agency Mossad had orchestrated the explosion; other reports, which were attributed to western intelligence services , also mentioned the involvement of Israel's intelligence services.","label":"clarity","raw_intents":["clarity","others","style"]}
{"doc_id":55503854.0,"context":"Relation to traditional epistemology Traditional epistemology and Bayesian epistemology are both forms of epistemology, but they differ in various respects, for example, concerning their methodology, their interpretation of belief , the role justification or confirmation plays in them and some of their research interests. Traditional epistemology focuses on topics such as the analysis of the nature of knowledge, usually in terms of justified true beliefs , the sources of knowledge , like perception or testimony, the structure of a body of knowledge, for example in the form of foundationalismor coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all . These inquiries are usually based on epistemic intuitions and regard beliefs as either present or absent . Bayesian epistemology, on the other hand, works by formalizing concepts and problems, which are often vague in the traditional approach. It thereby focuses more on mathematical intuitions and promises a higher degree of precision. It sees belief as a continuous phenomenon that comes in various degrees, so-called credences. Some Bayesians have even suggested that the regular notion of belief should be abandoned. But there are also proposals to connect the two, for example, the Lockean thesis, which defines belief as credence above a certain threshold. Justification plays a central role in traditional epistemology while Bayesians have focused on the related notions of confirmation and disconfirmation through evidence. The notion of evidence is important for both approaches but only the traditional approach has been interested in studying the sources of evidence, like perception and memory. Bayesianism, on the other hand, has focused on the role of evidence for rationality: how someone's credence should be adjusted upon receiving new evidence. There is an analogy between the Bayesian norms of rationality in terms of probabilistic laws and the traditional norms of rationality in terms of deductive consistency. Certain traditional problems, like the topic of skepticism about our knowledge of the external world, are difficult to express in Bayesian terms.","domain":"wiki","before_edit":" Traditional epistemology focuses on topics such as the analysis of the nature of knowledge, usually in terms of justified true beliefs , the sources of knowledge , like perception or testimony, the structure of a body of knowledge, for example in the form of foundationalismor coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all .","after_edit":" Traditional epistemology focuses on topics such as the analysis of the nature of knowledge, usually in terms of justified true beliefs . They then seek to understand what counts as knowledge and how to evaluate one's beliefs (see foundationalism, coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all .","label":"clarity","raw_intents":["clarity","coherence","clarity"]}
{"doc_id":560813.0,"context":"In its purest form, Civil libertarianism is a political philosophy supporting civil liberties, or which emphasize individual rights and personal freedoms over authorities - such as governments , a corporation and\/or social peer pressures . Civil libertarianism is not limited to an individual ideology, rather, it is a philosophy based on a strict interpretation of the Constitution's civil liberties and the many civil rightslaws enacted since . In the libertarian movement The primary concern of most Civil Libertarians is the government's reach over the individual. In theory, the civil libertarian seeks to reduce the role of government to a minimum - preferring private businesses to fill the many social needs for most Americans. Under the control of elected officials, the government is only relied upon for regulation, without excessively interfering in the lives of its citizens. The Civil Libertarian sees the government's role as critical - supporting free enterprise and the privatization of government programs wherever improvements are possible. One of the central pillars of Civil Libertarianism is free speech. In many cases Civil Libertarians oppose bans on hate speech and obscenity. Although they may or may not personally condone behaviors associated with these issues, civil libertarians hold that the advantages of unfettered public discourse outweigh all disadvantages. With the advent of personal computers, the Internet, email, cell phones and other information technology advances a subset of civil libertarianism has arisen that focuses on protecting individuals' digital rights and privacy . Just as acting Democrats and Republicans hold varying degrees of left and right-leaning beliefs; few Civil Libertarians, if any, hold all of the views defined by this philosophy .","domain":"wiki","before_edit":" In theory, the civil libertarian seeks to reduce the role of government to a minimum - preferring private businesses to fill the many social needs for most Americans. Under the control of elected officials, the government is only relied upon for regulation, without excessively interfering in the lives of its citizens.","after_edit":" In theory, the civil libertarian seeks to restrict this relationship to an absolute minimum in which the state can function and provide basic services and securities without excessively interfering in the lives of its citizens.","label":"clarity","raw_intents":["clarity","clarity","meaning-changed"]}
{"doc_id":60043236.0,"context":"Brig. Pritam Singh is an Indian Army Officer, born in Dina Village in Ferozpur, Punjab, India. He fought in the battle in Singapore in 1942. After the war, he promoted to Lt. Colonel. In 1947, he fought against Pakistan in Poonch. Army Life and Struggle Operation Easy. Poonch link-up 1 November 1948 - 26 November 1948 As a young officer, Brig Pritam Singh fought  the battle of Singapore in 1942 and he wounded badly. Opponent Army prisoned Pritam Singh. Somehow he escaped from the prison of the army campand after, six months he reached , Manipur, India. Later, he was awarded the coveted Military Cross for his great show of bravery. Lt Col Pritam Singh was promoted to the rank of Brigadier in December 1948. Poonch withstood a siege by the Pakistanis from November 1947 till relieved by an Indian offensive, Operation Easy on 20 November 1948. The besieged garrison , commanded by Brig. Pritam Singh , was maintained by air supply. Military operations ended with Poonch town and the eastern part of Poonch district in Indian hands and western Poonch in Pakistani hands. In 1951, he faced a court-martial.","domain":"wiki","before_edit":" The besieged garrison , commanded by Brig. Pritam Singh , was maintained by air supply.","after_edit":" The besieged garrison Singh commanded was maintained by air supply.","label":"clarity","raw_intents":["clarity","clarity","clarity"]}
{"doc_id":60043236.0,"context":"Brig. Pritam Singh is an Indian Army Officer, born in Dina Village in Ferozpur, Punjab, India. He fought in the battle in Singapore in 1942. After the war, he promoted to Lt. Colonel. In 1947, he fought against Pakistan in Poonch. Army Life and Struggle Operation Easy. Poonch link-up 1 November 1948 - 26 November 1948 As a young officer, Brig Pritam Singh fought  the battle of Singapore in 1942 and he wounded badly. Opponent Army prisoned Pritam Singh. Somehow he escaped from the prison of the army campand after, six months he reached , Manipur, India. Later, he was awarded the coveted Military Cross for his great show of bravery. Lt Col Pritam Singh was promoted to the rank of Brigadier in December 1948. Poonch withstood a siege by the Pakistanis from November 1947 till relieved by an Indian offensive, Operation Easy on 20 November 1948. The besieged garrison , commanded by Brig. Pritam Singh , was maintained by air supply. Military operations ended with Poonch town and the eastern part of Poonch district in Indian hands and western Poonch in Pakistani hands. In 1951, he faced a court-martial.","domain":"wiki","before_edit":" Later, he was awarded the coveted Military Cross for his great show of bravery.","after_edit":" Later, he was awarded the coveted Military Cross for his  bravery.","label":"clarity","raw_intents":["clarity","clarity","clarity"]}
{"doc_id":7205879.0,"context":"250px|Ziwa ruins, enclosure view from a distance. Ziwa, or Ziwa ruinsformerly Van Niekerk ruins after Major Pompey Van Niekerk who was second in command of the Afrikaner Corps is  the remains of a vast late Iron Age agricultural settlement that has been dated to the 15th century. The site is located in Nyanga District. Ziwa was declared a National Monument in 1946 and is currently under consideration for World Heritage listing. The site contains a large variety of stonework structures including stone terraces running along contours of hills and steep landscapes. Archaeological investigations have also engendered important aspects of pottery and rock art.","domain":"wiki","before_edit":" Ziwa, or Ziwa ruinsformerly Van Niekerk ruins after Major Pompey Van Niekerk who was second in command of the Afrikaner Corps is  the remains of a vast late Iron Age agricultural settlement that has been dated to the 15th century.","after_edit":" Ziwa, or Ziwa ruinsformerly Van Niekerk ruins after Major Pompey Van Niekerk who was second in command of the Afrikaner Corps is an archaeological site in Nyanga District, Zimbabwe, containing the remains of a vast late Iron Age agricultural settlement that has been dated to the 15th century.","label":"coherence","raw_intents":["meaning-changed","coherence","coherence"]}
{"doc_id":40918428.0,"context":"The Brussels Agreement ( \/ Briselski sporazum, ), formally the First Agreement of Principles Governing the Normalisation of Relations, was a multilateral treaty proposed to normalize relations between the nations of Serbia and KosovoAs to the agreement not having been signed, see text of agreement. . The agreement was negotiated and concluded in Brussels under the auspices of the European Union and signed on 19 April 2013. Negotiations were led by Serbian Prime Minister Ivica Dai and Kosovo Prime Minister Hashim Thai and mediated by EU High Representative Catherine Ashton. The government of Serbia does not recognize Kosovo as a sovereign state, but began normalizing relations with the government of Kosovo nonetheless, in accordance with the Brussels URL Background Following the Kosovo War and NATO bombing of Yugoslavia in 1999, Kosovo, as part of Serbia and Federal Republic of Yugoslavia, was placed under United Nations administration under UNSC Resolution 1244. In 2008, Kosovo declared independence and has since been recognized by 96 countries. However, Serbia maintains that Kosovo continues to be its territory. Kosovo has become a member of several URLanizations, while according to Serbia and about half of the UN member states, Resolution 1244 remains legally binding on all parties. The EU-mediated dialogue between Kosovo and Serbia was launched in March 2011, three years after Kosovo declared URL Belgrade and Pristina were urged to continue talks in Brussels, but Serbia was not obliged to recognize Kosovo at any point in the URL Talks Until preset, ten rounds of talks have been held at the European External Action Service office in Brussels. Baroness Ashton, the EU High Representative, had been chairing talks for two years, followed by Federica Mogherini. Normalization of relations with neighboring states is a key precondition for states wishing to join the EU; the Brussels Agreement brought Serbia close to EU accession talks and Kosovo to initialing a Stabilisation and Association Agreement (SAA). The SAA was signed by HR Mogherini and PM Mustafa in October 2015. Removing the parallel Serbian structures in the Northern part of Kosovo remains challenging. 330px|Ivica Dai, Prime Minister of Serbia (left), Catherine Ashton (middle), and Hashim Thai, Prime Minister of Kosovo (right) in Munich, 2014. United States diplomats have supported the EU-led dialogue from the beginning. U.S. Secretary of State Hillary Clinton invited Baroness Ashton to undertake joint travel in the Balkans, and the two made joint visits to Belgrade and Pristina (as well as Sarajevo) in October 2012. Clinton assigned Deputy Assistant Secretary of State ambassador Philip Reeker to support Ashton's efforts. Reeker and his team coordinated closely with EU colleagues and met with Serbian and Kosovar representatives on the margins of every dialogue session in Brussels, and during visits to the region. The result was the 15-point \"First Agreement of Principles Governing the Normalisation of Relations\", initialed but not signed on 19 April 2013. After the agreement was concluded, the European Commission officially advised that work start on an SAA with Kosovo, and accession negotiations began with Serbia. The agreement was supported by the European Union, NATO, the OSCE, and the United Nations. In October 2013, arrangements were made for Serbian officials to visit North Kosovo. It was agreed that electoral bodies in Kosovo would include Kosovo Serb representatives and that international dialing code +383 would be attributed to Kosovo. The new code was expected to go into effect in late 2015 but has again been delayed by Serbia until March 2016. The geographic phone code was implemented in December 2016. The National Assembly of Serbia has not treated the agreement as international and has not ratified it into a binding law, which is a procedure required for international agreements in Serbia.Zakon o zakljucivanju i izvrsenju medjunarodnih ugovora It has, however, merely accepted the government report about the \"hitherto process of political and technical dialog with the temporary institutions in Pristina with the mediation of EU, including the process of implementation of the achieved agreements\".O PRIHVATANjU IZVETAJA O DOSADANjEM PROCESS POLITIKOG I TEHNIKOG DIJALOGA SA PRIVREMENIM INSTITUCIJAMA SAMOUPRAVE U PRITINI UZ POSREDOVANjE EVROPSKE UNIJE, UKLjUUJUI PROCES IMPLEMENTACIJE POSTIGNUTIH DOGOVORA The constitutional court in Belgrade did not answer the question about constitutionality of the agreement, stating in December 2014 that the issue raised is a political question, and not a legal one. Serbia has accepted, however, that progress in implementing the Brussels agreement is a prerequisite for EU accession talks within the opening of Chapter 35 negotiations in December 2015.","domain":"wiki","before_edit":" The result was the 15-point \"First Agreement of Principles Governing the Normalisation of Relations\", initialed but not signed on 19 April 2013.","after_edit":" ","label":"coherence","raw_intents":["coherence","coherence","clarity"]}
{"doc_id":20529614.0,"context":"Post-trial commutation of death sentence  Peterson maintains his innocence. Peterson was granted post-conviction relief and re-sentenced to  120 years in prison December 12, 2004. His sentence was later commuted to 120 years in prison. He is scheduled for release on April 16th, 2051 according to the Indiana Department of Corrections .","domain":"wiki","before_edit":" His sentence was later commuted to 120 years in prison.","after_edit":" ","label":"coherence","raw_intents":["coherence","clarity","coherence"]}
{"doc_id":7205879.0,"context":"250px|Ziwa ruins, enclosure view from a distance. Ziwa, or Ziwa ruinsformerly Van Niekerk ruins after Major Pompey Van Niekerk who was second in command of the Afrikaner Corps is  the remains of a vast late Iron Age agricultural settlement that has been dated to the 15th century. The site is located in Nyanga District. Ziwa was declared a National Monument in 1946 and is currently under consideration for World Heritage listing. The site contains a large variety of stonework structures including stone terraces running along contours of hills and steep landscapes. Archaeological investigations have also engendered important aspects of pottery and rock art.","domain":"wiki","before_edit":" The site is located in Nyanga District.","after_edit":" ","label":"coherence","raw_intents":["coherence","clarity","coherence"]}
{"doc_id":60043236.0,"context":"Brig. Pritam Singh is an Indian Army Officer, born in Dina Village in Ferozpur, Punjab, India. He fought in the battle in Singapore in 1942. After the war, he promoted to Lt. Colonel. In 1947, he fought against Pakistan in Poonch. Army Life and Struggle Operation Easy. Poonch link-up 1 November 1948 - 26 November 1948 As a young officer, Brig Pritam Singh fought  the battle of Singapore in 1942 and he wounded badly. Opponent Army prisoned Pritam Singh. Somehow he escaped from the prison of the army campand after, six months he reached , Manipur, India. Later, he was awarded the coveted Military Cross for his great show of bravery. Lt Col Pritam Singh was promoted to the rank of Brigadier in December 1948. Poonch withstood a siege by the Pakistanis from November 1947 till relieved by an Indian offensive, Operation Easy on 20 November 1948. The besieged garrison , commanded by Brig. Pritam Singh , was maintained by air supply. Military operations ended with Poonch town and the eastern part of Poonch district in Indian hands and western Poonch in Pakistani hands. In 1951, he faced a court-martial.","domain":"wiki","before_edit":" Opponent Army prisoned Pritam Singh. Somehow he escaped from the prison of the army campand after, six months he reached , Manipur, India.","after_edit":" He was imprisoned by the enemy, but escaped from the prison of the army campand after, six months he reached , Manipur, India.","label":"coherence","raw_intents":["coherence","clarity","coherence"]}
{"doc_id":250641.0,"context":"The role of the librarian has changed much over time, with the past century in particular bringing many new media and technologies into play. From the earliest libraries in the ancient world to the modern information hub, there have been keepers and disseminators of the information held in data stores. Roles and responsibilities vary widely depending on the type of library and specialist librarian, from academic libraries to public libraries, as well as the functions needed behind the scenes to maintain the collection and make it available to its users. The Great Library of Alexandria, created by Ptolemy I after the death of Alexander the Great in 323 BC, was created to house the entirety of Greek literature. It was notable for its famous librarians: Demetrius, Zenodotus, Eratosthenes, Apollonius, Aristophanes, Aristarchus, and Callimachus. These scholars contributed significantly to the collection and cataloging of the wide variety of scrolls in the library's collection. Most notably, Callimachus created what is considered to be the first subject catalogue of the library holdings, called the pinakes. The pinakes contained 120 scrolls arranged into ten subject classes; each class was then subdivided, listing authors alphabetically by titles. The librarians at Alexandria were considered the \"custodians of learning\". As the crisis escalated,  was a high demand for contact tracers, and the CDC had earlier named librarians as key public health staff to support COVID-19 case investigation and contact tracing, so many librarians and library staff volunteered to help with contact tracing. Librarians also supported their community in other ways  such as staffing non-emergency hotlines and manning shelters for the homeless, for which they were able to retain their income, while others were furloughed for a time. Additional responsibilities Experienced librarians may take administrative positions such as library or information center director or learning resource officer. Similar to the management of any URLanization, they are concerned with the long-term planning of the library, and its relationship with its URLanization (the city or county for a public library, the college\/university for an academic library, or URLanization served by a special library). In smaller or specialized libraries, librarians typically perform a wide range of the different duties. upJustin Winsor, Librarian of Congress, c. 1885 Representative examples of librarian responsibilities: Researching topics of interest for their constituencies. Referring patrons to other URLanizations and government offices. Suggesting appropriate books (\"readers' advisory\") for children of different reading levels, and recommending novels for recreational reading. Reviewing books and journal databases Working with other URLanisations to establish continual, lifelong learning and further education initiatives Facilitating and promoting reading clubs. Developing programs for library users of all ages and backgrounds. Managing access to electronic information resources. Assessing library services and collections in order to best meet library users' needs. Building and maintaining collections to respond to changing community needs or demands Creating pathfinders Writing grants to gain funding for expanded program or collections Digitizing collections for online access Publishing articles in library science journals Answering incoming reference questions via telephone, postal mail, email, fax, and chat delivering arts and cultural activities to local communities Initiating and establishing creative digital activities to introduce children to coding, engineering and website building Marking promotion and advocacy of library services Assisting job seekers and local businesses Making and enforcing computer appointments on the public access Internet computers.\"The librarian's Internet survival guide: strategies for the high-tech reference desk\", Irene E. McDermott, Barbara E. Quint, p. 1-2, Information Today, Special library Special libraries can be described as libraries designed to perform some specific function to a particular set of people or URLanization  i.e. some include news, law, medical, theological, prison, corporate, museum, or any other type of library owned and operated by URLanization . They can be highly specialized, serving a discrete user group with a restricted collection area. In an increasingly global and virtual workplace, many special librarians may not even work in a library at all but instead manage and facilitate the use of electronic collections. Funding for special libraries varies widely. Librarians in some types of special libraries may be required to have additional training, such as a law degree for a librarian in an academic law library or appropriate subject degrees for subject specialties such as chemistry, engineering, etc. Many belong to the Special Libraries Association. There are also more specific associations such as the American Association of Law Libraries, Art Libraries Society of North America, the American Theological Library Association, the Medical Library Association, or the Visual Resources Association.","domain":"wiki","before_edit":"\"The librarian's Internet survival guide: strategies for the high-tech reference desk\", Irene E. McDermott, Barbara E. Quint, p. 1-2, Information Today, Special library Special libraries can be described as libraries designed to perform some specific function to a particular set of people or URLanization  i.e. some include news, law, medical, theological, prison, corporate, museum, or any other type of library owned and operated by URLanization .","after_edit":"\"The librarian's Internet survival guide: strategies for the high-tech reference desk\", Irene E. McDermott, Barbara E. Quint, p. 1-2, Information Today, Special library Special libraries can be described as libraries designed to perform some specific function for a particular set of people or URLanization  i.e. some include news, law, medical, theological, prison, corporate, museum, or any other type of library owned and operated by URLanization .","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":22062208.0,"context":"Discovery-driven planning is a planning technique first introduced in a Harvard Business Review article by Rita Gunther McGrath and Ian C. MacMillan in 1995 McGrath , R. G. & MacMillan, I. C. 1995. Discovery Driven Planning . Harvard Business Review, 73(4): 4454 and subsequently referenced in a number of books and articles.McGrath, R. G. & MacMillan, I. C. 2009. Discovery Driven Growth: A Breakthrough Process to Reduce Risk and Seize Opportunity . Boston: Harvard Business Publishing ; Christensen, C. M. 1997. The innovator's dilemma: When new technologies cause great firms to fail. Boston , Mass. : Harvard Business School Press  Its main thesis is that when one is operating in arenas with significant amounts of uncertainty, that a different approach  than is normally used in conventional planning applies . In conventional planning, the correctness of a plan is generally judged by how close outcomes come to projections. In discovery-driven planning, it is assumed that plan parameters may change as new information is revealed. With conventional planning, it is considered appropriate to fund the entire project  as the expectation is that one can predict a positive outcome. In discovery driven planning, funds are released based on the accomplishment of key milestones or checkpoints, at which point additional funding can be made available predicated on reasonable expectations for future success.Block, Z. & MacMillan, I. C. 1985. Milestones for successful venture planning. Harvard Business Review, 63(5): 8490 Conventional project management tools, such as stage-gate models or the use of financial tools to assess innovation  have been found to be flawed in that they are not well suited for the uncertainty of innovation-oriented projects Rajesh, S. & Zafar, I. 2008. Stage-Gate Controls, Learning Failure, and Adverse Effect on Novel New Products . Journal of Marketing, 72(1): 118. Christensen, C., Kaufman, S., & Shih, W. 2008. Innovation killers: how financial tools destroy your capacity to do new things. Harvard Business Review, 86(1): 98105, 137 Discovery-driven planning has been widely used in entrepreneurship curricula and has recently been cited by Steven G. Blank as a foundational idea in the lean startup methodology Blank, S. (2013). \"Why the Lean Start-Up Changes Everything. \" Harvard Business Review  91(5): 63-72. A discovery driven plan incorporates five disciplines or plan elements: Definition of success for the plan or initiative, including a 'reverse' income statement Benchmarking against market and competitive parameters Specification of operational requirements Documentation of assumptions Specification of key checkpoints Using discovery-driven planning, it is often possible to iterate the ideas in a plan, encouraging experimentation at lowest possible cost. The methodology is consistent with the application of real options reasoning to business planning, in which ventures are considered 'real' options. A real option is a small investment made today which buys the right, but not the obligation to make further investments.McGrath, R. G. 1997. A real options logic for initiating technology positioning investments. Academy of Management Review, 22(4): 974996van Putten, A. B. & MacMillan, I. C. 2004. Making Real Options Really Work . Harvard Business Review, 82(12): 134Dixit , A. K. & Pindyck, R. S. 1994. Investment Under Uncertainty. Princeton, New Jersey : Princeton University Press ","domain":"wiki","before_edit":" With conventional planning, it is considered appropriate to fund the entire project  as the expectation is that one can predict a positive outcome.","after_edit":" With conventional planning, it is considered appropriate to fund the entire project , as the expectation is that one can predict a positive outcome.","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":6853425.0,"context":"URLe Lilanga (1934 27 June 2005) was a Tanzanian painter and sculptor, active from the late 1970s and until the early years of the 21st century. He belonged to the Makonde people and lived most of his life in Dar es Salaam, the largest city in Tanzania. The main gate of the Nyumba ya Sanaa cultural centre in Dar es Salaam has decorations by Lilanga URLe Lilanga (right) and fellow painter Patrick Francis Imanjama outside Nyumba ya Sanaa In 1970, Lilanga decided to move to Dar es Salaam, where there were greater opportunities for selling sculptures and practising contemporary art. In 1971, he found his first employment, thanks to his uncle, Augustino Malaba, an already well-known sculptor, who would be his future collaborator. He worked as a night guard at the House of Art (Nyumba ya Sanaa), a  centre for the development of African art and craftsmanship in Dar es Salaam. Lilanga's talents were soon recognized by Jean Pruitt, an American aid worker promoting Tanzanian art. Lilanga welcomed  other artists like Robino Ntila, Augustino Malaba and Patrick Francis Imanjama to join Nyumba ya Sanaa . He also began to create paintings on batik cloth, on goatskin and on metal sheets for the finishing of railings and gates of the centre.  In 1977, he made his first journey outside Africa, travelling to New York, where he had a show at the Maryknoll Sisters Ossining Center . He stayed for a brief time in Manhattan, selling prints made on paper or cardboard, standing on street corners. Artistic development & success Shortly after beginning grammar school, Lilanga had his first contact with sculpture ( roots, softwood and, later, hard ebony), working in the Makonde tradition. He dedicated himself almost exclusively to this technique from 1961 until 1972. He showed his first works to Europeans who worked in the refugee camps during Mozambique's war of independence. Following their advice, in 1970 Lilanga decided to move to Dar es Salaam, where there were greater opportunities for selling sculptures. A lot of URLe Lilanga's lifetime art works can be found in leading international collections like The Contemporary African Art Collection (CAAC) of Jean Pigozzi or the Hamburg Mawingu Collection HMC of German collector Peter-Andreas Kamphausen. Directly after the death of the artist, the HMC: URLe Lilanga Collection presented the first systematically and thematically complete catalogue of Lilanga's work. In addition, the book explores the traditional roots of East African Makonde art, as well as four decades of Lilanga's artistic development with different materials and techniques, including sculpture, paintings, etchings, drawings and metal works. Currently the HMC publish the URLe Lilanga News as an online blog with information about the artist, his art works, exhibitions and other interesting background material. Also in 2005, the African Collection series (Skira Editore, Milan) published a well-illustrated book on Lilanga's work with useful information.","domain":"wiki","before_edit":" A lot of URLe Lilanga's lifetime art works can be found in leading international collections like The Contemporary African Art Collection (CAAC) of Jean Pigozzi or the Hamburg Mawingu Collection HMC of German collector Peter-Andreas Kamphausen.","after_edit":" A lot of URLe Lilanga's lifetime art works can be found in leading international collections like The Contemporary African Art Collection (CAAC) of Jean Pigozzi or the Hamburg Mawingu Collection (HMC) of German collector Peter-Andreas Kamphausen.","label":"fluency","raw_intents":["others","fluency","fluency"]}
{"doc_id":43854.0,"context":"Reality-Virtuality Continuum.The Virtuality Continuum is a continuous scale ranging between the completely virtual, a Virtuality , and the completely real: Reality. The reality-virtuality continuum therefore encompasses all possible variations and compositions of real and virtual objects. It has been described as a concept in new media and computer science, but in fact it could be considered a matter of anthropology. The concept was first introduced by Paul Milgram. The area between the two extremes, where both the real and the virtual are mixed, is the so-called Mixed reality. This in turn is said to consist of both Augmented Reality , where the virtual augments the real, and Augmented virtuality, where the real augments the virtual. Cyberspace, the world's computer systems considered as an interconnected whole, can be thought of as a virtual reality; for instance, it is portrayed as such in the cyberpunk fiction of William Gibson and others. Second life and MMORPGs such as World of Warcraft are examples of artificial environments or virtual worlds (falling some way short of full virtual reality) in cyberspace.","domain":"wiki","before_edit":"The Virtuality Continuum is a continuous scale ranging between the completely virtual, a Virtuality , and the completely real: Reality. The reality-virtuality continuum therefore encompasses all possible variations and compositions of real and virtual objects.","after_edit":"The Virtuality Continuum is a continuous scale ranging between the completely virtual, a Virtuality , and the completely real: reality. The realityvirtuality continuum therefore encompasses all possible variations and compositions of real and virtual objects.","label":"fluency","raw_intents":["fluency","fluency","style"]}
{"doc_id":564429.0,"context":"The Wlastkwewiyik, or Maliseet (,Erickson, Vincent O. (1978). \"Maliseet-Passamaquoddy.\" In Northeast, ed. Bruce G. Trigger. Vol. 15 of Handbook of North American Indians, ed. William C. Sturtevant. Washington, D.C.: Smithsonian Institution, pg. 123. also spelled Malecite), are an Algonquian-speaking First Nation of the Wabanaki Confederacy. They are the indigenous people of the Wlastk River (Saint John River) valley and its tributaries , and their territory extends across the current borders of New Brunswick and Quebec in Canada, and parts of Maine in the United States. The Houlton Band of Maliseet Indians, based on the Meduxnekeag River in the Maine portion of their traditional homeland, are since 19 July 1776, the first foreign Treaty allies with the United States of America and a federally recognized tribe of Maliseet people by the United States . Today Maliseet people have also migrated to other parts of the world. Maliseets are forest, river and coastal people within their 20,000, 000 acre, 200 mile wide, and 600 mile long Saint John river watershed homeland . Name The people call themselves Wlastkwewiyik after the Wlastkw River at the heart of their expansive territory in what is now New Brunswick and Maine. Wlastkw means \"Beautiful River.\" English colonists later named it the Saint John River. Wlastkwewiyik means \"People of the Beautiful River,\" in Maliseet.LeSourd, Philip, ed. 2007. Tales from Maliseet Country: The Maliseet Texts of Karl V. Teeter, Lincoln, Nebraska: University of Nebraska Press, p. 17, fnote 4 The Maliseet (Malecite) have long been associated with the Saint John  . Their territory still extends as far as the Saint Lawrence River. Their lands and resources are bounded on the east by the Mikmaq people, on the west by the Penobscot people , and on the south by the Passamaquoddy people , who also still speak related Algonquian languages. Malesse'jik was a Mikmaq word believed to mean \"He speaks slowly,\" or differently  by which the Mikmaq people contrasted the other tribe's language to their own. The meaning of the word today is unknown but  is commonly mistranslated to \"he speaks badly, lazy, or broken\"  Erickson 1978, pg. 135 This term is the exonym by which the Mikmaq people referred to this group when speaking to early Europeans. The Europeans met the Mikmaq people before the Wlastkwewiyik, and adopted Malesse'jik as Malcite in French for the people, not understanding that it was not their true name. The later English colonists anglicized this term as Maliseet, in another transliteration of sound  . 17th century At the time of European encounter, the Wlastkwewiyik were living in walled villages and practicing horticulture (corn, beans, squash and tobacco). In addition to  growing crops, the women gathered and processed fruits, berries, nuts and natural produce. The men contributed by fishing and hunting  . Written accounts in the early 17th century, such as those of Samuel de Champlain and Marc LesCarbot, refer to a large Malecite village at the mouth of the Saint John River. Later in the century, sources indicate their headquarters had shifted upriver to Meductic, on the middle reaches of the Saint John River. The French explorers were the first to establish a fur trade with the Wlastkwewiyik, which became important in their territory. Some European goods were desired because they were useful to Wlastkwewiyik subsistence and culture. The French Jesuits also established missions  where some Wlastkwewiyik converted to Catholicism. With years of colonialism, many learned the French language. The French called them Malcite, a transliteration of the Mi'kmaq name for the people. Local histories depict many encounters with the Iroquois, five powerful nations based south and east of the Great Lakes, and the Innu  . Contact with European fisher-traders in the early 17th century and with specialized fur traders developed into a stable relationship which lasted for nearly 100 years. Despite devastating population losses to European infectious diseases, to which they had no immunity, these Atlantic First Nations held on to their traditional coastal or river locations for hunting, fishing and gathering , and were concentrated along river valleys for trapping.","domain":"wiki","before_edit":" Malesse'jik was a Mikmaq word believed to mean \"He speaks slowly,\" or differently  by which the Mikmaq people contrasted the other tribe's language to their own.","after_edit":" Malesse'jik was a Mikmaq word believed to mean \"He speaks slowly,\" or differently , by which the Mikmaq people contrasted the other tribe's language to their own.","label":"fluency","raw_intents":["fluency","fluency","fluency"]}
{"doc_id":1602860.0,"context":"Criticism A number of groups object to the practice of canned hunting for reasons such as cruelty to animals or that it takes away what is known as \"fair chase.\" The Humane Society of the United States (HSUS) criticizes canned hunting. In a statement, the HSUS called canned hunts \"cruel and brutal activities , \"  in which the hunted animal has \"absolutely no chance of escape . \"  It went on to say that animals have been \"psychologically conditioned to behave as a target by life in captivity , \"  among other objections. In 2014, 62 cities across the globe participated in the first-ever global march against canned hunting. The march was organized by Campaign Against Canned Hunting. People from many parts of the world took part: Africa, Asia, Australia, Canada, Europe, Middle East, New Zealand, South America and the United States  .Your African Safari, \"Campaign against canned hunting in South Africa: interview with Chris Mercer\"","domain":"wiki","before_edit":" People from many parts of the world took part: Africa, Asia, Australia, Canada, Europe, Middle East, New Zealand, South America and the United States  .","after_edit":" People from many parts of the world took part: Africa, Asia, Australia, Canada, Europe, Middle East, New Zealand, South America and the United States ) and South America .","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":17250911.0,"context":"Early life Benjamin Thomas Atkins was born on August 26, 1968 in Detroit, the younger of two sons. His family lived in a poor neighborhood, and both of his parents were drug and alcohol abusers. Shortly after his birth, Tony's father left the family. In 1970, Benjamin ran away from home, and without parental supervision, wound up in an orphanage, where he spent his childhood and youth. While living there, he was physically assaulted by other children, and at the age of 10, was raped by one of the employees. Over the next five years, he was continuously subjected to sexual harassment by other boys, until he eventually escaped and reunited with his mother. For sometime, he lived together with her and his older brother, but  realised that his mother worked as a prostitute. Both Atkins and his brother saw her have sex with clients at the house on several occasions. Atkins left the house again in the late 1980s, living on the streets and doing drugs, and eventually developed a drug addiction. Because he lacked formal education, Atkins was forced to work in low-skilled labor jobs for low wages, and spent the nights at homeless shelters. Acquaintances claimed to be very fond of him, but at the same time noted that when drunk or on drugs, he showed signs of an antisocial personality and displayed misogynistic behavior. Murders As victims, Atkins chose vulnerable women, often prostitutes or drug addicts. He would lure them to abandoned buildings and houses, where he sexually assaulted  them. After strangling his victims, he would leave the bodies at the crime scenes, with some of them discovered months after their deaths. The first victim to be discovered was 30-year-old Debbie Ann Friday, found on December 14, 1991, after she had gone missing on December 8th. A few days later, on December 30th, the body of 26-year-old Bertha Jean Mason was found. She had gone missing on December 11th, and was last seen leaving her home and entering a store, after which she was never seen alive again. On January 3, 1992, while demolishing an abandoned house, workmen discovered the body of 36-year-old prostitute and drug addict Patricia Cannon URLe, who had been put on a wanted list in early December 1991 following a drug den bust within Woodward Corridor. On January 25th, the body of 39-year-old Vickie Truelove was located: like the other victims, she had been sodomized, raped and strangled. At the end of January, Atkins was arrested at an abandoned building and taken to the police station for interrogation. Due to lack of evidence to prove his guilt in the murders, he was released. On February 17th, the corpses of three women were found in three separate rooms in the former Monterey Hotel in Highland Park: they were 34-year-old Valerie Chalk, 23-year-old Juanita Hardy and a Jane Doe whose identity remains unknown. All of them had been raped and strangled . Relatives of Chalk told the police that after she was put on a wanted list in early November 1991, Valerie went missing. On April 9th, the body of 28-year-old Brenda Mitchell was found in an abandoned house, after she had gone missing four days earlier . Despite the fact Mitchell was found almost completely naked with a scarf wrapped around her neck , her death was originally classified as an overdose. %DIFDELCMD < %DIFDELCMD < %%% A few days later, on the 15th, the partially decomposed corpse of 27-year-old Vicki Beasley-Brown, who was last seen alive on March 25th, was discovered. On June 15th, the body of 45-year-old Joanne O'Rourke was found. Arrest Atkins was arrested on rape charges on August 21, 1992, after he was identified on a Detroit street by 34-year-old Darlene Saunders, who had been sodomized and raped by him in October 1991. %DIFDELCMD < %DIFDELCMD < %%% He was questioned again, but categorically denied any involvement, claiming that he had no interest in women and was a homosexual. After further interrogations, the police officers familiarized him with the psychological portrait they had compiled of the killer, which, after 12 hours, caused Atkins to admit to the murders of 11 women. He described in detail the appearance and clothing of the victims, and even indicated the whereabouts of the bodies of the 10th and 11th victims, 21-year-old Ocinena Waymer and 29-year-old LaTanya Showanda Smith. Their disappearances were not connected to the murders until Atkins' confession, and the bodies were found on the indicated place that same day. During the interrogation, Atkins said that the motive for the murders was his misogynistic views against girls and women engaged in prostitution.  Contrary to the official version of the investigation, Atkins revealed that the first victim had actually been Patricia URLe, whom he killed in the fall of 1991. According to his testimony, he didn't plan on killing the woman, but simply planned to smoke crack cocaine with her. When she decided to leave him, he flew into a rage and killed her. In several cases, he was unable to explain why he committed the murders: this was the case with Hardy, with whom Benjamin had an intimate relationship, but after doing drugs together, he said he strangled her for no apparent reason.","domain":"wiki","before_edit":"  Contrary to the official version of the investigation, Atkins revealed that the first victim had actually been Patricia URLe, whom he killed in the fall of 1991.","after_edit":" He stated that he lured his victims into abandoned houses by offering them drugs and alcohol, in addition to paying for their sexual services. Contrary to the official version of the investigation, Atkins revealed that the first victim had actually been Patricia URLe, whom he killed in the fall of 1991.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":55503854.0,"context":"Relation to traditional epistemology Traditional epistemology and Bayesian epistemology are both forms of epistemology, but they differ in various respects, for example, concerning their methodology, the propositional attitudes they study , the role justification or confirmation plays in them and some of their research interests. Bayesian epistemology focuses on degrees of belief, also often called credences. On the other hand, Traditional epistemology focuses on knowledge, analyzed by Plato as being justified true beliefs . They then seek to understand what counts as knowledgeand how to evaluate one's beliefs (see foundationalism, coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all ) . Bayesian epistemology, on the other hand, works by formalizing concepts and problems, which are often vague in the traditional approach. It thereby focuses more on mathematical intuitions and promises a higher degree of precision. It sees belief as a continuous phenomenon that comes in various degrees, so-called credences. Some Bayesians have even suggested that the regular notion of belief should be abandoned. But there are also proposals to connect the two, for example, the Lockean thesis, which defines belief as credence above a certain threshold. Justification plays a central role in traditional epistemology while Bayesians have focused on the related notions of confirmation and disconfirmation through evidence. The notion of evidence is important for both approaches but only the traditional approach has been interested in studying the sources of evidence, like perception and memory. Bayesianism, on the other hand, has focused on the role of evidence for rationality: how someone's credence should be adjusted upon receiving new evidence. There is an analogy between the Bayesian norms of rationality in terms of probabilistic laws and the traditional norms of rationality in terms of deductive consistency. Certain traditional problems, like the topic of skepticism about our knowledge of the external world, are difficult to express in Bayesian terms.","domain":"wiki","before_edit":" On the other hand, Traditional epistemology focuses on knowledge, analyzed by Plato as being justified true beliefs . They then seek to understand what counts as knowledgeand how to evaluate one's beliefs (see foundationalism, coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all ) . Bayesian epistemology, on the other hand, works by formalizing concepts and problems, which are often vague in the traditional approach.","after_edit":" On the other hand, Traditional epistemology focuses on knowledge, analyzed by Plato as being justified true beliefs , the sources of knowledge, like perception or testimony, the structure of a body of knowledge, for example in the form of foundationalism or coherentism, and the problem of philosophical skepticism or the question of whether knowledge is possible at all ) . Bayesian epistemology, on the other hand, works by formalizing concepts and problems, which are often vague in the traditional approach.","label":"meaning-changed","raw_intents":["meaning-changed","coherence","meaning-changed"]}
{"doc_id":59117588.0,"context":"Focus of celebrations by year Event logo on a digital screen in Riga  Each year of the anniversary has a keyword in recognition of events that took place 100 years ago, which were significant to the foundation of the country. Dignitaries laying wreaths at the Freedom Monument on 18 November 2018 As per  events on its actual centennial anniversary on 18 November 2018, many high-level government officials, dignitaries, military leaders, and public figures laid wreaths and flowers at the Freedom Monument in the capital. A musical concert was held at the Latvian National Theatre, where Latvia declared its sovereignty in 1918. A special meeting of the Saeima was alsoheld at the theatre. Military Parade The Italian Bersaglieri marching in the military parade . The annual military parade along the 11. novembra krastmala (November 11th Embankment) in Riga marked the centennial anniversary' s main events . It was the largest in history with around 1,700 soldiers from the Latvian National Armed Forces participating in the march past. It was composed of personnel of the Land Forces, Navy, Air Force, National Guard, Border Guard, Military Police, State Police, State Fire and Rescue Service and military academies. The parade was led by Latvian President Raimonds Vjonis, Chief of the National Defence Forces Leonds Kalni and Naval Forces commander Ingus Vizulis. Estonian President Kersti Kaljulaid and Armed Forces chief Riho Terras, Lithuanian President Dalia Grybauskait, Finnish President Sauli Niinist and Icelandic President Guni Th. Jhannesson joined in attending the military parade and the celebrations. The NATO countries and other military partners of Latvia that were represented at the parade were Italy, Estonia, Lithuania, Poland, Romania, the Czech Republic, Finland, Albania, Croatia, the Netherlands, Norway, Slovakia, Spain Slovenia, Britain, Denmark, Sweden, Germany, Canada and the United States.26th Latvian Song and Dance Festival closing concert \"On the Starry Path\" . Latvian Song and Dance Festival","domain":"wiki","before_edit":"Focus of celebrations by year Event logo on a digital screen in Riga  Each year of the anniversary has a keyword in recognition of events that took place 100 years ago, which were significant to the foundation of the country.","after_edit":"Focus of celebrations by year Event logo on a digital screen in Riga on Brvbas iela Each year of the anniversary has a keyword in recognition of events that took place 100 years ago, which were significant to the foundation of the country.","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","clarity"]}
{"doc_id":1809568.0,"context":"Death and legacy Syed Kamal died on 1 October 2009 at Karachi after a lingering illness at age 72. He had been a heart patient for many years and had fallen accidentally at his home about a month ago. He was bedridden since his fall. His survivors include his wife, his son Ghalib Kamal and three daughters. Retrieved 23 February 2019Film star Syed Kamal passes away Dawn (newspaper), Published 2 Oct 2009, Retrieved 23 February 2019 Filmography Syed Kamal's notable films as an actor : Thandi Sarak (1957)Actor Kamal dies The Nation (newspaper), Published 2 October 2009, Retrieved 24 February 2019 Sawera (1959) Apna Paraya (1959) Banjaran (1962) Tauba (1963) Aashiana (1964) Aisa Bhi Hota Hai (1965) Behan Bhai (1968) Nai Laila Naya Majnoon (1969) Road To Swat (1970) Insan Aur Gadha (1973) The following films were directed by Syed Kamal: Shehnai (1968) starring (Syed Kamal-Deeba) Insaan Aur Gadha (1973) starring (Syed Kamal-Nisho-Rozina) Yahan Say Wahan Tak starring (Syed Kamal-Mumtaz) Honeymoon (1970) starring (Syed Kamal-Husna-Rozina) Roop Behroop starring (producer-director-actor Syed Kamal opposite Nisho) Doosri Maan starring (Syed Kamal-Shamim Ara) Meray Bacchay Meri Aankhein starring (Syed Kamal-Deeba) Dard-E-Dil starring (Syed Kamal and Zeba) Aaliya starring (Syed Kamal and Shamim Ara) Jatt Kurrian Taun Darda (1976) A Punjabi film, starring Syed Kamal, Neelo and Aslam Pervaiz Ajj Dian Kurrian (1977) A Punjabi film, starring Syed Kamal and Neelo Kal De Munday (1978) Jat Kamala Gaya Dubai (1984) Siyasat (1986)","domain":"wiki","before_edit":" Retrieved 23 February 2019Film star Syed Kamal passes away Dawn (newspaper), Published 2 Oct 2009, Retrieved 23 February 2019 Filmography Syed Kamal's notable films as an actor :","after_edit":" Retrieved 23 February 2019Film star Syed Kamal passes away Dawn (newspaper), Published 2 Oct 2009, Retrieved 3 July 2021 Filmography Syed Kamal's notable films as an actor :","label":"meaning-changed","raw_intents":["meaning-changed","meaning-changed","meaning-changed"]}
{"doc_id":49949965.0,"context":"Kulbhushan Sudhir Jadhav (also spelled Kulbhushan Yadav, alleged alias Hussain Mubarak Patel) (born 16 April 1970) is an Indian national. It is alleged by the Pakistani government that he was arrested in the Pakistani province of Balochistan on charges of terrorism and spying for India's  Research and Analysis Wing. On 10 April 2017, India's Ministry of External Affairs stated that he had been \"kidnapped last year from Iran and his subsequent presence in Pakistan has never been explained credibly\". The Pakistani government claimed that he was a commander in the Indian Navy who was involved in subversive activities inside Pakistan and was arrested on 3 March 2016 during a counter-intelligence operation in Balochistan. The Indian government recognised Jadhav as a former naval officer but denied any current links with him and maintained that he took premature retirement and operated a business in Iranian city of Chabahar and was abducted from there .Revealed: 'Spy' Kulbhushan Yadav not caught but abducted by extremist Sunni group Jaishul Adil , India Today, 30 March 2016. Pakistani security forces reported Jadhav as a serving officer in the Indian Navy and stated that he was commissioned to the Research and Analysis Wing  , India's external intelligence agency. They believed him to be involved in subversive activities in Balochistan and Karachi. Jadhav was soon shifted to Islamabad for interrogation. While according to Indian sources, Jadhav was kidnapped by Mullah Shahozi of Jaish ul-Adl from Chabahar and was transported via Sarbaz to IranPakistan border and where he handed Jadhav over to the Pakistani Army. In a statement issued in the Parliament of India on 11 April 2017, Rajnath Singh, India's Minister of Home Affairs, reiterated that Jadhav was kidnapped by Pakistani agencies from Iran and put through trial as a R AW agent. Sushma Swaraj, India's Minister of External Affairs said there was no evidence of any wrongdoing by Jadhav and termed his sentencing an act of \"premeditated murder\". Swaraj said that if Pakistan implemented the death sentence, the bilateral relations between both countries would face dire consequences. The ICJ proceedings began in The Hague on 15 May to review the case. India and Pakistan both sent their legal teams to put forward their arguments, led by Harish Salve and Khawar Qureshi QC respectively. On 18 May 2017, the International Court of Justice stayed the hanging of Jadhav by Pakistan . On 22 June 2017, Pakistani sources confirmed that Jadhav had sought clemency from the country's army chief following his conviction. Pakistan also released a new confessional video of Jadhav, in which he stated that he visited Karachi twice for gathering intelligence on naval facilities. He also admitted to supporting and funding, on behalf of R AW , Baloch militants affiliated with the BLA and BRA, in addition to infiltrating and establishing \"30 to 40 R AW operatives along the Makran Coast\" for involvement in terrorist activities. Jadhav said that R AW 's activities in Balochistan and Sindh were conducted under the direction of Anil Kumar Dhasmana. India's Foreign Ministry again dismissed the confession as \"false propaganda\", stating that Pakistan was trying to influence ICJ proceedings while denying the consular rights to Jadhav. ICJ did not allow Pakistan to play the video during the hearing. On 17 July 2019, the ICJ, in its verdict, rejected India's appeal for Jadhav's release and directed Pakistan to allow consular access and effectively Stayed the death sentence. The court ordered that Pakistan should grant consular access to Jhadav. Pakistan and India both claimed victory and welcomed the judgement of ICJ.","domain":"wiki","before_edit":" While according to Indian sources, Jadhav was kidnapped by Mullah Shahozi of Jaish ul-Adl from Chabahar and was transported via Sarbaz to IranPakistan border and where he handed Jadhav over to the Pakistani Army.","after_edit":" While according to Indian sources, Jadhav was kidnapped by Mullah Shahozi of Jaish ul-Adl from Sarbaz City, Iran who later handed over Jadhav to the Pakistani Army.","label":"others","raw_intents":["others","others","clarity"]}
{"doc_id":22062208.0,"context":"Discovery-driven planning is a planning technique first introduced in a Harvard Business Review article by Rita Gunther McGrath and Ian C. MacMillan in 1995 McGrath , R. G. & MacMillan, I. C. 1995. Discovery Driven Planning . Harvard Business Review, 73(4): 4454 and subsequently referenced in a number of books and articles.McGrath, R. G. & MacMillan, I. C. 2009. Discovery Driven Growth: A Breakthrough Process to Reduce Risk and Seize Opportunity . Boston: Harvard Business Publishing ; Christensen, C. M. 1997. The innovator's dilemma: When new technologies cause great firms to fail. Boston , Mass. : Harvard Business School Press  Its main thesis is that when one is operating in arenas with significant amounts of uncertainty, that a different approach  than is normally used in conventional planning applies . In conventional planning, the correctness of a plan is generally judged by how close outcomes come to projections. In discovery-driven planning, it is assumed that plan parameters may change as new information is revealed. With conventional planning, it is considered appropriate to fund the entire project  as the expectation is that one can predict a positive outcome. In discovery driven planning, funds are released based on the accomplishment of key milestones or checkpoints, at which point additional funding can be made available predicated on reasonable expectations for future success.Block, Z. & MacMillan, I. C. 1985. Milestones for successful venture planning. Harvard Business Review, 63(5): 8490 Conventional project management tools, such as stage-gate models or the use of financial tools to assess innovation  have been found to be flawed in that they are not well suited for the uncertainty of innovation-oriented projects Rajesh, S. & Zafar, I. 2008. Stage-Gate Controls, Learning Failure, and Adverse Effect on Novel New Products . Journal of Marketing, 72(1): 118. Christensen, C., Kaufman, S., & Shih, W. 2008. Innovation killers: how financial tools destroy your capacity to do new things. Harvard Business Review, 86(1): 98105, 137 Discovery-driven planning has been widely used in entrepreneurship curricula and has recently been cited by Steven G. Blank as a foundational idea in the lean startup methodology Blank, S. (2013). \"Why the Lean Start-Up Changes Everything. \" Harvard Business Review  91(5): 63-72. A discovery driven plan incorporates five disciplines or plan elements: Definition of success for the plan or initiative, including a 'reverse' income statement Benchmarking against market and competitive parameters Specification of operational requirements Documentation of assumptions Specification of key checkpoints Using discovery-driven planning, it is often possible to iterate the ideas in a plan, encouraging experimentation at lowest possible cost. The methodology is consistent with the application of real options reasoning to business planning, in which ventures are considered 'real' options. A real option is a small investment made today which buys the right, but not the obligation to make further investments.McGrath, R. G. 1997. A real options logic for initiating technology positioning investments. Academy of Management Review, 22(4): 974996van Putten, A. B. & MacMillan, I. C. 2004. Making Real Options Really Work . Harvard Business Review, 82(12): 134Dixit , A. K. & Pindyck, R. S. 1994. Investment Under Uncertainty. Princeton, New Jersey : Princeton University Press ","domain":"wiki","before_edit":"Discovery-driven planning is a planning technique first introduced in a Harvard Business Review article by Rita Gunther McGrath and Ian C. MacMillan in 1995 McGrath , R. G. & MacMillan, I. C. 1995.","after_edit":"Discovery-driven planning is a planning technique first introduced in a Harvard Business Review article by Rita Gunther McGrath and Ian C. MacMillan in 1995McGrath , R. G. & MacMillan, I. C. 1995.","label":"others","raw_intents":["others","fluency","others"]}
{"doc_id":564429.0,"context":"The Wlastkwewiyik, or Maliseet (,Erickson, Vincent O. (1978). \"Maliseet-Passamaquoddy.\" In Northeast, ed. Bruce G. Trigger. Vol. 15 of Handbook of North American Indians, ed. William C. Sturtevant. Washington, D.C.: Smithsonian Institution, pg. 123. also spelled Malecite), are an Algonquian-speaking First Nation of the Wabanaki Confederacy. They are the indigenous people of the Wlastk River (Saint John River) valley and its tributaries , and their territory extends across the current borders of New Brunswick and Quebec in Canada, and parts of Maine in the United States. The Houlton Band of Maliseet Indians, based on the Meduxnekeag River in the Maine portion of their traditional homeland, are since 19 July 1776, the first foreign Treaty allies with the United States of America and a federally recognized tribe of Maliseet people by the United States . Today Maliseet people have also migrated to other parts of the world. Maliseets are forest, river and coastal people within their 20,000, 000 acre, 200 mile wide, and 600 mile long Saint John river watershed homeland . Name The people call themselves Wlastkwewiyik after the Wlastkw River at the heart of their expansive territory in what is now New Brunswick and Maine. Wlastkw means \"Beautiful River.\" English colonists later named it the Saint John River. Wlastkwewiyik means \"People of the Beautiful River,\" in Maliseet.LeSourd, Philip, ed. 2007. Tales from Maliseet Country: The Maliseet Texts of Karl V. Teeter, Lincoln, Nebraska: University of Nebraska Press, p. 17, fnote 4 The Maliseet (Malecite) have long been associated with the Saint John  . Their territory still extends as far as the Saint Lawrence River. Their lands and resources are bounded on the east by the Mikmaq people, on the west by the Penobscot people , and on the south by the Passamaquoddy people , who also still speak related Algonquian languages. Malesse'jik was a Mikmaq word believed to mean \"He speaks slowly,\" or differently  by which the Mikmaq people contrasted the other tribe's language to their own. The meaning of the word today is unknown but  is commonly mistranslated to \"he speaks badly, lazy, or broken\"  Erickson 1978, pg. 135 This term is the exonym by which the Mikmaq people referred to this group when speaking to early Europeans. The Europeans met the Mikmaq people before the Wlastkwewiyik, and adopted Malesse'jik as Malcite in French for the people, not understanding that it was not their true name. The later English colonists anglicized this term as Maliseet, in another transliteration of sound  . 17th century At the time of European encounter, the Wlastkwewiyik were living in walled villages and practicing horticulture (corn, beans, squash and tobacco). In addition to  growing crops, the women gathered and processed fruits, berries, nuts and natural produce. The men contributed by fishing and hunting  . Written accounts in the early 17th century, such as those of Samuel de Champlain and Marc LesCarbot, refer to a large Malecite village at the mouth of the Saint John River. Later in the century, sources indicate their headquarters had shifted upriver to Meductic, on the middle reaches of the Saint John River. The French explorers were the first to establish a fur trade with the Wlastkwewiyik, which became important in their territory. Some European goods were desired because they were useful to Wlastkwewiyik subsistence and culture. The French Jesuits also established missions  where some Wlastkwewiyik converted to Catholicism. With years of colonialism, many learned the French language. The French called them Malcite, a transliteration of the Mi'kmaq name for the people. Local histories depict many encounters with the Iroquois, five powerful nations based south and east of the Great Lakes, and the Innu  . Contact with European fisher-traders in the early 17th century and with specialized fur traders developed into a stable relationship which lasted for nearly 100 years. Despite devastating population losses to European infectious diseases, to which they had no immunity, these Atlantic First Nations held on to their traditional coastal or river locations for hunting, fishing and gathering , and were concentrated along river valleys for trapping.","domain":"wiki","before_edit":" Their lands and resources are bounded on the east by the Mikmaq people, on the west by the Penobscot people , and on the south by the Passamaquoddy people , who also still speak related Algonquian languages.","after_edit":" Their lands and resources are bounded on the east by the Mikmaq people, on the west by the Penobscot people , and on the south by the Passamaquoddy  , who also still speak related Algonquian languages.","label":"others","raw_intents":["others","style","clarity"]}
{"doc_id":49949965.0,"context":"Kulbhushan Sudhir Jadhav (also spelled Kulbhushan Yadav, alleged alias Hussain Mubarak Patel) (born 16 April 1970) is an Indian national. It is alleged by the Pakistani government that he was arrested in the Pakistani province of Balochistan on charges of terrorism and spying for India's  Research and Analysis Wing. On 10 April 2017, India's Ministry of External Affairs stated that he had been \"kidnapped last year from Iran and his subsequent presence in Pakistan has never been explained credibly\". The Pakistani government claimed that he was a commander in the Indian Navy who was involved in subversive activities inside Pakistan and was arrested on 3 March 2016 during a counter-intelligence operation in Balochistan. The Indian government recognised Jadhav as a former naval officer but denied any current links with him and maintained that he took premature retirement and operated a business in Iranian city of Chabahar and was abducted from there .Revealed: 'Spy' Kulbhushan Yadav not caught but abducted by extremist Sunni group Jaishul Adil , India Today, 30 March 2016. Pakistani security forces reported Jadhav as a serving officer in the Indian Navy and stated that he was commissioned to the Research and Analysis Wing  , India's external intelligence agency. They believed him to be involved in subversive activities in Balochistan and Karachi. Jadhav was soon shifted to Islamabad for interrogation. While according to Indian sources, Jadhav was kidnapped by Mullah Shahozi of Jaish ul-Adl from Chabahar and was transported via Sarbaz to IranPakistan border and where he handed Jadhav over to the Pakistani Army. In a statement issued in the Parliament of India on 11 April 2017, Rajnath Singh, India's Minister of Home Affairs, reiterated that Jadhav was kidnapped by Pakistani agencies from Iran and put through trial as a R AW agent. Sushma Swaraj, India's Minister of External Affairs said there was no evidence of any wrongdoing by Jadhav and termed his sentencing an act of \"premeditated murder\". Swaraj said that if Pakistan implemented the death sentence, the bilateral relations between both countries would face dire consequences. The ICJ proceedings began in The Hague on 15 May to review the case. India and Pakistan both sent their legal teams to put forward their arguments, led by Harish Salve and Khawar Qureshi QC respectively. On 18 May 2017, the International Court of Justice stayed the hanging of Jadhav by Pakistan . On 22 June 2017, Pakistani sources confirmed that Jadhav had sought clemency from the country's army chief following his conviction. Pakistan also released a new confessional video of Jadhav, in which he stated that he visited Karachi twice for gathering intelligence on naval facilities. He also admitted to supporting and funding, on behalf of R AW , Baloch militants affiliated with the BLA and BRA, in addition to infiltrating and establishing \"30 to 40 R AW operatives along the Makran Coast\" for involvement in terrorist activities. Jadhav said that R AW 's activities in Balochistan and Sindh were conducted under the direction of Anil Kumar Dhasmana. India's Foreign Ministry again dismissed the confession as \"false propaganda\", stating that Pakistan was trying to influence ICJ proceedings while denying the consular rights to Jadhav. ICJ did not allow Pakistan to play the video during the hearing. On 17 July 2019, the ICJ, in its verdict, rejected India's appeal for Jadhav's release and directed Pakistan to allow consular access and effectively Stayed the death sentence. The court ordered that Pakistan should grant consular access to Jhadav. Pakistan and India both claimed victory and welcomed the judgement of ICJ.","domain":"wiki","before_edit":" On 17 July 2019, the ICJ, in its verdict, rejected India's appeal for Jadhav's release and directed Pakistan to allow consular access and effectively Stayed the death sentence.","after_edit":" On 17 July 2019, the ICJ, in its verdict, rejected India's appeal for Jadhav's release and directed Pakistan to allow consular access and effectively review the death sentence.","label":"others","raw_intents":["others","others","style"]}
{"doc_id":49949965.0,"context":"Kulbhushan Sudhir Jadhav (also spelled Kulbhushan Yadav, alleged alias Hussain Mubarak Patel) (born 16 April 1970) is an Indian national. It is alleged by the Pakistani government that he was arrested in the Pakistani province of Balochistan on charges of terrorism and spying for India's  Research and Analysis Wing. On 10 April 2017, India's Ministry of External Affairs stated that he had been \"kidnapped last year from Iran and his subsequent presence in Pakistan has never been explained credibly\". The Pakistani government claimed that he was a commander in the Indian Navy who was involved in subversive activities inside Pakistan and was arrested on 3 March 2016 during a counter-intelligence operation in Balochistan. The Indian government recognised Jadhav as a former naval officer but denied any current links with him and maintained that he took premature retirement and operated a business in Iranian city of Chabahar and was abducted from there .Revealed: 'Spy' Kulbhushan Yadav not caught but abducted by extremist Sunni group Jaishul Adil , India Today, 30 March 2016. Pakistani security forces reported Jadhav as a serving officer in the Indian Navy and stated that he was commissioned to the Research and Analysis Wing  , India's external intelligence agency. They believed him to be involved in subversive activities in Balochistan and Karachi. Jadhav was soon shifted to Islamabad for interrogation. While according to Indian sources, Jadhav was kidnapped by Mullah Shahozi of Jaish ul-Adl from Chabahar and was transported via Sarbaz to IranPakistan border and where he handed Jadhav over to the Pakistani Army. In a statement issued in the Parliament of India on 11 April 2017, Rajnath Singh, India's Minister of Home Affairs, reiterated that Jadhav was kidnapped by Pakistani agencies from Iran and put through trial as a R AW agent. Sushma Swaraj, India's Minister of External Affairs said there was no evidence of any wrongdoing by Jadhav and termed his sentencing an act of \"premeditated murder\". Swaraj said that if Pakistan implemented the death sentence, the bilateral relations between both countries would face dire consequences. The ICJ proceedings began in The Hague on 15 May to review the case. India and Pakistan both sent their legal teams to put forward their arguments, led by Harish Salve and Khawar Qureshi QC respectively. On 18 May 2017, the International Court of Justice stayed the hanging of Jadhav by Pakistan . On 22 June 2017, Pakistani sources confirmed that Jadhav had sought clemency from the country's army chief following his conviction. Pakistan also released a new confessional video of Jadhav, in which he stated that he visited Karachi twice for gathering intelligence on naval facilities. He also admitted to supporting and funding, on behalf of R AW , Baloch militants affiliated with the BLA and BRA, in addition to infiltrating and establishing \"30 to 40 R AW operatives along the Makran Coast\" for involvement in terrorist activities. Jadhav said that R AW 's activities in Balochistan and Sindh were conducted under the direction of Anil Kumar Dhasmana. India's Foreign Ministry again dismissed the confession as \"false propaganda\", stating that Pakistan was trying to influence ICJ proceedings while denying the consular rights to Jadhav. ICJ did not allow Pakistan to play the video during the hearing. On 17 July 2019, the ICJ, in its verdict, rejected India's appeal for Jadhav's release and directed Pakistan to allow consular access and effectively Stayed the death sentence. The court ordered that Pakistan should grant consular access to Jhadav. Pakistan and India both claimed victory and welcomed the judgement of ICJ.","domain":"wiki","before_edit":" In a statement issued in the Parliament of India on 11 April 2017, Rajnath Singh, India's Minister of Home Affairs, reiterated that Jadhav was kidnapped by Pakistani agencies from Iran and put through trial as a R AW agent.","after_edit":" In a statement issued in the Parliament of India on 11 April 2017, Rajnath Singh, India's Minister of Home Affairs, reiterated that Jadhav was kidnapped by Pakistani agencies from Iran and put through trial as a R RAW agent.","label":"others","raw_intents":["others","others","others"]}
{"doc_id":60834637.0,"context":"Principles and Foundation During the Warring States period, Han Feizi would propose the establishment of the first all-encompassing autocratic monarchy for the future of the state. During the same time period, Shang Yang from the state of Qin would enact political reforms into practice. The imperial system would  be constituted by the time of the establishment of the Qin, as well as the system of three lords and nine ministers, and the system of prefectures and counties. Weights, measures, currency, and writing were unified. Books and scholars were burned and buried as the ideological control strengthened . Officials were  to act as teachers of the law  .","domain":"wiki","before_edit":" Officials were  to act as teachers of the law  .","after_edit":" Officials were  to act as faculties of the law  .","label":"style","raw_intents":["style","style","clarity"]}
{"doc_id":8556500.0,"context":"Practitioners of oil pulling claim it is capable of improving oral and whole-body health, including a benefit in conditions such as headaches, migraines, diabetes mellitus, asthma, and acne, as well as whitening teeth. Its promoters claim it works by pulling out toxins, which are known as ama in Ayurveda, but there is no credible evidence to support some of these claims and only limited and inconclusive evidence to support other some of these claims, primarily having to do with oral health.  A review of the evidence published in the scientific journal Heliyon (august 7, 2020) URL found \"The limited evidence suggests that oil pulling with coconut oil may have a beneficial effect on improving oral health and dental hygiene. Future clinical trials are of merit considering the universal availability of the intervention. Prospective research should have a robust design with rigorous execution to provide a higher quality of evidence... Oil pulling with coconut oil could be used as a adjunct to normal preventative regimes to improve oral health and dental hygiene although further studies are needed to determine the level of effectiveness.\" This article was deemed significant enought for the toothpaste maker Colgate to cite it on its website URL","domain":"wiki","before_edit":" Its promoters claim it works by pulling out toxins, which are known as ama in Ayurveda, but there is no credible evidence to support some of these claims and only limited and inconclusive evidence to support other some of these claims, primarily having to do with oral health.","after_edit":" Some of its promoters claim it works by pulling out toxins, which are known as ama in Ayurveda, but there is no credible evidence to support some of these claims and only limited and inconclusive evidence to support other some of these claims, primarily having to do with oral health.","label":"style","raw_intents":["style","coherence","style"]}
{"doc_id":2882854.0,"context":"Noon sights obtain the observer's Latitude. It is impossible to determine longitude with an accuracy better than 10nmi by means of a noon sight. A noon sight is called a Meridian Altitude.Basic Principles of Marine Navigation by D A Moore Published by Kandy p81 While it is very easy to determine the observer's latitude at noon without knowing the exact time, longitude cannot accurately be measured at noon. At noon the sun's change of altitude is very slow, so determining the exact time that the sun is at its zenith by direct observation is impossible, and therefore it is impossible to obtain an accurate longitude at the moment of Zenith . However, it is possible to determine the time of zenith for longitude with a useful accuracy by performing a mean time of observation when the sun is on its ascent and descent prior to and following its moment of Zenith . By taking a sextant reading within 15 to 30 minutes prior to local noon ( zenith ) and noting the time, then leaving the sextant set to the same angle and subsequently observing the moment in time at which the sun passes through the sight tube on its descent from Zenith between a half-hour and hour later, the two times can be averaged to obtain a longitude sufficiently accurate for navigation (within 2nmi).American Practical Navigator (bowditch) by Nathanial Bowditch p253","domain":"wiki","before_edit":" However, it is possible to determine the time of zenith for longitude with a useful accuracy by performing a mean time of observation when the sun is on its ascent and descent prior to and following its moment of Zenith .","after_edit":" However, it is possible to determine the time of culmination for longitude with a useful accuracy by performing a mean time of observation when the sun is on its ascent and descent prior to and following its moment of Zenith .","label":"style","raw_intents":["style","others","clarity"]}
{"doc_id":63712897.0,"context":"Joseph Mercado (, born July 2, 1972) is a Filipino statistician, professor, businessperson and university administrator who was a former dean and vice president of the Polytechnic University of the Philippines . Mercado has co-authored scientific publications involving Pharmaceutical Sciences , economic analysis, and sociological analysis and received the Distinguished Research Award from the Academic International Consortium of Indonesia for his work in 2016. At present, Mercado is a member of the Philippine Statistical Association, Philippine Association for Teacher Education (PAFTE), the Rotary Club of New Manila Heights and a Fellow of Royal Institution based in Singapore  . Early life and education Mercado finished a Bachelor of Applied Statistics degree in 1993, a Master of Applied Science degree in 2000 and a Doctor of Educational Management degree in 2003  at the Polytechnic University of the Philippines. In 2011, Mercado accepted an offer to complete a PhD on Criminology at the Philippine College of Criminology. After being designated as the Vice President of Research, Extension, Planning and Development of the Polytechnic University of the Philippines, he attended an Executive Development Program held by the Commission on Higher Education (CHED) with other university administrators to further his knowledge on higher education management. Career Polytechnic University of the Philippines (20052018) In 2004, Mercado first sat as the Acting Director of PUP Ragay. Consequently, in 2006, he was appointed as the director of PUP Sto. Tomas Batangas  and then designated as the Dean of the College of Science. At the same time, he was also the Assistant Director of Center for Data and Statistical Analysis. Three years later, he became the Executive Director for Branches and Campuses. Mercado then sat as the Vice President for Branches and Campuses for another three years. In late 2015, Mercado was then appointed by Emanuel de Guzman, the university's President, to be the Vice President for Research, Extension, Planning and Development. To pursue personal endeavours, Mercado resigned from office in mid-2018. He still serves as an expert  to the university, specializing in Applied Statistics .","domain":"wiki","before_edit":" In 2011, Mercado accepted an offer to complete a PhD on Criminology at the Philippine College of Criminology.","after_edit":" In 2011, Mercado completed Criminology PhD at the Philippine College of Criminology.","label":"style","raw_intents":["style","others","clarity"]}
{"doc_id":38569161.0,"context":"170px|Textile doll (cotton, wool, wood) The Chancay were a pre-Columbian archeological civilization which developed between the valleys of Fortaleza, Pativilca, Supe, Huaura, Chancay, Chilln, Rimac and Lurn, on the central coast of Peru, from about CE 1000 to 1470. History 200px|Llama effigy (earthenware, slip paint) Not much is known about the Chancay civilization, which developed in the later part of the Inca Empire. This culture emerged after the fall of the Wari civilization. Parts of the southern Chancay area were conquered by the Chim in the early fifteenth century and in about 1450 A.D. the Incas were occupying both areas. It is believed that the Chancay had a centralized political structure , forming a small regional state. Thus the Chancay culture declined in the fifteenth centuryto make way for the territorial expansion of the Inca Empire . The settlements in Lauri, Lumbra, Tambo Blanco, Handrail, Pisquillo Chico and Tronconal focused mainly on artisans producing large-scale ceramics and textiles. The Chancay culture is the first of the Peruvian cultures that had mass production of ceramics, textiles and metals such as gold and silver which were ritualistic and domestic goods. They were also noted for their wood carved items. In type of fabric used include llama wool, cotton, chiffon  and feathers. Their technique involved were decorated open weave, brocade, embroidery, and painting. Brushes were used to paint anthropomorphic, zoomorphic, geometric and other creative designs directly on the canvases. The Chancay are known for the quality of their painted tapestries. The typically geometric designs also included drawings of plants, animals such as fish, cats, birds, monkeys and dogs (most notably the hairless Peruvian dog) as well as human figures. Some of the human fiber sculptures are elaborate and include such scenes as a mother teaching her daughter to weave on a backstrap loom. Birds and deities wearing crescent-like headdresses were one of the more common decorative features. They produced a variety of goods such as clothing, bags, and funeral masks.","domain":"wiki","before_edit":" It is believed that the Chancay had a centralized political structure , forming a small regional state.","after_edit":" The Chancay likely had a centralized political structure , forming a small regional state.","label":"style","raw_intents":["style","style","clarity"]}
