{
    "nodes": [
        {
            "ix": "7-1641_v1_0",
            "content": "Sharing health research data – the role of funders in improving the impact",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_2",
            "content": "Recent public health emergencies with outbreaks of influenza, Ebola and Zika revealed that the mechanisms for sharing research data are neither being used, or adequate for the purpose, particularly where data needs to be shared rapidly.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_3",
            "content": "A review of research papers, including completed clinical trials related to priority pathogens, found only 31% (98 out of 319 published papers, excluding case studies) provided access to all the data underlying the paper - 65% of these papers give no information on how to find or access the data. Only two clinical trials out of 58 on interventions for WHO priority pathogens provided any link in their registry entry to the background data.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_4",
            "content": "Interviews with researchers revealed a reluctance to share data included a lack of confidence in the utility of the data; an absence of academic-incentives for rapid dissemination that prevents subsequent publication and a disconnect between those who are collecting the data and those who wish to use it quickly. The role of the funders of research needs to change to address this. Funders need to engage early with the researchers and related stakeholders to understand their concerns and work harder to define the more explicitly the benefits to all stakeholders. Secondly, there needs to be a direct benefit to sharing data that is directly relevant to those people that collect and curate the data. Thirdly more work needs to be done to realise the intent of making data sharing resources more equitable, ethical and efficient. Finally, a checklist of the issues that need to be addressed when designing new or revising existing data sharing resources should be created. This checklist would highlight the technical, cultural and ethical issues that need to be considered and point to examples of emerging good practice that can be used to address them.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_5",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_6",
            "content": "The benefits of sharing health research data to improve public health have been promoted by international research funders for over a decade but the reality is that the quality and volume of health research data shared, even in emergency situations, remains low <REF-1> , <REF-2> . This lack of progress seems to reflect a cultural reluctance among researchers to ‘give up their data’ without any clear benefits returning to them. This concern is heightened among researchers in low resource settings who feel that the requirements to share data, from funders and journals, risk turning them into data exporters unless greater efforts are made to ensure a fairer distribution of benefits. In this paper we draw on our experience of supporting data sharing initiatives and some commissioned research to highlight the barriers to sharing research data and the role research funders might play to improve this situation.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_7",
            "content": "A decade of progress?",
            "ntype": "title",
            "meta": {
                "section": "2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_8",
            "content": "In January 2011, a group of research funding organizations published a joint statement on sharing health research data with the aim to promote the efficient use of those data to accelerate improvements in public health. The funders recognized that for data sharing to be most effective, a combination of technical and cultural issues need to be addressed. They framed this approach around three principles which required any data sharing mechanism they supported to be equitable, ethical and efficient ( See Wellcome Trust page on sharing research data ). (See Box 1 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_9",
            "content": "Box 1.",
            "ntype": "label",
            "meta": {
                "id": "B1",
                "caption": "Sharing research data to improve public health the principles in the full joint statement by funders of health research (2010)",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_10",
            "content": "<boxed-text xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"B1\"> <caption> <title>Sharing research data to improve public health the principles in the full joint statement by funders of health research (2010)</title> </caption> <p> <bold>Equitable</bold>: any approach to the sharing of data should recognise and balance the needs of researchers who generate and use data, other analysts who might want to reuse those data and the communities and funders who expect health benefits to arise from research.</p> <p> <bold>Ethical</bold>: all data sharing should protect the privacy of individuals and the dignity of communities, while simultaneously respecting the imperative to improve public health through the most productive use of data.</p> <p> <bold>Efficient</bold>: any approach to data sharing should improve the quality and value of research and increase its contribution to improving public health. Approaches should be proportionate and build on existing practice and reduce unnecessary duplication and competition.</p> </boxed-text>",
            "ntype": "boxed-text",
            "meta": {
                "id": "B1",
                "caption": "Sharing research data to improve public health the principles in the full joint statement by funders of health research (2010)",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_11",
            "content": "Progress on encouraging the sharing of research data has been made over the subsequent decade and it is now common for research grants and journals to require the data underlying a paper or clinical trial to be shared (see PLOS editorial and publishing policies , AllTrials , and NIH data sharing policy .) However, recent public health emergencies with outbreaks of influenza, Ebola and Zika have brought into sharp focus the realization that the mechanisms for sharing data are neither being used or adequate for the purpose, particularly where data needs to be shared rapidly <REF-3> – <REF-5> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_12",
            "content": "In addition, researchers working in low- and middle-income countries highlight an inequity created by the disadvantage as they see it by the blanket requirements to share their data. Their concern is that sharing their data too soon, or without any restrictions will lead to their data being analysed by others with greater capacity, and no benefit will return to the researchers themselves or the populations they work with. In effect they become data exporters rather than partners. So while there is a lot of emphasis placed on data being Findable, Accessible, Inter-operable and Reusable, known as the FAIR approach, many researchers in developing countries fear the reality for them will be far from fair <REF-6> – <REF-8> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_13",
            "content": "The findings of two surveys and a workshop",
            "ntype": "title",
            "meta": {
                "section": "3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_14",
            "content": "To explore this further, we commissioned two surveys to review the governance arrangements and standards within existing data sharing resources. The findings of those studies informed a workshop held in October 2017 with a set of stakeholders representing researchers and funding organizations. All the reports and supporting files are published as open access under a Creative Commons licence and in free-to-access repositories. Readers are strongly encouraged to read that material as the primary source of reference <REF-1> , <REF-2> , <REF-9> , <REF-10> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_15",
            "content": "The first survey – Data Sharing in Public Health Emergencies - focussed on data sharing in public health emergencies concerned with the pathogens named by the World Health Organization as of priority concern because of their epidemic or pandemic potential (see WHO list of Blueprint priority diseases ). A review of academic papers published since 2003 relating to these diseases was undertaken and attempts were then made to access the data underlying those publications via the web and through a direct survey of the corresponding authors. Interviews were undertaken with a range of people either conducting or supporting research in these areas and this was supplemented with a review of institutional policies, discussion documents and academic commentaries about standards and norms in data sharing <REF-1> , <REF-2> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_16",
            "content": "The second survey - Development of International Standards for Online Repositories - was designed to identify which ‘standards’ were being used in data sharing relating to the neglected diseases. Standards were identified following a review of publically accessible information (via the web or publication) relating to three main areas each with a set of elements describing the standards under those areas <REF-9> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_17",
            "content": "A third report combined the findings of these two surveys and was used to shape thinking at a workshop held in Antwerp, Belgium in October 2017 <REF-10> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_18",
            "content": "The workshop brought together 26 experts representing agencies that included those that provide data sharing resources for diseases prevalent in low and middle income countries.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_19",
            "content": "What does this tell us?",
            "ntype": "title",
            "meta": {
                "section": "4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_20",
            "content": "Sharing health research data currently remains the exception rather than the norm. The review of research papers, including completed clinical trials related to priority pathogens, found only 31% (98 out of 319 published papers, excluding case studies) provided access to all the data underlying the paper. While a few authors will provide the data on request, 65% of these papers give no information on how to find or access the data. And the review of clinical trial registries, for trials on interventions for priority pathogens, reported an even worse picture. Only two trials out of 58 provided any link in their registry entry to the background data <REF-1> , <REF-2> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_21",
            "content": "Interviews with researchers revealed the reasons for a reluctance to share data included a lack of confidence in the utility of the data and therefore unwillingness to invest resources to prepare it to be shared; absence of academic-incentives for rapid dissemination that prevents subsequent publication (as opposed to the public health need) and a disconnect between those who are collecting the data and those who wish to use it quickly. A similar scepticism about how data might be used or misused, the potential harms to patients and the risks to the researcher sharing data that might reveal errors in their work, have been reported elsewhere <REF-8> , <REF-11> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_22",
            "content": "Table 1 summarises the survey findings that identified which standards are used to share research data for neglected diseases and what those standards cover with respect to data curation, governance, security and longevity. Whilst there is clearly no universal or single standard to cover all the three areas and the elements under them, technical guidance is available across all the areas when those standards are combined. The standards created by the Clinical Data Interchange Standards Consortium (CDISC) were included as the United States Food and Drug Administration (FDA) has required the use CDISC standards in a clinical trial data submission since 2017. Hence these are widely used in industry and CDISC is fast becoming the de facto standard for data labelling and meta data.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_23",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Elements of interest addressed by data repository standards used in sharing data on the neglected diseases (adapted from Castillon et al. <REF-9> ).",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_24",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Elements of interest addressed by data repository standards used in sharing data on the neglected diseases (adapted from Castillon <italic>et al.</italic> <sup> <xref ref-type=\"bibr\" rid=\"ref-9\">9</xref> </sup>).</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" valign=\"middle\">AREAS</th> <th align=\"left\" valign=\"middle\">ELEMENTS</th> <th align=\"left\" valign=\"middle\">TRAC</th> <th align=\"left\" valign=\"middle\">ISO <break/>16363</th> <th align=\"left\" valign=\"middle\">WHO</th> <th align=\"left\" valign=\"middle\">ICSU</th> <th align=\"left\" valign=\"middle\">H3Africa</th> <th align=\"left\" valign=\"middle\">CDISC</th> </tr> </thead> <tbody> <tr> <td align=\"left\" rowspan=\"4\" valign=\"middle\"> <bold>DATA</bold> <break/> <bold>CURATION</bold> </td> <td align=\"left\" valign=\"middle\"> <bold>Metadata</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Discoverability</bold> </td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Data Standardization</bold> </td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">+</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Data Verification and Quality</bold> <break/> <bold>Assurance Procedures</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" rowspan=\"7\" valign=\"middle\"> <bold>SECURITY AND LONGEVITY</bold> </td> <td align=\"left\" valign=\"middle\"> <bold>Encryption, Access Control</bold> <break/> <bold>&amp; Other Security Measures</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Storage</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Data Backup</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Data Migration</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Sustainability of Funding</bold> <break/> <bold>(fee, free-to-access etc.)</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Data Preservation</bold> </td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Succession Plan</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" rowspan=\"4\" valign=\"middle\"> <bold>GOVERNANCE</bold> </td> <td align=\"left\" valign=\"middle\"> <bold>Legal Status</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Access and Terms of use</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Benefit sharing, Intellectual</bold> <break/> <bold>Property Issues</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> </tr> <tr> <td align=\"left\" valign=\"middle\"> <bold>Audit Procedures</bold> </td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">+</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> <td align=\"center\" valign=\"middle\">-</td> </tr> </tbody> </table> <table-wrap-foot> <fn> <p>+ As stated in publicly available information</p> <p>- Information was not mentioned in the publicly available information. </p> <p>TRAC (Trustworthy Repositories Audit &amp; Certification), ISO 16363 (International Standards for Clinical Trial Registries -Space data and information transfer systems, Audit and certification of trustworthy digital repositories), WHO (World Health Organization), ICSU (International Council of Scientific Unions World Data System), H3Africa (The Human Heredity and Health in Africa Initiative), CDISC (Clinical Data Interchange Standards Consortium).</p> </fn> </table-wrap-foot> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Elements of interest addressed by data repository standards used in sharing data on the neglected diseases (adapted from Castillon et al. <REF-9> ).",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_25",
            "content": "What are the next steps: the role for funders in support of data sharing",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_26",
            "content": "Many health research funders have a generic policy requiring research data to be shared in a manner that maximises health and societal benefit. While some biomedical areas, like genomics, have forged ahead in maximizing data sharing, across health research more generally there is very low compliance with these policies. In part this might reflect the limited guidance offered by the same funders in supporting their researchers to understand and undertake data sharing to implement and monitor these policies in practice.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_27",
            "content": "It appears the main barrier to sharing is not technical but cultural, with researchers remaining sceptical about the benefits to them of sharing data. For researchers in low-resource setting data sharing can even be seen as a threat that their data will be exported and exploited by others with little benefit returning to them.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_28",
            "content": "Therefore, research funders should take stock and revise data sharing policies to provide incentive structures for researchers. One clear first step would be to engage early with the researchers and related stakeholders to understand their concerns and work harder to define the benefit of sharing beyond a general sense that sharing data is in the public interest. The overall purpose of sharing the data needs to be clear and ideally developed with input from data suppliers, secondary data users, potential end-users and beneficiaries, and if possible with input from the participants that are the source of those data. Concerns regarding privacy versus the secondary use of the data need to be explored and mechanisms put in place to balance the public benefit against potential risks to privacy and confidentiality.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_29",
            "content": "Secondly, there needs to be a direct benefit to sharing data that is directly relevant to those people that collect and curate the data. For example academics require citation of their work, including a data set. The generation of data and its subsequent citation for reuse needs to be integrated into research assessment – an idea captured in the Declaration on Research Assessment (see San Francisco Declaration on Research Assessment ). So if the purpose of the data sharing mechanism is clear and all stakeholders buy into that purpose and if they feel their inputs will be recognised in research assessment together this will create a strong incentive to share. This was certainly our experience when working with Schistosomiasis researchers <REF-8> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_30",
            "content": "Thirdly, whilst there are a myriad of data standards to work with to meet the general principles of making data FAIR, more work needs to be done to realise the intent of making data sharing resources more equitable, ethical and efficient. As evident in the surveys summarized here good practice is starting to emerge so what is needed is better ways to share that practice. Funders need to work with the researchers and their networks to support the technical work required to develop standards that enable inter-operability.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_31",
            "content": "For example one contributory role for funders would be to collect more systematically the data management plans that they have requested as part of funding grants and make them publicly accessible. In line with good practice these should be standardized where possible and ideally have clear, machine-readable metadata. An online resource that brings together the reference material and policies that are exemplars in each of the categories that cover governance, data curation, security and longevity would provide the basis for a framework to guide the future development of new sharing resources.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_32",
            "content": "Finally, a checklist of the issues that need to be addressed when designing new or revising existing data sharing resources should be created. In addition to defining the purpose of data sharing this would highlight the technical, cultural and ethical issues that need to be considered and point to examples of emerging good practice that can be used to address them. The authors are working on this next stage and hope that with this type of planning and support in place the data sharing long desired by research funders will start to become the norm.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_33",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_34",
            "content": "No data are associated with this article.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_35",
            "content": "<REF-1> Pisani E Ghataure A Merson L : Data sharing in public health emergencies: A study of current policies, practices and infrastructure supporting the sharing of data to prevent and respond to epidemic and pandemic threats . Wellcome Trust. 2018 . 10.6084/m9.figshare.5897608.v1",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_36",
            "content": "<REF-2> Pisani E Ghataure A Merson L : Supporting Data for: Data sharing in public health emergencies: A study of current policies, practices and infrastructure supporting the sharing of data to prevent and respond to epidemic and pandemic threats . Harvard Dataverse, V1. 2017 . 10.7910/DVN/D1HAPO",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_37",
            "content": "<REF-3> Yozwiak NL Schaffner SF Sabeti PC : Data sharing: Make outbreak research open access. Nature. 2015 ; 518 ( 7540 ): 477 – 9 . 25719649 10.1038/518477a",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_38",
            "content": "<REF-5> Olliaro PL : Initiation and publication time-lags of treatment trials for Ebola virus disease. Lancet Infect Dis. 2016 ; 18 ( 1 ): 28 – 29 . 29303737 10.1016/S1473-3099(17)30698-9",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_39",
            "content": "<REF-6> Wilkinson MD Dumontier M Aalbersberg IJ : The FAIR Guiding Principles for scientific data management and stewardship. Sci Data. [Internet]. 2016 ; 3 : 160018 , [cited 2017 Mar 13]. 26978244 10.1038/sdata.2016.18 4792175",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_40",
            "content": "<REF-8> Schistosomiasis Data Platform Stakeholder Meeting Report . World Health Organization, Geneva. 2015 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_41",
            "content": "<REF-9> Castillon G Castilloux AM Moride Y : Development of Standards for Online Repositories . Wellcome Trust, Version 3. 2017 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_42",
            "content": "<REF-10> Sharing health research data in low resource settings: Supporting necessary infrastructure and building on good practice. Pisani E. Report prepared for Wellcome Trust and TDR the Special Programme for Research and Training in Tropical Diseases. 2018 . 10.6084/m9.figshare.6042047.v1",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1641_v1_43",
            "content": "<REF-11> Committee on Population; Division of Behavioral and Social Sciences and Education; The National Academies of Sciences, Engineering, and Medicine : Sharing Research Data to Improve Public Health in Africa: A Workshop Summary . Washington, DC: The National Academies Press, 2015 . 26468573 10.17226/21801",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "7-1641_v1_0@0",
            "content": "Sharing health research data – the role of funders in improving the impact",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_0",
            "start": 0,
            "end": 73,
            "label": {}
        },
        {
            "ix": "7-1641_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-1641_v1_2@0",
            "content": "Recent public health emergencies with outbreaks of influenza, Ebola and Zika revealed that the mechanisms for sharing research data are neither being used, or adequate for the purpose, particularly where data needs to be shared rapidly.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_2",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "7-1641_v1_3@0",
            "content": "A review of research papers, including completed clinical trials related to priority pathogens, found only 31% (98 out of 319 published papers, excluding case studies) provided access to all the data underlying the paper - 65% of these papers give no information on how to find or access the data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_3",
            "start": 0,
            "end": 296,
            "label": {}
        },
        {
            "ix": "7-1641_v1_3@1",
            "content": "Only two clinical trials out of 58 on interventions for WHO priority pathogens provided any link in their registry entry to the background data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_3",
            "start": 298,
            "end": 441,
            "label": {}
        },
        {
            "ix": "7-1641_v1_4@0",
            "content": "Interviews with researchers revealed a reluctance to share data included a lack of confidence in the utility of the data; an absence of academic-incentives for rapid dissemination that prevents subsequent publication and a disconnect between those who are collecting the data and those who wish to use it quickly.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_4",
            "start": 0,
            "end": 312,
            "label": {}
        },
        {
            "ix": "7-1641_v1_4@1",
            "content": "The role of the funders of research needs to change to address this.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_4",
            "start": 314,
            "end": 381,
            "label": {}
        },
        {
            "ix": "7-1641_v1_4@2",
            "content": "Funders need to engage early with the researchers and related stakeholders to understand their concerns and work harder to define the more explicitly the benefits to all stakeholders.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_4",
            "start": 383,
            "end": 565,
            "label": {}
        },
        {
            "ix": "7-1641_v1_4@3",
            "content": "Secondly, there needs to be a direct benefit to sharing data that is directly relevant to those people that collect and curate the data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_4",
            "start": 567,
            "end": 702,
            "label": {}
        },
        {
            "ix": "7-1641_v1_4@4",
            "content": "Thirdly more work needs to be done to realise the intent of making data sharing resources more equitable, ethical and efficient.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_4",
            "start": 704,
            "end": 831,
            "label": {}
        },
        {
            "ix": "7-1641_v1_4@5",
            "content": "Finally, a checklist of the issues that need to be addressed when designing new or revising existing data sharing resources should be created.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_4",
            "start": 833,
            "end": 974,
            "label": {}
        },
        {
            "ix": "7-1641_v1_4@6",
            "content": "This checklist would highlight the technical, cultural and ethical issues that need to be considered and point to examples of emerging good practice that can be used to address them.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_4",
            "start": 976,
            "end": 1157,
            "label": {}
        },
        {
            "ix": "7-1641_v1_5@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_5",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "7-1641_v1_6@0",
            "content": "The benefits of sharing health research data to improve public health have been promoted by international research funders for over a decade but the reality is that the quality and volume of health research data shared, even in emergency situations, remains low <REF-1> , <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_6",
            "start": 0,
            "end": 280,
            "label": {}
        },
        {
            "ix": "7-1641_v1_6@1",
            "content": "This lack of progress seems to reflect a cultural reluctance among researchers to ‘give up their data’ without any clear benefits returning to them.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_6",
            "start": 282,
            "end": 429,
            "label": {}
        },
        {
            "ix": "7-1641_v1_6@2",
            "content": "This concern is heightened among researchers in low resource settings who feel that the requirements to share data, from funders and journals, risk turning them into data exporters unless greater efforts are made to ensure a fairer distribution of benefits.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_6",
            "start": 431,
            "end": 687,
            "label": {}
        },
        {
            "ix": "7-1641_v1_6@3",
            "content": "In this paper we draw on our experience of supporting data sharing initiatives and some commissioned research to highlight the barriers to sharing research data and the role research funders might play to improve this situation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_6",
            "start": 689,
            "end": 916,
            "label": {}
        },
        {
            "ix": "7-1641_v1_7@0",
            "content": "A decade of progress?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_7",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "7-1641_v1_8@0",
            "content": "In January 2011, a group of research funding organizations published a joint statement on sharing health research data with the aim to promote the efficient use of those data to accelerate improvements in public health.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_8",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "7-1641_v1_8@1",
            "content": "The funders recognized that for data sharing to be most effective, a combination of technical and cultural issues need to be addressed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_8",
            "start": 220,
            "end": 354,
            "label": {}
        },
        {
            "ix": "7-1641_v1_8@2",
            "content": "They framed this approach around three principles which required any data sharing mechanism they supported to be equitable, ethical and efficient ( See Wellcome Trust page on sharing research data ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_8",
            "start": 356,
            "end": 554,
            "label": {}
        },
        {
            "ix": "7-1641_v1_8@3",
            "content": "(See Box 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_8",
            "start": 556,
            "end": 568,
            "label": {}
        },
        {
            "ix": "7-1641_v1_9@0",
            "content": "Box 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_9",
            "start": 0,
            "end": 5,
            "label": {}
        },
        {
            "ix": "7-1641_v1_11@0",
            "content": "Progress on encouraging the sharing of research data has been made over the subsequent decade and it is now common for research grants and journals to require the data underlying a paper or clinical trial to be shared (see PLOS editorial and publishing policies , AllTrials , and NIH data sharing policy .) However, recent public health emergencies with outbreaks of influenza, Ebola and Zika have brought into sharp focus the realization that the mechanisms for sharing data are neither being used or adequate for the purpose, particularly where data needs to be shared rapidly <REF-3> – <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_11",
            "start": 0,
            "end": 597,
            "label": {}
        },
        {
            "ix": "7-1641_v1_12@0",
            "content": "In addition, researchers working in low- and middle-income countries highlight an inequity created by the disadvantage as they see it by the blanket requirements to share their data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_12",
            "start": 0,
            "end": 181,
            "label": {}
        },
        {
            "ix": "7-1641_v1_12@1",
            "content": "Their concern is that sharing their data too soon, or without any restrictions will lead to their data being analysed by others with greater capacity, and no benefit will return to the researchers themselves or the populations they work with.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_12",
            "start": 183,
            "end": 424,
            "label": {}
        },
        {
            "ix": "7-1641_v1_12@2",
            "content": "In effect they become data exporters rather than partners.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_12",
            "start": 426,
            "end": 483,
            "label": {}
        },
        {
            "ix": "7-1641_v1_12@3",
            "content": "So while there is a lot of emphasis placed on data being Findable, Accessible, Inter-operable and Reusable, known as the FAIR approach, many researchers in developing countries fear the reality for them will be far from fair <REF-6> – <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_12",
            "start": 485,
            "end": 728,
            "label": {}
        },
        {
            "ix": "7-1641_v1_13@0",
            "content": "The findings of two surveys and a workshop",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_13",
            "start": 0,
            "end": 41,
            "label": {}
        },
        {
            "ix": "7-1641_v1_14@0",
            "content": "To explore this further, we commissioned two surveys to review the governance arrangements and standards within existing data sharing resources.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_14",
            "start": 0,
            "end": 143,
            "label": {}
        },
        {
            "ix": "7-1641_v1_14@1",
            "content": "The findings of those studies informed a workshop held in October 2017 with a set of stakeholders representing researchers and funding organizations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_14",
            "start": 145,
            "end": 293,
            "label": {}
        },
        {
            "ix": "7-1641_v1_14@2",
            "content": "All the reports and supporting files are published as open access under a Creative Commons licence and in free-to-access repositories.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_14",
            "start": 295,
            "end": 428,
            "label": {}
        },
        {
            "ix": "7-1641_v1_14@3",
            "content": "Readers are strongly encouraged to read that material as the primary source of reference <REF-1> , <REF-2> , <REF-9> , <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_14",
            "start": 430,
            "end": 558,
            "label": {}
        },
        {
            "ix": "7-1641_v1_15@0",
            "content": "The first survey – Data Sharing in Public Health Emergencies - focussed on data sharing in public health emergencies concerned with the pathogens named by the World Health Organization as of priority concern because of their epidemic or pandemic potential (see WHO list of Blueprint priority diseases ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_15",
            "start": 0,
            "end": 302,
            "label": {}
        },
        {
            "ix": "7-1641_v1_15@1",
            "content": "A review of academic papers published since 2003 relating to these diseases was undertaken and attempts were then made to access the data underlying those publications via the web and through a direct survey of the corresponding authors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_15",
            "start": 304,
            "end": 540,
            "label": {}
        },
        {
            "ix": "7-1641_v1_15@2",
            "content": "Interviews were undertaken with a range of people either conducting or supporting research in these areas and this was supplemented with a review of institutional policies, discussion documents and academic commentaries about standards and norms in data sharing <REF-1> , <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_15",
            "start": 542,
            "end": 822,
            "label": {}
        },
        {
            "ix": "7-1641_v1_16@0",
            "content": "The second survey - Development of International Standards for Online Repositories - was designed to identify which ‘standards’ were being used in data sharing relating to the neglected diseases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_16",
            "start": 0,
            "end": 194,
            "label": {}
        },
        {
            "ix": "7-1641_v1_16@1",
            "content": "Standards were identified following a review of publically accessible information (via the web or publication) relating to three main areas each with a set of elements describing the standards under those areas <REF-9> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_16",
            "start": 196,
            "end": 415,
            "label": {}
        },
        {
            "ix": "7-1641_v1_17@0",
            "content": "A third report combined the findings of these two surveys and was used to shape thinking at a workshop held in Antwerp, Belgium in October 2017 <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_17",
            "start": 0,
            "end": 153,
            "label": {}
        },
        {
            "ix": "7-1641_v1_18@0",
            "content": "The workshop brought together 26 experts representing agencies that included those that provide data sharing resources for diseases prevalent in low and middle income countries.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_18",
            "start": 0,
            "end": 176,
            "label": {}
        },
        {
            "ix": "7-1641_v1_19@0",
            "content": "What does this tell us?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_19",
            "start": 0,
            "end": 22,
            "label": {}
        },
        {
            "ix": "7-1641_v1_20@0",
            "content": "Sharing health research data currently remains the exception rather than the norm.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_20",
            "start": 0,
            "end": 81,
            "label": {}
        },
        {
            "ix": "7-1641_v1_20@1",
            "content": "The review of research papers, including completed clinical trials related to priority pathogens, found only 31% (98 out of 319 published papers, excluding case studies) provided access to all the data underlying the paper.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_20",
            "start": 83,
            "end": 305,
            "label": {}
        },
        {
            "ix": "7-1641_v1_20@2",
            "content": "While a few authors will provide the data on request, 65% of these papers give no information on how to find or access the data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_20",
            "start": 307,
            "end": 434,
            "label": {}
        },
        {
            "ix": "7-1641_v1_20@3",
            "content": "And the review of clinical trial registries, for trials on interventions for priority pathogens, reported an even worse picture.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_20",
            "start": 436,
            "end": 563,
            "label": {}
        },
        {
            "ix": "7-1641_v1_20@4",
            "content": "Only two trials out of 58 provided any link in their registry entry to the background data <REF-1> , <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_20",
            "start": 565,
            "end": 674,
            "label": {}
        },
        {
            "ix": "7-1641_v1_21@0",
            "content": "Interviews with researchers revealed the reasons for a reluctance to share data included a lack of confidence in the utility of the data and therefore unwillingness to invest resources to prepare it to be shared; absence of academic-incentives for rapid dissemination that prevents subsequent publication (as opposed to the public health need) and a disconnect between those who are collecting the data and those who wish to use it quickly.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_21",
            "start": 0,
            "end": 439,
            "label": {}
        },
        {
            "ix": "7-1641_v1_21@1",
            "content": "A similar scepticism about how data might be used or misused, the potential harms to patients and the risks to the researcher sharing data that might reveal errors in their work, have been reported elsewhere <REF-8> , <REF-11> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_21",
            "start": 441,
            "end": 668,
            "label": {}
        },
        {
            "ix": "7-1641_v1_22@0",
            "content": "Table 1 summarises the survey findings that identified which standards are used to share research data for neglected diseases and what those standards cover with respect to data curation, governance, security and longevity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_22",
            "start": 0,
            "end": 222,
            "label": {}
        },
        {
            "ix": "7-1641_v1_22@1",
            "content": "Whilst there is clearly no universal or single standard to cover all the three areas and the elements under them, technical guidance is available across all the areas when those standards are combined.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_22",
            "start": 224,
            "end": 424,
            "label": {}
        },
        {
            "ix": "7-1641_v1_22@2",
            "content": "The standards created by the Clinical Data Interchange Standards Consortium (CDISC) were included as the United States Food and Drug Administration (FDA) has required the use CDISC standards in a clinical trial data submission since 2017.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_22",
            "start": 426,
            "end": 663,
            "label": {}
        },
        {
            "ix": "7-1641_v1_22@3",
            "content": "Hence these are widely used in industry and CDISC is fast becoming the de facto standard for data labelling and meta data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_22",
            "start": 665,
            "end": 786,
            "label": {}
        },
        {
            "ix": "7-1641_v1_23@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_23",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-1641_v1_25@0",
            "content": "What are the next steps: the role for funders in support of data sharing",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_25",
            "start": 0,
            "end": 71,
            "label": {}
        },
        {
            "ix": "7-1641_v1_26@0",
            "content": "Many health research funders have a generic policy requiring research data to be shared in a manner that maximises health and societal benefit.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_26",
            "start": 0,
            "end": 142,
            "label": {}
        },
        {
            "ix": "7-1641_v1_26@1",
            "content": "While some biomedical areas, like genomics, have forged ahead in maximizing data sharing, across health research more generally there is very low compliance with these policies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_26",
            "start": 144,
            "end": 320,
            "label": {}
        },
        {
            "ix": "7-1641_v1_26@2",
            "content": "In part this might reflect the limited guidance offered by the same funders in supporting their researchers to understand and undertake data sharing to implement and monitor these policies in practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_26",
            "start": 322,
            "end": 522,
            "label": {}
        },
        {
            "ix": "7-1641_v1_27@0",
            "content": "It appears the main barrier to sharing is not technical but cultural, with researchers remaining sceptical about the benefits to them of sharing data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_27",
            "start": 0,
            "end": 149,
            "label": {}
        },
        {
            "ix": "7-1641_v1_27@1",
            "content": "For researchers in low-resource setting data sharing can even be seen as a threat that their data will be exported and exploited by others with little benefit returning to them.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_27",
            "start": 151,
            "end": 327,
            "label": {}
        },
        {
            "ix": "7-1641_v1_28@0",
            "content": "Therefore, research funders should take stock and revise data sharing policies to provide incentive structures for researchers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_28",
            "start": 0,
            "end": 126,
            "label": {}
        },
        {
            "ix": "7-1641_v1_28@1",
            "content": "One clear first step would be to engage early with the researchers and related stakeholders to understand their concerns and work harder to define the benefit of sharing beyond a general sense that sharing data is in the public interest.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_28",
            "start": 128,
            "end": 364,
            "label": {}
        },
        {
            "ix": "7-1641_v1_28@2",
            "content": "The overall purpose of sharing the data needs to be clear and ideally developed with input from data suppliers, secondary data users, potential end-users and beneficiaries, and if possible with input from the participants that are the source of those data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_28",
            "start": 366,
            "end": 621,
            "label": {}
        },
        {
            "ix": "7-1641_v1_28@3",
            "content": "Concerns regarding privacy versus the secondary use of the data need to be explored and mechanisms put in place to balance the public benefit against potential risks to privacy and confidentiality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_28",
            "start": 623,
            "end": 819,
            "label": {}
        },
        {
            "ix": "7-1641_v1_29@0",
            "content": "Secondly, there needs to be a direct benefit to sharing data that is directly relevant to those people that collect and curate the data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_29",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "7-1641_v1_29@1",
            "content": "For example academics require citation of their work, including a data set.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_29",
            "start": 137,
            "end": 211,
            "label": {}
        },
        {
            "ix": "7-1641_v1_29@2",
            "content": "The generation of data and its subsequent citation for reuse needs to be integrated into research assessment – an idea captured in the Declaration on Research Assessment (see San Francisco Declaration on Research Assessment ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_29",
            "start": 213,
            "end": 438,
            "label": {}
        },
        {
            "ix": "7-1641_v1_29@3",
            "content": "So if the purpose of the data sharing mechanism is clear and all stakeholders buy into that purpose and if they feel their inputs will be recognised in research assessment together this will create a strong incentive to share.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_29",
            "start": 440,
            "end": 665,
            "label": {}
        },
        {
            "ix": "7-1641_v1_29@4",
            "content": "This was certainly our experience when working with Schistosomiasis researchers <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_29",
            "start": 667,
            "end": 755,
            "label": {}
        },
        {
            "ix": "7-1641_v1_30@0",
            "content": "Thirdly, whilst there are a myriad of data standards to work with to meet the general principles of making data FAIR, more work needs to be done to realise the intent of making data sharing resources more equitable, ethical and efficient.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_30",
            "start": 0,
            "end": 237,
            "label": {}
        },
        {
            "ix": "7-1641_v1_30@1",
            "content": "As evident in the surveys summarized here good practice is starting to emerge so what is needed is better ways to share that practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_30",
            "start": 239,
            "end": 372,
            "label": {}
        },
        {
            "ix": "7-1641_v1_30@2",
            "content": "Funders need to work with the researchers and their networks to support the technical work required to develop standards that enable inter-operability.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_30",
            "start": 374,
            "end": 524,
            "label": {}
        },
        {
            "ix": "7-1641_v1_31@0",
            "content": "For example one contributory role for funders would be to collect more systematically the data management plans that they have requested as part of funding grants and make them publicly accessible.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_31",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "7-1641_v1_31@1",
            "content": "In line with good practice these should be standardized where possible and ideally have clear, machine-readable metadata.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_31",
            "start": 198,
            "end": 318,
            "label": {}
        },
        {
            "ix": "7-1641_v1_31@2",
            "content": "An online resource that brings together the reference material and policies that are exemplars in each of the categories that cover governance, data curation, security and longevity would provide the basis for a framework to guide the future development of new sharing resources.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_31",
            "start": 320,
            "end": 598,
            "label": {}
        },
        {
            "ix": "7-1641_v1_32@0",
            "content": "Finally, a checklist of the issues that need to be addressed when designing new or revising existing data sharing resources should be created.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_32",
            "start": 0,
            "end": 141,
            "label": {}
        },
        {
            "ix": "7-1641_v1_32@1",
            "content": "In addition to defining the purpose of data sharing this would highlight the technical, cultural and ethical issues that need to be considered and point to examples of emerging good practice that can be used to address them.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_32",
            "start": 143,
            "end": 366,
            "label": {}
        },
        {
            "ix": "7-1641_v1_32@2",
            "content": "The authors are working on this next stage and hope that with this type of planning and support in place the data sharing long desired by research funders will start to become the norm.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_32",
            "start": 368,
            "end": 552,
            "label": {}
        },
        {
            "ix": "7-1641_v1_33@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_33",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "7-1641_v1_34@0",
            "content": "No data are associated with this article.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_34",
            "start": 0,
            "end": 40,
            "label": {}
        },
        {
            "ix": "7-1641_v1_35@0",
            "content": "<REF-1> Pisani E Ghataure A Merson L : Data sharing in public health emergencies: A study of current policies, practices and infrastructure supporting the sharing of data to prevent and respond to epidemic and pandemic threats . Wellcome Trust. 2018 . 10.6084/m9.figshare.5897608.v1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_35",
            "start": 0,
            "end": 281,
            "label": {}
        },
        {
            "ix": "7-1641_v1_36@0",
            "content": "<REF-2> Pisani E Ghataure A Merson L : Supporting Data for: Data sharing in public health emergencies: A study of current policies, practices and infrastructure supporting the sharing of data to prevent and respond to epidemic and pandemic threats . Harvard Dataverse, V1. 2017 . 10.7910/DVN/D1HAPO",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_36",
            "start": 0,
            "end": 297,
            "label": {}
        },
        {
            "ix": "7-1641_v1_37@0",
            "content": "<REF-3> Yozwiak NL Schaffner SF Sabeti PC : Data sharing: Make outbreak research open access. Nature. 2015 ; 518 ( 7540 ): 477 – 9 . 25719649 10.1038/518477a",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_37",
            "start": 0,
            "end": 156,
            "label": {}
        },
        {
            "ix": "7-1641_v1_38@0",
            "content": "<REF-5> Olliaro PL : Initiation and publication time-lags of treatment trials for Ebola virus disease. Lancet Infect Dis. 2016 ; 18 ( 1 ): 28 – 29 . 29303737 10.1016/S1473-3099(17)30698-9",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_38",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "7-1641_v1_39@0",
            "content": "<REF-6> Wilkinson MD Dumontier M Aalbersberg IJ : The FAIR Guiding Principles for scientific data management and stewardship. Sci Data. [Internet]. 2016 ; 3 : 160018 , [cited 2017 Mar 13]. 26978244 10.1038/sdata.2016.18 4792175",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_39",
            "start": 0,
            "end": 226,
            "label": {}
        },
        {
            "ix": "7-1641_v1_40@0",
            "content": "<REF-8> Schistosomiasis Data Platform Stakeholder Meeting Report . World Health Organization, Geneva. 2015 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_40",
            "start": 0,
            "end": 124,
            "label": {}
        },
        {
            "ix": "7-1641_v1_41@0",
            "content": "<REF-9> Castillon G Castilloux AM Moride Y : Development of Standards for Online Repositories . Wellcome Trust, Version 3. 2017 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_41",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "7-1641_v1_42@0",
            "content": "<REF-10> Sharing health research data in low resource settings: Supporting necessary infrastructure and building on good practice. Pisani E. Report prepared for Wellcome Trust and TDR the Special Programme for Research and Training in Tropical Diseases. 2018 . 10.6084/m9.figshare.6042047.v1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_42",
            "start": 0,
            "end": 290,
            "label": {}
        },
        {
            "ix": "7-1641_v1_43@0",
            "content": "<REF-11> Committee on Population; Division of Behavioral and Social Sciences and Education; The National Academies of Sciences, Engineering, and Medicine : Sharing Research Data to Improve Public Health in Africa: A Workshop Summary . Washington, DC: The National Academies Press, 2015 . 26468573 10.17226/21801",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1641_v1_43",
            "start": 0,
            "end": 310,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "7-1641_v1_0",
            "tgt_ix": "7-1641_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_1",
            "tgt_ix": "7-1641_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_1",
            "tgt_ix": "7-1641_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_1",
            "tgt_ix": "7-1641_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_0",
            "tgt_ix": "7-1641_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_5",
            "tgt_ix": "7-1641_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_0",
            "tgt_ix": "7-1641_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_7",
            "tgt_ix": "7-1641_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_7",
            "tgt_ix": "7-1641_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_9",
            "tgt_ix": "7-1641_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_7",
            "tgt_ix": "7-1641_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_7",
            "tgt_ix": "7-1641_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_0",
            "tgt_ix": "7-1641_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_13",
            "tgt_ix": "7-1641_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_13",
            "tgt_ix": "7-1641_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_13",
            "tgt_ix": "7-1641_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_13",
            "tgt_ix": "7-1641_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_13",
            "tgt_ix": "7-1641_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_0",
            "tgt_ix": "7-1641_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_19",
            "tgt_ix": "7-1641_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_19",
            "tgt_ix": "7-1641_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_19",
            "tgt_ix": "7-1641_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_19",
            "tgt_ix": "7-1641_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_23",
            "tgt_ix": "7-1641_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_0",
            "tgt_ix": "7-1641_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_25",
            "tgt_ix": "7-1641_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_25",
            "tgt_ix": "7-1641_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_25",
            "tgt_ix": "7-1641_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_25",
            "tgt_ix": "7-1641_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_25",
            "tgt_ix": "7-1641_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_25",
            "tgt_ix": "7-1641_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_25",
            "tgt_ix": "7-1641_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_0",
            "tgt_ix": "7-1641_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_33",
            "tgt_ix": "7-1641_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_0",
            "tgt_ix": "7-1641_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_1",
            "tgt_ix": "7-1641_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_2",
            "tgt_ix": "7-1641_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_3",
            "tgt_ix": "7-1641_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_4",
            "tgt_ix": "7-1641_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_5",
            "tgt_ix": "7-1641_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_6",
            "tgt_ix": "7-1641_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_7",
            "tgt_ix": "7-1641_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_8",
            "tgt_ix": "7-1641_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_9",
            "tgt_ix": "7-1641_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_10",
            "tgt_ix": "7-1641_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_11",
            "tgt_ix": "7-1641_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_12",
            "tgt_ix": "7-1641_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_13",
            "tgt_ix": "7-1641_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_14",
            "tgt_ix": "7-1641_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_15",
            "tgt_ix": "7-1641_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_16",
            "tgt_ix": "7-1641_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_17",
            "tgt_ix": "7-1641_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_18",
            "tgt_ix": "7-1641_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_19",
            "tgt_ix": "7-1641_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_20",
            "tgt_ix": "7-1641_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_21",
            "tgt_ix": "7-1641_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_22",
            "tgt_ix": "7-1641_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_23",
            "tgt_ix": "7-1641_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_24",
            "tgt_ix": "7-1641_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_25",
            "tgt_ix": "7-1641_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_26",
            "tgt_ix": "7-1641_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_27",
            "tgt_ix": "7-1641_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_28",
            "tgt_ix": "7-1641_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_29",
            "tgt_ix": "7-1641_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_30",
            "tgt_ix": "7-1641_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_31",
            "tgt_ix": "7-1641_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_32",
            "tgt_ix": "7-1641_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_33",
            "tgt_ix": "7-1641_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_6",
            "tgt_ix": "7-1641_v1_35",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_6",
            "tgt_ix": "7-1641_v1_36",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_11",
            "tgt_ix": "7-1641_v1_37",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_11",
            "tgt_ix": "7-1641_v1_38",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_12",
            "tgt_ix": "7-1641_v1_39",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_12",
            "tgt_ix": "7-1641_v1_40",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_14",
            "tgt_ix": "7-1641_v1_41",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_14",
            "tgt_ix": "7-1641_v1_42",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_21",
            "tgt_ix": "7-1641_v1_43",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_22",
            "tgt_ix": "7-1641_v1_24",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1641_v1_0",
            "tgt_ix": "7-1641_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_1",
            "tgt_ix": "7-1641_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_2",
            "tgt_ix": "7-1641_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_3",
            "tgt_ix": "7-1641_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_3",
            "tgt_ix": "7-1641_v1_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_4",
            "tgt_ix": "7-1641_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_4",
            "tgt_ix": "7-1641_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_4",
            "tgt_ix": "7-1641_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_4",
            "tgt_ix": "7-1641_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_4",
            "tgt_ix": "7-1641_v1_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_4",
            "tgt_ix": "7-1641_v1_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_4",
            "tgt_ix": "7-1641_v1_4@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_5",
            "tgt_ix": "7-1641_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_6",
            "tgt_ix": "7-1641_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_6",
            "tgt_ix": "7-1641_v1_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_6",
            "tgt_ix": "7-1641_v1_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_6",
            "tgt_ix": "7-1641_v1_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_7",
            "tgt_ix": "7-1641_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_8",
            "tgt_ix": "7-1641_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_8",
            "tgt_ix": "7-1641_v1_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_8",
            "tgt_ix": "7-1641_v1_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_8",
            "tgt_ix": "7-1641_v1_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_9",
            "tgt_ix": "7-1641_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_11",
            "tgt_ix": "7-1641_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_12",
            "tgt_ix": "7-1641_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_12",
            "tgt_ix": "7-1641_v1_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_12",
            "tgt_ix": "7-1641_v1_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_12",
            "tgt_ix": "7-1641_v1_12@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_13",
            "tgt_ix": "7-1641_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_14",
            "tgt_ix": "7-1641_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_14",
            "tgt_ix": "7-1641_v1_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_14",
            "tgt_ix": "7-1641_v1_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_14",
            "tgt_ix": "7-1641_v1_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_15",
            "tgt_ix": "7-1641_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_15",
            "tgt_ix": "7-1641_v1_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_15",
            "tgt_ix": "7-1641_v1_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_16",
            "tgt_ix": "7-1641_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_16",
            "tgt_ix": "7-1641_v1_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_17",
            "tgt_ix": "7-1641_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_18",
            "tgt_ix": "7-1641_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_19",
            "tgt_ix": "7-1641_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_20",
            "tgt_ix": "7-1641_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_20",
            "tgt_ix": "7-1641_v1_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_20",
            "tgt_ix": "7-1641_v1_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_20",
            "tgt_ix": "7-1641_v1_20@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_20",
            "tgt_ix": "7-1641_v1_20@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_21",
            "tgt_ix": "7-1641_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_21",
            "tgt_ix": "7-1641_v1_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_22",
            "tgt_ix": "7-1641_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_22",
            "tgt_ix": "7-1641_v1_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_22",
            "tgt_ix": "7-1641_v1_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_22",
            "tgt_ix": "7-1641_v1_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_23",
            "tgt_ix": "7-1641_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_25",
            "tgt_ix": "7-1641_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_26",
            "tgt_ix": "7-1641_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_26",
            "tgt_ix": "7-1641_v1_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_26",
            "tgt_ix": "7-1641_v1_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_27",
            "tgt_ix": "7-1641_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_27",
            "tgt_ix": "7-1641_v1_27@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_28",
            "tgt_ix": "7-1641_v1_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_28",
            "tgt_ix": "7-1641_v1_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_28",
            "tgt_ix": "7-1641_v1_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_28",
            "tgt_ix": "7-1641_v1_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_29",
            "tgt_ix": "7-1641_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_29",
            "tgt_ix": "7-1641_v1_29@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_29",
            "tgt_ix": "7-1641_v1_29@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_29",
            "tgt_ix": "7-1641_v1_29@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_29",
            "tgt_ix": "7-1641_v1_29@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_30",
            "tgt_ix": "7-1641_v1_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_30",
            "tgt_ix": "7-1641_v1_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_30",
            "tgt_ix": "7-1641_v1_30@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_31",
            "tgt_ix": "7-1641_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_31",
            "tgt_ix": "7-1641_v1_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_31",
            "tgt_ix": "7-1641_v1_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_32",
            "tgt_ix": "7-1641_v1_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_32",
            "tgt_ix": "7-1641_v1_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_32",
            "tgt_ix": "7-1641_v1_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_33",
            "tgt_ix": "7-1641_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_34",
            "tgt_ix": "7-1641_v1_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_35",
            "tgt_ix": "7-1641_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_36",
            "tgt_ix": "7-1641_v1_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_37",
            "tgt_ix": "7-1641_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_38",
            "tgt_ix": "7-1641_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_39",
            "tgt_ix": "7-1641_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_40",
            "tgt_ix": "7-1641_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_41",
            "tgt_ix": "7-1641_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_42",
            "tgt_ix": "7-1641_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1641_v1_43",
            "tgt_ix": "7-1641_v1_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "7-1641_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.16523.1",
        "atype": "opinion-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Sharing health research data – the role of funders in improving the impact",
        "abstract": "Recent public health emergencies with outbreaks of influenza, Ebola and Zika revealed that the mechanisms for sharing research data are neither being used, or adequate for the purpose, particularly where data needs to be shared rapidly. A review of research papers, including completed clinical trials related to priority pathogens, found only 31% (98 out of 319 published papers, excluding case studies) provided access to all the data underlying the paper - 65% of these papers give no information on how to find or access the data. Only two clinical trials out of 58 on interventions for WHO priority pathogens provided any link in their registry entry to the background data. Interviews with researchers revealed a reluctance to share data included a lack of confidence in the utility of the data; an absence of academic-incentives for rapid dissemination that prevents subsequent publication and a disconnect between those who are collecting the data and those who wish to use it quickly. The role of the funders of research needs to change to address this. Funders need to engage early with the researchers and related stakeholders to understand their concerns and work harder to define the more explicitly the benefits to all stakeholders. Secondly, there needs to be a direct benefit to sharing data that is directly relevant to those people that collect and curate the data. Thirdly more work needs to be done to realise the intent of making data sharing resources more equitable, ethical and efficient. Finally, a checklist of the issues that need to be addressed when designing new or revising existing data sharing resources should be created. This checklist would highlight the technical, cultural and ethical issues that need to be considered and point to examples of emerging good practice that can be used to address them.",
        "contributors": [
            {
                "surname": "Terry",
                "given-names": "Robert F."
            },
            {
                "surname": "Littler",
                "given-names": "Katherine"
            },
            {
                "surname": "Olliaro",
                "given-names": "Piero L."
            }
        ],
        "url": "https://f1000research.com/articles/7-1641/v1/",
        "doc_id": "7-1641",
        "version": 1,
        "ix_counter": 175,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}