{
    "nodes": [
        {
            "ix": "348-ARR_v1_0",
            "content": "Primum Non Nocere: Before working with Indigenous data, the ACL must confront ongoing colonialism",
            "ntype": "article-title",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_2",
            "content": "In this paper, we challenge the ACL community to reckon with historical and ongoing colonialism by adopting a set of ethical obligations and best practices drawn from the Indigenous studies literature. While the vast majority of NLP research focuses on a very small number of very high resource languages (English, Chinese, etc), some work has begun to engage with Indigenous languages. No research involving Indigenous language data can be considered ethical without first acknowledging that Indigenous languages are not merely very low resource languages. The toxic legacy of colonialism permeates every aspect of interaction between Indigenous communities and outside academic researchers. Ethical research must actively challenge this colonial legacy by explicitly acknowledging and centering Indigenous community goals and Indigenous ways of knowing. To this end, we propose that the ACL draft and adopt an ethical framework for NLP researchers and computational linguists wishing to engage in research involving Indigenous languages.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1"
            }
        },
        {
            "ix": "348-ARR_v1_4",
            "content": "Beginning with our community's first academic conference in 1952 (see Reifler, 1954) and continuing with the establishment of the Association for Computational Linguistics (ACL) 1 in 1962 (MT Journal, 1962), the members of our research community have examined a huge range of topics, ranging from linguistic and computational linguistic models and theories to engineering-focused problems in natural language processing. 2 While great progress has been made in recent years across many NLP tasks, the overwhelming 1 Originally founded as the Association for Machine Translation and Computational Linguistics, the current name stems from 1968 after the publication of the 1966 ALPAC report.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_5",
            "content": "2 See Linguistic Issues in Language Technology (2011) and Eisner (2016) for excellent discussions on the distinction between computational linguistics (CL) and natural language processing (NLP). majority of NLP and CL research focuses on a very small number of languages. Over the 70 years from 1952 to 2022, the vast majority of CL and NLP research has focused on a small number of widely-spoken languages, nearly all of which represent politically-and economically-dominant nationstates and the languages of those nation-states' historical and current adversaries: English, the Germanic and Romance languages of western Europe, Russian and the Slavic languages of eastern Europe, Hebrew, Arabic, Chinese, Japanese, and Korean. Bender (2009) surveyed papers from ACL 2008 and found that English dominated (63% of papers), with 20 other languages distributed along a long Zipfian tail (Chinese and German shared the number 2 slot at just under 4% of papers each); across all ACL 2008 long papers, only three languages (Hindi, Turkish, and Wambaya) were represented outside of the language families listed previously. This lack of diversity directly impacts both the quality and ethical status of our research, as nearly every successful NLP technique in widespread current use was designed around the linguistic characteristics of English. 3 A special theme designed to address this shortcoming has been selected for the 60th Annual Meeting of the ACL in 2022: \"Language Diversity: from Low Resource to Endangered Languages.\" This theme is to be commended as a step towards a more linguistically diverse research agenda. Yet as we expand our research to a broader and more inclusive set of languages, we must take great care to do so ethically. The endangered Indigenous languages of the world are not merely very low resource languages. The toxic legacy of colonialism permeates every aspect of interaction between Indigenous communities and outside academic re-3 A small minority of successful NLP techniques were designed taking into account the characteristics of a few other languages, nearly all from the Indo-European and Sino-Tibetan language families. searchers (Smith, 2012). Ethical research must actively challenge this colonial legacy by explicitly acknowledging and centering Indigenous community goals and Indigenous ways of knowing.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_6",
            "content": "To this end, we propose an ethical framework for NLP researchers and computational linguists wishing to engage in research involving Indigenous languages. We begin in §2 by examining the abstracts of *ACL papers from the past several years, replicating the results of Bender (2009), confirming that recent *ACL papers still lack significant language diversity. In §3 we address research practices and ongoing colonialism in Indigenous communities. Finally, we examine decolonial practices appropriate for a draft framework of ethical obligations ( §4) for the ACL research community.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_7",
            "content": "2 Recent *ACL papers lack significant language diversity",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_8",
            "content": "We begin by examining the abstracts of *ACL papers from the past several years to confirm the results of Bender (2009), namely that recent *ACL papers still lack significant language diversity. We collect a corpus of 9602 recent *ACL abstracts from the ACL Anthology; 4 more than 80% fail to mention any language. Essentially all such papers that fail the #BenderRule assume English as the language of study (Bender, 2019). Vanishingly few abstracts mention any Indigenous language. While 66 abstracts mention Arabic, fewer than 20 abstracts mention any other African language. Only 11 abstracts mention any Indigenous language of North America. Only 2 abstracts mention an Indigenous language of Australia. Only 1 abstract mentioned an Indigenous language of Zealandia.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_9",
            "content": "No abstracts mentioned any Indigenous language of South America.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_10",
            "content": "Table 1 shows a Zipfian distribution predominated by four language families: Indo-European (dominated by English), Sino-Tibetan (dominated by Mandarin Chinese), Japonic (essentially all Japanese), and Afro-Asiatic (dominated by Arabic and Hebrew). Indo-European languages are assumed (English) or explicitly mentioned in 97% of abstracts. The next three most mentioned language families account for another 1% of abstracts. percentage and number of abstracts that explicitly mention at least one language from the language family. bined, only 165 out of 9602 abstracts (1.7%) mention any language from any other language family.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_11",
            "content": "Research and Ongoing Colonialism in Indigenous Communities",
            "ntype": "title",
            "meta": {
                "section": "3"
            }
        },
        {
            "ix": "348-ARR_v1_12",
            "content": "Endangered Indigenous languages are not merely very low-resource languages. Each Indigenous community represents a sovereign political entity. Each Indigenous language represents a crucial component of the shared cultural heritage of its people. The rate of intergenerational transmission of Indigenous language from parent to child in many Indigeneous communities has declined and is continuing to decline (Norris, 2006), resulting in a deep sense of loss felt by older generations who grew up speaking the Indigenous language as well as by younger generations who do not speak the language who experience a diminished sense of cultural inclusion (Tulloch, 2008). Language is an integral part of culture, and declines in robust Indigenous language usage have been correlated with serious negative health and wellness outcomes (Chandler and Lalonde, 2008;Reid et al., 2019).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_13",
            "content": "language families listed in Table 1. This is because some abstracts mention multiple languages. This additional 1% represents abstracts that mentioned a language from the Sino-Tibetan, Japonic, or Afro-Asiatic language families and did not also mention an Indo-European language such as English.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_14",
            "content": "At the same time, Indigenous individuals and Indigenous communities have suffered greatly from colonial practices that separated children from communities, actively suppressed Indigenous language and culture, misappropriated land and natural resources, and treated Indigenous people, cultures, and languages as dehumanized data to study (Whitt, 2009;NTRC, 2015;Leonard, 2018;Bull, 2019;Dei, 2019;Guematcha, 2019;Bahnke et al., 2020;Kawerak, 2020). As Smith (2012) notes, \"research is probably one of the dirtiest words in the indigenous world's vocabulary;\" it is \"implicated in the worst excesses of colonialism\" and \"told [Indigenous people] things already known, suggested things that would not work, and made careers for people who already had jobs.\" It is then, hardly surprising that \"After generations of exploitation, Indigenous people often respond negatively to the idea that their languages are data ready for the taking\" (Bird, 2020).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_15",
            "content": "Outside perceptions of Indigenous peoples are inextricably linked to corresponding histories of colonization, and are typically accompanied by (usually outdated and incorrect) assumptions about the \"proper\" roles of Indigeneous peoples today that correspond with neither reality nor Indigenous people's views of themselves (Deloria, 2004;Leonard, 2011). When a linguist (or a computer scientist) begins the process of interacting with an Indigenous community and working with that community's Indigenous language, the starting \"lens through which others view [the linguist's] professional activities will at least partly reflect what 'linguist' has come to mean, and that this in some cases will occur regardless of whether [the linguist] personally exhibit a trait that has come to be associated with this named position\" (Leonard, 2021).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_16",
            "content": "Given the distinct value systems and distinct views of reality of research scientists and Indigenous communities, it is not surprising that even good-faith efforts of well-meaning outside researchers are often viewed by Indigenous communities as irrelevant at best and exploitative at worst. Research scientists rarely consider the philosophy of science (Popper, 1959) on which our research is predicated; as Wilson (2001) notes, this is defined by an ontology, epistimology, methodologies, and axiology that are seldom acknowledged. In our field, these often surface as unacknowledged positivist (Comte, 1853) assumptions that science is value-neutral and empirical observations and logical reasoning fully and completely define the nature of science and reality (Egan, 1997). By failing to acknowledge and critically examine these philosophical foundations, we implicitly and unconsciously elevate our ideas of research and language work above those of Indigenous communities (Leonard, 2017). Indigenous communities are rightly taking up the slogan \"Nothing about us without us\" (see, for example, Pearson, 2015). Even when we consider the \"lived experiences and issues that underlie [the] needs\" of Indigenous communities, these community priorities are typically treated as subordinate to research questions deemed valuable by members of academe (Leonard, 2018;Wilson, 2008;Simonds and Christopher, 2013). Credulous evangelical claims of technology as savior 6,7 only exacerbate these tensions.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_17",
            "content": "Prerequisite Obligations for Ethical Research involving Indigenous Languages and Indigenous Peoples",
            "ntype": "title",
            "meta": {
                "section": "4"
            }
        },
        {
            "ix": "348-ARR_v1_18",
            "content": "When CL and NLP researchers begin to work with Indigenous language data without first critically examining the toxic legacy of colonialism and the self-identified priority needs and epistemology of the Indigenous community, the risk of unwittingly perpetuating dehumanizing colonial practices is extremely high. It is therefore critically urgent that the ACL, perhaps through the recently-formed Special Interest Group on Endangered Languages (SIGEL), should begin a process of drafting and adopting a formal ethics policy with respect to Indigenous communities, Indigenous languages, and Indigenous data. In doing so, we should draw upon the recent Linguistics Society of America (2019) ethics statement, the foundational principles of medical ethics (autonomy, non-maleficence, beneficence, and justice; Beauchamp and Childress, 2001), the recommendations of Bird (2020), and the wisdom of Indigenous scholars such as Deloria, Wilson, Smith, and Leonard. As a beginning, we have identified four key ethical obligations that should at a minimum be included in such an ethics policy: cognizance, beneficence, accountability, and non-maleficence.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_19",
            "content": "6 \"The number of endangered languages is so large that their comprehensive documentation by the community of documentary linguists will only be possible if supported by NLP technology.\" (Vetter et al., 2016) 7 \"Languages that miss the opportunity to adopt Language Technologies will be less and less used, while languages that benefit from cross-lingual technologies such as Machine Translation will be more and more used.\" (ELRA, 2019)",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_20",
            "content": "Obligation of cognizance",
            "ntype": "title",
            "meta": {
                "section": "4.1"
            }
        },
        {
            "ix": "348-ARR_v1_21",
            "content": "The colonial political and racial ideas and behaviors that support and enable colonization and oppression are intentionally invented historical creations (Allen, 2012;Kendi, 2017). Before we engage with Indigenous peoples, let alone work with Indigenous data, we must intentionally make ourselves cognizant of this history. As outside academic researchers, we stand in a privileged position, and as such have an urgent obligation to educate ourselves about this history and about current practices that perpetuate these systems of oppression in the present day (Kendi, 2019;Smith, 2012).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_22",
            "content": "Before we are capable of ethically engaging with Indigenous data, we must learn the ways in which Indigenous communities approach reality and science, and accept that these are fully formed and fully valid worldviews with which we have an obligation to fully engage. Our research is premised on a particular philosophy of science which is nearly always left unstated. We must make ourselves cognizant of our own ontology, epistemology, methodology, and axiology, and the fact that there are alternative philosophies of science that are equally valid. We must educate ourselves about Indigenous ontologies, epistemologies, methodologies, and axiologies that are centered around relationality (Wilson, 2008).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_23",
            "content": "The obligation of cognizance therefore mandates that we as researchers intentionally and thoroughly educate ourselves about colonization of Indigenous communities; about the role that academic researchers have had and continue to play in the exploitation of Indigenous communities, Indigenous languages, Indigenous culture, and Indigenous data; and about Indigenous expectations and ways of being centered on relationality that differ from those we typically encounter in our research.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_24",
            "content": "Obligation of beneficence",
            "ntype": "title",
            "meta": {
                "section": "4.2"
            }
        },
        {
            "ix": "348-ARR_v1_25",
            "content": "Indigenous communities are sovereign political entities with inherent political and human rights which are enumerated in the Declaration on the Rights of Indigenous Peoples (United Nations, 2007). This includes the right to protect and develop their culture (Article 11), the right to dignity (Article 15), the right to develop and elect their own decision-making institutions (Article 18), and the right to \"maintain, control, protect, and develop their intellectual property over [their] cultural heritage, traditional knowledge, and traditional cultural expressions\" (Article 31).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_26",
            "content": "The obligation of beneficence therefore mandates that we as researchers ensure that our work benefits the Indigenous communities with which we work in ways that those communities recognize as beneficial; we as outside researchers seeking to engage with Indigenous communities have an obligation to learn about and to meaningfully support priority areas identified by Indigenous governing bodies and decision-making institutions that fall within our respective scopes of expertise.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_27",
            "content": "Obligation of accountability",
            "ntype": "title",
            "meta": {
                "section": "4.3"
            }
        },
        {
            "ix": "348-ARR_v1_28",
            "content": "As outside researchers seeking to work with Indigenous data, we have a responsibility to seek out respectful and meaningful relationships with the Indigenous communities whose data we seek to use. We have a responsibility to develop these relationships in ways that are appropriate and meaningful to the Indigenous communities with which we seek to work. We must intentionally acknowledge and accept the rightful authority of Indigenous communities' governing and decision-making bodies over those communities' own respective languages, cultures, and data.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_29",
            "content": "The obligation of accountability therefore mandates that we as researchers develop meaningful relations with the sovereign governing bodies of the Indigenous communities with which we seek to engage, and that we be meaningfully accountable to such bodies in our work involving their data.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_30",
            "content": "Obligation of non-maleficence",
            "ntype": "title",
            "meta": {
                "section": "4.4"
            }
        },
        {
            "ix": "348-ARR_v1_31",
            "content": "Colonization and colonial practices have inflicted substantial and often genocide-scale harm on Indigenous communities over the past five centuries (Smith, 2017), harm that is ongoing and is often perpetuated by modern research practices. We must intentionally adopt the prime ethical directive of the medical community, often stated in the Latin aphorism Primum Non Nocere \"Above all, do no harm\" (Smith, 2005). There are many good and laudable reasons why we should choose to engage in research with Indigenous communities; but none of these reasons is powerful enough to justify harm to these communities caused by our research.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_32",
            "content": "The obligation of non-maleficence therefore mandates that above all else, we do no harm to Indigenous people and Indigenous communities; if we can do good through our research without doing harm, that is well, but it is better to not engage than to cause harm.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "348-ARR_v1_33",
            "content": "UNKNOWN, None, 2012, The Invention of the White Race. Verso Books, .",
            "ntype": "ref",
            "meta": {
                "xid": "b0",
                "authors": null,
                "title": null,
                "pub_date": "2012",
                "pub_title": "The Invention of the White Race. Verso Books",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_34",
            "content": "UNKNOWN, None, 1966, Language and machines -computers in translation and linguistics. A Report by the Automatic Language Processing Advisory Committee, .",
            "ntype": "ref",
            "meta": {
                "xid": "b1",
                "authors": null,
                "title": null,
                "pub_date": "1966",
                "pub_title": "Language and machines -computers in translation and linguistics. A Report by the Automatic Language Processing Advisory Committee",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_35",
            "content": "UNKNOWN, None, 2020, Navigating the New Arctic NSF Comment Letter, .",
            "ntype": "ref",
            "meta": {
                "xid": "b2",
                "authors": null,
                "title": null,
                "pub_date": "2020",
                "pub_title": "Navigating the New Arctic NSF Comment Letter",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_36",
            "content": "UNKNOWN, None, 2001, Principles of Biomedical Ethics, Oxford University Press.",
            "ntype": "ref",
            "meta": {
                "xid": "b3",
                "authors": null,
                "title": null,
                "pub_date": "2001",
                "pub_title": "Principles of Biomedical Ethics",
                "pub": "Oxford University Press"
            }
        },
        {
            "ix": "348-ARR_v1_37",
            "content": "UNKNOWN, None, 2019, The #BenderRule: On naming the languages we study and why it matters. The Gradient, .",
            "ntype": "ref",
            "meta": {
                "xid": "b4",
                "authors": null,
                "title": null,
                "pub_date": "2019",
                "pub_title": "The #BenderRule: On naming the languages we study and why it matters. The Gradient",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_38",
            "content": "Emily Bender, Linguistically naïve != language independent: Why NLP needs linguistic typology, 2009, Proceedings of the EACL 2009 Workshop on the Interaction between Linguistics and Computational Linguistics: Virtuous, Vicious or Vacuous?, .",
            "ntype": "ref",
            "meta": {
                "xid": "b5",
                "authors": [
                    "Emily Bender"
                ],
                "title": "Linguistically naïve != language independent: Why NLP needs linguistic typology",
                "pub_date": "2009",
                "pub_title": "Proceedings of the EACL 2009 Workshop on the Interaction between Linguistics and Computational Linguistics: Virtuous, Vicious or Vacuous?",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_39",
            "content": "Steven Bird, Decolonising speech and language technology, 2020, Proceedings of the 28th International Conference on Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b6",
                "authors": [
                    "Steven Bird"
                ],
                "title": "Decolonising speech and language technology",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 28th International Conference on Computational Linguistics",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_40",
            "content": "UNKNOWN, None, 2019, Nothing about us without us: An Inuk reply to exploitive research | Impact Ethics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b7",
                "authors": null,
                "title": null,
                "pub_date": "2019",
                "pub_title": "Nothing about us without us: An Inuk reply to exploitive research | Impact Ethics",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_41",
            "content": "J Michael, Christopher Chandler,  Lalonde, Cultural continuity as a protective factor against suicide in first nations youth. Horizons, 2008, Special Issue -Hope or Heartbreak: Aboriginal Youth and Canada's Future, .",
            "ntype": "ref",
            "meta": {
                "xid": "b8",
                "authors": [
                    "J Michael",
                    "Christopher Chandler",
                    " Lalonde"
                ],
                "title": "Cultural continuity as a protective factor against suicide in first nations youth. Horizons",
                "pub_date": "2008",
                "pub_title": "Special Issue -Hope or Heartbreak: Aboriginal Youth and Canada's Future",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_42",
            "content": "UNKNOWN, None, , Auguste Comte. 1853. The Positive Philosophy of Auguste Comte. John Chapman, London. Condensed and translated from the original Cours de Philosophie Positive, .",
            "ntype": "ref",
            "meta": {
                "xid": "b9",
                "authors": null,
                "title": null,
                "pub_date": null,
                "pub_title": "Auguste Comte. 1853. The Positive Philosophy of Auguste Comte. John Chapman, London. Condensed and translated from the original Cours de Philosophie Positive",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_43",
            "content": "J George,  Sefa Dei, of Anticolonial Educational Perspectives for Transformative Change, 2019, Decolonization and Anti-colonial Praxis, Brill.",
            "ntype": "ref",
            "meta": {
                "xid": "b10",
                "authors": [
                    "J George",
                    " Sefa Dei"
                ],
                "title": "of Anticolonial Educational Perspectives for Transformative Change",
                "pub_date": "2019",
                "pub_title": "Decolonization and Anti-colonial Praxis",
                "pub": "Brill"
            }
        },
        {
            "ix": "348-ARR_v1_44",
            "content": "UNKNOWN, None, 2004, Indians in Unexpected Places, University Press.",
            "ntype": "ref",
            "meta": {
                "xid": "b11",
                "authors": null,
                "title": null,
                "pub_date": "2004",
                "pub_title": "Indians in Unexpected Places",
                "pub": "University Press"
            }
        },
        {
            "ix": "348-ARR_v1_45",
            "content": "UNKNOWN, None, 1997, The Educated Mind: How Cognitive Tools Shape Our Understanding, University of Chicago Press.",
            "ntype": "ref",
            "meta": {
                "xid": "b12",
                "authors": null,
                "title": null,
                "pub_date": "1997",
                "pub_title": "The Educated Mind: How Cognitive Tools Shape Our Understanding",
                "pub": "University of Chicago Press"
            }
        },
        {
            "ix": "348-ARR_v1_46",
            "content": "UNKNOWN, None, 2016, How is computational linguistics different from natural language processing? Quora, .",
            "ntype": "ref",
            "meta": {
                "xid": "b13",
                "authors": null,
                "title": null,
                "pub_date": "2016",
                "pub_title": "How is computational linguistics different from natural language processing? Quora",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_47",
            "content": "UNKNOWN, None, 2019, Lt4all: Language technologies for allcall for participation, .",
            "ntype": "ref",
            "meta": {
                "xid": "b14",
                "authors": null,
                "title": null,
                "pub_date": "2019",
                "pub_title": "Lt4all: Language technologies for allcall for participation",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_48",
            "content": "Emmanuel Guematcha, Genocide against indigenous peoples: The experiences of the truth commissions of Canada and Guatemala, 2019, The International Indigenous Policy Journal, .",
            "ntype": "ref",
            "meta": {
                "xid": "b15",
                "authors": [
                    "Emmanuel Guematcha"
                ],
                "title": "Genocide against indigenous peoples: The experiences of the truth commissions of Canada and Guatemala",
                "pub_date": "2019",
                "pub_title": "The International Indigenous Policy Journal",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_49",
            "content": "UNKNOWN, None, 2020, Knowledge Sovereignty and the Indigenization of Knowledge, .",
            "ntype": "ref",
            "meta": {
                "xid": "b16",
                "authors": null,
                "title": null,
                "pub_date": "2020",
                "pub_title": "Knowledge Sovereignty and the Indigenization of Knowledge",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_50",
            "content": "UNKNOWN, None, 2017, Stamped From The Beginning: The Definitive History of Racist Ideas in America, Bold Type Books.",
            "ntype": "ref",
            "meta": {
                "xid": "b17",
                "authors": null,
                "title": null,
                "pub_date": "2017",
                "pub_title": "Stamped From The Beginning: The Definitive History of Racist Ideas in America",
                "pub": "Bold Type Books"
            }
        },
        {
            "ix": "348-ARR_v1_51",
            "content": "X Ibram,  Kendi, How to Be an Antiracist, 2019, One World, .",
            "ntype": "ref",
            "meta": {
                "xid": "b18",
                "authors": [
                    "X Ibram",
                    " Kendi"
                ],
                "title": "How to Be an Antiracist",
                "pub_date": "2019",
                "pub_title": "One World",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_52",
            "content": "UNKNOWN, None, 2011, Challenging \"extinction\" through modern miami language practices, .",
            "ntype": "ref",
            "meta": {
                "xid": "b19",
                "authors": null,
                "title": null,
                "pub_date": "2011",
                "pub_title": "Challenging \"extinction\" through modern miami language practices",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_53",
            "content": ", None, , American Indian Culture and Research Journal, .",
            "ntype": "ref",
            "meta": {
                "xid": "b20",
                "authors": [],
                "title": null,
                "pub_date": null,
                "pub_title": "American Indian Culture and Research Journal",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_54",
            "content": "UNKNOWN, None, 2017, Producing language reclamation by decolonising 'language'. Language Documentation and Description, .",
            "ntype": "ref",
            "meta": {
                "xid": "b21",
                "authors": null,
                "title": null,
                "pub_date": "2017",
                "pub_title": "Producing language reclamation by decolonising 'language'. Language Documentation and Description",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_55",
            "content": "Y Wesley,  Leonard, Reflections on (de)colonialism in language documentation, 1998, Reflections on Language Documentation 20 Years after Himmelmann, Language Documentation & Conservation.",
            "ntype": "ref",
            "meta": {
                "xid": "b22",
                "authors": [
                    "Y Wesley",
                    " Leonard"
                ],
                "title": "Reflections on (de)colonialism in language documentation",
                "pub_date": "1998",
                "pub_title": "Reflections on Language Documentation 20 Years after Himmelmann",
                "pub": "Language Documentation & Conservation"
            }
        },
        {
            "ix": "348-ARR_v1_56",
            "content": "Y Wesley,  Leonard, Centering Indigenous ways of knowing in collaborative language work, 2021, Sustaining Indigenous Languages: Connecting Communities, Teachers, and Scholars, .",
            "ntype": "ref",
            "meta": {
                "xid": "b23",
                "authors": [
                    "Y Wesley",
                    " Leonard"
                ],
                "title": "Centering Indigenous ways of knowing in collaborative language work",
                "pub_date": "2021",
                "pub_title": "Sustaining Indigenous Languages: Connecting Communities, Teachers, and Scholars",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_57",
            "content": ", Linguistic Issues in Language Technology, 2011, teraction of linguistics and computational linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b24",
                "authors": [],
                "title": "Linguistic Issues in Language Technology",
                "pub_date": "2011",
                "pub_title": "teraction of linguistics and computational linguistics",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_58",
            "content": "UNKNOWN, None, 2019, Linguistics Society of America, .",
            "ntype": "ref",
            "meta": {
                "xid": "b25",
                "authors": null,
                "title": null,
                "pub_date": "2019",
                "pub_title": "Linguistics Society of America",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_59",
            "content": "UNKNOWN, None, 2008, Proceedings of ACL-08: HLT. Association for Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b26",
                "authors": null,
                "title": null,
                "pub_date": "2008",
                "pub_title": "Proceedings of ACL-08: HLT. Association for Computational Linguistics",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_60",
            "content": "UNKNOWN, None, 1962, Professional society formed. Mechanical Translation, .",
            "ntype": "ref",
            "meta": {
                "xid": "b27",
                "authors": null,
                "title": null,
                "pub_date": "1962",
                "pub_title": "Professional society formed. Mechanical Translation",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_61",
            "content": "Mary Norris, Aboriginal languages in Canada: Trends and perspectives on maintenance and revitalization, 2006, Making a Difference, Thompson Educational Publishing.",
            "ntype": "ref",
            "meta": {
                "xid": "b28",
                "authors": [
                    "Mary Norris"
                ],
                "title": "Aboriginal languages in Canada: Trends and perspectives on maintenance and revitalization",
                "pub_date": "2006",
                "pub_title": "Making a Difference",
                "pub": "Thompson Educational Publishing"
            }
        },
        {
            "ix": "348-ARR_v1_62",
            "content": "UNKNOWN, None, 2015, Honouring the truth, reconciling for the future: Summary of the final report of the Truth and Reconciliation of Canada, .",
            "ntype": "ref",
            "meta": {
                "xid": "b29",
                "authors": null,
                "title": null,
                "pub_date": "2015",
                "pub_title": "Honouring the truth, reconciling for the future: Summary of the final report of the Truth and Reconciliation of Canada",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_63",
            "content": "UNKNOWN, None, 2015, Nothing about us, without us. that's why we need Indigenous-owned media. The Guardian, .",
            "ntype": "ref",
            "meta": {
                "xid": "b30",
                "authors": null,
                "title": null,
                "pub_date": "2015",
                "pub_title": "Nothing about us, without us. that's why we need Indigenous-owned media. The Guardian",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_64",
            "content": "UNKNOWN, None, 1959, The Logic of Scientific Discovery, Hutchinson & Co.",
            "ntype": "ref",
            "meta": {
                "xid": "b31",
                "authors": null,
                "title": null,
                "pub_date": "1959",
                "pub_title": "The Logic of Scientific Discovery",
                "pub": "Hutchinson & Co"
            }
        },
        {
            "ix": "348-ARR_v1_65",
            "content": "M Papaarangi, Donna Reid, Sarah-Jane Cormack,  Paine, Colonial histories, racism and health -the experience of Māori and Indigenous peoples, 2019, Special issue on Migration, .",
            "ntype": "ref",
            "meta": {
                "xid": "b32",
                "authors": [
                    "M Papaarangi",
                    "Donna Reid",
                    "Sarah-Jane Cormack",
                    " Paine"
                ],
                "title": "Colonial histories, racism and health -the experience of Māori and Indigenous peoples",
                "pub_date": "2019",
                "pub_title": "Special issue on Migration",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_66",
            "content": "Erwin Reifler, The first conference on mechanical translation, 1954, Mechanical Translation, .",
            "ntype": "ref",
            "meta": {
                "xid": "b33",
                "authors": [
                    "Erwin Reifler"
                ],
                "title": "The first conference on mechanical translation",
                "pub_date": "1954",
                "pub_title": "Mechanical Translation",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_67",
            "content": "W Vanessa, Suzanne Simonds,  Christopher, Adapting western research methods to indigenous ways of knowing, 2013, American Journal of Public Health, .",
            "ntype": "ref",
            "meta": {
                "xid": "b34",
                "authors": [
                    "W Vanessa",
                    "Suzanne Simonds",
                    " Christopher"
                ],
                "title": "Adapting western research methods to indigenous ways of knowing",
                "pub_date": "2013",
                "pub_title": "American Journal of Public Health",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_68",
            "content": "Cedric Smith, Origin and uses of primum non nocere -above all, do no harm!, 2005, The Journal of Clinical Pharmacology, .",
            "ntype": "ref",
            "meta": {
                "xid": "b35",
                "authors": [
                    "Cedric Smith"
                ],
                "title": "Origin and uses of primum non nocere -above all, do no harm!",
                "pub_date": "2005",
                "pub_title": "The Journal of Clinical Pharmacology",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_69",
            "content": "David Michael Smith, Counting the dead: Estimating the loss of life in the Indigenous Holocaust, 1492 -present, 2017, Proceedings of the Twelfth Native American Symposium, .",
            "ntype": "ref",
            "meta": {
                "xid": "b36",
                "authors": [
                    "David Michael Smith"
                ],
                "title": "Counting the dead: Estimating the loss of life in the Indigenous Holocaust, 1492 -present",
                "pub_date": "2017",
                "pub_title": "Proceedings of the Twelfth Native American Symposium",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_70",
            "content": "UNKNOWN, None, 2012, Decolonizing Methodologies: Research and Indigenous Peoples, .",
            "ntype": "ref",
            "meta": {
                "xid": "b37",
                "authors": null,
                "title": null,
                "pub_date": "2012",
                "pub_title": "Decolonizing Methodologies: Research and Indigenous Peoples",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_71",
            "content": "UNKNOWN, None, 2008, Special Issue -Hope or Heartbreak: Aboriginal Youth and Canada's Future, .",
            "ntype": "ref",
            "meta": {
                "xid": "b38",
                "authors": null,
                "title": null,
                "pub_date": "2008",
                "pub_title": "Special Issue -Hope or Heartbreak: Aboriginal Youth and Canada's Future",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_72",
            "content": "UNKNOWN, None, 2007, United Nations declaration on the rights of Indigenous peoples, .",
            "ntype": "ref",
            "meta": {
                "xid": "b39",
                "authors": null,
                "title": null,
                "pub_date": "2007",
                "pub_title": "United Nations declaration on the rights of Indigenous peoples",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_73",
            "content": "Marco Vetter, Markus Müller, Fatima Hamlaoui, Graham Neubig, Satoshi Nakamura, Sebastian Stüker, Alex Waibel, Unsupervised phoneme segmentation of previously unseen languages, 2016, 17th Annual Conference of the International Speech Communication Association, .",
            "ntype": "ref",
            "meta": {
                "xid": "b40",
                "authors": [
                    "Marco Vetter",
                    "Markus Müller",
                    "Fatima Hamlaoui",
                    "Graham Neubig",
                    "Satoshi Nakamura",
                    "Sebastian Stüker",
                    "Alex Waibel"
                ],
                "title": "Unsupervised phoneme segmentation of previously unseen languages",
                "pub_date": "2016",
                "pub_title": "17th Annual Conference of the International Speech Communication Association",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_74",
            "content": "Laurelyn Whitt, None, 2009, Colonialism, and Indigenous Peoples: The Cultural Politics of Law and Knowledge, Cambridge University Press.",
            "ntype": "ref",
            "meta": {
                "xid": "b41",
                "authors": [
                    "Laurelyn Whitt"
                ],
                "title": null,
                "pub_date": "2009",
                "pub_title": "Colonialism, and Indigenous Peoples: The Cultural Politics of Law and Knowledge",
                "pub": "Cambridge University Press"
            }
        },
        {
            "ix": "348-ARR_v1_75",
            "content": "Shawn Wilson, What is an Indigenous Research Methodology?, 2001, Canadian Journal of Native Education, .",
            "ntype": "ref",
            "meta": {
                "xid": "b42",
                "authors": [
                    "Shawn Wilson"
                ],
                "title": "What is an Indigenous Research Methodology?",
                "pub_date": "2001",
                "pub_title": "Canadian Journal of Native Education",
                "pub": null
            }
        },
        {
            "ix": "348-ARR_v1_76",
            "content": "UNKNOWN, None, 2008, Research Is Ceremony: Indigenous Research Methods, Fernwood Publishing.",
            "ntype": "ref",
            "meta": {
                "xid": "b43",
                "authors": null,
                "title": null,
                "pub_date": "2008",
                "pub_title": "Research Is Ceremony: Indigenous Research Methods",
                "pub": "Fernwood Publishing"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "348-ARR_v1_0@0",
            "content": "Primum Non Nocere: Before working with Indigenous data, the ACL must confront ongoing colonialism",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_0",
            "start": 0,
            "end": 96,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_2@0",
            "content": "In this paper, we challenge the ACL community to reckon with historical and ongoing colonialism by adopting a set of ethical obligations and best practices drawn from the Indigenous studies literature.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_2",
            "start": 0,
            "end": 200,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_2@1",
            "content": "While the vast majority of NLP research focuses on a very small number of very high resource languages (English, Chinese, etc), some work has begun to engage with Indigenous languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_2",
            "start": 202,
            "end": 385,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_2@2",
            "content": "No research involving Indigenous language data can be considered ethical without first acknowledging that Indigenous languages are not merely very low resource languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_2",
            "start": 387,
            "end": 556,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_2@3",
            "content": "The toxic legacy of colonialism permeates every aspect of interaction between Indigenous communities and outside academic researchers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_2",
            "start": 558,
            "end": 691,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_2@4",
            "content": "Ethical research must actively challenge this colonial legacy by explicitly acknowledging and centering Indigenous community goals and Indigenous ways of knowing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_2",
            "start": 693,
            "end": 854,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_2@5",
            "content": "To this end, we propose that the ACL draft and adopt an ethical framework for NLP researchers and computational linguists wishing to engage in research involving Indigenous languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_2",
            "start": 856,
            "end": 1038,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_4@0",
            "content": "Beginning with our community's first academic conference in 1952 (see Reifler, 1954) and continuing with the establishment of the Association for Computational Linguistics (ACL) 1 in 1962 (MT Journal, 1962), the members of our research community have examined a huge range of topics, ranging from linguistic and computational linguistic models and theories to engineering-focused problems in natural language processing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_4",
            "start": 0,
            "end": 419,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_4@1",
            "content": "2 While great progress has been made in recent years across many NLP tasks, the overwhelming 1 Originally founded as the Association for Machine Translation and Computational Linguistics, the current name stems from 1968 after the publication of the 1966 ALPAC report.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_4",
            "start": 421,
            "end": 688,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@0",
            "content": "2 See Linguistic Issues in Language Technology (2011) and Eisner (2016) for excellent discussions on the distinction between computational linguistics (CL) and natural language processing (NLP).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@1",
            "content": "majority of NLP and CL research focuses on a very small number of languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 195,
            "end": 270,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@2",
            "content": "Over the 70 years from 1952 to 2022, the vast majority of CL and NLP research has focused on a small number of widely-spoken languages, nearly all of which represent politically-and economically-dominant nationstates and the languages of those nation-states' historical and current adversaries: English, the Germanic and Romance languages of western Europe, Russian and the Slavic languages of eastern Europe, Hebrew, Arabic, Chinese, Japanese, and Korean.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 272,
            "end": 727,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@3",
            "content": "Bender (2009) surveyed papers from ACL 2008 and found that English dominated (63% of papers), with 20 other languages distributed along a long Zipfian tail (Chinese and German shared the number 2 slot at just under 4% of papers each); across all ACL 2008 long papers, only three languages (Hindi, Turkish, and Wambaya) were represented outside of the language families listed previously.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 729,
            "end": 1115,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@4",
            "content": "This lack of diversity directly impacts both the quality and ethical status of our research, as nearly every successful NLP technique in widespread current use was designed around the linguistic characteristics of English.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 1117,
            "end": 1338,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@5",
            "content": "3 A special theme designed to address this shortcoming has been selected for the 60th Annual Meeting of the ACL in 2022: \"Language Diversity: from Low Resource to Endangered Languages.\" This theme is to be commended as a step towards a more linguistically diverse research agenda.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 1340,
            "end": 1619,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@6",
            "content": "Yet as we expand our research to a broader and more inclusive set of languages, we must take great care to do so ethically.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 1621,
            "end": 1743,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@7",
            "content": "The endangered Indigenous languages of the world are not merely very low resource languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 1745,
            "end": 1836,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@8",
            "content": "The toxic legacy of colonialism permeates every aspect of interaction between Indigenous communities and outside academic re-3 A small minority of successful NLP techniques were designed taking into account the characteristics of a few other languages, nearly all from the Indo-European and Sino-Tibetan language families.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 1838,
            "end": 2159,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@9",
            "content": "searchers (Smith, 2012).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 2161,
            "end": 2184,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_5@10",
            "content": "Ethical research must actively challenge this colonial legacy by explicitly acknowledging and centering Indigenous community goals and Indigenous ways of knowing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_5",
            "start": 2186,
            "end": 2347,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_6@0",
            "content": "To this end, we propose an ethical framework for NLP researchers and computational linguists wishing to engage in research involving Indigenous languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_6",
            "start": 0,
            "end": 153,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_6@1",
            "content": "We begin in §2 by examining the abstracts of *ACL papers from the past several years, replicating the results of Bender (2009), confirming that recent *ACL papers still lack significant language diversity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_6",
            "start": 155,
            "end": 359,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_6@2",
            "content": "In §3 we address research practices and ongoing colonialism in Indigenous communities.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_6",
            "start": 361,
            "end": 446,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_6@3",
            "content": "Finally, we examine decolonial practices appropriate for a draft framework of ethical obligations ( §4) for the ACL research community.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_6",
            "start": 448,
            "end": 582,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_7@0",
            "content": "2 Recent *ACL papers lack significant language diversity",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_7",
            "start": 0,
            "end": 55,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_8@0",
            "content": "We begin by examining the abstracts of *ACL papers from the past several years to confirm the results of Bender (2009), namely that recent *ACL papers still lack significant language diversity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_8",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_8@1",
            "content": "We collect a corpus of 9602 recent *ACL abstracts from the ACL Anthology; 4 more than 80% fail to mention any language.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_8",
            "start": 194,
            "end": 312,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_8@2",
            "content": "Essentially all such papers that fail the #BenderRule assume English as the language of study (Bender, 2019).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_8",
            "start": 314,
            "end": 422,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_8@3",
            "content": "Vanishingly few abstracts mention any Indigenous language.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_8",
            "start": 424,
            "end": 481,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_8@4",
            "content": "While 66 abstracts mention Arabic, fewer than 20 abstracts mention any other African language.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_8",
            "start": 483,
            "end": 576,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_8@5",
            "content": "Only 11 abstracts mention any Indigenous language of North America.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_8",
            "start": 578,
            "end": 644,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_8@6",
            "content": "Only 2 abstracts mention an Indigenous language of Australia.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_8",
            "start": 646,
            "end": 706,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_8@7",
            "content": "Only 1 abstract mentioned an Indigenous language of Zealandia.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_8",
            "start": 708,
            "end": 769,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_9@0",
            "content": "No abstracts mentioned any Indigenous language of South America.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_9",
            "start": 0,
            "end": 63,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_10@0",
            "content": "Table 1 shows a Zipfian distribution predominated by four language families: Indo-European (dominated by English), Sino-Tibetan (dominated by Mandarin Chinese), Japonic (essentially all Japanese), and Afro-Asiatic (dominated by Arabic and Hebrew).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_10",
            "start": 0,
            "end": 246,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_10@1",
            "content": "Indo-European languages are assumed (English) or explicitly mentioned in 97% of abstracts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_10",
            "start": 248,
            "end": 337,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_10@2",
            "content": "The next three most mentioned language families account for another 1% of abstracts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_10",
            "start": 339,
            "end": 422,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_10@3",
            "content": "percentage and number of abstracts that explicitly mention at least one language from the language family. bined, only 165 out of 9602 abstracts (1.7%) mention any language from any other language family.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_10",
            "start": 424,
            "end": 627,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_11@0",
            "content": "Research and Ongoing Colonialism in Indigenous Communities",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_11",
            "start": 0,
            "end": 57,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_12@0",
            "content": "Endangered Indigenous languages are not merely very low-resource languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_12",
            "start": 0,
            "end": 74,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_12@1",
            "content": "Each Indigenous community represents a sovereign political entity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_12",
            "start": 76,
            "end": 141,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_12@2",
            "content": "Each Indigenous language represents a crucial component of the shared cultural heritage of its people.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_12",
            "start": 143,
            "end": 244,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_12@3",
            "content": "The rate of intergenerational transmission of Indigenous language from parent to child in many Indigeneous communities has declined and is continuing to decline (Norris, 2006), resulting in a deep sense of loss felt by older generations who grew up speaking the Indigenous language as well as by younger generations who do not speak the language who experience a diminished sense of cultural inclusion (Tulloch, 2008).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_12",
            "start": 246,
            "end": 663,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_12@4",
            "content": "Language is an integral part of culture, and declines in robust Indigenous language usage have been correlated with serious negative health and wellness outcomes (Chandler and Lalonde, 2008;Reid et al., 2019).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_12",
            "start": 665,
            "end": 873,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_13@0",
            "content": "language families listed in Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_13",
            "start": 0,
            "end": 35,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_13@1",
            "content": "This is because some abstracts mention multiple languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_13",
            "start": 37,
            "end": 94,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_13@2",
            "content": "This additional 1% represents abstracts that mentioned a language from the Sino-Tibetan, Japonic, or Afro-Asiatic language families and did not also mention an Indo-European language such as English.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_13",
            "start": 96,
            "end": 294,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_14@0",
            "content": "At the same time, Indigenous individuals and Indigenous communities have suffered greatly from colonial practices that separated children from communities, actively suppressed Indigenous language and culture, misappropriated land and natural resources, and treated Indigenous people, cultures, and languages as dehumanized data to study (Whitt, 2009;NTRC, 2015;Leonard, 2018;Bull, 2019;Dei, 2019;Guematcha, 2019;Bahnke et al., 2020;Kawerak, 2020).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_14",
            "start": 0,
            "end": 446,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_14@1",
            "content": "As Smith (2012) notes, \"research is probably one of the dirtiest words in the indigenous world's vocabulary;\" it is \"implicated in the worst excesses of colonialism\" and \"told [Indigenous people] things already known, suggested things that would not work, and made careers for people who already had jobs.\" It is then, hardly surprising that \"After generations of exploitation, Indigenous people often respond negatively to the idea that their languages are data ready for the taking\" (Bird, 2020).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_14",
            "start": 448,
            "end": 945,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_15@0",
            "content": "Outside perceptions of Indigenous peoples are inextricably linked to corresponding histories of colonization, and are typically accompanied by (usually outdated and incorrect) assumptions about the \"proper\" roles of Indigeneous peoples today that correspond with neither reality nor Indigenous people's views of themselves (Deloria, 2004;Leonard, 2011).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_15",
            "start": 0,
            "end": 352,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_15@1",
            "content": "When a linguist (or a computer scientist) begins the process of interacting with an Indigenous community and working with that community's Indigenous language, the starting \"lens through which others view [the linguist's] professional activities will at least partly reflect what 'linguist' has come to mean, and that this in some cases will occur regardless of whether [the linguist] personally exhibit a trait that has come to be associated with this named position\" (Leonard, 2021).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_15",
            "start": 354,
            "end": 838,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_16@0",
            "content": "Given the distinct value systems and distinct views of reality of research scientists and Indigenous communities, it is not surprising that even good-faith efforts of well-meaning outside researchers are often viewed by Indigenous communities as irrelevant at best and exploitative at worst.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_16",
            "start": 0,
            "end": 290,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_16@1",
            "content": "Research scientists rarely consider the philosophy of science (Popper, 1959) on which our research is predicated; as Wilson (2001) notes, this is defined by an ontology, epistimology, methodologies, and axiology that are seldom acknowledged.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_16",
            "start": 292,
            "end": 532,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_16@2",
            "content": "In our field, these often surface as unacknowledged positivist (Comte, 1853) assumptions that science is value-neutral and empirical observations and logical reasoning fully and completely define the nature of science and reality (Egan, 1997).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_16",
            "start": 534,
            "end": 776,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_16@3",
            "content": "By failing to acknowledge and critically examine these philosophical foundations, we implicitly and unconsciously elevate our ideas of research and language work above those of Indigenous communities (Leonard, 2017).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_16",
            "start": 778,
            "end": 993,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_16@4",
            "content": "Indigenous communities are rightly taking up the slogan \"Nothing about us without us\" (see, for example, Pearson, 2015).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_16",
            "start": 995,
            "end": 1114,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_16@5",
            "content": "Even when we consider the \"lived experiences and issues that underlie [the] needs\" of Indigenous communities, these community priorities are typically treated as subordinate to research questions deemed valuable by members of academe (Leonard, 2018;Wilson, 2008;Simonds and Christopher, 2013).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_16",
            "start": 1116,
            "end": 1408,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_16@6",
            "content": "Credulous evangelical claims of technology as savior 6,7 only exacerbate these tensions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_16",
            "start": 1410,
            "end": 1497,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_17@0",
            "content": "Prerequisite Obligations for Ethical Research involving Indigenous Languages and Indigenous Peoples",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_17",
            "start": 0,
            "end": 98,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_18@0",
            "content": "When CL and NLP researchers begin to work with Indigenous language data without first critically examining the toxic legacy of colonialism and the self-identified priority needs and epistemology of the Indigenous community, the risk of unwittingly perpetuating dehumanizing colonial practices is extremely high.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_18",
            "start": 0,
            "end": 310,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_18@1",
            "content": "It is therefore critically urgent that the ACL, perhaps through the recently-formed Special Interest Group on Endangered Languages (SIGEL), should begin a process of drafting and adopting a formal ethics policy with respect to Indigenous communities, Indigenous languages, and Indigenous data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_18",
            "start": 312,
            "end": 604,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_18@2",
            "content": "In doing so, we should draw upon the recent Linguistics Society of America (2019) ethics statement, the foundational principles of medical ethics (autonomy, non-maleficence, beneficence, and justice; Beauchamp and Childress, 2001), the recommendations of Bird (2020), and the wisdom of Indigenous scholars such as Deloria, Wilson, Smith, and Leonard.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_18",
            "start": 606,
            "end": 955,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_18@3",
            "content": "As a beginning, we have identified four key ethical obligations that should at a minimum be included in such an ethics policy: cognizance, beneficence, accountability, and non-maleficence.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_18",
            "start": 957,
            "end": 1144,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_19@0",
            "content": "6 \"The number of endangered languages is so large that their comprehensive documentation by the community of documentary linguists will only be possible if supported by NLP technology.\" (Vetter et al., 2016) 7 \"Languages that miss the opportunity to adopt Language Technologies will be less and less used, while languages that benefit from cross-lingual technologies such as Machine Translation will be more and more used.\" (ELRA, 2019)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_19",
            "start": 0,
            "end": 435,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_20@0",
            "content": "Obligation of cognizance",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_20",
            "start": 0,
            "end": 23,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_21@0",
            "content": "The colonial political and racial ideas and behaviors that support and enable colonization and oppression are intentionally invented historical creations (Allen, 2012;Kendi, 2017).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_21",
            "start": 0,
            "end": 179,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_21@1",
            "content": "Before we engage with Indigenous peoples, let alone work with Indigenous data, we must intentionally make ourselves cognizant of this history.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_21",
            "start": 181,
            "end": 322,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_21@2",
            "content": "As outside academic researchers, we stand in a privileged position, and as such have an urgent obligation to educate ourselves about this history and about current practices that perpetuate these systems of oppression in the present day (Kendi, 2019;Smith, 2012).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_21",
            "start": 324,
            "end": 586,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_22@0",
            "content": "Before we are capable of ethically engaging with Indigenous data, we must learn the ways in which Indigenous communities approach reality and science, and accept that these are fully formed and fully valid worldviews with which we have an obligation to fully engage.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_22",
            "start": 0,
            "end": 265,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_22@1",
            "content": "Our research is premised on a particular philosophy of science which is nearly always left unstated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_22",
            "start": 267,
            "end": 366,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_22@2",
            "content": "We must make ourselves cognizant of our own ontology, epistemology, methodology, and axiology, and the fact that there are alternative philosophies of science that are equally valid.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_22",
            "start": 368,
            "end": 549,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_22@3",
            "content": "We must educate ourselves about Indigenous ontologies, epistemologies, methodologies, and axiologies that are centered around relationality (Wilson, 2008).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_22",
            "start": 551,
            "end": 705,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_23@0",
            "content": "The obligation of cognizance therefore mandates that we as researchers intentionally and thoroughly educate ourselves about colonization of Indigenous communities; about the role that academic researchers have had and continue to play in the exploitation of Indigenous communities, Indigenous languages, Indigenous culture, and Indigenous data; and about Indigenous expectations and ways of being centered on relationality that differ from those we typically encounter in our research.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_23",
            "start": 0,
            "end": 484,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_24@0",
            "content": "Obligation of beneficence",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_24",
            "start": 0,
            "end": 24,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_25@0",
            "content": "Indigenous communities are sovereign political entities with inherent political and human rights which are enumerated in the Declaration on the Rights of Indigenous Peoples (United Nations, 2007).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_25",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_25@1",
            "content": "This includes the right to protect and develop their culture (Article 11), the right to dignity (Article 15), the right to develop and elect their own decision-making institutions (Article 18), and the right to \"maintain, control, protect, and develop their intellectual property over [their] cultural heritage, traditional knowledge, and traditional cultural expressions\" (Article 31).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_25",
            "start": 197,
            "end": 582,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_26@0",
            "content": "The obligation of beneficence therefore mandates that we as researchers ensure that our work benefits the Indigenous communities with which we work in ways that those communities recognize as beneficial; we as outside researchers seeking to engage with Indigenous communities have an obligation to learn about and to meaningfully support priority areas identified by Indigenous governing bodies and decision-making institutions that fall within our respective scopes of expertise.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_26",
            "start": 0,
            "end": 479,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_27@0",
            "content": "Obligation of accountability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_27",
            "start": 0,
            "end": 27,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_28@0",
            "content": "As outside researchers seeking to work with Indigenous data, we have a responsibility to seek out respectful and meaningful relationships with the Indigenous communities whose data we seek to use.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_28",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_28@1",
            "content": "We have a responsibility to develop these relationships in ways that are appropriate and meaningful to the Indigenous communities with which we seek to work.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_28",
            "start": 197,
            "end": 353,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_28@2",
            "content": "We must intentionally acknowledge and accept the rightful authority of Indigenous communities' governing and decision-making bodies over those communities' own respective languages, cultures, and data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_28",
            "start": 355,
            "end": 555,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_29@0",
            "content": "The obligation of accountability therefore mandates that we as researchers develop meaningful relations with the sovereign governing bodies of the Indigenous communities with which we seek to engage, and that we be meaningfully accountable to such bodies in our work involving their data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_29",
            "start": 0,
            "end": 287,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_30@0",
            "content": "Obligation of non-maleficence",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_30",
            "start": 0,
            "end": 28,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_31@0",
            "content": "Colonization and colonial practices have inflicted substantial and often genocide-scale harm on Indigenous communities over the past five centuries (Smith, 2017), harm that is ongoing and is often perpetuated by modern research practices.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_31",
            "start": 0,
            "end": 237,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_31@1",
            "content": "We must intentionally adopt the prime ethical directive of the medical community, often stated in the Latin aphorism Primum Non Nocere \"Above all, do no harm\" (Smith, 2005).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_31",
            "start": 239,
            "end": 411,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_31@2",
            "content": "There are many good and laudable reasons why we should choose to engage in research with Indigenous communities; but none of these reasons is powerful enough to justify harm to these communities caused by our research.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_31",
            "start": 413,
            "end": 630,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_32@0",
            "content": "The obligation of non-maleficence therefore mandates that above all else, we do no harm to Indigenous people and Indigenous communities; if we can do good through our research without doing harm, that is well, but it is better to not engage than to cause harm.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_32",
            "start": 0,
            "end": 259,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_33@0",
            "content": "UNKNOWN, None, 2012, The Invention of the White Race. Verso Books, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_33",
            "start": 0,
            "end": 67,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_34@0",
            "content": "UNKNOWN, None, 1966, Language and machines -computers in translation and linguistics. A Report by the Automatic Language Processing Advisory Committee, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_34",
            "start": 0,
            "end": 152,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_35@0",
            "content": "UNKNOWN, None, 2020, Navigating the New Arctic NSF Comment Letter, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_35",
            "start": 0,
            "end": 67,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_36@0",
            "content": "UNKNOWN, None, 2001, Principles of Biomedical Ethics, Oxford University Press.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_36",
            "start": 0,
            "end": 77,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_37@0",
            "content": "UNKNOWN, None, 2019, The #BenderRule: On naming the languages we study and why it matters. The Gradient, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_37",
            "start": 0,
            "end": 105,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_38@0",
            "content": "Emily Bender, Linguistically naïve != language independent: Why NLP needs linguistic typology, 2009, Proceedings of the EACL 2009 Workshop on the Interaction between Linguistics and Computational Linguistics: Virtuous, Vicious or Vacuous?, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_38",
            "start": 0,
            "end": 240,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_39@0",
            "content": "Steven Bird, Decolonising speech and language technology, 2020, Proceedings of the 28th International Conference on Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_39",
            "start": 0,
            "end": 143,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_40@0",
            "content": "UNKNOWN, None, 2019, Nothing about us without us: An Inuk reply to exploitive research | Impact Ethics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_40",
            "start": 0,
            "end": 104,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_41@0",
            "content": "J Michael, Christopher Chandler,  Lalonde, Cultural continuity as a protective factor against suicide in first nations youth. Horizons, 2008, Special Issue -Hope or Heartbreak: Aboriginal Youth and Canada's Future, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_41",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_42@0",
            "content": "UNKNOWN, None, , Auguste Comte. 1853. The Positive Philosophy of Auguste Comte. John Chapman, London. Condensed and translated from the original Cours de Philosophie Positive, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_42",
            "start": 0,
            "end": 176,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_43@0",
            "content": "J George,  Sefa Dei, of Anticolonial Educational Perspectives for Transformative Change, 2019, Decolonization and Anti-colonial Praxis, Brill.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_43",
            "start": 0,
            "end": 141,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_44@0",
            "content": "UNKNOWN, None, 2004, Indians in Unexpected Places, University Press.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_44",
            "start": 0,
            "end": 67,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_45@0",
            "content": "UNKNOWN, None, 1997, The Educated Mind: How Cognitive Tools Shape Our Understanding, University of Chicago Press.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_45",
            "start": 0,
            "end": 112,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_46@0",
            "content": "UNKNOWN, None, 2016, How is computational linguistics different from natural language processing? Quora, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_46",
            "start": 0,
            "end": 105,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_47@0",
            "content": "UNKNOWN, None, 2019, Lt4all: Language technologies for allcall for participation, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_47",
            "start": 0,
            "end": 82,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_48@0",
            "content": "Emmanuel Guematcha, Genocide against indigenous peoples: The experiences of the truth commissions of Canada and Guatemala, 2019, The International Indigenous Policy Journal, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_48",
            "start": 0,
            "end": 174,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_49@0",
            "content": "UNKNOWN, None, 2020, Knowledge Sovereignty and the Indigenization of Knowledge, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_49",
            "start": 0,
            "end": 80,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_50@0",
            "content": "UNKNOWN, None, 2017, Stamped From The Beginning: The Definitive History of Racist Ideas in America, Bold Type Books.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_50",
            "start": 0,
            "end": 115,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_51@0",
            "content": "X Ibram,  Kendi, How to Be an Antiracist, 2019, One World, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_51",
            "start": 0,
            "end": 59,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_52@0",
            "content": "UNKNOWN, None, 2011, Challenging \"extinction\" through modern miami language practices, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_52",
            "start": 0,
            "end": 87,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_53@0",
            "content": ", None, , American Indian Culture and Research Journal, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_53",
            "start": 0,
            "end": 56,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_54@0",
            "content": "UNKNOWN, None, 2017, Producing language reclamation by decolonising 'language'. Language Documentation and Description, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_54",
            "start": 0,
            "end": 120,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_55@0",
            "content": "Y Wesley,  Leonard, Reflections on (de)colonialism in language documentation, 1998, Reflections on Language Documentation 20 Years after Himmelmann, Language Documentation & Conservation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_55",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_56@0",
            "content": "Y Wesley,  Leonard, Centering Indigenous ways of knowing in collaborative language work, 2021, Sustaining Indigenous Languages: Connecting Communities, Teachers, and Scholars, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_56",
            "start": 0,
            "end": 176,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_57@0",
            "content": ", Linguistic Issues in Language Technology, 2011, teraction of linguistics and computational linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_57",
            "start": 0,
            "end": 106,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_58@0",
            "content": "UNKNOWN, None, 2019, Linguistics Society of America, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_58",
            "start": 0,
            "end": 53,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_59@0",
            "content": "UNKNOWN, None, 2008, Proceedings of ACL-08: HLT. Association for Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_59",
            "start": 0,
            "end": 92,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_60@0",
            "content": "UNKNOWN, None, 1962, Professional society formed. Mechanical Translation, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_60",
            "start": 0,
            "end": 74,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_61@0",
            "content": "Mary Norris, Aboriginal languages in Canada: Trends and perspectives on maintenance and revitalization, 2006, Making a Difference, Thompson Educational Publishing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_61",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_62@0",
            "content": "UNKNOWN, None, 2015, Honouring the truth, reconciling for the future: Summary of the final report of the Truth and Reconciliation of Canada, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_62",
            "start": 0,
            "end": 141,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_63@0",
            "content": "UNKNOWN, None, 2015, Nothing about us, without us. that's why we need Indigenous-owned media. The Guardian, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_63",
            "start": 0,
            "end": 108,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_64@0",
            "content": "UNKNOWN, None, 1959, The Logic of Scientific Discovery, Hutchinson & Co.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_64",
            "start": 0,
            "end": 71,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_65@0",
            "content": "M Papaarangi, Donna Reid, Sarah-Jane Cormack,  Paine, Colonial histories, racism and health -the experience of Māori and Indigenous peoples, 2019, Special issue on Migration, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_65",
            "start": 0,
            "end": 175,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_66@0",
            "content": "Erwin Reifler, The first conference on mechanical translation, 1954, Mechanical Translation, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_66",
            "start": 0,
            "end": 93,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_67@0",
            "content": "W Vanessa, Suzanne Simonds,  Christopher, Adapting western research methods to indigenous ways of knowing, 2013, American Journal of Public Health, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_67",
            "start": 0,
            "end": 148,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_68@0",
            "content": "Cedric Smith, Origin and uses of primum non nocere -above all, do no harm!, 2005, The Journal of Clinical Pharmacology, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_68",
            "start": 0,
            "end": 120,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_69@0",
            "content": "David Michael Smith, Counting the dead: Estimating the loss of life in the Indigenous Holocaust, 1492 -present, 2017, Proceedings of the Twelfth Native American Symposium, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_69",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_70@0",
            "content": "UNKNOWN, None, 2012, Decolonizing Methodologies: Research and Indigenous Peoples, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_70",
            "start": 0,
            "end": 82,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_71@0",
            "content": "UNKNOWN, None, 2008, Special Issue -Hope or Heartbreak: Aboriginal Youth and Canada's Future, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_71",
            "start": 0,
            "end": 94,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_72@0",
            "content": "UNKNOWN, None, 2007, United Nations declaration on the rights of Indigenous peoples, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_72",
            "start": 0,
            "end": 85,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_73@0",
            "content": "Marco Vetter, Markus Müller, Fatima Hamlaoui, Graham Neubig, Satoshi Nakamura, Sebastian Stüker, Alex Waibel, Unsupervised phoneme segmentation of previously unseen languages, 2016, 17th Annual Conference of the International Speech Communication Association, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_73",
            "start": 0,
            "end": 260,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_74@0",
            "content": "Laurelyn Whitt, None, 2009, Colonialism, and Indigenous Peoples: The Cultural Politics of Law and Knowledge, Cambridge University Press.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_74",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_75@0",
            "content": "Shawn Wilson, What is an Indigenous Research Methodology?, 2001, Canadian Journal of Native Education, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_75",
            "start": 0,
            "end": 103,
            "label": {}
        },
        {
            "ix": "348-ARR_v1_76@0",
            "content": "UNKNOWN, None, 2008, Research Is Ceremony: Indigenous Research Methods, Fernwood Publishing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "348-ARR_v1_76",
            "start": 0,
            "end": 91,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "348-ARR_v1_0",
            "tgt_ix": "348-ARR_v1_1",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_0",
            "tgt_ix": "348-ARR_v1_1",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_1",
            "tgt_ix": "348-ARR_v1_2",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_1",
            "tgt_ix": "348-ARR_v1_2",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_0",
            "tgt_ix": "348-ARR_v1_3",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_2",
            "tgt_ix": "348-ARR_v1_3",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_4",
            "tgt_ix": "348-ARR_v1_5",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_6",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_6",
            "tgt_ix": "348-ARR_v1_7",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_7",
            "tgt_ix": "348-ARR_v1_8",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_8",
            "tgt_ix": "348-ARR_v1_9",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_9",
            "tgt_ix": "348-ARR_v1_10",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_3",
            "tgt_ix": "348-ARR_v1_4",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_3",
            "tgt_ix": "348-ARR_v1_5",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_3",
            "tgt_ix": "348-ARR_v1_6",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_3",
            "tgt_ix": "348-ARR_v1_7",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_3",
            "tgt_ix": "348-ARR_v1_8",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_3",
            "tgt_ix": "348-ARR_v1_9",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_3",
            "tgt_ix": "348-ARR_v1_10",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_3",
            "tgt_ix": "348-ARR_v1_4",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_0",
            "tgt_ix": "348-ARR_v1_11",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_10",
            "tgt_ix": "348-ARR_v1_11",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_12",
            "tgt_ix": "348-ARR_v1_13",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_13",
            "tgt_ix": "348-ARR_v1_14",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_14",
            "tgt_ix": "348-ARR_v1_15",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_15",
            "tgt_ix": "348-ARR_v1_16",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_11",
            "tgt_ix": "348-ARR_v1_12",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_11",
            "tgt_ix": "348-ARR_v1_13",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_11",
            "tgt_ix": "348-ARR_v1_14",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_11",
            "tgt_ix": "348-ARR_v1_15",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_11",
            "tgt_ix": "348-ARR_v1_16",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_11",
            "tgt_ix": "348-ARR_v1_12",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_0",
            "tgt_ix": "348-ARR_v1_17",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_16",
            "tgt_ix": "348-ARR_v1_17",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_18",
            "tgt_ix": "348-ARR_v1_19",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_17",
            "tgt_ix": "348-ARR_v1_18",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_17",
            "tgt_ix": "348-ARR_v1_19",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_17",
            "tgt_ix": "348-ARR_v1_18",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_17",
            "tgt_ix": "348-ARR_v1_20",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_19",
            "tgt_ix": "348-ARR_v1_20",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_21",
            "tgt_ix": "348-ARR_v1_22",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_22",
            "tgt_ix": "348-ARR_v1_23",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_20",
            "tgt_ix": "348-ARR_v1_21",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_20",
            "tgt_ix": "348-ARR_v1_22",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_20",
            "tgt_ix": "348-ARR_v1_23",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_20",
            "tgt_ix": "348-ARR_v1_21",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_17",
            "tgt_ix": "348-ARR_v1_24",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_23",
            "tgt_ix": "348-ARR_v1_24",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_25",
            "tgt_ix": "348-ARR_v1_26",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_24",
            "tgt_ix": "348-ARR_v1_25",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_24",
            "tgt_ix": "348-ARR_v1_26",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_24",
            "tgt_ix": "348-ARR_v1_25",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_17",
            "tgt_ix": "348-ARR_v1_27",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_26",
            "tgt_ix": "348-ARR_v1_27",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_28",
            "tgt_ix": "348-ARR_v1_29",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_27",
            "tgt_ix": "348-ARR_v1_28",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_27",
            "tgt_ix": "348-ARR_v1_29",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_27",
            "tgt_ix": "348-ARR_v1_28",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_17",
            "tgt_ix": "348-ARR_v1_30",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_29",
            "tgt_ix": "348-ARR_v1_30",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_31",
            "tgt_ix": "348-ARR_v1_32",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_30",
            "tgt_ix": "348-ARR_v1_31",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_30",
            "tgt_ix": "348-ARR_v1_32",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_30",
            "tgt_ix": "348-ARR_v1_31",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "348-ARR_v1_0",
            "tgt_ix": "348-ARR_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_1",
            "tgt_ix": "348-ARR_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_2",
            "tgt_ix": "348-ARR_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_2",
            "tgt_ix": "348-ARR_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_2",
            "tgt_ix": "348-ARR_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_2",
            "tgt_ix": "348-ARR_v1_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_2",
            "tgt_ix": "348-ARR_v1_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_2",
            "tgt_ix": "348-ARR_v1_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_3",
            "tgt_ix": "348-ARR_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_4",
            "tgt_ix": "348-ARR_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_4",
            "tgt_ix": "348-ARR_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_5",
            "tgt_ix": "348-ARR_v1_5@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_6",
            "tgt_ix": "348-ARR_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_6",
            "tgt_ix": "348-ARR_v1_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_6",
            "tgt_ix": "348-ARR_v1_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_6",
            "tgt_ix": "348-ARR_v1_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_7",
            "tgt_ix": "348-ARR_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_8",
            "tgt_ix": "348-ARR_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_8",
            "tgt_ix": "348-ARR_v1_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_8",
            "tgt_ix": "348-ARR_v1_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_8",
            "tgt_ix": "348-ARR_v1_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_8",
            "tgt_ix": "348-ARR_v1_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_8",
            "tgt_ix": "348-ARR_v1_8@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_8",
            "tgt_ix": "348-ARR_v1_8@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_8",
            "tgt_ix": "348-ARR_v1_8@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_9",
            "tgt_ix": "348-ARR_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_10",
            "tgt_ix": "348-ARR_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_10",
            "tgt_ix": "348-ARR_v1_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_10",
            "tgt_ix": "348-ARR_v1_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_10",
            "tgt_ix": "348-ARR_v1_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_11",
            "tgt_ix": "348-ARR_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_12",
            "tgt_ix": "348-ARR_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_12",
            "tgt_ix": "348-ARR_v1_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_12",
            "tgt_ix": "348-ARR_v1_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_12",
            "tgt_ix": "348-ARR_v1_12@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_12",
            "tgt_ix": "348-ARR_v1_12@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_13",
            "tgt_ix": "348-ARR_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_13",
            "tgt_ix": "348-ARR_v1_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_13",
            "tgt_ix": "348-ARR_v1_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_14",
            "tgt_ix": "348-ARR_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_14",
            "tgt_ix": "348-ARR_v1_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_15",
            "tgt_ix": "348-ARR_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_15",
            "tgt_ix": "348-ARR_v1_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_16",
            "tgt_ix": "348-ARR_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_16",
            "tgt_ix": "348-ARR_v1_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_16",
            "tgt_ix": "348-ARR_v1_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_16",
            "tgt_ix": "348-ARR_v1_16@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_16",
            "tgt_ix": "348-ARR_v1_16@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_16",
            "tgt_ix": "348-ARR_v1_16@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_16",
            "tgt_ix": "348-ARR_v1_16@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_17",
            "tgt_ix": "348-ARR_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_18",
            "tgt_ix": "348-ARR_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_18",
            "tgt_ix": "348-ARR_v1_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_18",
            "tgt_ix": "348-ARR_v1_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_18",
            "tgt_ix": "348-ARR_v1_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_19",
            "tgt_ix": "348-ARR_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_20",
            "tgt_ix": "348-ARR_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_21",
            "tgt_ix": "348-ARR_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_21",
            "tgt_ix": "348-ARR_v1_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_21",
            "tgt_ix": "348-ARR_v1_21@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_22",
            "tgt_ix": "348-ARR_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_22",
            "tgt_ix": "348-ARR_v1_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_22",
            "tgt_ix": "348-ARR_v1_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_22",
            "tgt_ix": "348-ARR_v1_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_23",
            "tgt_ix": "348-ARR_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_24",
            "tgt_ix": "348-ARR_v1_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_25",
            "tgt_ix": "348-ARR_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_25",
            "tgt_ix": "348-ARR_v1_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_26",
            "tgt_ix": "348-ARR_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_27",
            "tgt_ix": "348-ARR_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_28",
            "tgt_ix": "348-ARR_v1_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_28",
            "tgt_ix": "348-ARR_v1_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_28",
            "tgt_ix": "348-ARR_v1_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_29",
            "tgt_ix": "348-ARR_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_30",
            "tgt_ix": "348-ARR_v1_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_31",
            "tgt_ix": "348-ARR_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_31",
            "tgt_ix": "348-ARR_v1_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_31",
            "tgt_ix": "348-ARR_v1_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_32",
            "tgt_ix": "348-ARR_v1_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_33",
            "tgt_ix": "348-ARR_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_34",
            "tgt_ix": "348-ARR_v1_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_35",
            "tgt_ix": "348-ARR_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_36",
            "tgt_ix": "348-ARR_v1_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_37",
            "tgt_ix": "348-ARR_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_38",
            "tgt_ix": "348-ARR_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_39",
            "tgt_ix": "348-ARR_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_40",
            "tgt_ix": "348-ARR_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_41",
            "tgt_ix": "348-ARR_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_42",
            "tgt_ix": "348-ARR_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_43",
            "tgt_ix": "348-ARR_v1_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_44",
            "tgt_ix": "348-ARR_v1_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_45",
            "tgt_ix": "348-ARR_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_46",
            "tgt_ix": "348-ARR_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_47",
            "tgt_ix": "348-ARR_v1_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_48",
            "tgt_ix": "348-ARR_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_49",
            "tgt_ix": "348-ARR_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_50",
            "tgt_ix": "348-ARR_v1_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_51",
            "tgt_ix": "348-ARR_v1_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_52",
            "tgt_ix": "348-ARR_v1_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_53",
            "tgt_ix": "348-ARR_v1_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_54",
            "tgt_ix": "348-ARR_v1_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_55",
            "tgt_ix": "348-ARR_v1_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_56",
            "tgt_ix": "348-ARR_v1_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_57",
            "tgt_ix": "348-ARR_v1_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_58",
            "tgt_ix": "348-ARR_v1_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_59",
            "tgt_ix": "348-ARR_v1_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_60",
            "tgt_ix": "348-ARR_v1_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_61",
            "tgt_ix": "348-ARR_v1_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_62",
            "tgt_ix": "348-ARR_v1_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_63",
            "tgt_ix": "348-ARR_v1_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_64",
            "tgt_ix": "348-ARR_v1_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_65",
            "tgt_ix": "348-ARR_v1_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_66",
            "tgt_ix": "348-ARR_v1_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_67",
            "tgt_ix": "348-ARR_v1_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_68",
            "tgt_ix": "348-ARR_v1_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_69",
            "tgt_ix": "348-ARR_v1_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_70",
            "tgt_ix": "348-ARR_v1_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_71",
            "tgt_ix": "348-ARR_v1_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_72",
            "tgt_ix": "348-ARR_v1_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_73",
            "tgt_ix": "348-ARR_v1_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_74",
            "tgt_ix": "348-ARR_v1_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_75",
            "tgt_ix": "348-ARR_v1_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "348-ARR_v1_76",
            "tgt_ix": "348-ARR_v1_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "paper.tei",
    "meta": {
        "ix_counter": 723,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy",
        "position_tag_type": "from_draft",
        "doc_id": "348-ARR",
        "version": 1
    }
}