{
    "nodes": [
        {
            "ix": "1-21_v1_report457_0",
            "content": "Reviewer response for version 1",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-21_v1_report457_1",
            "content": "Understanding the response of bacterial populations to bacteriophage viruses is of central importance to predicting microbial dynamics. To do so requires knowledge about both the ecological and evolutionary responses of bacteria to phage in the environment.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-21_v1_report457_2",
            "content": "This includes possible changes in bacterial growth rate and cell size, as both have been shown to affect the rate of adsorption of phages by host cells (e.g. Hadas et al. 1997 ). In this paper, Poisot and coauthors investigate the inducible response of bacteria to phages by using UV-treated phages that are capable of binding to, but not infecting their host cells. They find that bacteria encountering UV-treated phages have a faster doubling time and smaller cell size than the control bacterial populations but that this response is short-lived and does not confer resistance to the phage.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-21_v1_report457_3",
            "content": "This is a very intriguing result that confirms work from studies using live phages (e.g. Gómez, P. and A. Buckling. 2011 ) and suggests that binding of phages, regardless of subsequent infection success, might play a key role in shaping bacterial population dynamics. The approach taken is a very nice way to look for inducible responses to phage and the results are, for the most part, very clear. I do, however, wonder about the independence of the results for doubling time (measured as optical density) and cell size. Surely the optical density measure is affected by the cell size? The authors state that “Analyses of the distribution of several flow cytometry profiles showed that a difference in cell shape is unlikely to explain this result (see data associated to this article)” Since this is an absolutely central result of the finding, I would find it very helpful if the authors actually presented and discussed this evidence. In fact, it was not clear to me which data were in support of this. Otherwise, I do not think that the results should be used to primarily suggest a phage-induced response of increased growth rate, with a cost of decreased cell size. Instead, perhaps it is a response of decreased cell size with a subsequent small change in doubling time? I imagine the authors have the analyses to rule out the latter possibility. Further to this, when the authors do look directly at colony forming units, rather than optical density, in their analyses of bacterial resistance to live phages they do not find a difference among the treatments. In this case, when bacteria were exposed to live phages, bacterial populations that had been exposed to inactivated phages grew to the same densities over 24 hours as those that had not been exposed to inactivated phages. I find this hard to interpret as it could suggest that a) the previous results were primarily indicative of a change in cell size, rather than growth rate, or even that b) the bacteria from the inactivated phage treatments do have a higher growth rate but were more susceptible to phages and thus had the same CFU. It would be helpful if the authors could discuss this result in more detail.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-21_v1_report457_4",
            "content": "I have a few additional points of clarification that I think would help readers fully understand the results.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-21_v1_report457_5",
            "content": "First, I wonder whether the authors could clarify their thoughts on the mechanism underlying the change to smaller cell size and/or increased doubling time of bacteria encountering inactivated phages. For example, could it be that small cell size is a response to altered numbers or activity of receptors on the bacterial cell surface? It seems that phage binding to receptors could alter their function and thus those bacterial cells with bound inactivated phages could be smaller due to decreased uptake of resources.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-21_v1_report457_6",
            "content": "Second, I think the finding that bacteria treated with inactivated phages show changes in growth rate and/or cell size but do not differ in terms of their resistance to live phages is quite interesting! I would be keen to know what the infection rates of the control and treated populations were, as this would help with interpretation of the result. It seems surprising that there is no change in resistance, as previous evidence suggests a strong correlation between cell size and growth rate with adsorption rate. Might this result give insight to the mechanism underlying the changes observed? The authors mention that smaller surface area would mean a lower encounter rate with phages, but this doesn’t seem to be the case when the cells are exposed to live phages.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-21_v1_report457_7",
            "content": "As a very minor point, I wonder whether the authors meant to say that bacteria were separated from unbound, rather than bound, phages in their methods section, as it is unclear how centrifugation would separate bacteria from bound phages.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "1-21_v1_report457_0@0",
            "content": "Reviewer response for version 1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_0",
            "start": 0,
            "end": 30,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_1@0",
            "content": "Understanding the response of bacterial populations to bacteriophage viruses is of central importance to predicting microbial dynamics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_1",
            "start": 0,
            "end": 134,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_1@1",
            "content": "To do so requires knowledge about both the ecological and evolutionary responses of bacteria to phage in the environment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_1",
            "start": 136,
            "end": 256,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_2@0",
            "content": "This includes possible changes in bacterial growth rate and cell size, as both have been shown to affect the rate of adsorption of phages by host cells (e.g. Hadas et al. 1997 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_2",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_2@1",
            "content": "In this paper, Poisot and coauthors investigate the inducible response of bacteria to phages by using UV-treated phages that are capable of binding to, but not infecting their host cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_2",
            "start": 179,
            "end": 365,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_2@2",
            "content": "They find that bacteria encountering UV-treated phages have a faster doubling time and smaller cell size than the control bacterial populations but that this response is short-lived and does not confer resistance to the phage.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_2",
            "start": 367,
            "end": 592,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@0",
            "content": "This is a very intriguing result that confirms work from studies using live phages (e.g. Gómez, P. and A. Buckling. 2011 ) and suggests that binding of phages, regardless of subsequent infection success, might play a key role in shaping bacterial population dynamics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 0,
            "end": 266,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@1",
            "content": "The approach taken is a very nice way to look for inducible responses to phage and the results are, for the most part, very clear.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 268,
            "end": 397,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@2",
            "content": "I do, however, wonder about the independence of the results for doubling time (measured as optical density) and cell size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 399,
            "end": 520,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@3",
            "content": "Surely the optical density measure is affected by the cell size?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 522,
            "end": 585,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@4",
            "content": "The authors state that “Analyses of the distribution of several flow cytometry profiles showed that a difference in cell shape is unlikely to explain this result (see data associated to this article)” Since this is an absolutely central result of the finding, I would find it very helpful if the authors actually presented and discussed this evidence.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 587,
            "end": 937,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@5",
            "content": "In fact, it was not clear to me which data were in support of this.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 939,
            "end": 1005,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@6",
            "content": "Otherwise, I do not think that the results should be used to primarily suggest a phage-induced response of increased growth rate, with a cost of decreased cell size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 1007,
            "end": 1171,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@7",
            "content": "Instead, perhaps it is a response of decreased cell size with a subsequent small change in doubling time?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 1173,
            "end": 1277,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@8",
            "content": "I imagine the authors have the analyses to rule out the latter possibility.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 1279,
            "end": 1353,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@9",
            "content": "Further to this, when the authors do look directly at colony forming units, rather than optical density, in their analyses of bacterial resistance to live phages they do not find a difference among the treatments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 1355,
            "end": 1567,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@10",
            "content": "In this case, when bacteria were exposed to live phages, bacterial populations that had been exposed to inactivated phages grew to the same densities over 24 hours as those that had not been exposed to inactivated phages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 1569,
            "end": 1789,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@11",
            "content": "I find this hard to interpret as it could suggest that",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 1791,
            "end": 1844,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@12",
            "content": "a) the previous results were primarily indicative of a change in cell size, rather than growth rate, or even that",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 1846,
            "end": 1958,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@13",
            "content": "b) the bacteria from the inactivated phage treatments do have a higher growth rate but were more susceptible to phages and thus had the same CFU.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 1960,
            "end": 2104,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_3@14",
            "content": "It would be helpful if the authors could discuss this result in more detail.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_3",
            "start": 2106,
            "end": 2181,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_4@0",
            "content": "I have a few additional points of clarification that I think would help readers fully understand the results.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_4",
            "start": 0,
            "end": 108,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_5@0",
            "content": "First, I wonder whether the authors could clarify their thoughts on the mechanism underlying the change to smaller cell size and/or increased doubling time of bacteria encountering inactivated phages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_5",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_5@1",
            "content": "For example, could it be that small cell size is a response to altered numbers or activity of receptors on the bacterial cell surface?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_5",
            "start": 201,
            "end": 334,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_5@2",
            "content": "It seems that phage binding to receptors could alter their function and thus those bacterial cells with bound inactivated phages could be smaller due to decreased uptake of resources.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_5",
            "start": 336,
            "end": 518,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_6@0",
            "content": "Second, I think the finding that bacteria treated with inactivated phages show changes in growth rate and/or cell size but do not differ in terms of their resistance to live phages is quite interesting! I would be keen to know what the infection rates of the control and treated populations were, as this would help with interpretation of the result.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_6",
            "start": 0,
            "end": 349,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_6@1",
            "content": "It seems surprising that there is no change in resistance, as previous evidence suggests a strong correlation between cell size and growth rate with adsorption rate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_6",
            "start": 351,
            "end": 515,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_6@2",
            "content": "Might this result give insight to the mechanism underlying the changes observed?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_6",
            "start": 517,
            "end": 596,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_6@3",
            "content": "The authors mention that smaller surface area would mean a lower encounter rate with phages, but this doesn’t seem to be the case when the cells are exposed to live phages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_6",
            "start": 598,
            "end": 769,
            "label": {}
        },
        {
            "ix": "1-21_v1_report457_7@0",
            "content": "As a very minor point, I wonder whether the authors meant to say that bacteria were separated from unbound, rather than bound, phages in their methods section, as it is unclear how centrifugation would separate bacteria from bound phages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-21_v1_report457_7",
            "start": 0,
            "end": 237,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "1-21_v1_report457_0",
            "tgt_ix": "1-21_v1_report457_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_0",
            "tgt_ix": "1-21_v1_report457_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_0",
            "tgt_ix": "1-21_v1_report457_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_0",
            "tgt_ix": "1-21_v1_report457_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_0",
            "tgt_ix": "1-21_v1_report457_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_0",
            "tgt_ix": "1-21_v1_report457_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_0",
            "tgt_ix": "1-21_v1_report457_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_0",
            "tgt_ix": "1-21_v1_report457_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_1",
            "tgt_ix": "1-21_v1_report457_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_2",
            "tgt_ix": "1-21_v1_report457_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_4",
            "tgt_ix": "1-21_v1_report457_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_5",
            "tgt_ix": "1-21_v1_report457_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_6",
            "tgt_ix": "1-21_v1_report457_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-21_v1_report457_0",
            "tgt_ix": "1-21_v1_report457_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_1",
            "tgt_ix": "1-21_v1_report457_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_1",
            "tgt_ix": "1-21_v1_report457_1@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_2",
            "tgt_ix": "1-21_v1_report457_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_2",
            "tgt_ix": "1-21_v1_report457_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_2",
            "tgt_ix": "1-21_v1_report457_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_3",
            "tgt_ix": "1-21_v1_report457_3@14",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_4",
            "tgt_ix": "1-21_v1_report457_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_5",
            "tgt_ix": "1-21_v1_report457_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_5",
            "tgt_ix": "1-21_v1_report457_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_5",
            "tgt_ix": "1-21_v1_report457_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_6",
            "tgt_ix": "1-21_v1_report457_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_6",
            "tgt_ix": "1-21_v1_report457_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_6",
            "tgt_ix": "1-21_v1_report457_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_6",
            "tgt_ix": "1-21_v1_report457_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-21_v1_report457_7",
            "tgt_ix": "1-21_v1_report457_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "1-21_v1_report457",
    "meta": {
        "review_id": "1-21_v1_report457",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "recommendation": "approve-with-reservations",
        "doi": "10.5256/f1000research.121.r457",
        "contributors": [
            {
                "surname": "Koskella",
                "given-names": "Britt"
            }
        ],
        "ix_counter": 45,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}