{
    "nodes": [
        {
            "ix": "2-173_v1_0",
            "content": "Regulation of CYP3A genes by glucocorticoids in human lung cells",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_2",
            "content": "Inhaled glucocorticoids are the first-line treatment for patients with persistent asthma. However, approximately thirty percent of patients exhibit glucocorticoid insensitivity, which may involve excess metabolic clearance of the glucocorticoids by CYP3A enzymes in the lung. CYP3A4, 3A5, and 3A7 enzymes metabolize glucocorticoids, which in turn induce CYP3A genes. However, the mechanism of CYP3A5 mRNA regulation by glucocorticoids in lung cells has not been determined. In hepatocytes, glucocorticoids bind to the glucocorticoid receptor (GR), which induces the expression of the constitutive androstane receptor or pregnane X receptor; both of which bind to the retinoid X receptor alpha, leading to the induction of CYP3A4, 3A5, and 3A7. There is also evidence to suggest a direct induction of CYP3A5 by GR activation in liver cells. In this study, these pathways were evaluated as the mechanism for CYP3A5 mRNA induction by glucocorticoids in freshly isolated primary tracheal epithelial, adenocarcinomic human alveolar basal epithelial (A549), immortalized bronchial epithelial (BEAS-2B), primary normal human bronchial/tracheal epithelial (NHBE), primary small airway epithelial (SAEC), and primary lobar epithelial lung cells. In A549 cells, beclomethasone 17-monopropionate ([M1]) induced CYP3A5 mRNA through the glucocorticoid receptor. CYP3A5 mRNA induction by five different glucocorticoids was attenuated by inhibiting the glucocorticoid receptor using ketoconazole, and for beclomethasone dipropionate, using siRNA-mediated knock-down of the glucocorticoid receptor. The constitutive androstane receptor was not expressed in lung cells. SAEC cells, a primary lung cell line, expressed CYP3A5, but CYP3A5 mRNA was not induced by glucocorticoid treatment despite evaluating a multitude of cell culture conditions. None of the other lung cells expressed CYP3A4, 3A5 or 3A7 mRNA. These studies demonstrate that CYP3A5 mRNA is induced by glucocorticoids in A549 cells via the glucocorticoid receptor, but that additional undefined regulatory processes exist in primary lung cells.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_4",
            "content": "Inhaled glucocorticoids are the first-line treatment for asthma <REF-1> – <REF-3> . Glucocorticoids bind to the glucocorticoid receptor to reduce the expression of genes that produce a variety of pro-inflammatory mediators and mucus in the lung <REF-4> – <REF-6> . The most commonly prescribed glucocorticoids are beclomethasone dipropionate (BDP), triamcinolone acetonide (TCL), budesonide (BUD), fluticasone propionate (FLT), and flunisolide (FLN) <REF-1> . BDP is a pro-drug and requires removal of the C-21 propionate group to become pharmacologically active; the active drug is beclomethasone 17-monopropionate, referred to as [M1] ( Figure 1 ) <REF-7> . Pharmacological inactivation and clearance of glucocorticoids, such as BDP and its active metabolite [M1], is mediated, in part, by cytochrome P450 (CYP) enzymes ( Figure 1 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_5",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Metabolic scheme for the production of [M1] (the active form of the drug) by esterase enzymes and [M5] by CYP3A enzymes.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_6",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Metabolic scheme for the production of [M1] (the active form of the drug) by esterase enzymes and [M5] by CYP3A enzymes.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Metabolic scheme for the production of [M1] (the active form of the drug) by esterase enzymes and [M5] by CYP3A enzymes.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_7",
            "content": "In humans, CYP3A4, 3A5, and 3A7 are the primary CYP enzymes involved in glucocorticoid metabolism <REF-8> – <REF-11> . CYP3A4 is the most abundant CYP3A enzyme in the liver and intestines <REF-8> , <REF-12> , <REF-13> , CYP3A5 is more prevalent in the lung than the liver <REF-12> , <REF-14> – <REF-16> , and CYP3A7 is expressed in fetal liver, but diminishes after birth when CYP3A4 becomes the dominant adult hepatic CYP3A enzyme <REF-17> , <REF-18> . Expression of CYP3A7 in fetal and adult respiratory tissue has also been observed <REF-16> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_8",
            "content": "Regulation of CYP3A enzymes in response to glucocorticoid treatment has been extensively characterized in the liver, but less is known about this phenomenon in the lung. In hepatocytes, CYP3A enzyme induction is mediated by the pregnane X receptor (PXR) <REF-19> , <REF-20> ( Figure 2A ). However, PXR is not expressed in the lung <REF-21> . Glucocorticoids can also influence CYP3A induction via the glucocorticoid receptor (GR) and the constitutive androstane receptor (CAR) in the liver <REF-22> , <REF-23> . Briefly, glucocorticoids bind GR in the cytosol, which forms a homodimer and translocates into the nucleus, leading to increased transcription of CAR. CAR forms a heterodimer with the retinoid X receptor alpha (RXRα), which binds to the RXR-response element and induces the expression of CYP3A enzymes ( Figure 2A ) <REF-22> . Previous work by Hukannen et al. demonstrated that CAR was not expressed in A549 (adenocarcinomic human alveolar basal epithelial) cells and suggested that glucocorticoid binding to GR may directly regulate CYP3A gene expression in A549 cells ( Figure 2B ), based on inhibition using RU-486 <REF-15> , <REF-24> . However, these pathways have not been evaluated in primary lung cell cultures or lung tissue.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_9",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Possible mechanisms for the induction of CYP3A genes in lung cells. ( A ) Active glucocorticoid will bind to the glucocorticoid receptor (GR), which forms a homodimer and translocates to the nucleus. The homodimer binds to its response element (GRE) and induces the expression of either the pregnane X receptor (PXR) or the constitutive androstane receptor (CAR). CAR or PXR (though this receptor is not expressed in the lungs) forms a heterodimer with the retinoic X receptor alpha (RXRα) which in turn induces the expression of the CYP3A enzymes via binding of the respective response-elements (CARE and/or PXRE). ( B ) Active glucocorticoid will bind to the glucocorticoid receptor (GR), which forms a homodimer and translocates into the nucleus. The homodimer binds to its response element (GRE) and induces the expression of CYP3A enzymes.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_10",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Possible mechanisms for the induction of CYP3A genes in lung cells.</title> <p>( <bold>A</bold>) Active glucocorticoid will bind to the glucocorticoid receptor (GR), which forms a homodimer and translocates to the nucleus. The homodimer binds to its response element (GRE) and induces the expression of either the pregnane X receptor (PXR) or the constitutive androstane receptor (CAR). CAR or PXR (though this receptor is not expressed in the lungs) forms a heterodimer with the retinoic X receptor alpha (RXR&#945;) which in turn induces the expression of the CYP3A enzymes via binding of the respective response-elements (CARE and/or PXRE). ( <bold>B</bold>) Active glucocorticoid will bind to the glucocorticoid receptor (GR), which forms a homodimer and translocates into the nucleus. The homodimer binds to its response element (GRE) and induces the expression of CYP3A enzymes.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Possible mechanisms for the induction of CYP3A genes in lung cells. ( A ) Active glucocorticoid will bind to the glucocorticoid receptor (GR), which forms a homodimer and translocates to the nucleus. The homodimer binds to its response element (GRE) and induces the expression of either the pregnane X receptor (PXR) or the constitutive androstane receptor (CAR). CAR or PXR (though this receptor is not expressed in the lungs) forms a heterodimer with the retinoic X receptor alpha (RXRα) which in turn induces the expression of the CYP3A enzymes via binding of the respective response-elements (CARE and/or PXRE). ( B ) Active glucocorticoid will bind to the glucocorticoid receptor (GR), which forms a homodimer and translocates into the nucleus. The homodimer binds to its response element (GRE) and induces the expression of CYP3A enzymes.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_11",
            "content": "The purpose of this study was three fold: to evaluate the changes in the expression of CYP3A mRNA in primary lung cells treated with glucocorticoids; to determine which pathway was responsible for glucocorticoid-induced changes in CYP3A mRNA expression; and to determine the role of BDP metabolism in this phenomenon. The cell lines used in this study were BEAS-2B (immortalized bronchial epithelial cell line), NHBE (normal human bronchial/tracheal epithelial cells), lobar epithelial cells (secondary bronchus epithelial cells), primary cells recovered from tracheal washes of pediatric patients on ventilation, SAEC (small airway epithelial cells), and A549 (human lung adenocarcinoma) cells. It was hypothesized that CYP3A5 mRNA induction in primary cells by BDP <REF-11> and other glucocorticoids would occur via a mechanism involving GR/CAR/RXRα, as previously demonstrated using hepatocytes.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_12",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_13",
            "content": "Chemicals, reagents, and treatments",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_14",
            "content": "Beclomethasone dipropionate (BDP), triamcinolone acetonide (TCL), fluticasone propionate (FLT), flunisolide (FLN), budesonide (BUD), prednisolone, ammonium acetate, eserine, and methanol were purchased from Sigma-Aldrich Chemical Company (St. Louis, MO). Paraoxon was purchased from Chem Service (West Chester, PA).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_15",
            "content": "Cell culture",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_16",
            "content": "A549 cells (American Type Culture Collection, Manassas, VA) were cultured in Dulbecco's Modified Eagle Medium (DMEM) fortified with 5% fetal bovine serum (Life Technologies, Grand Island, NY). SAEC cells (LONZA, Walkersville, MD; donor numbers 11662, 14453, 14457) were cultured in small airway epithelial growth medium, supplemented with the SAGM bullet kit (LONZA). Cells were cultured with and without hydrocortisone by adding or not adding the hydrocortisone component from the SAGM bullet kit. NHBE cells (LONZA; donor numbers 15268, 5S03795) were grown in bronchial epithelial cell growth medium (BEGM Bullet kit) (LONZA). BEAS-2B cells (American Type Culture Collection) were cultured in LHC-9 medium (Life Technologies). Lobar cells (donor number 01334) were cultured in BronchiaLife Basal Medium supplemented with the BronchiaLife B/T supplement kit (Lifeline Cell Technology, Walkersville, MD). All cells except A549 cells were plated in 12-well plates pre-coated with LHC basal medium (Life Technologies). Tracheal epithelial cells were recovered from tracheal washes from mechanically ventilated pediatric patients in the neonatal intensive care unit and pediatric intensive care unit at Primary Children’s Medical Center at the University of Utah, with IRB approval (00026839). Briefly, cells were separated from sputum by centrifugation at 900 x g for 30 min in 14 mL of DMEM/F12 media. Cells were plated in a 12-well plate pre-coated with 2% gelatin (Life Technologies) and cultured in DMEM/F12 media + 10% fetal bovine serum (FBS) (Life Technologies). All cells were cultured in an atmosphere of 5% CO 2 :95% air at 37ºC.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_17",
            "content": "Cell treatments",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_18",
            "content": "Cell treatments were prepared in treatment media with a final concentration of DMSO less than 1%. Cells were treated at ~70% confluence. A549 cells were cultured in OPTIMEM (Life Technologies) and SAEC cells were cultured in growth media either with or without hydrocortisone and with or without heat inactivated and/or charcoal-stripped FBS. All other cell lines were treated in their respective growth medium, and heat inactivated to eliminate esterase activity from the FBS, which would metabolize BDP before it could diffuse into the cells. Cytotoxicity assays were performed using the Dojindo Cell Counting Kit-8 (Dojindo Laboratories, Rockville, MD) to determine glucocorticoid, esterase inhibitor, and ketoconazole concentrations exhibiting <20% cytotoxicity in A549 cells. All other cell lines were treated with the same concentrations as determined with A549 cells. Glucocorticoid treatments were as follows: BDP (10 μM), TCL (1 μM), BUD (10 μM), FLT (1 μM), and FLN (100 nM). Pre-treatments in various experiments included ketoconazole (Sigma-Aldrich Chemical Company) (50 μM, 10 μM, and 1 μM, to antagonize GR), esterase inhibitors (1:1 mixture of eserine and paraoxon, each at 175 μM, to inhibit [M1] formation), and 1-aminobenzotriazole (Sigma-Aldrich Chemical Company) (1-ABT; 200 μM, to inhibit P450-mediated metabolism) for 2 h prior to a 22 h glucocorticoid co-treatment. Controls were treated with an equivalent concentration of DMSO. All A549 cell treatments were carried out in 6-well plates for 24 h (n=6). All other cell lines were cultured in pre-coated 12-well plates and treated for 24 h (n=3).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_19",
            "content": "Analysis of BDP metabolites",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_20",
            "content": "After treatment, BDP and its metabolites were extracted from the collected media by adding 2x volume (6 mL for A549, 4 mL for all other cell lines) methyl tert -butyl ether containing 1 nM prednisolone (internal standard for quantification) and shaking for 25 min. Samples were clarified by centrifugation, the organic fraction was collected, dried under air, reconstituted in 100 µL 1:1 H 2 O:MeOH, clarified again by centrifugation, and transferred to autosampler vials for analysis by liquid chromatography-mass spectrometry (LC/MS/MS). LC/MS/MS was conducted on a Thermo LCQ Advantage Max ion trap instrument equipped with a Finnigan Surveyor LC pump, Surveyor Autosampler and universal Ion Max source operated with Thermo Xcalibur software version 2.0 (Thermo Fisher Scientific, Waltham, MA) as previously described <REF-11> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_21",
            "content": "Quantitative reverse transcription-PCR",
            "ntype": "title",
            "meta": {
                "section": "2.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_22",
            "content": "Total RNA was isolated from cells using TRIzol reagent (Life Technologies). cDNA was synthesized using iScript Reverse Transcription Supermix for qPCR (BIO RAD, Hercules, CA). qPCR was performed using either LightCycler 480 Probes Master mix (CYP3A5*1) or LightCycler 480 SYBR Green I Master Mix (all other genes) (Roche, Indianapolis, IN) with a LightCycler 480 System. The PCR program for the probe mix consisted of a 5 min incubation at 95ºC, followed by 45 cycles of 95ºC for 10s, 55ºC for 30s, then 72ºC for 1s. The PCR program for SYBR Green I mix consisted of a 5 min incubation at 95ºC, followed by 40 cycles of 95ºC for 10s, 63ºC for 5s for CYP3A4, CYP3A7 and β2-microglobulin. For GR and CAR, annealing was performed at 65ºC for 5s and extension at 72ºC for 10s. mRNA copy number was determined from standard curves for each gene and was normalized using β2-microglobulin. Primer sequences for the various genes are listed in Table 1 <REF-25> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_23",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Primer sequences for qPCR assays.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_24",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Primer sequences for qPCR assays.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <tbody> <tr> <td valign=\"top\">CYP3A5*1</td> <td>F-5&#180; CCTATCGTCAGGGTCTCTGGAA 3&#180; <break/>R-5&#180; TGATGGCCAGCACAGGGA 3&#180; <break/>Probe [6FAM]ATGTGGGGAACGTATGAA[BHQ1]</td> </tr> <tr> <td valign=\"top\">CYP3A5-all</td> <td>F-5&#180; CGTCAGGGTCTCTGGAAATTTG 3&#180; <break/>R-5&#180; CACGTCGGGATCTGTGATGG 3&#180;</td> </tr> <tr> <td valign=\"top\">CYP3A4</td> <td>F-5&#180; GAAAGTCGCCTCGAAGATAC 3&#180; <break/>R-5&#180; ACGAGCTCCAGATCGGACAG 3&#180;</td> </tr> <tr> <td valign=\"top\">CYP3A7</td> <td>F-5&#180; TTCCGTAAGGGCTATTGGAC 3&#180; <break/>R-5&#180; TCTGTGATAGCCAGCATAGG 3&#180;</td> </tr> <tr> <td valign=\"top\">Glucocorticoid receptor</td> <td>F-5&#180; CCAACGGTGGCAATGTGAAA 3&#180; <break/>R-5&#180; CCGCCAGAGGAGAAAGCAAA 3&#180;</td> </tr> <tr> <td valign=\"top\">Constitutive androstane receptor</td> <td>F-5&#180; CCGTGTGGGGTTCCAGGTAG 3&#180; <break/>R-5&#180; CAGCCAGCAGGCCTACGAAC 3&#180;</td> </tr> <tr> <td valign=\"top\">&#946;2-microglobulin</td> <td>F-5&#180; GATGAGTATGCCTGCCGTGTG 3&#180; <break/>R-5&#180; CAATCCAAATGCGGCATCT 3&#180;</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Primer sequences for qPCR assays.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_25",
            "content": "siRNA-mediated protein knockdown",
            "ntype": "title",
            "meta": {
                "section": "2.6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_26",
            "content": "Pre-annealed, short interfering “Smart Pool” siRNAs specific to human GR were purchased from Dharmacon (Waltham, MA). siRNA directed against GFP (negative control) <REF-26> was synthesized at the University of Utah oligonucleotide synthesis core and annealed by combining 40 µM of each strand and incubating in annealing buffer (100 mM potassium acetate, 30 mM HEPES KOH, 2 mM magnesium acetate adjusted to pH 7.4) for 1 min at 90ºC followed by 1 h at 37ºC, in a final volume of 0.5 mL. A549 cells were plated into 6-well plates containing 20 nM siRNA per well, previously complexed with Lipofectamine 2000 (Life Technologies) using a ratio of 3:2 lipid to siRNA in 100 µL of OPTIMEM (Life Technologies). The cells were grown for 48, 72, and 96 h to determine the time at which maximum decreases in GR mRNA occurred (72 h). In subsequent experiments, cells were treated with DMSO, 10 µM BDP, or 10 μM BDP + 175 µM esterase inhibitors (1:1 eserine:paraoxon) for 24 h to determine the effects of attenuated GR expression on the induction of CYP3A5 in A549 cells.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_27",
            "content": "Statistical analysis",
            "ntype": "title",
            "meta": {
                "section": "2.7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_28",
            "content": "Statistical analysis was performed using GraphPad Prism 4.02 software for Windows (San Diego, CA). One-way ANOVA and Dunnett’s post-hoc test were used with p<0.05. All data are represented as a mean with error bars representing standard deviation.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_29",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_30",
            "content": "Inhibition of [M1] formation prevented CYP3A5 mRNA induction by BDP in A549 cells",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_31",
            "content": "Media from A549 cells treated with BDP (10 µM) for 24 h was extracted and analyzed for metabolites of BDP produced by CYP3A enzymes. The only CYP3A-mediated metabolite detected was [M5] ( Figure 1 and Figure 3A ) <REF-11> . For the remainder of the studies, [M1], the active metabolite, was used as a marker for esterase activity and [M5] was used as a marker for CYP3A5 activity. Only CYP3A5*1 mRNA was detected in A549 cells. CYP3A4 and CYP3A7 mRNA were not detected in A549 cells, as previously documented <REF-11> , <REF-16> . BDP treatment significantly induced the expression of CYP3A5 mRNA (~2-fold) compared to the DMSO control ( Figure 3B ). Inhibiting the production of [M1] using esterase inhibitors also blocked the induction of CYP3A5 mRNA ( Figure 2A and Figure 2B ); esterase inhibitor (EI) treatment alone had no effect on CYP3A5 expression. 1-ABT, a mechanism-based inactivator of P450 enzymes, also inhibited esterase activity (i.e. [M1] formation) ( Figure 3A ), and as a result, prevented the induction of CYP3A5 mRNA ( Figure 3B ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_32",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "[M1] is required to induce CYP3A5 mRNA. ( A ) Relative quantities of [M1] and [M5] measured by LC/MS/MS in A549 cell culture media following beclomethasone dipropionate (BDP) treatment alone, BDP + esterase inhibitors (EI), 1-aminobenzotriazole (1-ABT) + BDP, and 1-ABT + EI + [M1]. ( B ) CYP3A5 mRNA detected in A549 cells following DMSO control, BDP treatment alone, BDP + EI, 1-ABT alone, 1-ABT + BDP, and 1-ABT + EI + [M1]. Values are expressed as fold over DMSO controls. Statistics used for data analysis were one-way ANOVA with Dunnett’s post-hoc test. Data are the mean and standard deviation from n=6 replicates. * p<0.05, ** p<0.01.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_33",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>[M1] is required to induce CYP3A5 mRNA.</title> <p>( <bold>A</bold>) Relative quantities of [M1] and [M5] measured by LC/MS/MS in A549 cell culture media following beclomethasone dipropionate (BDP) treatment alone, BDP + esterase inhibitors (EI), 1-aminobenzotriazole (1-ABT) + BDP, and 1-ABT + EI + [M1]. ( <bold>B</bold>) CYP3A5 mRNA detected in A549 cells following DMSO control, BDP treatment alone, BDP + EI, 1-ABT alone, 1-ABT + BDP, and 1-ABT + EI + [M1]. Values are expressed as fold over DMSO controls. Statistics used for data analysis were one-way ANOVA with Dunnett&#8217;s post-hoc test. Data are the mean and standard deviation from n=6 replicates. * p&lt;0.05, ** p&lt;0.01.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "[M1] is required to induce CYP3A5 mRNA. ( A ) Relative quantities of [M1] and [M5] measured by LC/MS/MS in A549 cell culture media following beclomethasone dipropionate (BDP) treatment alone, BDP + esterase inhibitors (EI), 1-aminobenzotriazole (1-ABT) + BDP, and 1-ABT + EI + [M1]. ( B ) CYP3A5 mRNA detected in A549 cells following DMSO control, BDP treatment alone, BDP + EI, 1-ABT alone, 1-ABT + BDP, and 1-ABT + EI + [M1]. Values are expressed as fold over DMSO controls. Statistics used for data analysis were one-way ANOVA with Dunnett’s post-hoc test. Data are the mean and standard deviation from n=6 replicates. * p<0.05, ** p<0.01.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_34",
            "content": "[M1] was sufficient to induce CYP3A5 mRNA in A549 cells",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_35",
            "content": "Cells were treated with [M1] in either the absence or presence of 1-ABT and esterase inhibitors. [M1] treatment was sufficient to induce CYP3A5 mRNA (~2-fold), without the requirement of esterases to produce [M1] ( Figure 3B ), indicating that CYP3A5 mRNA induction in A549 cells was mediated by [M1].",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_36",
            "content": "GR, but not CAR, regulated the induction of CYP3A5 mRNA in A549 cells",
            "ntype": "title",
            "meta": {
                "section": "3.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_37",
            "content": "GR and CAR mRNA were quantified in A549 cells. A significant increase in GR mRNA (~2.5-fold) was observed following 24 h treatment with BDP ( Table 2 ), consistent with previous studies <REF-15> , suggesting that GR, not CAR, was responsible for the induction of CYP3A5 message in A549 cells.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_38",
            "content": "Table 2.",
            "ntype": "label",
            "meta": {
                "id": "T2",
                "caption": "Comparison of glucocorticoid receptor (GR), constitutive androstane receptor (CAR), and CYP3A5 mRNA expression in lung cell cultures.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_39",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T2\" position=\"anchor\"> <caption> <title>Comparison of glucocorticoid receptor (GR), constitutive androstane receptor (CAR), and CYP3A5 mRNA expression in lung cell cultures.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">Cell type</th> <th align=\"left\">GR expression</th> <th align=\"left\">GR induction by GC treatment</th> <th align=\"left\">CAR expression</th> <th align=\"left\">CAR induction by GC treatment</th> <th align=\"left\">CYP3A5 mRNA</th> <th align=\"left\">CYP3A5 induction by GC treatment</th> </tr> </thead> <tbody> <tr> <td>Beas-2B</td> <td>+</td> <td>N.D.</td> <td>N.D.</td> <td>N.D.</td> <td>N.D.</td> <td>N.D.</td> </tr> <tr> <td>NHBE</td> <td>+</td> <td>N.D.</td> <td>N.D.</td> <td>N.D.</td> <td>N.D.</td> <td>N.D.</td> </tr> <tr> <td>Patient tracheal washes</td> <td valign=\"top\">N.D.</td> <td valign=\"top\">N.D.</td> <td valign=\"top\">N.D.</td> <td valign=\"top\">N.D.</td> <td valign=\"top\">N.D.</td> <td valign=\"top\">N.D.</td> </tr> <tr> <td>Lobar</td> <td>+</td> <td>N.D.</td> <td>N.D.</td> <td>N.D.</td> <td>N.D.</td> <td>N.D.</td> </tr> <tr> <td>A549</td> <td>+</td> <td>2.4 &#177; 0.35 **</td> <td>N.D.</td> <td>N.D.</td> <td>+</td> <td>2.1 &#177; 0.55 **</td> </tr> <tr> <td valign=\"top\">SAEC</td> <td valign=\"top\">+</td> <td valign=\"top\">N.D.</td> <td valign=\"top\">N.D.</td> <td valign=\"top\">N.D.</td> <td>1 out of 3 patients</td> <td valign=\"top\">N.D.</td> </tr> </tbody> </table> <table-wrap-foot> <fn> <p>Data are represented as fold over DMSO control. Statistics used for data analysis were one-way ANOVA with Dunnett&#8217;s post-hoc test. ** p&lt;0.01, N.D. = not detected, GC = glucocorticoid.</p> </fn> </table-wrap-foot> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T2",
                "caption": "Comparison of glucocorticoid receptor (GR), constitutive androstane receptor (CAR), and CYP3A5 mRNA expression in lung cell cultures.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_40",
            "content": "Inhibition of GR with ketoconazole attenuated CYP3A5 mRNA induction by glucocorticoids in A549 cells",
            "ntype": "title",
            "meta": {
                "section": "3.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_41",
            "content": "Ketoconazole is a competitive antagonist of GR <REF-25> . Ketoconazole alone had no significant effect on CYP3A5 mRNA expression as compared to DMSO controls. As the concentration of ketoconazole was decreased, dose-dependent increases in the expression of CYP3A5 mRNA were observed for BDP, TCL, FLT, BUD, and FLN ( Figure 4A–E ): BDP caused a ~2-fold induction, BUD caused a ~4-fold induction, TCL caused a ~5.5-fold induction, FLT caused a ~3.5-fold induction, and FLN caused a ~5.5-fold induction, relative to their respective controls. These data confirm the hypothesis that the induction of CYP3A5 mRNA in A549 cells was mediated by GR. BDP or FLT paired with KTZ 1 µM treatment also showed further induction of CYP3A5 mRNA as compared to controls (~3.5 for BDP and ~6.5 for FLT). However, the basis and significance for this enhanced induction are not clear at this time.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_42",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Ketoconazole inhibits the induction of CYP3A5 through the glucocorticoid receptor (GR). CYP3A5 mRNA detected in A549 cells treated with ( A ) beclomethasone dipropionate (BDP), ( B ) budesonide (BUD), ( C ) triamcinolone acetonide (TCL), ( D ) fluticasone propionate (FLT), and ( E ) flunisolide (FLN), with and without ketoconazole (KTZ), a competitive antagonist for GR. Results are presented as fold over DMSO controls. Statistics used for data analysis were one-way ANOVA with Dunnett’s post-hoc test. Data are the mean and standard deviation from n=6 replicates. * p<0.05, ** p<0.01, *** p<0.001.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_43",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <title>Ketoconazole inhibits the induction of CYP3A5 through the glucocorticoid receptor (GR).</title> <p>CYP3A5 mRNA detected in A549 cells treated with ( <bold>A</bold>) beclomethasone dipropionate (BDP), ( <bold>B</bold>) budesonide (BUD), ( <bold>C</bold>) triamcinolone acetonide (TCL), ( <bold>D</bold>) fluticasone propionate (FLT), and ( <bold>E</bold>) flunisolide (FLN), with and without ketoconazole (KTZ), a competitive antagonist for GR. Results are presented as fold over DMSO controls. Statistics used for data analysis were one-way ANOVA with Dunnett&#8217;s post-hoc test. Data are the mean and standard deviation from n=6 replicates. * p&lt;0.05, ** p&lt;0.01, *** p&lt;0.001.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Ketoconazole inhibits the induction of CYP3A5 through the glucocorticoid receptor (GR). CYP3A5 mRNA detected in A549 cells treated with ( A ) beclomethasone dipropionate (BDP), ( B ) budesonide (BUD), ( C ) triamcinolone acetonide (TCL), ( D ) fluticasone propionate (FLT), and ( E ) flunisolide (FLN), with and without ketoconazole (KTZ), a competitive antagonist for GR. Results are presented as fold over DMSO controls. Statistics used for data analysis were one-way ANOVA with Dunnett’s post-hoc test. Data are the mean and standard deviation from n=6 replicates. * p<0.05, ** p<0.01, *** p<0.001.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_44",
            "content": "siRNA-mediated knockdown of GR also attenuated CYP3A5 mRNA induction by BDP in A549 cells",
            "ntype": "title",
            "meta": {
                "section": "3.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_45",
            "content": "Cells were transfected with siRNA and grown for 48, 72, and 96 h to determine the time of maximum GR mRNA knock down ( Figure 5A ). Maximum suppression occurred as early as 48 h, but the 72 h time point was chosen for further experiments to ensure efficient GR protein depletion. An approximate 2-fold induction of CYP3A5 mRNA was observed in A549 cells following treatment with BDP in control cells transfected with “nonsense” siRNA directed against GFP. Consistent with previous results ( Figure 3A and Figure 3B ), CYP3A5 mRNA induction was prevented by esterase inhibitors ( Figure 5B ). Cells transfected with siRNA targeted for GR mRNA showed no change in CYP3A5 mRNA with BDP treatment ( Figure 5B ), further confirming the role of GR in directly regulating the induction of CYP3A5 mRNA in A549 cells treated with BDP and presumably the other glucocorticoids used in Figure 4 .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_46",
            "content": "Figure 5.",
            "ntype": "label",
            "meta": {
                "id": "f5",
                "caption": "Glucocorticoid receptor (GR) siRNA blocks the induction of CYP3A5 by beclomethasone dipropionate (BDP). ( A ) siRNA-mediated GR knockdown in A549 cells at 48, 72, 96 h compared to \"nonsense\" GFP siRNA (negative control), expressed as fold over designated GFP control for each time point. ( B ) Cells were exposed to siRNA for 72 h then treated with DMSO, BDP, or BDP + esterase inhibitor (EI). Statistics used for data analysis were one-way ANOVA with Dunnett’s post-hoc test. Data are the mean and standard deviation from three replicates. * p<0.05, ** p<0.01.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_47",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f5\" position=\"float\"> <caption> <title> Glucocorticoid receptor (GR) siRNA blocks the induction of CYP3A5 by beclomethasone dipropionate (BDP).</title> <p>( <bold>A</bold>) siRNA-mediated GR knockdown in A549 cells at 48, 72, 96 h compared to \"nonsense\" GFP siRNA (negative control), expressed as fold over designated GFP control for each time point. ( <bold>B</bold>) Cells were exposed to siRNA for 72 h then treated with DMSO, BDP, or BDP + esterase inhibitor (EI). Statistics used for data analysis were one-way ANOVA with Dunnett&#8217;s post-hoc test. Data are the mean and standard deviation from three replicates. * p&lt;0.05, ** p&lt;0.01.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure5.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f5",
                "caption": "Glucocorticoid receptor (GR) siRNA blocks the induction of CYP3A5 by beclomethasone dipropionate (BDP). ( A ) siRNA-mediated GR knockdown in A549 cells at 48, 72, 96 h compared to \"nonsense\" GFP siRNA (negative control), expressed as fold over designated GFP control for each time point. ( B ) Cells were exposed to siRNA for 72 h then treated with DMSO, BDP, or BDP + esterase inhibitor (EI). Statistics used for data analysis were one-way ANOVA with Dunnett’s post-hoc test. Data are the mean and standard deviation from three replicates. * p<0.05, ** p<0.01.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_48",
            "content": "CYP3A5 was not expressed or induced by glucocorticoid treatment in tracheal/bronchial epithelial cells",
            "ntype": "title",
            "meta": {
                "section": "3.6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_49",
            "content": "Neither CYP3A5*1 mRNA nor any other variant form of CYP3A5 mRNA was detected or induced by glucocorticoids in NHBE, BEAS-2B, lobar, and freshly isolated tracheal wash samples ( Table 2 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_50",
            "content": "SAEC cells expressed CYP3A5, but mRNA for CYP3A5 was not induced by glucocorticoid treatment",
            "ntype": "title",
            "meta": {
                "section": "3.7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_51",
            "content": "SAEC cells from three separate donors were evaluated for CYP3A5*1 and other variant forms of CYP3A5 mRNA expression and induction in response to glucocorticoid treatment. Initial experiments demonstrated that mRNA for CYP3A5*1, but not CYP3A4 or 3A7, was expressed in one of the three SAEC samples (donor number 11662), but that expression levels were not altered by glucocorticoid treatment. It was hypothesized that the high concentration of hydrocortisone (500 µM) in the SAEC growth media prevented the induction of CYP3A5 mRNA by substantially lower concentrations of the glucocorticoids used in the treatments. Elimination of hydrocortisone from the media decreased the basal expression of CYP3A5 mRNA ( Figure 6 ). However, no change in mRNA abundance was observed over a 24 h treatment period with BDP. Furthermore, neither increasing the treatment concentration of BDP to 50 µM, nor treatment with [M1] at 150 µM led to an increase in CYP3A5 mRNA in SAEC cells. It was subsequently hypothesized that phthalates or other substances in the FBS might alter GR function and CYP3A5 mRNA induction by glucocorticoids <REF-27> . However, neither heat inactivation nor charcoal-stripping of the FBS in media with or without hydrocortisone led to CYP3A5 mRNA induction. The various manipulations to SAEC culture conditions and results for CYP3A5 induction are summarized in Table 3 .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_52",
            "content": "Figure 6.",
            "ntype": "label",
            "meta": {
                "id": "f6",
                "caption": "Beclomethasone dipropionate (BDP) treatment in SAEC cells results in no change in CYP3A5 mRNA. SAEC cells treated with BDP (10 µM; 24 h) or DMSO matching controls with and without hydrocortisone (HC). There was no significant difference between treatments or matching controls using one-way ANOVA with p<0.05.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure6.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_53",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f6\" position=\"float\"> <caption> <title>Beclomethasone dipropionate (BDP) treatment in SAEC cells results in no change in CYP3A5 mRNA.</title> <p>SAEC cells treated with BDP (10 &#181;M; 24 h) or DMSO matching controls with and without hydrocortisone (HC). There was no significant difference between treatments or matching controls using one-way ANOVA with p&lt;0.05.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure6.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f6",
                "caption": "Beclomethasone dipropionate (BDP) treatment in SAEC cells results in no change in CYP3A5 mRNA. SAEC cells treated with BDP (10 µM; 24 h) or DMSO matching controls with and without hydrocortisone (HC). There was no significant difference between treatments or matching controls using one-way ANOVA with p<0.05.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/1845/ff665663-8cd6-4e7a-8299-47d2235172d6_figure6.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_54",
            "content": "Table 3.",
            "ntype": "label",
            "meta": {
                "id": "T3",
                "caption": "Modifications made to SAEC culture media.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_55",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T3\" position=\"anchor\"> <caption> <title>Modifications made to SAEC culture media.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">Basal culture conditions</th> <th align=\"left\">Experimental modifications</th> <th align=\"left\">Result</th> </tr> </thead> <tbody> <tr> <td valign=\"top\">Cultured in growth media</td> <td valign=\"top\">-Heat inactivated media for treatment <break/>-10 &#181;M BDP for 24 h</td> <td>-Basal CYP3A5 mRNA expression observed in 1 out of 3 patients <break/>-No change in CYP3A5 mRNA</td> </tr> <tr> <td valign=\"top\">Cultured in growth media without hydrocortisone</td> <td valign=\"top\">-Heat inactivated media for treatment <break/>-10 &#181;M BDP for 24 h</td> <td>-Lowered basal level of CYP3A5 mRNA <break/>-No change in CYP3A5 mRNA</td> </tr> <tr> <td valign=\"top\">Cultured in growth media without hydrocortisone</td> <td>-Heat inactivated media for treatment <break/>-50 &#181;M BDP or 105 &#181;M [M1] for 24 h</td> <td valign=\"top\">-No change in CYP3A5 mRNA</td> </tr> <tr> <td valign=\"top\">Cultured in growth media without hydrocortisone</td> <td>-Treated in heat inactivated and charcoal stripped FBS <break/>-50 &#181;M BDP or 105 &#181;M [M1] for 24 h</td> <td valign=\"top\">-No change in CYP3A5 mRNA</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T3",
                "caption": "Modifications made to SAEC culture media.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_56",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_57",
            "content": "Inhaled glucocorticoids are used to control undesirable symptoms in asthmatic patients. However, about 30% of the population does not benefit from this first-line treatment <REF-6> . Prior work demonstrated that the five most commonly prescribed glucocorticoids used in the treatment of asthma are metabolized by CYP3A enzymes, specifically CYP3A4, CYP3A5, and CYP3A7 <REF-10> , <REF-11> . Therefore, it has been proposed that unusually high rates of metabolism of glucocorticoids in lung cells by these enzymes might contribute to the decrease and/or lack of efficacy in some individuals. However, it is not understood how the expression of CYP3A enzymes is regulated in the lung in response to glucocorticoid treatment, despite extensive knowledge of this phenomenon in hepatocytes and the liver <REF-22> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_58",
            "content": "Using A549 cells, it was demonstrated that CYP3A5*1 mRNA was induced by glucocorticoid treatment ( Figure 3B and Figure 4A–E ); neither CYP3A4 nor CYP3A7 mRNA were detected in A549 cells. Subsequent studies using a competitive antagonist of GR (ketoconazole) and siRNA selective for GR mRNA, demonstrated that inhibition of GR function prevented the induction of CYP3A5 mRNA by BDP and other glucocorticoids in A549 cells ( Figure 4A–E and Figure 5B ). It was also demonstrated that CAR mRNA was not expressed by lung cells, consistent with previous data <REF-15> , and therefore could not be involved in the regulation of CYP3A5 expression by glucocorticoids as occurs in hepatocytes. It was concluded that CYP3A5 expression was directly regulated by GR ( Figure 2B ). Schuetz et al. <REF-24> previously described two “half sites” of GR (TGTTCT) separated by 160 bp in the promoter region of CYP3A5 in HepG2 cells and in human and rat hepatocytes. It was demonstrated that dexamethasone induced the expression of CYP3A5 by the GR homodimer binding to these two joined “half-sites” which could be blocked by RU-486, a GR antagonist. It is plausible these same sites are involved in the regulation of CYP3A5 in lung cells by BDP and other glucocorticoids.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_59",
            "content": "Regardless of the exact mechanism of regulation, the current results illustrate that glucocorticoids have the capacity to induce the expression of CYP3A5 in A549 cells. These data, in conjunction with prior metabolism studies of glucocorticoids <REF-10> , <REF-11> , support the hypothesis that treating patients with glucocorticoids could increase levels of CYP3A5 in the lung, and therefore increase pulmonary glucocorticoid metabolism, ultimately increasing clearance, and potentially decreasing the concentration of active drug in lung cells. Though most of the population expresses the inactive form of CYP3A5 ( CYP3A5*3 ) <REF-13> , <REF-28> those expressing CYP3A5*1, the active form of CYP3A5 <REF-13> , would exhibit increased clearance of the drug, and therefore could account for at least some of the 30% of patients who do not respond to inhaled glucocorticoid therapy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_60",
            "content": "In order to further support the hypothetical scenario above, the induction of CYP3A enzymes by glucocorticoids in various lung cells was studied. CYP3A5 mRNA expression was quantified in primary lung cells, which presumably more closely model epithelial cells of the human respiratory tract and lung. NHBE, lobar, and cells recovered from tracheal washes of mechanically ventilated children were evaluated for CYP3A enzyme expression and induction by glucocorticoids. Results in Table 2 show that CYP3A mRNA was not expressed in cells of the conducting airways in response to glucocorticoid treatment, indicating that these epithelial cells likely do not play a role in CYP3A-dependent metabolism of glucocorticoids in the lung. In contrast, select donor samples of SAEC cells, representing cells of the distal bronchioles, alveolar ducts, and alveoli, did express CYP3A5 ( Table 2 ). However, there was no change in CYP3A5 mRNA when these cells were treated with glucocorticoids. A thorough examination of potential confounding issues associated with cell culture revealed a high concentration of hydrocortisone (500 µM) in the growth media. Because cells were treated with only 10 µM BDP, it would stand to reason that no change in CYP3A5 mRNA would occur because CYP3A5 expression would already be maximized as a result of hydrocortisone activating the GR pathway.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_61",
            "content": "Experiments conducted in A549 cells showed that culturing cells in 500 µM hydrocortisone increased the basal expression of CYP3A5 mRNA by 2-fold, masking the induction routinely observed using 10 µM BDP for 24 h. When A549 cells were subsequently cultured in media without hydrocortisone for 48 h, providing sufficient time for a “wash out” of the hydrocortisone, the basal expression of CYP3A5 mRNA was reduced, and ~2-fold induction of CYP3A5 mRNA occurred with the 10 µM BDP, 24 h treatment. Therefore, hydrocortisone was omitted from the SAEC growth media. Subsequent experiments in SAEC cells showed no change in CYP3A5 mRNA in response to glucocorticoid treatment ( Figure 6 ), albeit removal of hydrocortisone from the media caused a slight decrease in the basal level of CYP3A5 mRNA expression, suggesting that GR plays a role in the regulation of CYP3A5. It is feasible that because cells had been exposed to such high concentrations of hydrocortisone during their isolation and expansion, that 10 µM of BDP was not sufficient to induce CYP3A5 mRNA, even after culturing the cells in the absence of hydrocortisone for multiple division cycles. Therefore, the concentration of BDP was increased to 50 µM and an additional treatment group using 150 µM [M1] was added. Again no increases in CYP3A5 mRNA was observed. Heat-inactivated and charcoal-stripped FBS were also utilized to remove potential interfering compounds from FBS, and still no change was observed.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_62",
            "content": "To our knowledge, no one has observed a change in CYP3A mRNA expression in any primary human lung cell cultures. However, Cyp3a11, 3a13, and 3a16 mRNA and protein induction have been documented in mouse lung following dexamethasone treatment <REF-29> . As such, additional studies using animal models and relevant samples from human patients need to be evaluated in order to conclusively confirm or reject the hypothesis that CYP3A genes are regulated in human lung cells in response to glucocorticoid treatment since current in vitro models remain unexplainably limited in value for such studies.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_63",
            "content": "In summary, the data presented herein demonstrate that, in A549 cells, glucocorticoid binding to the glucocorticoid receptor regulates the expression of CYP3A5, and therefore, corroborates the hypothesis that increased metabolism of glucocorticoids may occur in some patients. However, further research is needed to determine if changes in CYP3A5 expression occur in the human respiratory tissue similar to A549 cells, the precise mechanism by which this process occurs, and whether changes in the local metabolism of glucocorticoids by CYP3A5 ultimately impact glucocorticoid efficiency.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_64",
            "content": "<REF-1> EPR-3. Guidelines for the Diagnosis and Management of Asthma-Summary Report 2007. J Allergy Clin Immunol. 2007 ; 120 ( 5 Suppl ): S94 – 138 . 17983880 10.1016/j.jaci.2007.09.029",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_65",
            "content": "<REF-3> Williams SG Schmidt DK Redd SC : Key clinical activities for quality asthma care. Recommendations of the National Asthma Education and Prevention Program. MMWR Recomm Rep. 2003 ; 52 ( RR-6 ): 1 – 8 . 12696781",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_66",
            "content": "<REF-4> Jusko WJ : Corticosteroid pharmacodynamics: models for a broad array of receptor-mediated pharmacologic effects. J Clin Pharmacol. 1990 ; 30 ( 4 ): 303 – 310 . 1971281 10.1002/j.1552-4604.1990.tb03598.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_67",
            "content": "<REF-6> Mjaanes CM Whelan GJ Szefler SJ : Corticosteroid therapy in Asthma: Predictors of Responsiveness. Clin Chest Med. 2006 ; 27 ( 1 ): 119 – 132 . 16543057 10.1016/j.ccm.2005.10.005",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_68",
            "content": "<REF-7> Wilcox JB Avery GS : Beclomethasone dipropionate corticosteroid inhaler: a preliminary report of its pharmacological properties and therapeutic efficacy in asthma. Drugs. 1973 ; 6 ( 2 ): 84 – 93 . 4753325 10.2165/00003495-197306020-00002",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_69",
            "content": "<REF-8> Jonsson G Astrom A Andersson P : Budesonide is metabolized by cytochrome P450 3A (CYP3A) enzymes in human liver. Drug Metab Dispos. 1995 ; 23 ( 1 ): 137 – 142 . 7720517",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_70",
            "content": "<REF-10> Moore CD Roberts JK Orton CR : Metabolic pathways of inhaled glucocorticoids by the CYP3A enzymes. Drug Metab Dispos. 2013 ; 41 ( 2 ): 379 – 389 . 23143891 10.1124/dmd.112.046318",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_71",
            "content": "<REF-11> Roberts JK Moore CD Ward RM : Metabolism of Beclomethasone Dipropionate by Cytochrome P450 3A Enzymes. J Pharmacol Exp Ther. 2013 ; 345 ( 2 ): 308 – 316 . 23512537 10.1124/jpet.112.202556",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_72",
            "content": "<REF-12> Leclerc J Tournel G Courcot-Ngoubo Ngangue E : Profiling gene expression of whole cytochrome P450 superfamily in human bronchial and peripheral lung tissues: Differential expression in non-small cell lung cancers. Biochimie. 2010 ; 92 ( 3 ): 292 – 306 . 20034539 10.1016/j.biochi.2009.12.007",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_73",
            "content": "<REF-13> Westlind-Johnsson A Malmebo S Johansson A : Comparative analysis of CYP3A expression in human liver suggests only a minor role for CYP3A5 in drug metabolism. Drug Metab Dispos. 2003 ; 31 ( 6 ): 755 – 761 . 12756208 10.1124/dmd.31.6.755",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_74",
            "content": "<REF-14> Hukkanen J Hakkola J Anttila S : Detection of mRNA encoding xenobiotic-metabolizing cytochrome P450s in human bronchoalveolar macrophages and peripheral blood lymphocytes. Mol Carcinogen. 1997 ; 20 ( 2 ): 224 – 230 . 9364212 10.1002/(SICI)1098-2744(199710)20:2<224::AID-MC9>3.0.CO;2-M",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_75",
            "content": "<REF-15> Hukkanen J Vaisanen T Lassila A : Regulation of CYP3A5 by glucocorticoids and cigarette smoke in human lung-derived cells. J Pharmacol Exp Ther. 2003 ; 304 ( 2 ): 745 – 752 . 12538830 10.1124/jpet.102.038208",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_76",
            "content": "<REF-16> Courcot E Leclerc J Lafitte JJ : Xenobiotic metabolism and disposition in human lung cell models: comparison with in vivo expression profiles. Drug Metab Dispos. 2012 ; 40 ( 10 ): 1953 – 1965 . 22798553 10.1124/dmd.112.046896",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_77",
            "content": "<REF-17> Lacroix D Sonnier M Moncion A : Expression of CYP3A in the human liver--evidence that the shift between CYP3A7 and CYP3A4 occurs immediately after birth. Eur J Biochem. 1997 ; 247 ( 2 ): 625 – 634 . 9266706 10.1111/j.1432-1033.1997.00625.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_78",
            "content": "<REF-18> Schuetz JD Beach DL Guzelian PS : Selective expression of cytochrome P450 CYP3A mRNAs in embryonic and adult human liver. Pharmacogenetics. 1994 ; 4 ( 1 ): 11 – 20 . 8004129",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_79",
            "content": "<REF-19> Goodwin B Redinbo MR Kliewer SA : Regulation of cyp3a gene transcription by the pregnane x receptor. Annu Rev Pharmacol Toxicol. 2002 ; 42 : 1 – 23 . 11807162 10.1146/annurev.pharmtox.42.111901.111051",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_80",
            "content": "<REF-20> Kliewer SA Goodwin B Willson TM : The nuclear pregnane X receptor: a key regulator of xenobiotic metabolism. Endocr Rev. 2002 ; 23 ( 5 ): 687 – 702 . 12372848 10.1210/er.2001-0038",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_81",
            "content": "<REF-21> Raunio H Hakkola J Pelkonen O : Regulation of CYP3A genes in the human respiratory tract. Chem Biol Interact. 2005 ; 151 ( 2 ): 53 – 62 . 15698577 10.1016/j.cbi.2003.12.007",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_82",
            "content": "<REF-22> Dvorak Z Pavek P : Regulation of drug-metabolizing cytochrome P450 enzymes by glucocorticoids. Drug Metab Rev. 2010 ; 42 ( 4 ): 621 – 635 . 20482443 10.3109/03602532.2010.484462",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_83",
            "content": "<REF-23> Urquhart BL Tirona RG Kim RB : Nuclear receptors and the regulation of drug-metabolizing enzymes and drug transporters: implications for interindividual variability in response to drugs. J Clin Pharmacol. 2007 ; 47 ( 5 ): 566 – 578 . 17442683 10.1177/0091270007299930",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_84",
            "content": "<REF-24> Schuetz JD Schuetz EG Thottassery JV : Identification of a novel dexamethasone responsive enhancer in the human CYP3A5 gene and its activation in human and rat liver cells. Mol Pharmacol. 1996 ; 49 ( 1 ): 63 – 72 . 8569713",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_85",
            "content": "<REF-25> Duret C Daujat-Chavanieu M Pascussi JM : Ketoconazole and miconazole are antagonists of the human glucocorticoid receptor: consequences on the expression and function of the constitutive androstane receptor and the pregnane X receptor. Mol Pharmacol. 2006 ; 70 ( 1 ): 329 – 339 . 16608920 10.1124/mol.105.022046",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_86",
            "content": "<REF-26> Katome T Obata T Matsushima R : Use of RNA interference-mediated gene silencing and adenoviral overexpression to elucidate the roles of AKT/protein kinase B isoforms in insulin actions. J Biol Chem. 2003 ; 278 ( 30 ): 28312 – 28323 . 12734182 10.1074/jbc.M302094200",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_87",
            "content": "<REF-27> DeKeyser JG Laurenzana EM Peterson EC : Selective phthalate activation of naturally occurring human constitutive androstane receptor splice variants and the pregnane X receptor. Toxicol Sci. 2011 ; 120 ( 2 ): 381 – 391 . 21227907 10.1093/toxsci/kfq394 3107492",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_88",
            "content": "<REF-28> Kuehl P Zhang J Lin Y : Sequence diversity in CYP3A promoters and characterization of the genetic basis of polymorphic CYP3A5 expression. Nat Genet. 2001 ; 27 ( 4 ): 383 – 391 . 11279519 10.1038/86882",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-173_v1_89",
            "content": "<REF-29> Haag M Fautrel A Guillouzo A : Expression of cytochromes P450 3A in mouse lung: effects of dexamethasone and pregnenolone 16alpha-carbonitrile. Arch Toxicol. 2003 ; 77 ( 3 ): 145 – 149 . 12632254",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "2-173_v1_0@0",
            "content": "Regulation of CYP3A genes by glucocorticoids in human lung cells",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_0",
            "start": 0,
            "end": 63,
            "label": {}
        },
        {
            "ix": "2-173_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@0",
            "content": "Inhaled glucocorticoids are the first-line treatment for patients with persistent asthma.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 0,
            "end": 88,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@1",
            "content": "However, approximately thirty percent of patients exhibit glucocorticoid insensitivity, which may involve excess metabolic clearance of the glucocorticoids by CYP3A enzymes in the lung.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 90,
            "end": 274,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@2",
            "content": "CYP3A4, 3A5, and 3A7 enzymes metabolize glucocorticoids, which in turn induce CYP3A genes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 276,
            "end": 365,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@3",
            "content": "However, the mechanism of CYP3A5 mRNA regulation by glucocorticoids in lung cells has not been determined.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 367,
            "end": 472,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@4",
            "content": "In hepatocytes, glucocorticoids bind to the glucocorticoid receptor (GR), which induces the expression of the constitutive androstane receptor or pregnane X receptor; both of which bind to the retinoid X receptor alpha, leading to the induction of CYP3A4, 3A5, and 3A7.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 474,
            "end": 742,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@5",
            "content": "There is also evidence to suggest a direct induction of CYP3A5 by GR activation in liver cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 744,
            "end": 838,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@6",
            "content": "In this study, these pathways were evaluated as the mechanism for CYP3A5 mRNA induction by glucocorticoids in freshly isolated primary tracheal epithelial, adenocarcinomic human alveolar basal epithelial (A549), immortalized bronchial epithelial (BEAS-2B), primary normal human bronchial/tracheal epithelial (NHBE), primary small airway epithelial (SAEC), and primary lobar epithelial lung cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 840,
            "end": 1235,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@7",
            "content": "In A549 cells, beclomethasone 17-monopropionate ([M1]) induced CYP3A5 mRNA through the glucocorticoid receptor.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 1237,
            "end": 1347,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@8",
            "content": "CYP3A5 mRNA induction by five different glucocorticoids was attenuated by inhibiting the glucocorticoid receptor using ketoconazole, and for beclomethasone dipropionate, using siRNA-mediated knock-down of the glucocorticoid receptor.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 1349,
            "end": 1581,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@9",
            "content": "The constitutive androstane receptor was not expressed in lung cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 1583,
            "end": 1651,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@10",
            "content": "SAEC cells, a primary lung cell line, expressed CYP3A5, but CYP3A5 mRNA was not induced by glucocorticoid treatment despite evaluating a multitude of cell culture conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 1653,
            "end": 1826,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@11",
            "content": "None of the other lung cells expressed CYP3A4, 3A5 or 3A7 mRNA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 1828,
            "end": 1890,
            "label": {}
        },
        {
            "ix": "2-173_v1_2@12",
            "content": "These studies demonstrate that CYP3A5 mRNA is induced by glucocorticoids in A549 cells via the glucocorticoid receptor, but that additional undefined regulatory processes exist in primary lung cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_2",
            "start": 1892,
            "end": 2090,
            "label": {}
        },
        {
            "ix": "2-173_v1_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-173_v1_4@0",
            "content": "Inhaled glucocorticoids are the first-line treatment for asthma <REF-1> – <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_4",
            "start": 0,
            "end": 82,
            "label": {}
        },
        {
            "ix": "2-173_v1_4@1",
            "content": "Glucocorticoids bind to the glucocorticoid receptor to reduce the expression of genes that produce a variety of pro-inflammatory mediators and mucus in the lung <REF-4> – <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_4",
            "start": 84,
            "end": 263,
            "label": {}
        },
        {
            "ix": "2-173_v1_4@2",
            "content": "The most commonly prescribed glucocorticoids are beclomethasone dipropionate (BDP), triamcinolone acetonide (TCL), budesonide (BUD), fluticasone propionate (FLT), and flunisolide (FLN) <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_4",
            "start": 265,
            "end": 458,
            "label": {}
        },
        {
            "ix": "2-173_v1_4@3",
            "content": "BDP is a pro-drug and requires removal of the C-21 propionate group to become pharmacologically active; the active drug is beclomethasone 17-monopropionate, referred to as [M1] ( Figure 1 ) <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_4",
            "start": 460,
            "end": 658,
            "label": {}
        },
        {
            "ix": "2-173_v1_4@4",
            "content": "Pharmacological inactivation and clearance of glucocorticoids, such as BDP and its active metabolite [M1], is mediated, in part, by cytochrome P450 (CYP) enzymes ( Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_4",
            "start": 660,
            "end": 834,
            "label": {}
        },
        {
            "ix": "2-173_v1_5@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_5",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-173_v1_7@0",
            "content": "In humans, CYP3A4, 3A5, and 3A7 are the primary CYP enzymes involved in glucocorticoid metabolism <REF-8> – <REF-11> . CYP3A4 is the most abundant CYP3A enzyme in the liver and intestines <REF-8> , <REF-12> , <REF-13> , CYP3A5 is more prevalent in the lung than the liver <REF-12> , <REF-14> – <REF-16> , and CYP3A7 is expressed in fetal liver, but diminishes after birth when CYP3A4 becomes the dominant adult hepatic CYP3A enzyme <REF-17> , <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_7",
            "start": 0,
            "end": 452,
            "label": {}
        },
        {
            "ix": "2-173_v1_7@1",
            "content": "Expression of CYP3A7 in fetal and adult respiratory tissue has also been observed <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_7",
            "start": 454,
            "end": 545,
            "label": {}
        },
        {
            "ix": "2-173_v1_8@0",
            "content": "Regulation of CYP3A enzymes in response to glucocorticoid treatment has been extensively characterized in the liver, but less is known about this phenomenon in the lung.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_8",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "2-173_v1_8@1",
            "content": "In hepatocytes, CYP3A enzyme induction is mediated by the pregnane X receptor (PXR) <REF-19> , <REF-20> ( Figure 2A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_8",
            "start": 170,
            "end": 287,
            "label": {}
        },
        {
            "ix": "2-173_v1_8@2",
            "content": "However, PXR is not expressed in the lung <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_8",
            "start": 289,
            "end": 340,
            "label": {}
        },
        {
            "ix": "2-173_v1_8@3",
            "content": "Glucocorticoids can also influence CYP3A induction via the glucocorticoid receptor (GR) and the constitutive androstane receptor (CAR) in the liver <REF-22> , <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_8",
            "start": 342,
            "end": 510,
            "label": {}
        },
        {
            "ix": "2-173_v1_8@4",
            "content": "Briefly, glucocorticoids bind GR in the cytosol, which forms a homodimer and translocates into the nucleus, leading to increased transcription of CAR.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_8",
            "start": 512,
            "end": 661,
            "label": {}
        },
        {
            "ix": "2-173_v1_8@5",
            "content": "CAR forms a heterodimer with the retinoid X receptor alpha (RXRα), which binds to the RXR-response element and induces the expression of CYP3A enzymes ( Figure 2A ) <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_8",
            "start": 663,
            "end": 837,
            "label": {}
        },
        {
            "ix": "2-173_v1_8@6",
            "content": "Previous work by Hukannen et al. demonstrated that CAR was not expressed in A549 (adenocarcinomic human alveolar basal epithelial) cells and suggested that glucocorticoid binding to GR may directly regulate CYP3A gene expression in A549 cells ( Figure 2B ), based on inhibition using RU-486 <REF-15> , <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_8",
            "start": 839,
            "end": 1150,
            "label": {}
        },
        {
            "ix": "2-173_v1_8@7",
            "content": "However, these pathways have not been evaluated in primary lung cell cultures or lung tissue.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_8",
            "start": 1152,
            "end": 1244,
            "label": {}
        },
        {
            "ix": "2-173_v1_9@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_9",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-173_v1_11@0",
            "content": "The purpose of this study was three fold: to evaluate the changes in the expression of CYP3A mRNA in primary lung cells treated with glucocorticoids; to determine which pathway was responsible for glucocorticoid-induced changes in CYP3A mRNA expression; and to determine the role of BDP metabolism in this phenomenon.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_11",
            "start": 0,
            "end": 316,
            "label": {}
        },
        {
            "ix": "2-173_v1_11@1",
            "content": "The cell lines used in this study were BEAS-2B (immortalized bronchial epithelial cell line), NHBE (normal human bronchial/tracheal epithelial cells), lobar epithelial cells (secondary bronchus epithelial cells), primary cells recovered from tracheal washes of pediatric patients on ventilation, SAEC (small airway epithelial cells), and A549 (human lung adenocarcinoma) cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_11",
            "start": 318,
            "end": 694,
            "label": {}
        },
        {
            "ix": "2-173_v1_11@2",
            "content": "It was hypothesized that CYP3A5 mRNA induction in primary cells by BDP <REF-11> and other glucocorticoids would occur via a mechanism involving GR/CAR/RXRα, as previously demonstrated using hepatocytes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_11",
            "start": 696,
            "end": 897,
            "label": {}
        },
        {
            "ix": "2-173_v1_12@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_12",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-173_v1_13@0",
            "content": "Chemicals, reagents, and treatments",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_13",
            "start": 0,
            "end": 34,
            "label": {}
        },
        {
            "ix": "2-173_v1_14@0",
            "content": "Beclomethasone dipropionate (BDP), triamcinolone acetonide (TCL), fluticasone propionate (FLT), flunisolide (FLN), budesonide (BUD), prednisolone, ammonium acetate, eserine, and methanol were purchased from Sigma-Aldrich Chemical Company (St. Louis, MO).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_14",
            "start": 0,
            "end": 253,
            "label": {}
        },
        {
            "ix": "2-173_v1_14@1",
            "content": "Paraoxon was purchased from Chem Service (West Chester, PA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_14",
            "start": 255,
            "end": 314,
            "label": {}
        },
        {
            "ix": "2-173_v1_15@0",
            "content": "Cell culture",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_15",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@0",
            "content": "A549 cells (American Type Culture Collection, Manassas, VA) were cultured in Dulbecco's Modified Eagle Medium (DMEM) fortified with 5% fetal bovine serum (Life Technologies, Grand Island, NY).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@1",
            "content": "SAEC cells (LONZA, Walkersville, MD; donor numbers 11662, 14453, 14457) were cultured in small airway epithelial growth medium, supplemented with the SAGM bullet kit (LONZA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 193,
            "end": 366,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@2",
            "content": "Cells were cultured with and without hydrocortisone by adding or not adding the hydrocortisone component from the SAGM bullet kit.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 368,
            "end": 497,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@3",
            "content": "NHBE cells (LONZA; donor numbers 15268, 5S03795) were grown in bronchial epithelial cell growth medium (BEGM Bullet kit) (LONZA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 499,
            "end": 627,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@4",
            "content": "BEAS-2B cells (American Type Culture Collection) were cultured in LHC-9 medium (Life Technologies).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 629,
            "end": 727,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@5",
            "content": "Lobar cells (donor number 01334) were cultured in BronchiaLife Basal Medium supplemented with the BronchiaLife B/T supplement kit (Lifeline Cell Technology, Walkersville, MD).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 729,
            "end": 903,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@6",
            "content": "All cells except A549 cells were plated in 12-well plates pre-coated with LHC basal medium (Life Technologies).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 905,
            "end": 1015,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@7",
            "content": "Tracheal epithelial cells were recovered from tracheal washes from mechanically ventilated pediatric patients in the neonatal intensive care unit and pediatric intensive care unit at Primary Children’s Medical Center at the University of Utah, with IRB approval (00026839).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 1017,
            "end": 1289,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@8",
            "content": "Briefly, cells were separated from sputum by centrifugation at 900 x g for 30 min in 14 mL of DMEM/F12 media.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 1291,
            "end": 1399,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@9",
            "content": "Cells were plated in a 12-well plate pre-coated with 2% gelatin (Life Technologies) and cultured in DMEM/F12 media + 10% fetal bovine serum (FBS) (Life Technologies).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 1401,
            "end": 1566,
            "label": {}
        },
        {
            "ix": "2-173_v1_16@10",
            "content": "All cells were cultured in an atmosphere of 5% CO 2 :95% air at 37ºC.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_16",
            "start": 1568,
            "end": 1636,
            "label": {}
        },
        {
            "ix": "2-173_v1_17@0",
            "content": "Cell treatments",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_17",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@0",
            "content": "Cell treatments were prepared in treatment media with a final concentration of DMSO less than 1%.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 0,
            "end": 96,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@1",
            "content": "Cells were treated at ~70% confluence.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 98,
            "end": 135,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@2",
            "content": "A549 cells were cultured in OPTIMEM (Life Technologies) and SAEC cells were cultured in growth media either with or without hydrocortisone and with or without heat inactivated and/or charcoal-stripped FBS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 137,
            "end": 341,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@3",
            "content": "All other cell lines were treated in their respective growth medium, and heat inactivated to eliminate esterase activity from the FBS, which would metabolize BDP before it could diffuse into the cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 343,
            "end": 543,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@4",
            "content": "Cytotoxicity assays were performed using the Dojindo Cell Counting Kit-8 (Dojindo Laboratories, Rockville, MD) to determine glucocorticoid, esterase inhibitor, and ketoconazole concentrations exhibiting <20% cytotoxicity in A549 cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 545,
            "end": 779,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@5",
            "content": "All other cell lines were treated with the same concentrations as determined with A549 cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 781,
            "end": 873,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@6",
            "content": "Glucocorticoid treatments were as follows: BDP (10 μM), TCL (1 μM), BUD (10 μM), FLT (1 μM), and FLN (100 nM).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 875,
            "end": 984,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@7",
            "content": "Pre-treatments in various experiments included ketoconazole (Sigma-Aldrich Chemical Company) (50 μM, 10 μM, and 1 μM, to antagonize GR), esterase inhibitors (1:1 mixture of eserine and paraoxon, each at 175 μM, to inhibit [M1] formation), and 1-aminobenzotriazole (Sigma-Aldrich Chemical Company) (1-ABT; 200 μM, to inhibit P450-mediated metabolism) for 2 h prior to a 22 h glucocorticoid co-treatment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 986,
            "end": 1387,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@8",
            "content": "Controls were treated with an equivalent concentration of DMSO.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 1389,
            "end": 1451,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@9",
            "content": "All A549 cell treatments were carried out in 6-well plates for 24 h (n=6).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 1453,
            "end": 1526,
            "label": {}
        },
        {
            "ix": "2-173_v1_18@10",
            "content": "All other cell lines were cultured in pre-coated 12-well plates and treated for 24 h (n=3).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_18",
            "start": 1528,
            "end": 1618,
            "label": {}
        },
        {
            "ix": "2-173_v1_19@0",
            "content": "Analysis of BDP metabolites",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_19",
            "start": 0,
            "end": 26,
            "label": {}
        },
        {
            "ix": "2-173_v1_20@0",
            "content": "After treatment, BDP and its metabolites were extracted from the collected media by adding 2x volume (6 mL for A549, 4 mL for all other cell lines) methyl tert -butyl ether containing 1 nM prednisolone (internal standard for quantification) and shaking for 25 min.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_20",
            "start": 0,
            "end": 263,
            "label": {}
        },
        {
            "ix": "2-173_v1_20@1",
            "content": "Samples were clarified by centrifugation, the organic fraction was collected, dried under air, reconstituted in 100 µL 1:1 H 2 O:MeOH, clarified again by centrifugation, and transferred to autosampler vials for analysis by liquid chromatography-mass spectrometry (LC/MS/MS).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_20",
            "start": 265,
            "end": 538,
            "label": {}
        },
        {
            "ix": "2-173_v1_20@2",
            "content": "LC/MS/MS was conducted on a Thermo LCQ Advantage Max ion trap instrument equipped with a Finnigan Surveyor LC pump, Surveyor Autosampler and universal Ion Max source operated with Thermo Xcalibur software version 2.0 (Thermo Fisher Scientific, Waltham, MA) as previously described <REF-11> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_20",
            "start": 540,
            "end": 830,
            "label": {}
        },
        {
            "ix": "2-173_v1_21@0",
            "content": "Quantitative reverse transcription-PCR",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_21",
            "start": 0,
            "end": 37,
            "label": {}
        },
        {
            "ix": "2-173_v1_22@0",
            "content": "Total RNA was isolated from cells using TRIzol reagent (Life Technologies).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_22",
            "start": 0,
            "end": 74,
            "label": {}
        },
        {
            "ix": "2-173_v1_22@1",
            "content": "cDNA was synthesized using iScript Reverse Transcription Supermix for qPCR (BIO RAD, Hercules, CA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_22",
            "start": 76,
            "end": 174,
            "label": {}
        },
        {
            "ix": "2-173_v1_22@2",
            "content": "qPCR was performed using either LightCycler 480 Probes Master mix (CYP3A5*1) or LightCycler 480 SYBR Green I Master Mix (all other genes) (Roche, Indianapolis, IN) with a LightCycler 480 System.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_22",
            "start": 176,
            "end": 369,
            "label": {}
        },
        {
            "ix": "2-173_v1_22@3",
            "content": "The PCR program for the probe mix consisted of a 5 min incubation at 95ºC, followed by 45 cycles of 95ºC for 10s, 55ºC for 30s, then 72ºC for 1s.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_22",
            "start": 371,
            "end": 515,
            "label": {}
        },
        {
            "ix": "2-173_v1_22@4",
            "content": "The PCR program for SYBR Green I mix consisted of a 5 min incubation at 95ºC, followed by 40 cycles of 95ºC for 10s, 63ºC for 5s for CYP3A4, CYP3A7 and β2-microglobulin.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_22",
            "start": 517,
            "end": 685,
            "label": {}
        },
        {
            "ix": "2-173_v1_22@5",
            "content": "For GR and CAR, annealing was performed at 65ºC for 5s and extension at 72ºC for 10s.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_22",
            "start": 687,
            "end": 771,
            "label": {}
        },
        {
            "ix": "2-173_v1_22@6",
            "content": "mRNA copy number was determined from standard curves for each gene and was normalized using β2-microglobulin.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_22",
            "start": 773,
            "end": 881,
            "label": {}
        },
        {
            "ix": "2-173_v1_22@7",
            "content": "Primer sequences for the various genes are listed in Table 1 <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_22",
            "start": 883,
            "end": 953,
            "label": {}
        },
        {
            "ix": "2-173_v1_23@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_23",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-173_v1_25@0",
            "content": "siRNA-mediated protein knockdown",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_25",
            "start": 0,
            "end": 31,
            "label": {}
        },
        {
            "ix": "2-173_v1_26@0",
            "content": "Pre-annealed, short interfering “Smart Pool” siRNAs specific to human GR were purchased from Dharmacon (Waltham, MA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_26",
            "start": 0,
            "end": 116,
            "label": {}
        },
        {
            "ix": "2-173_v1_26@1",
            "content": "siRNA directed against GFP (negative control) <REF-26> was synthesized at the University of Utah oligonucleotide synthesis core and annealed by combining 40 µM of each strand and incubating in annealing buffer (100 mM potassium acetate, 30 mM HEPES KOH, 2 mM magnesium acetate adjusted to pH 7.4) for 1 min at 90ºC followed by 1 h at 37ºC, in a final volume of 0.5 mL.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_26",
            "start": 118,
            "end": 485,
            "label": {}
        },
        {
            "ix": "2-173_v1_26@2",
            "content": "A549 cells were plated into 6-well plates containing 20 nM siRNA per well, previously complexed with Lipofectamine 2000 (Life Technologies) using a ratio of 3:2 lipid to siRNA in 100 µL of OPTIMEM (Life Technologies).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_26",
            "start": 487,
            "end": 703,
            "label": {}
        },
        {
            "ix": "2-173_v1_26@3",
            "content": "The cells were grown for 48, 72, and 96 h to determine the time at which maximum decreases in GR mRNA occurred (72 h).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_26",
            "start": 705,
            "end": 822,
            "label": {}
        },
        {
            "ix": "2-173_v1_26@4",
            "content": "In subsequent experiments, cells were treated with DMSO, 10 µM BDP, or 10 μM BDP + 175 µM esterase inhibitors (1:1 eserine:paraoxon) for 24 h to determine the effects of attenuated GR expression on the induction of CYP3A5 in A549 cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_26",
            "start": 824,
            "end": 1059,
            "label": {}
        },
        {
            "ix": "2-173_v1_27@0",
            "content": "Statistical analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_27",
            "start": 0,
            "end": 19,
            "label": {}
        },
        {
            "ix": "2-173_v1_28@0",
            "content": "Statistical analysis was performed using GraphPad Prism 4.02 software for Windows (San Diego, CA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_28",
            "start": 0,
            "end": 97,
            "label": {}
        },
        {
            "ix": "2-173_v1_28@1",
            "content": "One-way ANOVA and Dunnett’s post-hoc test were used with p<0.05.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_28",
            "start": 99,
            "end": 162,
            "label": {}
        },
        {
            "ix": "2-173_v1_28@2",
            "content": "All data are represented as a mean with error bars representing standard deviation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_28",
            "start": 164,
            "end": 246,
            "label": {}
        },
        {
            "ix": "2-173_v1_29@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_29",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-173_v1_30@0",
            "content": "Inhibition of [M1] formation prevented CYP3A5 mRNA induction by BDP in A549 cells",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_30",
            "start": 0,
            "end": 80,
            "label": {}
        },
        {
            "ix": "2-173_v1_31@0",
            "content": "Media from A549 cells treated with BDP (10 µM) for 24 h was extracted and analyzed for metabolites of BDP produced by CYP3A enzymes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_31",
            "start": 0,
            "end": 131,
            "label": {}
        },
        {
            "ix": "2-173_v1_31@1",
            "content": "The only CYP3A-mediated metabolite detected was [M5] ( Figure 1 and Figure 3A ) <REF-11> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_31",
            "start": 133,
            "end": 222,
            "label": {}
        },
        {
            "ix": "2-173_v1_31@2",
            "content": "For the remainder of the studies, [M1], the active metabolite, was used as a marker for esterase activity and [M5] was used as a marker for CYP3A5 activity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_31",
            "start": 224,
            "end": 379,
            "label": {}
        },
        {
            "ix": "2-173_v1_31@3",
            "content": "Only CYP3A5*1 mRNA was detected in A549 cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_31",
            "start": 381,
            "end": 426,
            "label": {}
        },
        {
            "ix": "2-173_v1_31@4",
            "content": "CYP3A4 and CYP3A7 mRNA were not detected in A549 cells, as previously documented <REF-11> , <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_31",
            "start": 428,
            "end": 529,
            "label": {}
        },
        {
            "ix": "2-173_v1_31@5",
            "content": "BDP treatment significantly induced the expression of CYP3A5 mRNA (~2-fold) compared to the DMSO control ( Figure 3B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_31",
            "start": 531,
            "end": 649,
            "label": {}
        },
        {
            "ix": "2-173_v1_31@6",
            "content": "Inhibiting the production of [M1] using esterase inhibitors also blocked the induction of CYP3A5 mRNA ( Figure 2A and Figure 2B ); esterase inhibitor (EI) treatment alone had no effect on CYP3A5 expression.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_31",
            "start": 651,
            "end": 856,
            "label": {}
        },
        {
            "ix": "2-173_v1_31@7",
            "content": "1-ABT, a mechanism-based inactivator of P450 enzymes, also inhibited esterase activity (i.e. [M1] formation) ( Figure 3A ), and as a result, prevented the induction of CYP3A5 mRNA ( Figure 3B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_31",
            "start": 858,
            "end": 1051,
            "label": {}
        },
        {
            "ix": "2-173_v1_32@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_32",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-173_v1_34@0",
            "content": "[M1] was sufficient to induce CYP3A5 mRNA in A549 cells",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_34",
            "start": 0,
            "end": 54,
            "label": {}
        },
        {
            "ix": "2-173_v1_35@0",
            "content": "Cells were treated with [M1] in either the absence or presence of 1-ABT and esterase inhibitors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_35",
            "start": 0,
            "end": 95,
            "label": {}
        },
        {
            "ix": "2-173_v1_35@1",
            "content": "[M1] treatment was sufficient to induce CYP3A5 mRNA (~2-fold), without the requirement of esterases to produce [M1] ( Figure 3B ), indicating that CYP3A5 mRNA induction in A549 cells was mediated by [M1].",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_35",
            "start": 97,
            "end": 300,
            "label": {}
        },
        {
            "ix": "2-173_v1_36@0",
            "content": "GR, but not CAR, regulated the induction of CYP3A5 mRNA in A549 cells",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_36",
            "start": 0,
            "end": 68,
            "label": {}
        },
        {
            "ix": "2-173_v1_37@0",
            "content": "GR and CAR mRNA were quantified in A549 cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_37",
            "start": 0,
            "end": 45,
            "label": {}
        },
        {
            "ix": "2-173_v1_37@1",
            "content": "A significant increase in GR mRNA (~2.5-fold) was observed following 24 h treatment with BDP ( Table 2 ), consistent with previous studies <REF-15> , suggesting that GR, not CAR, was responsible for the induction of CYP3A5 message in A549 cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_37",
            "start": 47,
            "end": 291,
            "label": {}
        },
        {
            "ix": "2-173_v1_38@0",
            "content": "Table 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_38",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-173_v1_40@0",
            "content": "Inhibition of GR with ketoconazole attenuated CYP3A5 mRNA induction by glucocorticoids in A549 cells",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_40",
            "start": 0,
            "end": 99,
            "label": {}
        },
        {
            "ix": "2-173_v1_41@0",
            "content": "Ketoconazole is a competitive antagonist of GR <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_41",
            "start": 0,
            "end": 56,
            "label": {}
        },
        {
            "ix": "2-173_v1_41@1",
            "content": "Ketoconazole alone had no significant effect on CYP3A5 mRNA expression as compared to DMSO controls.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_41",
            "start": 58,
            "end": 157,
            "label": {}
        },
        {
            "ix": "2-173_v1_41@2",
            "content": "As the concentration of ketoconazole was decreased, dose-dependent increases in the expression of CYP3A5 mRNA were observed for BDP, TCL, FLT, BUD, and FLN ( Figure 4A–E ): BDP caused a ~2-fold induction, BUD caused a ~4-fold induction, TCL caused a ~5.5-fold induction, FLT caused a ~3.5-fold induction, and FLN caused a ~5.5-fold induction, relative to their respective controls.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_41",
            "start": 159,
            "end": 539,
            "label": {}
        },
        {
            "ix": "2-173_v1_41@3",
            "content": "These data confirm the hypothesis that the induction of CYP3A5 mRNA in A549 cells was mediated by GR.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_41",
            "start": 541,
            "end": 641,
            "label": {}
        },
        {
            "ix": "2-173_v1_41@4",
            "content": "BDP or FLT paired with KTZ 1 µM treatment also showed further induction of CYP3A5 mRNA as compared to controls (~3.5 for BDP and ~6.5 for FLT).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_41",
            "start": 643,
            "end": 785,
            "label": {}
        },
        {
            "ix": "2-173_v1_41@5",
            "content": "However, the basis and significance for this enhanced induction are not clear at this time.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_41",
            "start": 787,
            "end": 877,
            "label": {}
        },
        {
            "ix": "2-173_v1_42@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_42",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-173_v1_44@0",
            "content": "siRNA-mediated knockdown of GR also attenuated CYP3A5 mRNA induction by BDP in A549 cells",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_44",
            "start": 0,
            "end": 88,
            "label": {}
        },
        {
            "ix": "2-173_v1_45@0",
            "content": "Cells were transfected with siRNA and grown for 48, 72, and 96 h to determine the time of maximum GR mRNA knock down ( Figure 5A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_45",
            "start": 0,
            "end": 130,
            "label": {}
        },
        {
            "ix": "2-173_v1_45@1",
            "content": "Maximum suppression occurred as early as 48 h, but the 72 h time point was chosen for further experiments to ensure efficient GR protein depletion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_45",
            "start": 132,
            "end": 278,
            "label": {}
        },
        {
            "ix": "2-173_v1_45@2",
            "content": "An approximate 2-fold induction of CYP3A5 mRNA was observed in A549 cells following treatment with BDP in control cells transfected with “nonsense” siRNA directed against GFP.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_45",
            "start": 280,
            "end": 454,
            "label": {}
        },
        {
            "ix": "2-173_v1_45@3",
            "content": "Consistent with previous results ( Figure 3A and Figure 3B ), CYP3A5 mRNA induction was prevented by esterase inhibitors ( Figure 5B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_45",
            "start": 456,
            "end": 590,
            "label": {}
        },
        {
            "ix": "2-173_v1_45@4",
            "content": "Cells transfected with siRNA targeted for GR mRNA showed no change in CYP3A5 mRNA with BDP treatment ( Figure 5B ), further confirming the role of GR in directly regulating the induction of CYP3A5 mRNA in A549 cells treated with BDP and presumably the other glucocorticoids used in Figure 4 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_45",
            "start": 592,
            "end": 883,
            "label": {}
        },
        {
            "ix": "2-173_v1_46@0",
            "content": "Figure 5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_46",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-173_v1_48@0",
            "content": "CYP3A5 was not expressed or induced by glucocorticoid treatment in tracheal/bronchial epithelial cells",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_48",
            "start": 0,
            "end": 101,
            "label": {}
        },
        {
            "ix": "2-173_v1_49@0",
            "content": "Neither CYP3A5*1 mRNA nor any other variant form of CYP3A5 mRNA was detected or induced by glucocorticoids in NHBE, BEAS-2B, lobar, and freshly isolated tracheal wash samples ( Table 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_49",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "2-173_v1_50@0",
            "content": "SAEC cells expressed CYP3A5, but mRNA for CYP3A5 was not induced by glucocorticoid treatment",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_50",
            "start": 0,
            "end": 91,
            "label": {}
        },
        {
            "ix": "2-173_v1_51@0",
            "content": "SAEC cells from three separate donors were evaluated for CYP3A5*1 and other variant forms of CYP3A5 mRNA expression and induction in response to glucocorticoid treatment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_51",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "2-173_v1_51@1",
            "content": "Initial experiments demonstrated that mRNA for CYP3A5*1, but not CYP3A4 or 3A7, was expressed in one of the three SAEC samples (donor number 11662), but that expression levels were not altered by glucocorticoid treatment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_51",
            "start": 171,
            "end": 391,
            "label": {}
        },
        {
            "ix": "2-173_v1_51@2",
            "content": "It was hypothesized that the high concentration of hydrocortisone (500 µM) in the SAEC growth media prevented the induction of CYP3A5 mRNA by substantially lower concentrations of the glucocorticoids used in the treatments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_51",
            "start": 393,
            "end": 615,
            "label": {}
        },
        {
            "ix": "2-173_v1_51@3",
            "content": "Elimination of hydrocortisone from the media decreased the basal expression of CYP3A5 mRNA ( Figure 6 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_51",
            "start": 617,
            "end": 720,
            "label": {}
        },
        {
            "ix": "2-173_v1_51@4",
            "content": "However, no change in mRNA abundance was observed over a 24 h treatment period with BDP.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_51",
            "start": 722,
            "end": 809,
            "label": {}
        },
        {
            "ix": "2-173_v1_51@5",
            "content": "Furthermore, neither increasing the treatment concentration of BDP to 50 µM, nor treatment with [M1] at 150 µM led to an increase in CYP3A5 mRNA in SAEC cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_51",
            "start": 811,
            "end": 969,
            "label": {}
        },
        {
            "ix": "2-173_v1_51@6",
            "content": "It was subsequently hypothesized that phthalates or other substances in the FBS might alter GR function and CYP3A5 mRNA induction by glucocorticoids <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_51",
            "start": 971,
            "end": 1129,
            "label": {}
        },
        {
            "ix": "2-173_v1_51@7",
            "content": "However, neither heat inactivation nor charcoal-stripping of the FBS in media with or without hydrocortisone led to CYP3A5 mRNA induction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_51",
            "start": 1131,
            "end": 1268,
            "label": {}
        },
        {
            "ix": "2-173_v1_51@8",
            "content": "The various manipulations to SAEC culture conditions and results for CYP3A5 induction are summarized in Table 3 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_51",
            "start": 1270,
            "end": 1382,
            "label": {}
        },
        {
            "ix": "2-173_v1_52@0",
            "content": "Figure 6.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_52",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-173_v1_54@0",
            "content": "Table 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_54",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-173_v1_56@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_56",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "2-173_v1_57@0",
            "content": "Inhaled glucocorticoids are used to control undesirable symptoms in asthmatic patients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_57",
            "start": 0,
            "end": 86,
            "label": {}
        },
        {
            "ix": "2-173_v1_57@1",
            "content": "However, about 30% of the population does not benefit from this first-line treatment <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_57",
            "start": 88,
            "end": 181,
            "label": {}
        },
        {
            "ix": "2-173_v1_57@2",
            "content": "Prior work demonstrated that the five most commonly prescribed glucocorticoids used in the treatment of asthma are metabolized by CYP3A enzymes, specifically CYP3A4, CYP3A5, and CYP3A7 <REF-10> , <REF-11> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_57",
            "start": 183,
            "end": 388,
            "label": {}
        },
        {
            "ix": "2-173_v1_57@3",
            "content": "Therefore, it has been proposed that unusually high rates of metabolism of glucocorticoids in lung cells by these enzymes might contribute to the decrease and/or lack of efficacy in some individuals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_57",
            "start": 390,
            "end": 588,
            "label": {}
        },
        {
            "ix": "2-173_v1_57@4",
            "content": "However, it is not understood how the expression of CYP3A enzymes is regulated in the lung in response to glucocorticoid treatment, despite extensive knowledge of this phenomenon in hepatocytes and the liver <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_57",
            "start": 590,
            "end": 807,
            "label": {}
        },
        {
            "ix": "2-173_v1_58@0",
            "content": "Using A549 cells, it was demonstrated that CYP3A5*1 mRNA was induced by glucocorticoid treatment ( Figure 3B and Figure 4A–E ); neither CYP3A4 nor CYP3A7 mRNA were detected in A549 cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_58",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "2-173_v1_58@1",
            "content": "Subsequent studies using a competitive antagonist of GR (ketoconazole) and siRNA selective for GR mRNA, demonstrated that inhibition of GR function prevented the induction of CYP3A5 mRNA by BDP and other glucocorticoids in A549 cells ( Figure 4A–E and Figure 5B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_58",
            "start": 188,
            "end": 451,
            "label": {}
        },
        {
            "ix": "2-173_v1_58@2",
            "content": "It was also demonstrated that CAR mRNA was not expressed by lung cells, consistent with previous data <REF-15> , and therefore could not be involved in the regulation of CYP3A5 expression by glucocorticoids as occurs in hepatocytes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_58",
            "start": 453,
            "end": 684,
            "label": {}
        },
        {
            "ix": "2-173_v1_58@3",
            "content": "It was concluded that CYP3A5 expression was directly regulated by GR ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_58",
            "start": 686,
            "end": 768,
            "label": {}
        },
        {
            "ix": "2-173_v1_58@4",
            "content": "Schuetz et al. <REF-24> previously described two “half sites” of GR (TGTTCT) separated by 160 bp in the promoter region of CYP3A5 in HepG2 cells and in human and rat hepatocytes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_58",
            "start": 770,
            "end": 947,
            "label": {}
        },
        {
            "ix": "2-173_v1_58@5",
            "content": "It was demonstrated that dexamethasone induced the expression of CYP3A5 by the GR homodimer binding to these two joined “half-sites” which could be blocked by RU-486, a GR antagonist.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_58",
            "start": 949,
            "end": 1131,
            "label": {}
        },
        {
            "ix": "2-173_v1_58@6",
            "content": "It is plausible these same sites are involved in the regulation of CYP3A5 in lung cells by BDP and other glucocorticoids.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_58",
            "start": 1133,
            "end": 1253,
            "label": {}
        },
        {
            "ix": "2-173_v1_59@0",
            "content": "Regardless of the exact mechanism of regulation, the current results illustrate that glucocorticoids have the capacity to induce the expression of CYP3A5 in A549 cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_59",
            "start": 0,
            "end": 167,
            "label": {}
        },
        {
            "ix": "2-173_v1_59@1",
            "content": "These data, in conjunction with prior metabolism studies of glucocorticoids <REF-10> , <REF-11> , support the hypothesis that treating patients with glucocorticoids could increase levels of CYP3A5 in the lung, and therefore increase pulmonary glucocorticoid metabolism, ultimately increasing clearance, and potentially decreasing the concentration of active drug in lung cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_59",
            "start": 169,
            "end": 545,
            "label": {}
        },
        {
            "ix": "2-173_v1_59@2",
            "content": "Though most of the population expresses the inactive form of CYP3A5 ( CYP3A5*3 ) <REF-13> , <REF-28> those expressing CYP3A5*1, the active form of CYP3A5 <REF-13> , would exhibit increased clearance of the drug, and therefore could account for at least some of the 30% of patients who do not respond to inhaled glucocorticoid therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_59",
            "start": 547,
            "end": 880,
            "label": {}
        },
        {
            "ix": "2-173_v1_60@0",
            "content": "In order to further support the hypothetical scenario above, the induction of CYP3A enzymes by glucocorticoids in various lung cells was studied.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_60",
            "start": 0,
            "end": 144,
            "label": {}
        },
        {
            "ix": "2-173_v1_60@1",
            "content": "CYP3A5 mRNA expression was quantified in primary lung cells, which presumably more closely model epithelial cells of the human respiratory tract and lung.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_60",
            "start": 146,
            "end": 299,
            "label": {}
        },
        {
            "ix": "2-173_v1_60@2",
            "content": "NHBE, lobar, and cells recovered from tracheal washes of mechanically ventilated children were evaluated for CYP3A enzyme expression and induction by glucocorticoids.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_60",
            "start": 301,
            "end": 466,
            "label": {}
        },
        {
            "ix": "2-173_v1_60@3",
            "content": "Results in Table 2 show that CYP3A mRNA was not expressed in cells of the conducting airways in response to glucocorticoid treatment, indicating that these epithelial cells likely do not play a role in CYP3A-dependent metabolism of glucocorticoids in the lung.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_60",
            "start": 468,
            "end": 727,
            "label": {}
        },
        {
            "ix": "2-173_v1_60@4",
            "content": "In contrast, select donor samples of SAEC cells, representing cells of the distal bronchioles, alveolar ducts, and alveoli, did express CYP3A5 ( Table 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_60",
            "start": 729,
            "end": 883,
            "label": {}
        },
        {
            "ix": "2-173_v1_60@5",
            "content": "However, there was no change in CYP3A5 mRNA when these cells were treated with glucocorticoids.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_60",
            "start": 885,
            "end": 979,
            "label": {}
        },
        {
            "ix": "2-173_v1_60@6",
            "content": "A thorough examination of potential confounding issues associated with cell culture revealed a high concentration of hydrocortisone (500 µM) in the growth media.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_60",
            "start": 981,
            "end": 1141,
            "label": {}
        },
        {
            "ix": "2-173_v1_60@7",
            "content": "Because cells were treated with only 10 µM BDP, it would stand to reason that no change in CYP3A5 mRNA would occur because CYP3A5 expression would already be maximized as a result of hydrocortisone activating the GR pathway.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_60",
            "start": 1143,
            "end": 1366,
            "label": {}
        },
        {
            "ix": "2-173_v1_61@0",
            "content": "Experiments conducted in A549 cells showed that culturing cells in 500 µM hydrocortisone increased the basal expression of CYP3A5 mRNA by 2-fold, masking the induction routinely observed using 10 µM BDP for 24 h.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_61",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "2-173_v1_61@1",
            "content": "When A549 cells were subsequently cultured in media without hydrocortisone for 48 h, providing sufficient time for a “wash out” of the hydrocortisone, the basal expression of CYP3A5 mRNA was reduced, and ~2-fold induction of CYP3A5 mRNA occurred with the 10 µM BDP, 24 h treatment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_61",
            "start": 213,
            "end": 493,
            "label": {}
        },
        {
            "ix": "2-173_v1_61@2",
            "content": "Therefore, hydrocortisone was omitted from the SAEC growth media.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_61",
            "start": 495,
            "end": 559,
            "label": {}
        },
        {
            "ix": "2-173_v1_61@3",
            "content": "Subsequent experiments in SAEC cells showed no change in CYP3A5 mRNA in response to glucocorticoid treatment ( Figure 6 ), albeit removal of hydrocortisone from the media caused a slight decrease in the basal level of CYP3A5 mRNA expression, suggesting that GR plays a role in the regulation of CYP3A5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_61",
            "start": 561,
            "end": 862,
            "label": {}
        },
        {
            "ix": "2-173_v1_61@4",
            "content": "It is feasible that because cells had been exposed to such high concentrations of hydrocortisone during their isolation and expansion, that 10 µM of BDP was not sufficient to induce CYP3A5 mRNA, even after culturing the cells in the absence of hydrocortisone for multiple division cycles.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_61",
            "start": 864,
            "end": 1151,
            "label": {}
        },
        {
            "ix": "2-173_v1_61@5",
            "content": "Therefore, the concentration of BDP was increased to 50 µM and an additional treatment group using 150 µM [M1] was added.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_61",
            "start": 1153,
            "end": 1273,
            "label": {}
        },
        {
            "ix": "2-173_v1_61@6",
            "content": "Again no increases in CYP3A5 mRNA was observed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_61",
            "start": 1275,
            "end": 1321,
            "label": {}
        },
        {
            "ix": "2-173_v1_61@7",
            "content": "Heat-inactivated and charcoal-stripped FBS were also utilized to remove potential interfering compounds from FBS, and still no change was observed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_61",
            "start": 1323,
            "end": 1469,
            "label": {}
        },
        {
            "ix": "2-173_v1_62@0",
            "content": "To our knowledge, no one has observed a change in CYP3A mRNA expression in any primary human lung cell cultures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_62",
            "start": 0,
            "end": 111,
            "label": {}
        },
        {
            "ix": "2-173_v1_62@1",
            "content": "However, Cyp3a11, 3a13, and 3a16 mRNA and protein induction have been documented in mouse lung following dexamethasone treatment <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_62",
            "start": 113,
            "end": 251,
            "label": {}
        },
        {
            "ix": "2-173_v1_62@2",
            "content": "As such, additional studies using animal models and relevant samples from human patients need to be evaluated in order to conclusively confirm or reject the hypothesis that CYP3A genes are regulated in human lung cells in response to glucocorticoid treatment since current in vitro models remain unexplainably limited in value for such studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_62",
            "start": 253,
            "end": 596,
            "label": {}
        },
        {
            "ix": "2-173_v1_63@0",
            "content": "In summary, the data presented herein demonstrate that, in A549 cells, glucocorticoid binding to the glucocorticoid receptor regulates the expression of CYP3A5, and therefore, corroborates the hypothesis that increased metabolism of glucocorticoids may occur in some patients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_63",
            "start": 0,
            "end": 275,
            "label": {}
        },
        {
            "ix": "2-173_v1_63@1",
            "content": "However, further research is needed to determine if changes in CYP3A5 expression occur in the human respiratory tissue similar to A549 cells, the precise mechanism by which this process occurs, and whether changes in the local metabolism of glucocorticoids by CYP3A5 ultimately impact glucocorticoid efficiency.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_63",
            "start": 277,
            "end": 587,
            "label": {}
        },
        {
            "ix": "2-173_v1_64@0",
            "content": "<REF-1> EPR-3. Guidelines for the Diagnosis and Management of Asthma-Summary Report 2007. J Allergy Clin Immunol. 2007 ; 120 ( 5 Suppl ): S94 – 138 . 17983880 10.1016/j.jaci.2007.09.029",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_64",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "2-173_v1_65@0",
            "content": "<REF-3> Williams SG Schmidt DK Redd SC : Key clinical activities for quality asthma care. Recommendations of the National Asthma Education and Prevention Program. MMWR Recomm Rep. 2003 ; 52 ( RR-6 ): 1 – 8 . 12696781",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_65",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "2-173_v1_66@0",
            "content": "<REF-4> Jusko WJ : Corticosteroid pharmacodynamics: models for a broad array of receptor-mediated pharmacologic effects. J Clin Pharmacol. 1990 ; 30 ( 4 ): 303 – 310 . 1971281 10.1002/j.1552-4604.1990.tb03598.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_66",
            "start": 0,
            "end": 209,
            "label": {}
        },
        {
            "ix": "2-173_v1_67@0",
            "content": "<REF-6> Mjaanes CM Whelan GJ Szefler SJ : Corticosteroid therapy in Asthma: Predictors of Responsiveness. Clin Chest Med. 2006 ; 27 ( 1 ): 119 – 132 . 16543057 10.1016/j.ccm.2005.10.005",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_67",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "2-173_v1_68@0",
            "content": "<REF-7> Wilcox JB Avery GS : Beclomethasone dipropionate corticosteroid inhaler: a preliminary report of its pharmacological properties and therapeutic efficacy in asthma. Drugs. 1973 ; 6 ( 2 ): 84 – 93 . 4753325 10.2165/00003495-197306020-00002",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_68",
            "start": 0,
            "end": 244,
            "label": {}
        },
        {
            "ix": "2-173_v1_69@0",
            "content": "<REF-8> Jonsson G Astrom A Andersson P : Budesonide is metabolized by cytochrome P450 3A (CYP3A) enzymes in human liver. Drug Metab Dispos. 1995 ; 23 ( 1 ): 137 – 142 . 7720517",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_69",
            "start": 0,
            "end": 175,
            "label": {}
        },
        {
            "ix": "2-173_v1_70@0",
            "content": "<REF-10> Moore CD Roberts JK Orton CR : Metabolic pathways of inhaled glucocorticoids by the CYP3A enzymes. Drug Metab Dispos. 2013 ; 41 ( 2 ): 379 – 389 . 23143891 10.1124/dmd.112.046318",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_70",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "2-173_v1_71@0",
            "content": "<REF-11> Roberts JK Moore CD Ward RM : Metabolism of Beclomethasone Dipropionate by Cytochrome P450 3A Enzymes. J Pharmacol Exp Ther. 2013 ; 345 ( 2 ): 308 – 316 . 23512537 10.1124/jpet.112.202556",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_71",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "2-173_v1_72@0",
            "content": "<REF-12> Leclerc J Tournel G Courcot-Ngoubo Ngangue E : Profiling gene expression of whole cytochrome P450 superfamily in human bronchial and peripheral lung tissues: Differential expression in non-small cell lung cancers. Biochimie. 2010 ; 92 ( 3 ): 292 – 306 . 20034539 10.1016/j.biochi.2009.12.007",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_72",
            "start": 0,
            "end": 299,
            "label": {}
        },
        {
            "ix": "2-173_v1_73@0",
            "content": "<REF-13> Westlind-Johnsson A Malmebo S Johansson A : Comparative analysis of CYP3A expression in human liver suggests only a minor role for CYP3A5 in drug metabolism. Drug Metab Dispos. 2003 ; 31 ( 6 ): 755 – 761 . 12756208 10.1124/dmd.31.6.755",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_73",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "2-173_v1_74@0",
            "content": "<REF-14> Hukkanen J Hakkola J Anttila S : Detection of mRNA encoding xenobiotic-metabolizing cytochrome P450s in human bronchoalveolar macrophages and peripheral blood lymphocytes. Mol Carcinogen. 1997 ; 20 ( 2 ): 224 – 230 . 9364212 10.1002/(SICI)1098-2744(199710)20:2<224::AID-MC9>3.0.CO;2-M",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_74",
            "start": 0,
            "end": 292,
            "label": {}
        },
        {
            "ix": "2-173_v1_75@0",
            "content": "<REF-15> Hukkanen J Vaisanen T Lassila A : Regulation of CYP3A5 by glucocorticoids and cigarette smoke in human lung-derived cells. J Pharmacol Exp Ther. 2003 ; 304 ( 2 ): 745 – 752 . 12538830 10.1124/jpet.102.038208",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_75",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "2-173_v1_76@0",
            "content": "<REF-16> Courcot E Leclerc J Lafitte JJ : Xenobiotic metabolism and disposition in human lung cell models: comparison with in vivo expression profiles. Drug Metab Dispos. 2012 ; 40 ( 10 ): 1953 – 1965 . 22798553 10.1124/dmd.112.046896",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_76",
            "start": 0,
            "end": 233,
            "label": {}
        },
        {
            "ix": "2-173_v1_77@0",
            "content": "<REF-17> Lacroix D Sonnier M Moncion A : Expression of CYP3A in the human liver--evidence that the shift between CYP3A7 and CYP3A4 occurs immediately after birth. Eur J Biochem. 1997 ; 247 ( 2 ): 625 – 634 . 9266706 10.1111/j.1432-1033.1997.00625.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_77",
            "start": 0,
            "end": 247,
            "label": {}
        },
        {
            "ix": "2-173_v1_78@0",
            "content": "<REF-18> Schuetz JD Beach DL Guzelian PS : Selective expression of cytochrome P450 CYP3A mRNAs in embryonic and adult human liver. Pharmacogenetics. 1994 ; 4 ( 1 ): 11 – 20 . 8004129",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_78",
            "start": 0,
            "end": 181,
            "label": {}
        },
        {
            "ix": "2-173_v1_79@0",
            "content": "<REF-19> Goodwin B Redinbo MR Kliewer SA : Regulation of cyp3a gene transcription by the pregnane x receptor. Annu Rev Pharmacol Toxicol. 2002 ; 42 : 1 – 23 . 11807162 10.1146/annurev.pharmtox.42.111901.111051",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_79",
            "start": 0,
            "end": 208,
            "label": {}
        },
        {
            "ix": "2-173_v1_80@0",
            "content": "<REF-20> Kliewer SA Goodwin B Willson TM : The nuclear pregnane X receptor: a key regulator of xenobiotic metabolism. Endocr Rev. 2002 ; 23 ( 5 ): 687 – 702 . 12372848 10.1210/er.2001-0038",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_80",
            "start": 0,
            "end": 187,
            "label": {}
        },
        {
            "ix": "2-173_v1_81@0",
            "content": "<REF-21> Raunio H Hakkola J Pelkonen O : Regulation of CYP3A genes in the human respiratory tract. Chem Biol Interact. 2005 ; 151 ( 2 ): 53 – 62 . 15698577 10.1016/j.cbi.2003.12.007",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_81",
            "start": 0,
            "end": 180,
            "label": {}
        },
        {
            "ix": "2-173_v1_82@0",
            "content": "<REF-22> Dvorak Z Pavek P : Regulation of drug-metabolizing cytochrome P450 enzymes by glucocorticoids. Drug Metab Rev. 2010 ; 42 ( 4 ): 621 – 635 . 20482443 10.3109/03602532.2010.484462",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_82",
            "start": 0,
            "end": 185,
            "label": {}
        },
        {
            "ix": "2-173_v1_83@0",
            "content": "<REF-23> Urquhart BL Tirona RG Kim RB : Nuclear receptors and the regulation of drug-metabolizing enzymes and drug transporters: implications for interindividual variability in response to drugs. J Clin Pharmacol. 2007 ; 47 ( 5 ): 566 – 578 . 17442683 10.1177/0091270007299930",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_83",
            "start": 0,
            "end": 275,
            "label": {}
        },
        {
            "ix": "2-173_v1_84@0",
            "content": "<REF-24> Schuetz JD Schuetz EG Thottassery JV : Identification of a novel dexamethasone responsive enhancer in the human CYP3A5 gene and its activation in human and rat liver cells. Mol Pharmacol. 1996 ; 49 ( 1 ): 63 – 72 . 8569713",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_84",
            "start": 0,
            "end": 230,
            "label": {}
        },
        {
            "ix": "2-173_v1_85@0",
            "content": "<REF-25> Duret C Daujat-Chavanieu M Pascussi JM : Ketoconazole and miconazole are antagonists of the human glucocorticoid receptor: consequences on the expression and function of the constitutive androstane receptor and the pregnane X receptor. Mol Pharmacol. 2006 ; 70 ( 1 ): 329 – 339 . 16608920 10.1124/mol.105.022046",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_85",
            "start": 0,
            "end": 319,
            "label": {}
        },
        {
            "ix": "2-173_v1_86@0",
            "content": "<REF-26> Katome T Obata T Matsushima R : Use of RNA interference-mediated gene silencing and adenoviral overexpression to elucidate the roles of AKT/protein kinase B isoforms in insulin actions. J Biol Chem. 2003 ; 278 ( 30 ): 28312 – 28323 . 12734182 10.1074/jbc.M302094200",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_86",
            "start": 0,
            "end": 273,
            "label": {}
        },
        {
            "ix": "2-173_v1_87@0",
            "content": "<REF-27> DeKeyser JG Laurenzana EM Peterson EC : Selective phthalate activation of naturally occurring human constitutive androstane receptor splice variants and the pregnane X receptor. Toxicol Sci. 2011 ; 120 ( 2 ): 381 – 391 . 21227907 10.1093/toxsci/kfq394 3107492",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_87",
            "start": 0,
            "end": 267,
            "label": {}
        },
        {
            "ix": "2-173_v1_88@0",
            "content": "<REF-28> Kuehl P Zhang J Lin Y : Sequence diversity in CYP3A promoters and characterization of the genetic basis of polymorphic CYP3A5 expression. Nat Genet. 2001 ; 27 ( 4 ): 383 – 391 . 11279519 10.1038/86882",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_88",
            "start": 0,
            "end": 208,
            "label": {}
        },
        {
            "ix": "2-173_v1_89@0",
            "content": "<REF-29> Haag M Fautrel A Guillouzo A : Expression of cytochromes P450 3A in mouse lung: effects of dexamethasone and pregnenolone 16alpha-carbonitrile. Arch Toxicol. 2003 ; 77 ( 3 ): 145 – 149 . 12632254",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-173_v1_89",
            "start": 0,
            "end": 203,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "2-173_v1_0",
            "tgt_ix": "2-173_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_1",
            "tgt_ix": "2-173_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_0",
            "tgt_ix": "2-173_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_3",
            "tgt_ix": "2-173_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_3",
            "tgt_ix": "2-173_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_5",
            "tgt_ix": "2-173_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_3",
            "tgt_ix": "2-173_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_3",
            "tgt_ix": "2-173_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_3",
            "tgt_ix": "2-173_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_9",
            "tgt_ix": "2-173_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_3",
            "tgt_ix": "2-173_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_0",
            "tgt_ix": "2-173_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_12",
            "tgt_ix": "2-173_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_13",
            "tgt_ix": "2-173_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_12",
            "tgt_ix": "2-173_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_15",
            "tgt_ix": "2-173_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_12",
            "tgt_ix": "2-173_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_17",
            "tgt_ix": "2-173_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_12",
            "tgt_ix": "2-173_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_19",
            "tgt_ix": "2-173_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_12",
            "tgt_ix": "2-173_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_21",
            "tgt_ix": "2-173_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_21",
            "tgt_ix": "2-173_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_23",
            "tgt_ix": "2-173_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_12",
            "tgt_ix": "2-173_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_25",
            "tgt_ix": "2-173_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_12",
            "tgt_ix": "2-173_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_27",
            "tgt_ix": "2-173_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_0",
            "tgt_ix": "2-173_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_29",
            "tgt_ix": "2-173_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_30",
            "tgt_ix": "2-173_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_30",
            "tgt_ix": "2-173_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_32",
            "tgt_ix": "2-173_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_29",
            "tgt_ix": "2-173_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_34",
            "tgt_ix": "2-173_v1_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_29",
            "tgt_ix": "2-173_v1_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_36",
            "tgt_ix": "2-173_v1_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_36",
            "tgt_ix": "2-173_v1_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_38",
            "tgt_ix": "2-173_v1_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_29",
            "tgt_ix": "2-173_v1_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_40",
            "tgt_ix": "2-173_v1_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_40",
            "tgt_ix": "2-173_v1_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_42",
            "tgt_ix": "2-173_v1_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_29",
            "tgt_ix": "2-173_v1_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_44",
            "tgt_ix": "2-173_v1_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_44",
            "tgt_ix": "2-173_v1_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_46",
            "tgt_ix": "2-173_v1_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_29",
            "tgt_ix": "2-173_v1_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_48",
            "tgt_ix": "2-173_v1_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_29",
            "tgt_ix": "2-173_v1_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_50",
            "tgt_ix": "2-173_v1_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_50",
            "tgt_ix": "2-173_v1_52",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_52",
            "tgt_ix": "2-173_v1_53",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_50",
            "tgt_ix": "2-173_v1_54",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_54",
            "tgt_ix": "2-173_v1_55",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_0",
            "tgt_ix": "2-173_v1_56",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_56",
            "tgt_ix": "2-173_v1_57",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_56",
            "tgt_ix": "2-173_v1_58",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_56",
            "tgt_ix": "2-173_v1_59",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_56",
            "tgt_ix": "2-173_v1_60",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_56",
            "tgt_ix": "2-173_v1_61",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_56",
            "tgt_ix": "2-173_v1_62",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_56",
            "tgt_ix": "2-173_v1_63",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_0",
            "tgt_ix": "2-173_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_1",
            "tgt_ix": "2-173_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_3",
            "tgt_ix": "2-173_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_5",
            "tgt_ix": "2-173_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_6",
            "tgt_ix": "2-173_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_9",
            "tgt_ix": "2-173_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_10",
            "tgt_ix": "2-173_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_11",
            "tgt_ix": "2-173_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_12",
            "tgt_ix": "2-173_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_13",
            "tgt_ix": "2-173_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_14",
            "tgt_ix": "2-173_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_15",
            "tgt_ix": "2-173_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_17",
            "tgt_ix": "2-173_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_19",
            "tgt_ix": "2-173_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_20",
            "tgt_ix": "2-173_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_21",
            "tgt_ix": "2-173_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_23",
            "tgt_ix": "2-173_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_24",
            "tgt_ix": "2-173_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_25",
            "tgt_ix": "2-173_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_26",
            "tgt_ix": "2-173_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_27",
            "tgt_ix": "2-173_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_28",
            "tgt_ix": "2-173_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_29",
            "tgt_ix": "2-173_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_30",
            "tgt_ix": "2-173_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_31",
            "tgt_ix": "2-173_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_32",
            "tgt_ix": "2-173_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_33",
            "tgt_ix": "2-173_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_34",
            "tgt_ix": "2-173_v1_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_35",
            "tgt_ix": "2-173_v1_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_36",
            "tgt_ix": "2-173_v1_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_37",
            "tgt_ix": "2-173_v1_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_38",
            "tgt_ix": "2-173_v1_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_39",
            "tgt_ix": "2-173_v1_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_40",
            "tgt_ix": "2-173_v1_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_41",
            "tgt_ix": "2-173_v1_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_42",
            "tgt_ix": "2-173_v1_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_43",
            "tgt_ix": "2-173_v1_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_44",
            "tgt_ix": "2-173_v1_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_45",
            "tgt_ix": "2-173_v1_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_46",
            "tgt_ix": "2-173_v1_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_47",
            "tgt_ix": "2-173_v1_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_48",
            "tgt_ix": "2-173_v1_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_49",
            "tgt_ix": "2-173_v1_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_50",
            "tgt_ix": "2-173_v1_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_52",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_52",
            "tgt_ix": "2-173_v1_53",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_53",
            "tgt_ix": "2-173_v1_54",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_54",
            "tgt_ix": "2-173_v1_55",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_55",
            "tgt_ix": "2-173_v1_56",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_56",
            "tgt_ix": "2-173_v1_57",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_57",
            "tgt_ix": "2-173_v1_58",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_58",
            "tgt_ix": "2-173_v1_59",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_59",
            "tgt_ix": "2-173_v1_60",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_60",
            "tgt_ix": "2-173_v1_61",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_61",
            "tgt_ix": "2-173_v1_62",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_62",
            "tgt_ix": "2-173_v1_63",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_57",
            "tgt_ix": "2-173_v1_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_26",
            "tgt_ix": "2-173_v1_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_59",
            "tgt_ix": "2-173_v1_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_62",
            "tgt_ix": "2-173_v1_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_6",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_10",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_24",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_31",
            "tgt_ix": "2-173_v1_33",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_37",
            "tgt_ix": "2-173_v1_39",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_41",
            "tgt_ix": "2-173_v1_43",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_45",
            "tgt_ix": "2-173_v1_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-173_v1_0",
            "tgt_ix": "2-173_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_1",
            "tgt_ix": "2-173_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_2",
            "tgt_ix": "2-173_v1_2@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_3",
            "tgt_ix": "2-173_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_4",
            "tgt_ix": "2-173_v1_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_5",
            "tgt_ix": "2-173_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_7",
            "tgt_ix": "2-173_v1_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_8@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_8@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_8",
            "tgt_ix": "2-173_v1_8@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_9",
            "tgt_ix": "2-173_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_11",
            "tgt_ix": "2-173_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_11",
            "tgt_ix": "2-173_v1_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_11",
            "tgt_ix": "2-173_v1_11@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_12",
            "tgt_ix": "2-173_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_13",
            "tgt_ix": "2-173_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_14",
            "tgt_ix": "2-173_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_14",
            "tgt_ix": "2-173_v1_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_15",
            "tgt_ix": "2-173_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_16",
            "tgt_ix": "2-173_v1_16@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_17",
            "tgt_ix": "2-173_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_18",
            "tgt_ix": "2-173_v1_18@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_19",
            "tgt_ix": "2-173_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_20",
            "tgt_ix": "2-173_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_20",
            "tgt_ix": "2-173_v1_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_20",
            "tgt_ix": "2-173_v1_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_21",
            "tgt_ix": "2-173_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_22@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_22@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_22@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_22",
            "tgt_ix": "2-173_v1_22@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_23",
            "tgt_ix": "2-173_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_25",
            "tgt_ix": "2-173_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_26",
            "tgt_ix": "2-173_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_26",
            "tgt_ix": "2-173_v1_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_26",
            "tgt_ix": "2-173_v1_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_26",
            "tgt_ix": "2-173_v1_26@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_26",
            "tgt_ix": "2-173_v1_26@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_27",
            "tgt_ix": "2-173_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_28",
            "tgt_ix": "2-173_v1_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_28",
            "tgt_ix": "2-173_v1_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_28",
            "tgt_ix": "2-173_v1_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_29",
            "tgt_ix": "2-173_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_30",
            "tgt_ix": "2-173_v1_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_31",
            "tgt_ix": "2-173_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_31",
            "tgt_ix": "2-173_v1_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_31",
            "tgt_ix": "2-173_v1_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_31",
            "tgt_ix": "2-173_v1_31@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_31",
            "tgt_ix": "2-173_v1_31@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_31",
            "tgt_ix": "2-173_v1_31@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_31",
            "tgt_ix": "2-173_v1_31@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_31",
            "tgt_ix": "2-173_v1_31@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_32",
            "tgt_ix": "2-173_v1_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_34",
            "tgt_ix": "2-173_v1_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_35",
            "tgt_ix": "2-173_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_35",
            "tgt_ix": "2-173_v1_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_36",
            "tgt_ix": "2-173_v1_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_37",
            "tgt_ix": "2-173_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_37",
            "tgt_ix": "2-173_v1_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_38",
            "tgt_ix": "2-173_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_40",
            "tgt_ix": "2-173_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_41",
            "tgt_ix": "2-173_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_41",
            "tgt_ix": "2-173_v1_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_41",
            "tgt_ix": "2-173_v1_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_41",
            "tgt_ix": "2-173_v1_41@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_41",
            "tgt_ix": "2-173_v1_41@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_41",
            "tgt_ix": "2-173_v1_41@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_42",
            "tgt_ix": "2-173_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_44",
            "tgt_ix": "2-173_v1_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_45",
            "tgt_ix": "2-173_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_45",
            "tgt_ix": "2-173_v1_45@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_45",
            "tgt_ix": "2-173_v1_45@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_45",
            "tgt_ix": "2-173_v1_45@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_45",
            "tgt_ix": "2-173_v1_45@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_46",
            "tgt_ix": "2-173_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_48",
            "tgt_ix": "2-173_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_49",
            "tgt_ix": "2-173_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_50",
            "tgt_ix": "2-173_v1_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_51@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_51@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_51@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_51@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_51@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_51@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_51@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_51",
            "tgt_ix": "2-173_v1_51@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_52",
            "tgt_ix": "2-173_v1_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_54",
            "tgt_ix": "2-173_v1_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_56",
            "tgt_ix": "2-173_v1_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_57",
            "tgt_ix": "2-173_v1_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_57",
            "tgt_ix": "2-173_v1_57@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_57",
            "tgt_ix": "2-173_v1_57@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_57",
            "tgt_ix": "2-173_v1_57@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_57",
            "tgt_ix": "2-173_v1_57@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_58",
            "tgt_ix": "2-173_v1_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_58",
            "tgt_ix": "2-173_v1_58@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_58",
            "tgt_ix": "2-173_v1_58@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_58",
            "tgt_ix": "2-173_v1_58@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_58",
            "tgt_ix": "2-173_v1_58@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_58",
            "tgt_ix": "2-173_v1_58@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_58",
            "tgt_ix": "2-173_v1_58@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_59",
            "tgt_ix": "2-173_v1_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_59",
            "tgt_ix": "2-173_v1_59@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_59",
            "tgt_ix": "2-173_v1_59@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_60",
            "tgt_ix": "2-173_v1_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_60",
            "tgt_ix": "2-173_v1_60@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_60",
            "tgt_ix": "2-173_v1_60@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_60",
            "tgt_ix": "2-173_v1_60@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_60",
            "tgt_ix": "2-173_v1_60@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_60",
            "tgt_ix": "2-173_v1_60@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_60",
            "tgt_ix": "2-173_v1_60@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_60",
            "tgt_ix": "2-173_v1_60@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_61",
            "tgt_ix": "2-173_v1_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_61",
            "tgt_ix": "2-173_v1_61@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_61",
            "tgt_ix": "2-173_v1_61@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_61",
            "tgt_ix": "2-173_v1_61@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_61",
            "tgt_ix": "2-173_v1_61@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_61",
            "tgt_ix": "2-173_v1_61@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_61",
            "tgt_ix": "2-173_v1_61@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_61",
            "tgt_ix": "2-173_v1_61@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_62",
            "tgt_ix": "2-173_v1_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_62",
            "tgt_ix": "2-173_v1_62@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_62",
            "tgt_ix": "2-173_v1_62@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_63",
            "tgt_ix": "2-173_v1_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_63",
            "tgt_ix": "2-173_v1_63@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_64",
            "tgt_ix": "2-173_v1_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_65",
            "tgt_ix": "2-173_v1_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_66",
            "tgt_ix": "2-173_v1_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_67",
            "tgt_ix": "2-173_v1_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_68",
            "tgt_ix": "2-173_v1_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_69",
            "tgt_ix": "2-173_v1_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_70",
            "tgt_ix": "2-173_v1_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_71",
            "tgt_ix": "2-173_v1_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_72",
            "tgt_ix": "2-173_v1_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_73",
            "tgt_ix": "2-173_v1_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_74",
            "tgt_ix": "2-173_v1_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_75",
            "tgt_ix": "2-173_v1_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_76",
            "tgt_ix": "2-173_v1_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_77",
            "tgt_ix": "2-173_v1_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_78",
            "tgt_ix": "2-173_v1_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_79",
            "tgt_ix": "2-173_v1_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_80",
            "tgt_ix": "2-173_v1_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_81",
            "tgt_ix": "2-173_v1_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_82",
            "tgt_ix": "2-173_v1_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_83",
            "tgt_ix": "2-173_v1_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_84",
            "tgt_ix": "2-173_v1_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_85",
            "tgt_ix": "2-173_v1_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_86",
            "tgt_ix": "2-173_v1_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_87",
            "tgt_ix": "2-173_v1_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_88",
            "tgt_ix": "2-173_v1_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-173_v1_89",
            "tgt_ix": "2-173_v1_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "2-173_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.2-173.v1",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/3.0/",
        "title": "Regulation of CYP3A genes by glucocorticoids in human lung cells",
        "abstract": "Inhaled glucocorticoids are the first-line treatment for patients with persistent asthma. However, approximately thirty percent of patients exhibit glucocorticoid insensitivity, which may involve excess metabolic clearance of the glucocorticoids by CYP3A enzymes in the lung. CYP3A4, 3A5, and 3A7 enzymes metabolize glucocorticoids, which in turn induce CYP3A genes. However, the mechanism of CYP3A5 mRNA regulation by glucocorticoids in lung cells has not been determined. In hepatocytes, glucocorticoids bind to the glucocorticoid receptor (GR), which induces the expression of the constitutive androstane receptor or pregnane X receptor; both of which bind to the retinoid X receptor alpha, leading to the induction of CYP3A4, 3A5, and 3A7. There is also evidence to suggest a direct induction of CYP3A5 by GR activation in liver cells. In this study, these pathways were evaluated as the mechanism for CYP3A5 mRNA induction by glucocorticoids in freshly isolated primary tracheal epithelial, adenocarcinomic human alveolar basal epithelial (A549), immortalized bronchial epithelial (BEAS-2B), primary normal human bronchial/tracheal epithelial (NHBE), primary small airway epithelial (SAEC), and primary lobar epithelial lung cells. In A549 cells, beclomethasone 17-monopropionate ([M1]) induced CYP3A5 mRNA through the glucocorticoid receptor. CYP3A5 mRNA induction by five different glucocorticoids was attenuated by inhibiting the glucocorticoid receptor using ketoconazole, and for beclomethasone dipropionate, using siRNA-mediated knock-down of the glucocorticoid receptor. The constitutive androstane receptor was not expressed in lung cells. SAEC cells, a primary lung cell line, expressed CYP3A5, but CYP3A5 mRNA was not induced by glucocorticoid treatment despite evaluating a multitude of cell culture conditions. None of the other lung cells expressed CYP3A4, 3A5 or 3A7 mRNA. These studies demonstrate that CYP3A5 mRNA is induced by glucocorticoids in A549 cells via the glucocorticoid receptor, but that additional undefined regulatory processes exist in primary lung cells.",
        "contributors": [
            {
                "surname": "Roberts",
                "given-names": "Jessica K"
            },
            {
                "surname": "Moore",
                "given-names": "Chad D"
            },
            {
                "surname": "Romero",
                "given-names": "Erin G"
            },
            {
                "surname": "Ward",
                "given-names": "Robert M"
            },
            {
                "surname": "Yost",
                "given-names": "Garold S"
            },
            {
                "surname": "Reilly",
                "given-names": "Christopher A"
            }
        ],
        "url": "https://f1000research.com/articles/2-173/v1/",
        "doc_id": "2-173",
        "version": 1,
        "ix_counter": 377,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}