{
    "nodes": [
        {
            "ix": "5-1005_v2_0",
            "content": "Identification of selective inhibitors of RET and comparison with current clinical candidates through development and validation of a robust screening cascade",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_2",
            "content": "RET (REarranged during Transfection) is a receptor tyrosine kinase, which plays pivotal roles in regulating cell survival, differentiation, proliferation, migration and chemotaxis. Activation of RET is a mechanism of oncogenesis in medullary thyroid carcinomas where both germline and sporadic activating somatic mutations are prevalent.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_3",
            "content": "At present, there are no known specific RET inhibitors in clinical development, although many potent inhibitors of RET have been opportunistically identified through selectivity profiling of compounds initially designed to target other tyrosine kinases. Vandetanib and cabozantinib, both multi-kinase inhibitors with RET activity, are approved for use in medullary thyroid carcinoma, but additional pharmacological activities, most notably inhibition of vascular endothelial growth factor - VEGFR2 (KDR), lead to dose-limiting toxicity. The recent identification of RET fusions present in ~1% of lung adenocarcinoma patients has renewed interest in the identification and development of more selective RET inhibitors lacking the toxicities associated with the current treatments.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_4",
            "content": "In an earlier publication [Newton et al , 2016; 1] we reported the discovery of a series of 2-substituted phenol quinazolines as potent and selective RET kinase inhibitors. Here we describe the development of the robust screening cascade which allowed the identification and advancement of this chemical series. Furthermore we have profiled a panel of RET-active clinical compounds both to validate the cascade and to confirm that none display a RET-selective target profile.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_5",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_6",
            "content": "RET is a receptor tyrosine kinase (TK) expressed primarily on derived neural crest and urogenital cells during embryonic development. It is required for maturation of several cell lineages of the peripheral nervous system, kidney morphogenesis and spermatogenesis <REF-2> . The glial derived neurotrophic factor (GDNF) family of ligands bind RET in association with one of four glycosyl phosphatidylinositol (GPI) anchored GDNF family α-receptors (GFRα), triggering RET dimerization, followed by auto-phosphorylation of specific tyrosine residues within the C-terminal chain and trans-phosphorylation of intracellular signalling cascades. These downstream signalling networks play a key role in regulating cell survival, differentiation, proliferation, migration and chemotaxis <REF-3> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_7",
            "content": "Activating mutations in RET ( e.g. C634W and M918T) have been identified in familial and sporadic forms of medullary thyroid carcinomas (MTC <REF-4> , <REF-5> ) and are associated with aggressive disease progression <REF-6> . More recently, several groups independently identified RET rearrangements in 1–2% of lung adenocarcinoma (LAD) cases <REF-7> – <REF-10> . The RET fusion genes discovered in these studies include CCDC6-RET (already known as RET/PTC1 in papillary thyroid carcinoma) as well as a novel fusion with KIF5B (kinesin family member 5B), encoding a coiled coil domain, generated by pericentric inversion in chromosome 10. The coiled-coil domains present in the fusion partner promote overexpression and ligand-independent dimerization leading to constitutive activation of RET. These studies also demonstrated that the resulting fusion proteins are oncogenic, and that their inhibition has therapeutic potential. Importantly, the RET fusions are mutually exclusive with other known drivers in LAD (e.g. KRAS, epidermal growth factor receptor (EGFR), EML4-anaplastic lymphoma kinase (ALK)), further supporting a role for RET as a unique driver of malignancy in these tumors. RET-positive patients represent a well-defined population with specific features: all are adenocarcinomas, and patients tend to be non-smokers and to be younger than the median age for lung cancer patients <REF-11> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_8",
            "content": "At present, there are no known specific RET inhibitors in clinical development, although many potent inhibitors of RET have been opportunistically identified through selectivity profiling of compounds initially designed to target other TKs. The small molecule inhibitors vandetanib and cabozantinib are perhaps the best examples of such compounds. Although both have been approved for the treatment of advanced metastatic MTC <REF-12> , <REF-13> , RET inhibition is a secondary pharmacology of these drugs, which were initially developed as inhibitors of other TKs. Both agents target KDR, whilst vandetanib has additional activity versus EGFR and cabozantinib versus MET. These compounds are now under investigation for the treatment of RET fusion positive LAD. A preliminary report of a phase II trial <REF-14> of cabozantinib confirmed partial responses in two of three RET-positive patients <REF-11> ; the third patient presented with prolonged stable disease. The activity of vandetanib in RET fusion positive patients has been demonstrated in two case reports <REF-15> . However significant toxicity ( e.g. rash, diarrhoea, hypertension) resulting from inhibition of other kinases, particularly KDR, has led to dose reductions in clinical trials (11–13) and is likely to compromise the use of both these agents in clinical settings <REF-16> . Thus, there is a clear need for selective RET inhibitors which do not display the toxicities associated with the current treatments and enable more potent and sustained inhibition of RET signalling. These agents may offer greater clinical benefit for patients with RET mutant cancers and widen the scope for the clinical use of RET inhibitors <REF-17> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_9",
            "content": "The role of RET in this subset of LAD has heightened interest in re-purposing a number of other clinically approved inhibitors, shown to have RET activity in pre-clinical studies. Sunitinib, sorafenib, ponatinib and lenvatinib, all multi-kinase TK inhibitors with some RET activity, are currently under investigation in numerous phase II clinical trials <REF-14> for treatment of RET fusion positive LAD <REF-18> . Sunitinib, already approved for the treatment of imatinib-resistant gastrointestinal stromal tumors (GIST), advanced renal carcinoma and advanced pancreatic neuroendocrine tumors, is the subject of a phase II study in certain types of LAD tumors, including those harbouring a RET fusion. Sorafenib, also approved for several indications including kidney and liver cancer, has demonstrated preclinical activity in RET models but has yet to be tested in patients selected based on RET fusion status. Some efficacy in advanced MTC has been reported for lenvatinib <REF-19> , however tumor response did not correlate with RET mutation status and the observed toxicity profile was consistent with KDR inhibition. A phase II study of lenvatinib in RET fusion positive LAD is ongoing <REF-14> . Ponatinib is also a multi-targeted, broad-spectrum tyrosine kinase inhibitor <REF-20> , approved in late 2012 for patients with resistant or intolerant chronic myeloid leukemia and Philadelphia chromosome-positive acute lymphoblastic leukemia. Ponatinib was withdrawn shortly afterwards due to serious safety concerns but was later returned to the market with additional warnings in the product information. An investigational phase II clinical trial of ponatinib in LAD patients selected based on RET mutation status is currently ongoing <REF-14> . Alectinib is a highly selective ALK inhibitor (median inhibitory concentration of 1.9 nM for ALK activity), recently approved by the FDA for the treatment of patients with ALK positive LAD who progressed on crizotinib. Preclinical data demonstrating activity of alectinib in RET mouse models <REF-21> has led to its investigation as a treatment for RET fusion positive LAD as part of the DARWIN II trial <REF-14> . The compounds described above are all classic TK inhibitors but in 2010, Alfano et al. <REF-22> proposed an alternative approach for targeting RET in LAD involving inhibition of HSP90 (heat shock protein 90kDa). HSP90 is a molecular chaperone that plays a central role in regulating the correct folding, stability and function of numerous proteins <REF-23> . Inhibition of HSP90 activity results in aggregation or proteasomal degradation of these proteins. RET, along with other driver kinases such as EGFR and ALK is a HSP90 client protein and as such requires HSP90 for protein stability and function. Thus, targeting the chaperone function of HSP90 offers an alternative to direct kinase inhibition for therapeutic intervention in RET driven cancer. Clinical evaluation of this approach is currently being assessed as part of a larger study in stage IV LAD patients with driver molecular alterations other than EGFR mutations <REF-14> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_10",
            "content": "In an earlier publication <REF-1> we reported the discovery of 2-substituted phenol quinazolines as potent RET kinase inhibitors with improved KDR selectivity; here we describe development of the robust screening cascade which allowed us to achieve that goal and additionally profile existing clinical compounds with RET activity in order to assess them against our compound target profile.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_11",
            "content": "Materials and methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "materials | methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_12",
            "content": "Material",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "sec-type": "materials",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_13",
            "content": "Clinical compounds were purchased from SelleckChem. Paterson Drug Discovery (PDD) compounds were synthesised in-house by methods described in an earlier publication <REF-1> . All compounds were dissolved at 20mM in dimethyl sulfoxide (DMSO, Sigma) and stored at -20°C or in a desiccator at room temperature.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_14",
            "content": "Biochemical kinase assays",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_15",
            "content": "RET and KDR kinase activities were measured according to methods previously described using the HTRF kinEASE kit (CisBio) <REF-1> . For measurement of mutant RET (M918T; Carna Bioscience), the following modifications were made: 50pM RET (M918T), 9µM ATP and 1µM substrate. For the slow binding studies, the standard kinase assay procedure was used but with varying time of compound pre-incubation with RET prior to the addition of ATP. Reversibility of binding was determined by measuring the recovery of enzymatic activity after a rapid and large dilution of the enzyme-inhibitor complex. RET enzyme was incubated at 100 fold the concentration normally required for the standard screening assay, with a concentration of inhibitor equivalent to 10 fold the IC 50 . After 15 minutes of incubation, this mixture was diluted 100 fold in the reaction buffer containing the enzyme substrates to start the reaction. This diluted the enzyme to the standard assay concentration and the compound from 10 fold to 0.1 fold of the IC 50 concentration. Theoretically, following this 100-fold dilution of the pre-incubation mixture, 91% enzyme activity will be recovered for a fully reversible inhibitor. However, taking into account assay variability, compounds showing >75% enzymatic activity recovery compared to the no inhibitor positive control were classed as fully reversible, those with <75% but where recovery of some activity was clearly detected were classed as slowly reversible (i.e. would eventually reach >75% recovery of activity). To test whether compounds were ATP competitive, assays were performed under standard conditions with 9µM ATP (Km), and then repeated at 450µM ATP (50× Km). By increasing the amount of ATP in the reaction by 50 fold, the IC 50 value should increase for competitive compounds, theoretically by a ratio of 25. For non-competitive compounds the ratio should be 0.5.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_16",
            "content": "Cell culture",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_17",
            "content": "MZ-CRC-1 (gift from Alexander Knuth, University of Zurich) LC-2/ad (RIKEN) and HEK293 (ATCC) cells were cultured in advanced DMEM/F12 media (Invitrogen), supplemented with 5% fetal bovine serum (FBS, Invitrogen) and 2mM Glutamax (Invitrogen) and incubated at 37°C in 5% CO 2 /air. The BaF3 cell lines, expressing KIF5B-RET (gift from Pasi Janne <REF-10> ) and KDR (Advanced Cellular Dynamics, San Diego) were maintained in RPMI-1640 (Invitrogen) media containing 10% Hyclone FBS (Scientific Laboratory Supplies) with the addition of 1µg/mL puromycin (Sigma) for the KDR cell line. Non-modified BaF3 cells (WT; DSMZ, Germany) were maintained in RPMI-1640 media (Invitrogen) containing 10% FBS (Invitrogen) and supplemented with 10 ng/mL recombinant mouse IL-3 (R&D systems).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_18",
            "content": "Cell POM (proof of mechanism) assay",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_19",
            "content": "The RET proof of mechanism assay (POM) assay measures the compound effect on the target. Active forms of RET and KDR are phosphorylated and thus compound inhibitory activity may be measured directly by quantifying levels of the phosphoproteins, pRET and pKDR, remaining after cell treatment. MZ-CRC-1 cells harbour the M918T mutation and thus express constitutively high levels of pRET and although pKDR is barely detectable it is possible to increase expression with ligand stimulation thus allowing measurement of RET and KDR inactivation within the same cell lysate. MZ-CRC-1 cells were seeded into 96-well plates at 100,000 cells per well in 100µL culture medium. After 24 hours, medium was replaced with 100µl of serum-free medium and cells were incubated overnight. Compounds were dispensed into the appropriate wells using an acoustic liquid handling platform (LABCYTE). Cells were incubated with compound for 2h, followed by vascular endothelial growth factor (human VEGF 165, R&D Systems) ligand stimulation (50ng/ml for 5 minutes at 37°C). VEGF treatment does not affect levels of pRET (data not shown). Cells were washed with 100µL ice-cold PBS and 30µL lysis buffer (Cell Signalling Technology) added. Plates were incubated at 4°C for 1 hour, resulting lysates were transferred to another 96-well plate and protein concentration determined using the Millipore Direct Detect infrared spectrometer. Levels of pRET and pKDR in the cell lysates were determined, according to the manufacturer’s instructions, using the pRET (panTyr) and pVEGFR-2 (Tyr1175) PathScan sandwich ELISA kits (Cell Signalling Technology). Compound IC 50 s were based on levels of phosphoprotein normalised to control values. Selectivity (versus KDR) was calculated by dividing KDR IC 50 value by RET IC 50 value.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_20",
            "content": "Compound effects on pRET levels in LC-2/ad cells were measured as described above except that 30,000 cells per well were plated and the ligand stimulation step was omitted; KDR protein is not detectable in this cell line and therefore it is not possible to determine compound effects on levels of pKDR.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_21",
            "content": "Cell POP (proof of principle) assay",
            "ntype": "title",
            "meta": {
                "section": "2.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_22",
            "content": "The RET proof of principle (POP) assay measures compound effects on cell proliferation in a disease relevant model. For routine screening we compared anti-proliferative effects of the compounds in the disease model, MZ-CRC-1 (RET (M918T)) versus a control, non-RET expressing cell line, HEK293. This allows us to demonstrate translation of mechanistic effects measured in the POM assay into RET-specific phenotypic effects in cells. MZ-CRC-1 and HEK293 (control, no RET expression) cells were seeded into 384 plates at 4000 and 1000 cells per well respectively in 30µL culture medium and confluence monitored at 4 hourly intervals using the IncuCyte ZOOM live cell imaging platform (Essen). After 48 hours, compounds were dispensed as described above and cells incubated until confluence of control cells reached 80–90%. Compound IC 50 s were calculated based on cell confluency at this time point normalised to control values. Non-specific toxicity margin was calculated by dividing IC 50 value obtained for the HEK293 control cells by that for the MZ-CRC-1 cells.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_23",
            "content": "The POP assay has also been used to measure compound effects in other disease relevant cell lines, for example, LC-2/ad, an LAD cell line harbouring the CCDC6-RET fusion. LC-2/ad cells were seeded into 96 well plates at 4000 cells per well in 100µL serum free culture medium and incubated at 37°C in 5% CO 2 . After 48 hours compounds were diluted to 2x final concentration and added to appropriate wells in 100µL serum-free culture medium. Once control cells had reached 80–90% confluence, protein content was measured using the sulforhodamine B (SRB) assay <REF-24> . Compound IC 50 s were based on protein content (proportional to cell number) normalised to control values.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_24",
            "content": "BaF3 POM assay",
            "ntype": "title",
            "meta": {
                "section": "2.6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_25",
            "content": "This assay was performed as described previously <REF-1> . Selectivity values were calculated as described above.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_26",
            "content": "Western blotting analysis",
            "ntype": "title",
            "meta": {
                "section": "2.7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_27",
            "content": "Following compound treatment (1µM, 24 hours), MZ-CRC-1 cell lysates (50 μg) were subjected to polyacrylamide gel electrophoresis (PAGE) and semi-dry transfer to nitrocellulose membrane using the Bio-Rad Trans-Blot Turbo system and Trans-Blot Turbo transfer packs. Membranes were blocked overnight at 4°C in phosphate-buffered saline containing 0.1% Tween (PBST; Sigma) and 5% non-fat dried milk powder (marvel). Primary and secondary antibody incubations were performed at room temperature in PBST/0.5% marvel with 3× PBST washes post incubation. pRET (Santa Cruz #SC-20252-R) and total RET (Santa Cruz #sc-167) antibodies were used at 1:500 dilutions; GAPDH (Cell Signaling Technology #2118L) and secondary goat anti rabbit IgG HRP-linked (Cell Signaling Technology #7074) antibodies were used at 1:1000. Proteins were visualized by chemiluminescent detection of peroxidase activity using SuperSignal reagent (Pierce), and images were captured using the Syngene imager and GeneSys software.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_28",
            "content": "Results and discussion",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results | discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_29",
            "content": "Our aim was to develop and validate a robust screening cascade to support the identification and development of potent and selective RET inhibitors using vandetanib as the starting point <REF-1> and to assess these attributes in clinical compounds reported to have RET activity. All compounds were initially assayed biochemically for activity versus RET and KDR enzyme. Once potency and selectivity had been confirmed, and structure activity relationships (SAR) demonstrated, for a number of compounds within the anilinoquinazoline series <REF-1> , we performed further biochemical studies to investigate the mechanism of RET inhibition using selected compounds including our starting point, vandetanib ( Figure 1 ). Some inhibitors bind to, or dissociate from the target enzyme slowly, leading to time dependent inhibition <REF-25> . Failure to identify this can lead to an underestimation of biochemical potency and misleading SAR. To investigate this, compounds were assayed under standard conditions but pre-incubated with RET for between 0 and 60 minutes prior to addition of ATP. Pre-incubation did not significantly affect IC 50 values indicating that the anilinoquinazolines are not slow binders and that a 15 minutes pre-incubation, as used in our standard assay, is sufficient to allow the reaction to reach equilibrium ( Figure 1A ). Although diverse in primary amino acid sequence, the human kinases share a great degree of similarity in their 3D structures, especially in their catalytically active kinase domain where the ATP-binding pocket is located. Kinase inhibitors can be grouped into two classes, based on binding mode: irreversible and reversible. The former tend to bind covalently with a reactive nucleophilic cysteine residue proximal to the ATP-binding site, resulting in the blockage of the ATP site and irreversible inhibition. Reversible inhibitors can be further classified into four main types, competitive, non-competitive, uncompetitive and mixed inhibition <REF-26> . Our data ( Figure 1B ) indicates that the anilinoquinazolines under investigation here fall into the reversible, ATP competitive category which is not surprising since it has been demonstrated previously that vandetanib, a related compound and our starting point, exhibits this mode of binding <REF-27> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_30",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Mechanism of inhibition data. ( A ) Effect of increasing pre-incubation time (5–60 mins) on compound IC 50 value. ( B ) Table showing results of reversibility and ATP competition studies.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_31",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Mechanism of inhibition data.</title> <p>( <bold>A</bold>) Effect of increasing pre-incubation time (5&#8211;60 mins) on compound IC <sub>50</sub> value. ( <bold>B</bold>) Table showing results of reversibility and ATP competition studies.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Mechanism of inhibition data. ( A ) Effect of increasing pre-incubation time (5–60 mins) on compound IC 50 value. ( B ) Table showing results of reversibility and ATP competition studies.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_32",
            "content": "Compounds meeting defined criteria for potency and selectivity in the biochemical assay were then assessed in a cellular POM assay. Initially we developed an ELISA-based POM assay, measuring changes in levels of (active) phosphorylated RET (M918T) and KDR, within the same MTC cell line (MZ-CRC-1).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_33",
            "content": "However, it soon became apparent that compared to KDR there was a poor correlation between RET biochemical and cell-based IC 50 measurements ( Figures 2A & B ). In addition, the drop off in potency from the biochemical to cellular assay was generally much greater for RET than KDR, in effect compressing the selectivity margins, often from >100-fold in the biochemical assay to parity (or worse) in the cellular assay. Compound permeability was not believed to be the cause of the disparity as the magnitude of the drop off was not the same for both RET and KDR, despite measurement of both proteins in the same cell lysate. A previous report <REF-28> had indicated that a single mutation within the kinase domain of RET could alter compound inhibitory activity. In order to address the possibility that some of the discrepancy could be due to our measurement of WT protein activity biochemically but mutant RET (M918T) protein in the MZ-CRC-1 cells, we compared the biochemical activity of selected compounds versus both RET (WT) and RET (M918T) protein. The compound IC 50 data for the two proteins correlate well ( Figure 2C ) and therefore indicate that the mutation does not significantly affect biochemical activity for this class of compound. In order to follow this up in the cellular context we extended our repertoire of assays to enable robust measurement of RET activity in TT <REF-29> , LC-2/ad <REF-30> , <REF-31> and mouse BaF3 <REF-10> cells harbouring a C634W mutation, a CCDC6-RET fusion and a KIF5B-RET fusion respectively. We assessed relative RET potencies for a number of tool compounds (including vandetanib and cabozantinib) across these cell lines and found that activities correlated well ( Supplementary Figure 1 ), further supporting the notion that this class of compounds are equally active versus mutant and WT forms of the protein.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_34",
            "content": "In order to demonstrate POP in a disease relevant cell line, we developed and validated a proliferation endpoint assay in the MTC line MZ-CRC-1; non-specific toxicity was evaluated by measuring the same endpoint in HEK293, a human embryonic kidney line which does not express RET. Compounds exhibiting RET potency (<500nM) and selectivity (>10x) in the POM assay were selected for POP assay screening. Our data show that there is a good correlation between the POM and POP IC 50 values measured in the MZ-CRC-1 ( Figure 3A ) cells and other RET models (e.g. LC-2/ad, Supplementary Figure 2 ) indicating that the RET inhibitory activity that we observe in our POM assay translates into anti-proliferative effects in our MTC and LAD disease models. In addition, we have assayed a selection of representative compounds for anti-proliferative effects in LC-2/ad and as for the POM assay, data correlate well with that obtained in MZ-CRC-1 ( Figure 3B ). Therefore, we are confident that activities observed in our routine MZ-CRC-1 POM and POP screens are predictive for the other cell line models.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_35",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Correlation of IC 50 data: A ) RET enzyme vs RET cellular POM B ) KDR enzyme vs KDR cellular POM C ) RET enzyme WT vs RET (M918T). All data points represent the geometric mean of at least two independent measurements.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_36",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Correlation of IC <sub>50</sub> data:</title> <p> <bold>A</bold>) RET enzyme vs RET cellular POM <bold>B</bold>) KDR enzyme vs KDR cellular POM <bold>C</bold>) RET enzyme WT vs RET (M918T). All data points represent the geometric mean of at least two independent measurements.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Correlation of IC 50 data: A ) RET enzyme vs RET cellular POM B ) KDR enzyme vs KDR cellular POM C ) RET enzyme WT vs RET (M918T). All data points represent the geometric mean of at least two independent measurements.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_37",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "Correlation of cellular data: A ) POM vs POP IC 50 data in MZ-CRC-1 B ) POP vs POP IC 50 data in MZ-CRC-1 and LC-2/ad C ) POM vs POM IC 50 data in MZ-CRC-1 and KIF5B-RET (BaF3) D ) POM vs POM selectivity data in MZ-CRC-1 and KIF5B-RET (BaF3). All data points represent the geometric mean of at least two independent measurements.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_38",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <p>Correlation of cellular data: <bold>A</bold>) POM vs POP IC <sub>50</sub> data in MZ-CRC-1 <bold>B</bold>) POP vs POP IC <sub>50</sub> data in MZ-CRC-1 and LC-2/ad <bold>C</bold>) POM vs POM IC <sub>50</sub> data in MZ-CRC-1 and KIF5B-RET (BaF3) <bold>D</bold>) POM vs POM selectivity data in MZ-CRC-1 and KIF5B-RET (BaF3). All data points represent the geometric mean of at least two independent measurements.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "Correlation of cellular data: A ) POM vs POP IC 50 data in MZ-CRC-1 B ) POP vs POP IC 50 data in MZ-CRC-1 and LC-2/ad C ) POM vs POM IC 50 data in MZ-CRC-1 and KIF5B-RET (BaF3) D ) POM vs POM selectivity data in MZ-CRC-1 and KIF5B-RET (BaF3). All data points represent the geometric mean of at least two independent measurements.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_39",
            "content": "Although at this stage we were confident that we could drive our internal chemistry effort based on the cellular data, it was clear that performance in the biochemical assay was not always a good predictor of RET cellular activity and therefore should not be used as a pre-screen for this chemical series. To address this issue this we developed and validated a higher throughput POM assay allowing parallel assessment of all compounds in both cellular and biochemical assays. This BaF3 proliferation assay platform, employing cell lines dependent upon RET or KDR for survival alongside WT IL-3 dependent control cells, is robust with 4x higher throughput than the original MZ-CRC-1 POM ELISA. More importantly the proliferation IC 50 for both RET ( Figure 3C ) and KDR in the BaF3 models correlate well with those generated using the respective phosphorylation endpoint assays thus maintaining the selectivity values previously observed ( Figure 3D ). Accordingly, we introduced this as the routine POM screening assay with the option to further evaluate compound effects on phosphoprotein levels using the ELISA POM if necessary.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_40",
            "content": "Chemical optimisation of the series ultimately led to the identification of a number of potent and selective RET inhibitors ( e.g. PDD16860 and PDD16964; Table 1 ). Clinical RET compounds currently under investigation in LAD were also profiled using the screening cascade ( Table 1 ). With the possible exception of alectinib, which it was not possible to dose at the highest concentrations due to solubility issues, none of the kinase inhibitors tested met our criteria for selectivity versus KDR ( i.e . >10x). Several reports in the literature <REF-21> , <REF-32> , which we have subsequently confirmed in-house (data not shown), demonstrate that alectinib is a much better cellular inhibitor of ALK (IC 50 in H2228 cells = 10nM) than RET (IC 50 in MZ-CRC-1 cells = 80nM). Given this, along with its limited solubility and required dosing of 300–600mg bid for clinical efficacy in ALK driven LAD, therapeutic inhibition of RET is unlikely at clinically relevant doses. Although not a direct inhibitor of RET activity, we have also profiled ganetespib, a HSP90 inhibitor. Ganetespib did reduce levels of active RET, through protein degradation ( Supplementary Figure 3 ) but was not RET-selective and exhibited more toxicity (toxicity margin = 0.7x) in the control non-RET driven HEK293 cells compared to the MTC RET-driven model, MZ-CRC-1. This indicates that the pleiotropic effects of HSP90 inhibition on numerous client proteins (including KDR) is likely to elicit non-specific toxicity at therapeutically active doses. Other aspects of the screening cascade ( Figure 4 ) are already in place and as discussed in an earlier publication <REF-1> , selected compounds have been assessed in in vitro DMPK assays as part of the chemical optimisation. Furthermore, in vivo models and capabilities ( Figure 4 ) have been established and validated (data not shown) and several tool compounds are currently undergoing assessment in PK/PD and efficacy studies. To date, our robust screening workflows have proved very successful in identifying potent, selective tool compounds and will continue to support our active pursuit of clinical candidates suitable for evaluation in RET fusion positive LAD patients.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_41",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Clinical competitor and selected compound profiling data. The desired profile values indicate our target values for selectivity and toxicity margin. All values represent the geometric mean of at least four independent measurements. Figures are highlighted depending upon whether they easily (green); clearly do not (red) or almost (orange) meet the target criteria. PDD16860 and PDD16964 are examples of QZ compounds developed by screening through the cascade. 1 Solubility of alectinib is limited, maximum dose achieved=1µM. 2 Ganetespib is not a kinase inhibitor and therefore it is not possible to measure biochemical activity.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_42",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Clinical competitor and selected compound profiling data.</title> <p>The desired profile values indicate our target values for selectivity and toxicity margin. All values represent the geometric mean of at least four independent measurements. Figures are highlighted depending upon whether they easily (green); clearly do not (red) or almost (orange) meet the target criteria. PDD16860 and PDD16964 are examples of QZ compounds developed by screening through the cascade.</p> <p id=\"note-1\"> <sup>1</sup>Solubility of alectinib is limited, maximum dose achieved=1&#181;M.</p> <p id=\"note-2\"> <sup>2</sup>Ganetespib is not a kinase inhibitor and therefore it is not possible to measure biochemical activity.</p> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th/> <th align=\"center\">Desired <break/>Profile</th> <th align=\"center\">Vandetanib</th> <th align=\"center\">Cabozantinib</th> <th align=\"center\">Sorafenib</th> <th align=\"center\">Sunitinib</th> <th align=\"center\">Ponatinib</th> <th align=\"center\">Lenvatinib</th> <th align=\"center\">Alectinib</th> <th align=\"center\">Ganetespib</th> <th align=\"center\">PDD16860</th> <th align=\"center\">PDD16964</th> </tr> </thead> <tbody> <tr> <td align=\"center\"> <bold>RET</bold> <break/> <bold>Enzyme</bold> <break/> <bold>IC <sub>50</sub> </bold> </td> <td/> <td align=\"center\"> <bold>0.05</bold> </td> <td align=\"center\"> <bold>0.65</bold> </td> <td align=\"center\"> <bold>0.13</bold> </td> <td align=\"center\"> <bold>0.03</bold> </td> <td align=\"center\"> <bold>0.023</bold> </td> <td align=\"center\"> <bold>0.024</bold> </td> <td align=\"center\"> <bold>0.18</bold> </td> <td align=\"center\"> <bold> <sup> <xref ref-type=\"other\" rid=\"note-2\">2</xref> </sup>ND</bold> </td> <td align=\"center\"> <bold>0.0015</bold> </td> <td align=\"center\"> <bold>0.004</bold> </td> </tr> <tr> <td align=\"center\"> <bold>Selectivity</bold> <break/> <bold>vs. KDR</bold> </td> <td align=\"center\"> <styled-content style=\"#00B050\" style-type=\"color\"> <bold>&gt;100&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>3.6&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>0.02&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>1.0&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>0.03&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>2.0&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>0.05&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#00B050\" style-type=\"color\"> <bold>483&#215;</bold> </styled-content> </td> <td align=\"center\"> <bold> <sup> <xref ref-type=\"other\" rid=\"note-2\">2</xref> </sup>ND</bold> </td> <td align=\"center\"> <styled-content style=\"#00B050\" style-type=\"color\"> <bold>250&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#00B050\" style-type=\"color\"> <bold>282x</bold> </styled-content> </td> </tr> <tr> <td align=\"center\"> <bold>RET Cell</bold> <break/> <bold>IC <sub>50</sub> </bold> </td> <td/> <td align=\"center\"> <bold>0.4</bold> </td> <td align=\"center\"> <bold>0.19</bold> </td> <td align=\"center\"> <bold>0.17</bold> </td> <td align=\"center\"> <bold>0.29</bold> </td> <td align=\"center\"> <bold>0.024</bold> </td> <td align=\"center\"> <bold>0.093</bold> </td> <td align=\"center\"> <bold>0.26</bold> </td> <td align=\"center\"> <bold>0.0039</bold> </td> <td align=\"center\"> <bold>0.12</bold> </td> <td align=\"center\"> <bold>0.26</bold> </td> </tr> <tr> <td align=\"center\"> <bold>Selectivity</bold> <break/> <bold>vs. KDR</bold> </td> <td align=\"center\"> <styled-content style=\"#00B050\" style-type=\"color\"> <bold>&gt;10&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>1.6&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>0.07&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>0.11&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>0.93&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>0.2&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>0.2&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#E36C0A\" style-type=\"color\"> <bold> <sup> <xref ref-type=\"other\" rid=\"note-1\">1</xref> </sup>&gt;3.8&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>0.36&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#00B050\" style-type=\"color\"> <bold>23&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#00B050\" style-type=\"color\"> <bold>21x</bold> </styled-content> </td> </tr> <tr> <td align=\"center\"> <bold>Toxicity</bold> <break/> <bold>Margin</bold> </td> <td align=\"center\"> <styled-content style=\"#00B050\" style-type=\"color\"> <bold>&gt;&gt;10&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#E36C0A\" style-type=\"color\"> <bold>35&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#E36C0A\" style-type=\"color\"> <bold>54&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#E36C0A\" style-type=\"color\"> <bold>13&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#E36C0A\" style-type=\"color\"> <bold>28&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#00B050\" style-type=\"color\"> <bold>127&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#00B050\" style-type=\"color\"> <bold>141&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#E36C0A\" style-type=\"color\"> <bold> <sup> <xref ref-type=\"other\" rid=\"note-1\">1</xref> </sup>&gt;35&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#FF0000\" style-type=\"color\"> <bold>0.7&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#E36C0A\" style-type=\"color\"> <bold>19&#215;</bold> </styled-content> </td> <td align=\"center\"> <styled-content style=\"#E36C0A\" style-type=\"color\"> <bold>42x</bold> </styled-content> </td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Clinical competitor and selected compound profiling data. The desired profile values indicate our target values for selectivity and toxicity margin. All values represent the geometric mean of at least four independent measurements. Figures are highlighted depending upon whether they easily (green); clearly do not (red) or almost (orange) meet the target criteria. PDD16860 and PDD16964 are examples of QZ compounds developed by screening through the cascade. 1 Solubility of alectinib is limited, maximum dose achieved=1µM. 2 Ganetespib is not a kinase inhibitor and therefore it is not possible to measure biochemical activity.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_43",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Current screening cascade (and selection criteria) for identification and development of potent and selective (vs KDR) RET inhibitors. Arrows represent compound flow. Sol = solubility, Stab = stability, Perm = permeability, BB = Blood-binding, Cyps = Cytochrome P450s.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_44",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <title>Current screening cascade (and selection criteria) for identification and development of potent and selective (vs KDR) RET inhibitors.</title> <p>Arrows represent compound flow. Sol = solubility, Stab = stability, Perm = permeability, BB = Blood-binding, Cyps = Cytochrome P450s.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Current screening cascade (and selection criteria) for identification and development of potent and selective (vs KDR) RET inhibitors. Arrows represent compound flow. Sol = solubility, Stab = stability, Perm = permeability, BB = Blood-binding, Cyps = Cytochrome P450s.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/10203/0739d1fc-7654-4e5b-8841-f8fa98df47ab_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_45",
            "content": "Conclusions",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "conclusions",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_46",
            "content": "We have established a robust screening cascade to enable the identification and development of a clinical candidate compound demonstrating potent and selective RET activity. Furthermore we have profiled clinical compounds currently under investigation for treatment of LAD confirming that they do not meet our target profile. We are continuing our efforts to develop a clinical candidate and will report on further progress in a future publication.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_47",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS0\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/8724/407b742c-b65c-4554-8a7c-376ec6093f97_Raw_data.zip\"> <label>Datasets: selective inhibitors of RET and comparison with current clinical candidates through development and validation of a robust screening cascade</label> <caption> <p>This dataset includes all the raw data behind the figures shown in this paper. Information about each file can be found in 'Description of raw data files'.</p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_48",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_49",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2016 Watson AJ et al.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_50",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_51",
            "content": "F1000Research : Dataset 1. Datasets: selective inhibitors of RET and comparison with current clinical candidates through development and validation of a robust screening cascade, 10.5256/f1000research.8724.d122280 <REF-33>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_52",
            "content": "<REF-1> Newton R Bowler KA Burns EM : The discovery of 2-substituted phenol quinazolines as potent RET kinase inhibitors with improved KDR selectivity. Eur J Med Chem. 2016 ; 112 : 20 – 32 . 26874741 10.1016/j.ejmech.2016.01.039 4896931",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_53",
            "content": "<REF-2> Arighi E Borrello MG Sariola H : RET tyrosine kinase signaling in development and cancer. Cytokine Growth Factor Rev. 2005 ; 16 ( 4–5 ): 441 – 467 . 15982921 10.1016/j.cytogfr.2005.05.010",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_54",
            "content": "<REF-3> Santoro M Carlomagno F Melillo RM : Dysfunction of the RET receptor in human cancer. Cell Mol Life Sci. 2004 ; 61 ( 23 ): 2954 – 2964 . 15583857 10.1007/s00018-004-4276-8",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_55",
            "content": "<REF-4> Santoro M Carlomagno F : Drug insight: Small-molecule inhibitors of protein kinases in the treatment of thyroid cancer. Nat Clin Pract Endocrinol Metab. 2006 ; 2 ( 1 ): 42 – 52 . 16932252 10.1038/ncpendmet0073",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_56",
            "content": "<REF-5> Wells SA Jr Santoro M : Targeting the RET pathway in thyroid cancer. Clin Cancer Res. 2009 ; 15 ( 23 ): 7119 – 23 . 19934298 10.1158/1078-0432.CCR-08-2742",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_57",
            "content": "<REF-6> Elisei R Cosci B Romei C : Prognostic significance of somatic RET oncogene mutations in sporadic medullary thyroid cancer: a 10-year follow-up study. J Clin Endocrinol Metab. 2008 ; 93 ( 3 ): 682 – 687 . 18073307 10.1210/jc.2007-1714",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_58",
            "content": "<REF-7> Ju YS Lee WC Shin JY : A transforming KIF5B and RET gene fusion in lung adenocarcinoma revealed from whole-genome and transcriptome sequencing. Genome Res. 2012 ; 22 ( 3 ): 436 – 45 . 22194472 10.1101/gr.133645.111 3290779",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_59",
            "content": "<REF-10> Lipson D Capelletti M Yelensky R : Identification of new ALK and RET gene fusions from colorectal and lung cancer biopsies. Nat Med. 2012 ; 18 ( 3 ): 382 – 384 . 22327622 10.1038/nm.2673 3916180",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_60",
            "content": "<REF-11> Drilon A Wang L Hasanovic A : Response to Cabozantinib in patients with RET fusion-positive lung adenocarcinomas. Cancer Discov. 2013 ; 3 ( 6 ): 630 – 635 . 23533264 10.1158/2159-8290.CD-13-0035 4160032",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_61",
            "content": "<REF-12> Wells SA Jr Robinson BG Gagel RF : Vandetanib in patients with locally advanced or metastatic medullary thyroid cancer: a randomized, double-blind phase III trial. J Clin Oncol. 2012 ; 30 ( 2 ): 134 – 141 . 22025146 10.1200/JCO.2011.35.5040 3675689",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_62",
            "content": "<REF-13> Elisei R Schlumberger MJ Müller SP : Cabozantinib in progressive medullary thyroid cancer. J Clin Oncol. 2013 ; 31 ( 29 ): 3639 – 3646 . 24002501 10.1200/JCO.2012.48.4659 4164813",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_63",
            "content": "<REF-14> https://clinicaltrials.gov/ (accessed February 2016).",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_64",
            "content": "<REF-15> Gautschi O Zander T Keller FA : A patient with lung adenocarcinoma and RET fusion treated with vandetanib. J Thorac Oncol. 2013 ; 8 ( 5 ): e43 – 44 . 23584301 10.1097/JTO.0b013e31828a4d07",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_65",
            "content": "<REF-16> Suguwara M Ly T Hershman JM : Medullary thyroid cancer--current treatment strategy, novel therapies and perspectives for the future. Horm Cancer. 2012 ; 3 ( 5–6 ): 218 – 226 . 23011723 10.1007/s12672-012-0119-5",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_66",
            "content": "<REF-17> Mulligan LM : RET revisited: expanding the oncogenic portfolio. Nat Rev Cancer. 2014 ; 14 ( 3 ): 173 – 186 . 24561444 10.1038/nrc3680",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_67",
            "content": "<REF-18> Song M : Progress in Discovery of KIF5B-RET Kinase Inhibitors for the Treatment of Non-Small-Cell Lung Cancer. J Med Chem. 2015 ; 58 ( 9 ): 3672 – 3681 . 25625428 10.1021/jm501464c",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_68",
            "content": "<REF-19> Schlumberger M Jarzab B Cabanillas ME : A Phase II Trial of the Multitargeted Tyrosine Kinase Inhibitor Lenvatinib (E7080) in Advanced Medullary Thyroid Cancer. Clin Cancer Res. 2016 ; 22 ( 1 ): 44 – 53 . 26311725 10.1158/1078-0432.CCR-15-1127",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_69",
            "content": "<REF-20> De Falco V Buonocore P Muthu M : Ponatinib (AP24534) is a novel potent inhibitor of oncogenic RET mutants associated with thyroid cancer. J Clin Enocrinol Metab. 2013 ; 98 ( 5 ): E811 – E819 . 23526464 10.1210/jc.2012-2672",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_70",
            "content": "<REF-21> Kodama T Tsukaguchi T Satoh Y : Alectinib shows potent antitumor activity against RET -rearranged non-small cell lung cancer. Mol Cancer Ther. 2014 ; 13 ( 12 ): 2910 – 2918 . 25349307 10.1158/1535-7163.MCT-14-0274",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_71",
            "content": "<REF-22> Alfano L Guida T Provitero L : RET is a heat shock protein 90 (HSP90) client protein and is knocked down upon HSP90 pharmacological block. J Clin Endocrinol Metab. 2010 ; 95 ( 7 ): 3552 – 3557 . 20444924 10.1210/jc.2009-2315",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_72",
            "content": "<REF-23> Taipale M Jarosz DF Lindquist S : HSP90 at the hub of protein homeostasis: emerging mechanistic insights. Nat Rev Mol Cell Biol. 2010 ; 11 ( 7 ): 515 – 528 . 20531426 10.1038/nrm2918",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_73",
            "content": "<REF-24> Vichai V Kirtikara K : Sulforhodamine B colorimetric assay for cytotoxicity screening. Nat Protoc. 2006 ; 1 ( 3 ): 1112 – 1116 . 17406391 10.1038/nprot.2006.179",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_74",
            "content": "<REF-25> Rudolph J Xiao Y Pardi A : Slow inhibition and conformation selective properties of extracellular signal-regulated kinase 1 and 2 inhibitors. Biochemistry. 2015 ; 54 ( 1 ): 22 – 31 . 25350931 10.1021/bi501101v 4724192",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_75",
            "content": "<REF-26> Wu P Nielsen TE Clausen MH : FDA-approved small-molecule kinase inhibitors. Trends Pharmacol Sci. 2015 ; 36 ( 7 ): 422 – 39 . 25975227 10.1016/j.tips.2015.04.005",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_76",
            "content": "<REF-27> Knowles PP Murray-Rust J Kjaer S : Structure and chemical inhibition of the RET tyrosine kinase domain. J Biol Chem. 2006 ; 281 ( 44 ): 33577 – 33587 . 16928683 10.1074/jbc.M605604200",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_77",
            "content": "<REF-28> Verbeek HH Alves MM de Groot JW : The effects of four different tyrosine kinase inhibitors on medullary and papillary thyroid cancer cells. J Clin Endocrinol Metab. 2011 ; 96 ( 6 ): E991 – 5 . 21470995 10.1210/jc.2010-2381",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_78",
            "content": "<REF-29> Carlomagno F Salvatore D Santoro M : Point mutation of the RET proto-oncogene in the TT human medullary thyroid carcinoma cell line. Biochem Biophys Res Commun. 1995 ; 207 ( 3 ): 1022 – 1028 . 7864888 10.1006/bbrc.1995.1287",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_79",
            "content": "<REF-30> Matsubara D Kanai Y Ishikawa S : Identification of CCDC6-RET fusion in the human lung adenocarcinoma cell line, LC-2/ad. J Thorac Oncol. 2012 ; 7 ( 12 ): 1872 – 1876 . 23154560 10.1097/JTO.0b013e3182721ed1",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_80",
            "content": "<REF-31> Suzuki M Makinoshima H Matsumoto S : Identification of a lung adenocarcinoma cell line with CCDC6-RET fusion gene and the effect of RET inhibitors in vitro and in vivo . Cancer Sci. 2013 ; 104 ( 7 ): 896 – 903 . 23578175 10.1111/cas.12175",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_81",
            "content": "<REF-32> Sakamoto H Tsukaguchi T Hiroshima S : CH5424802, a selective ALK inhibitor capable of blocking the resistant gatekeeper mutant. Cancer Cell. 2011 ; 19 ( 5 ): 679 – 690 . 21575866 10.1016/j.ccr.2011.04.004",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1005_v2_82",
            "content": "<REF-33> Watson AJ Hopkins GV Hitchin S : Dataset 1 in: identification of selective inhibitors of RET and comparison with current clinical candidates through development and validation of a robust screening cascade. F1000Research. 2016 . Data Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "5-1005_v2_0@0",
            "content": "Identification of selective inhibitors of RET and comparison with current clinical candidates through development and validation of a robust screening cascade",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_0",
            "start": 0,
            "end": 157,
            "label": {}
        },
        {
            "ix": "5-1005_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "5-1005_v2_2@0",
            "content": "RET (REarranged during Transfection) is a receptor tyrosine kinase, which plays pivotal roles in regulating cell survival, differentiation, proliferation, migration and chemotaxis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_2",
            "start": 0,
            "end": 179,
            "label": {}
        },
        {
            "ix": "5-1005_v2_2@1",
            "content": "Activation of RET is a mechanism of oncogenesis in medullary thyroid carcinomas where both germline and sporadic activating somatic mutations are prevalent.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_2",
            "start": 181,
            "end": 336,
            "label": {}
        },
        {
            "ix": "5-1005_v2_3@0",
            "content": "At present, there are no known specific RET inhibitors in clinical development, although many potent inhibitors of RET have been opportunistically identified through selectivity profiling of compounds initially designed to target other tyrosine kinases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_3",
            "start": 0,
            "end": 252,
            "label": {}
        },
        {
            "ix": "5-1005_v2_3@1",
            "content": "Vandetanib and cabozantinib, both multi-kinase inhibitors with RET activity, are approved for use in medullary thyroid carcinoma, but additional pharmacological activities, most notably inhibition of vascular endothelial growth factor - VEGFR2 (KDR), lead to dose-limiting toxicity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_3",
            "start": 254,
            "end": 535,
            "label": {}
        },
        {
            "ix": "5-1005_v2_3@2",
            "content": "The recent identification of RET fusions present in ~1% of lung adenocarcinoma patients has renewed interest in the identification and development of more selective RET inhibitors lacking the toxicities associated with the current treatments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_3",
            "start": 537,
            "end": 778,
            "label": {}
        },
        {
            "ix": "5-1005_v2_4@0",
            "content": "In an earlier publication [Newton et al , 2016; 1] we reported the discovery of a series of 2-substituted phenol quinazolines as potent and selective RET kinase inhibitors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_4",
            "start": 0,
            "end": 171,
            "label": {}
        },
        {
            "ix": "5-1005_v2_4@1",
            "content": "Here we describe the development of the robust screening cascade which allowed the identification and advancement of this chemical series.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_4",
            "start": 173,
            "end": 310,
            "label": {}
        },
        {
            "ix": "5-1005_v2_4@2",
            "content": "Furthermore we have profiled a panel of RET-active clinical compounds both to validate the cascade and to confirm that none display a RET-selective target profile.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_4",
            "start": 312,
            "end": 474,
            "label": {}
        },
        {
            "ix": "5-1005_v2_5@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_5",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "5-1005_v2_6@0",
            "content": "RET is a receptor tyrosine kinase (TK) expressed primarily on derived neural crest and urogenital cells during embryonic development.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_6",
            "start": 0,
            "end": 132,
            "label": {}
        },
        {
            "ix": "5-1005_v2_6@1",
            "content": "It is required for maturation of several cell lineages of the peripheral nervous system, kidney morphogenesis and spermatogenesis <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_6",
            "start": 134,
            "end": 272,
            "label": {}
        },
        {
            "ix": "5-1005_v2_6@2",
            "content": "The glial derived neurotrophic factor (GDNF) family of ligands bind RET in association with one of four glycosyl phosphatidylinositol (GPI) anchored GDNF family α-receptors (GFRα), triggering RET dimerization, followed by auto-phosphorylation of specific tyrosine residues within the C-terminal chain and trans-phosphorylation of intracellular signalling cascades.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_6",
            "start": 274,
            "end": 637,
            "label": {}
        },
        {
            "ix": "5-1005_v2_6@3",
            "content": "These downstream signalling networks play a key role in regulating cell survival, differentiation, proliferation, migration and chemotaxis <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_6",
            "start": 639,
            "end": 786,
            "label": {}
        },
        {
            "ix": "5-1005_v2_7@0",
            "content": "Activating mutations in RET ( e.g. C634W and M918T) have been identified in familial and sporadic forms of medullary thyroid carcinomas (MTC <REF-4> , <REF-5> ) and are associated with aggressive disease progression <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_7",
            "start": 0,
            "end": 224,
            "label": {}
        },
        {
            "ix": "5-1005_v2_7@1",
            "content": "More recently, several groups independently identified RET rearrangements in 1–2% of lung adenocarcinoma (LAD) cases <REF-7> – <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_7",
            "start": 226,
            "end": 362,
            "label": {}
        },
        {
            "ix": "5-1005_v2_7@2",
            "content": "The RET fusion genes discovered in these studies include CCDC6-RET (already known as RET/PTC1 in papillary thyroid carcinoma) as well as a novel fusion with KIF5B (kinesin family member 5B), encoding a coiled coil domain, generated by pericentric inversion in chromosome 10.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_7",
            "start": 364,
            "end": 637,
            "label": {}
        },
        {
            "ix": "5-1005_v2_7@3",
            "content": "The coiled-coil domains present in the fusion partner promote overexpression and ligand-independent dimerization leading to constitutive activation of RET.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_7",
            "start": 639,
            "end": 793,
            "label": {}
        },
        {
            "ix": "5-1005_v2_7@4",
            "content": "These studies also demonstrated that the resulting fusion proteins are oncogenic, and that their inhibition has therapeutic potential.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_7",
            "start": 795,
            "end": 928,
            "label": {}
        },
        {
            "ix": "5-1005_v2_7@5",
            "content": "Importantly, the RET fusions are mutually exclusive with other known drivers in LAD (e.g. KRAS, epidermal growth factor receptor (EGFR), EML4-anaplastic lymphoma kinase (ALK)), further supporting a role for RET as a unique driver of malignancy in these tumors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_7",
            "start": 930,
            "end": 1189,
            "label": {}
        },
        {
            "ix": "5-1005_v2_7@6",
            "content": "RET-positive patients represent a well-defined population with specific features: all are adenocarcinomas, and patients tend to be non-smokers and to be younger than the median age for lung cancer patients <REF-11> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_7",
            "start": 1191,
            "end": 1406,
            "label": {}
        },
        {
            "ix": "5-1005_v2_8@0",
            "content": "At present, there are no known specific RET inhibitors in clinical development, although many potent inhibitors of RET have been opportunistically identified through selectivity profiling of compounds initially designed to target other TKs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_8",
            "start": 0,
            "end": 239,
            "label": {}
        },
        {
            "ix": "5-1005_v2_8@1",
            "content": "The small molecule inhibitors vandetanib and cabozantinib are perhaps the best examples of such compounds.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_8",
            "start": 241,
            "end": 346,
            "label": {}
        },
        {
            "ix": "5-1005_v2_8@2",
            "content": "Although both have been approved for the treatment of advanced metastatic MTC <REF-12> , <REF-13> , RET inhibition is a secondary pharmacology of these drugs, which were initially developed as inhibitors of other TKs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_8",
            "start": 348,
            "end": 564,
            "label": {}
        },
        {
            "ix": "5-1005_v2_8@3",
            "content": "Both agents target KDR, whilst vandetanib has additional activity versus EGFR and cabozantinib versus MET.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_8",
            "start": 566,
            "end": 671,
            "label": {}
        },
        {
            "ix": "5-1005_v2_8@4",
            "content": "These compounds are now under investigation for the treatment of RET fusion positive LAD.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_8",
            "start": 673,
            "end": 761,
            "label": {}
        },
        {
            "ix": "5-1005_v2_8@5",
            "content": "A preliminary report of a phase II trial <REF-14> of cabozantinib confirmed partial responses in two of three RET-positive patients <REF-11> ; the third patient presented with prolonged stable disease.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_8",
            "start": 763,
            "end": 963,
            "label": {}
        },
        {
            "ix": "5-1005_v2_8@6",
            "content": "The activity of vandetanib in RET fusion positive patients has been demonstrated in two case reports <REF-15> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_8",
            "start": 965,
            "end": 1075,
            "label": {}
        },
        {
            "ix": "5-1005_v2_8@7",
            "content": "However significant toxicity ( e.g. rash, diarrhoea, hypertension) resulting from inhibition of other kinases, particularly KDR, has led to dose reductions in clinical trials (11–13) and is likely to compromise the use of both these agents in clinical settings <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_8",
            "start": 1077,
            "end": 1347,
            "label": {}
        },
        {
            "ix": "5-1005_v2_8@8",
            "content": "Thus, there is a clear need for selective RET inhibitors which do not display the toxicities associated with the current treatments and enable more potent and sustained inhibition of RET signalling.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_8",
            "start": 1349,
            "end": 1546,
            "label": {}
        },
        {
            "ix": "5-1005_v2_8@9",
            "content": "These agents may offer greater clinical benefit for patients with RET mutant cancers and widen the scope for the clinical use of RET inhibitors <REF-17> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_8",
            "start": 1548,
            "end": 1701,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@0",
            "content": "The role of RET in this subset of LAD has heightened interest in re-purposing a number of other clinically approved inhibitors, shown to have RET activity in pre-clinical studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 0,
            "end": 178,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@1",
            "content": "Sunitinib, sorafenib, ponatinib and lenvatinib, all multi-kinase TK inhibitors with some RET activity, are currently under investigation in numerous phase II clinical trials <REF-14> for treatment of RET fusion positive LAD <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 180,
            "end": 413,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@2",
            "content": "Sunitinib, already approved for the treatment of imatinib-resistant gastrointestinal stromal tumors (GIST), advanced renal carcinoma and advanced pancreatic neuroendocrine tumors, is the subject of a phase II study in certain types of LAD tumors, including those harbouring a RET fusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 415,
            "end": 701,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@3",
            "content": "Sorafenib, also approved for several indications including kidney and liver cancer, has demonstrated preclinical activity in RET models but has yet to be tested in patients selected based on RET fusion status.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 703,
            "end": 911,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@4",
            "content": "Some efficacy in advanced MTC has been reported for lenvatinib <REF-19> , however tumor response did not correlate with RET mutation status and the observed toxicity profile was consistent with KDR inhibition.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 913,
            "end": 1121,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@5",
            "content": "A phase II study of lenvatinib in RET fusion positive LAD is ongoing <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 1123,
            "end": 1201,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@6",
            "content": "Ponatinib is also a multi-targeted, broad-spectrum tyrosine kinase inhibitor <REF-20> , approved in late 2012 for patients with resistant or intolerant chronic myeloid leukemia and Philadelphia chromosome-positive acute lymphoblastic leukemia.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 1203,
            "end": 1445,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@7",
            "content": "Ponatinib was withdrawn shortly afterwards due to serious safety concerns but was later returned to the market with additional warnings in the product information.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 1447,
            "end": 1609,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@8",
            "content": "An investigational phase II clinical trial of ponatinib in LAD patients selected based on RET mutation status is currently ongoing <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 1611,
            "end": 1751,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@9",
            "content": "Alectinib is a highly selective ALK inhibitor (median inhibitory concentration of 1.9 nM for ALK activity), recently approved by the FDA for the treatment of patients with ALK positive LAD who progressed on crizotinib.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 1753,
            "end": 1970,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@10",
            "content": "Preclinical data demonstrating activity of alectinib in RET mouse models <REF-21> has led to its investigation as a treatment for RET fusion positive LAD as part of the DARWIN II trial <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 1972,
            "end": 2166,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@11",
            "content": "The compounds described above are all classic TK inhibitors but in 2010, Alfano et al. <REF-22> proposed an alternative approach for targeting RET in LAD involving inhibition of HSP90 (heat shock protein 90kDa).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 2168,
            "end": 2378,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@12",
            "content": "HSP90 is a molecular chaperone that plays a central role in regulating the correct folding, stability and function of numerous proteins <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 2380,
            "end": 2525,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@13",
            "content": "Inhibition of HSP90 activity results in aggregation or proteasomal degradation of these proteins.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 2527,
            "end": 2623,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@14",
            "content": "RET, along with other driver kinases such as EGFR and ALK is a HSP90 client protein and as such requires HSP90 for protein stability and function.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 2625,
            "end": 2770,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@15",
            "content": "Thus, targeting the chaperone function of HSP90 offers an alternative to direct kinase inhibition for therapeutic intervention in RET driven cancer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 2772,
            "end": 2919,
            "label": {}
        },
        {
            "ix": "5-1005_v2_9@16",
            "content": "Clinical evaluation of this approach is currently being assessed as part of a larger study in stage IV LAD patients with driver molecular alterations other than EGFR mutations <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_9",
            "start": 2921,
            "end": 3106,
            "label": {}
        },
        {
            "ix": "5-1005_v2_10@0",
            "content": "In an earlier publication <REF-1> we reported the discovery of 2-substituted phenol quinazolines as potent RET kinase inhibitors with improved KDR selectivity; here we describe development of the robust screening cascade which allowed us to achieve that goal and additionally profile existing clinical compounds with RET activity in order to assess them against our compound target profile.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_10",
            "start": 0,
            "end": 389,
            "label": {}
        },
        {
            "ix": "5-1005_v2_11@0",
            "content": "Materials and methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_11",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "5-1005_v2_12@0",
            "content": "Material",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_12",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "5-1005_v2_13@0",
            "content": "Clinical compounds were purchased from SelleckChem.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_13",
            "start": 0,
            "end": 50,
            "label": {}
        },
        {
            "ix": "5-1005_v2_13@1",
            "content": "Paterson Drug Discovery (PDD) compounds were synthesised in-house by methods described in an earlier publication <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_13",
            "start": 52,
            "end": 173,
            "label": {}
        },
        {
            "ix": "5-1005_v2_13@2",
            "content": "All compounds were dissolved at 20mM in dimethyl sulfoxide (DMSO, Sigma) and stored at -20°C or in a desiccator at room temperature.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_13",
            "start": 175,
            "end": 306,
            "label": {}
        },
        {
            "ix": "5-1005_v2_14@0",
            "content": "Biochemical kinase assays",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_14",
            "start": 0,
            "end": 24,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@0",
            "content": "RET and KDR kinase activities were measured according to methods previously described using the HTRF kinEASE kit (CisBio) <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 0,
            "end": 130,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@1",
            "content": "For measurement of mutant RET (M918T; Carna Bioscience), the following modifications were made: 50pM RET (M918T), 9µM ATP and 1µM substrate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 132,
            "end": 271,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@2",
            "content": "For the slow binding studies, the standard kinase assay procedure was used but with varying time of compound pre-incubation with RET prior to the addition of ATP.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 273,
            "end": 434,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@3",
            "content": "Reversibility of binding was determined by measuring the recovery of enzymatic activity after a rapid and large dilution of the enzyme-inhibitor complex.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 436,
            "end": 588,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@4",
            "content": "RET enzyme was incubated at 100 fold the concentration normally required for the standard screening assay, with a concentration of inhibitor equivalent to 10 fold the IC 50 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 590,
            "end": 763,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@5",
            "content": "After 15 minutes of incubation, this mixture was diluted 100 fold in the reaction buffer containing the enzyme substrates to start the reaction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 765,
            "end": 908,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@6",
            "content": "This diluted the enzyme to the standard assay concentration and the compound from 10 fold to 0.1 fold of the IC 50 concentration.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 910,
            "end": 1038,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@7",
            "content": "Theoretically, following this 100-fold dilution of the pre-incubation mixture, 91% enzyme activity will be recovered for a fully reversible inhibitor.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 1040,
            "end": 1189,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@8",
            "content": "However, taking into account assay variability, compounds showing >75% enzymatic activity recovery compared to the no inhibitor positive control were classed as fully reversible, those with <75% but where recovery of some activity was clearly detected were classed as slowly reversible (i.e. would eventually reach >75% recovery of activity).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 1191,
            "end": 1532,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@9",
            "content": "To test whether compounds were ATP competitive, assays were performed under standard conditions with 9µM ATP (Km), and then repeated at 450µM ATP (50× Km).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 1534,
            "end": 1688,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@10",
            "content": "By increasing the amount of ATP in the reaction by 50 fold, the IC 50 value should increase for competitive compounds, theoretically by a ratio of 25.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 1690,
            "end": 1839,
            "label": {}
        },
        {
            "ix": "5-1005_v2_15@11",
            "content": "For non-competitive compounds the ratio should be 0.5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_15",
            "start": 1841,
            "end": 1894,
            "label": {}
        },
        {
            "ix": "5-1005_v2_16@0",
            "content": "Cell culture",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_16",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "5-1005_v2_17@0",
            "content": "MZ-CRC-1 (gift from Alexander Knuth, University of Zurich) LC-2/ad (RIKEN) and HEK293 (ATCC) cells were cultured in advanced DMEM/F12 media (Invitrogen), supplemented with 5% fetal bovine serum (FBS, Invitrogen) and 2mM Glutamax (Invitrogen) and incubated at 37°C in 5% CO 2 /air.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_17",
            "start": 0,
            "end": 279,
            "label": {}
        },
        {
            "ix": "5-1005_v2_17@1",
            "content": "The BaF3 cell lines, expressing KIF5B-RET (gift from Pasi Janne <REF-10> ) and KDR (Advanced Cellular Dynamics, San Diego) were maintained in RPMI-1640 (Invitrogen) media containing 10% Hyclone FBS (Scientific Laboratory Supplies) with the addition of 1µg/mL puromycin (Sigma) for the KDR cell line.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_17",
            "start": 281,
            "end": 579,
            "label": {}
        },
        {
            "ix": "5-1005_v2_17@2",
            "content": "Non-modified BaF3 cells (WT; DSMZ, Germany) were maintained in RPMI-1640 media (Invitrogen) containing 10% FBS (Invitrogen) and supplemented with 10 ng/mL recombinant mouse IL-3 (R&D systems).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_17",
            "start": 581,
            "end": 772,
            "label": {}
        },
        {
            "ix": "5-1005_v2_18@0",
            "content": "Cell POM (proof of mechanism) assay",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_18",
            "start": 0,
            "end": 34,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@0",
            "content": "The RET proof of mechanism assay (POM) assay measures the compound effect on the target.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 0,
            "end": 87,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@1",
            "content": "Active forms of RET and KDR are phosphorylated and thus compound inhibitory activity may be measured directly by quantifying levels of the phosphoproteins, pRET and pKDR, remaining after cell treatment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 89,
            "end": 290,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@2",
            "content": "MZ-CRC-1 cells harbour the M918T mutation and thus express constitutively high levels of pRET and although pKDR is barely detectable it is possible to increase expression with ligand stimulation thus allowing measurement of RET and KDR inactivation within the same cell lysate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 292,
            "end": 568,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@3",
            "content": "MZ-CRC-1 cells were seeded into 96-well plates at 100,000 cells per well in 100µL culture medium.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 570,
            "end": 666,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@4",
            "content": "After 24 hours, medium was replaced with 100µl of serum-free medium and cells were incubated overnight.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 668,
            "end": 770,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@5",
            "content": "Compounds were dispensed into the appropriate wells using an acoustic liquid handling platform (LABCYTE).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 772,
            "end": 876,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@6",
            "content": "Cells were incubated with compound for 2h, followed by vascular endothelial growth factor (human VEGF 165, R&D Systems) ligand stimulation (50ng/ml for 5 minutes at 37°C).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 878,
            "end": 1048,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@7",
            "content": "VEGF treatment does not affect levels of pRET (data not shown).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 1050,
            "end": 1112,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@8",
            "content": "Cells were washed with 100µL ice-cold PBS and 30µL lysis buffer (Cell Signalling Technology) added.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 1114,
            "end": 1212,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@9",
            "content": "Plates were incubated at 4°C for 1 hour, resulting lysates were transferred to another 96-well plate and protein concentration determined using the Millipore Direct Detect infrared spectrometer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 1214,
            "end": 1407,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@10",
            "content": "Levels of pRET and pKDR in the cell lysates were determined, according to the manufacturer’s instructions, using the pRET (panTyr) and pVEGFR-2 (Tyr1175) PathScan sandwich ELISA kits (Cell Signalling Technology).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 1409,
            "end": 1620,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@11",
            "content": "Compound IC 50 s were based on levels of phosphoprotein normalised to control values.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 1622,
            "end": 1706,
            "label": {}
        },
        {
            "ix": "5-1005_v2_19@12",
            "content": "Selectivity (versus KDR) was calculated by dividing KDR IC 50 value by RET IC 50 value.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_19",
            "start": 1708,
            "end": 1794,
            "label": {}
        },
        {
            "ix": "5-1005_v2_20@0",
            "content": "Compound effects on pRET levels in LC-2/ad cells were measured as described above except that 30,000 cells per well were plated and the ligand stimulation step was omitted; KDR protein is not detectable in this cell line and therefore it is not possible to determine compound effects on levels of pKDR.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_20",
            "start": 0,
            "end": 301,
            "label": {}
        },
        {
            "ix": "5-1005_v2_21@0",
            "content": "Cell POP (proof of principle) assay",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_21",
            "start": 0,
            "end": 34,
            "label": {}
        },
        {
            "ix": "5-1005_v2_22@0",
            "content": "The RET proof of principle (POP) assay measures compound effects on cell proliferation in a disease relevant model.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_22",
            "start": 0,
            "end": 114,
            "label": {}
        },
        {
            "ix": "5-1005_v2_22@1",
            "content": "For routine screening we compared anti-proliferative effects of the compounds in the disease model, MZ-CRC-1 (RET (M918T)) versus a control, non-RET expressing cell line, HEK293.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_22",
            "start": 116,
            "end": 293,
            "label": {}
        },
        {
            "ix": "5-1005_v2_22@2",
            "content": "This allows us to demonstrate translation of mechanistic effects measured in the POM assay into RET-specific phenotypic effects in cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_22",
            "start": 295,
            "end": 431,
            "label": {}
        },
        {
            "ix": "5-1005_v2_22@3",
            "content": "MZ-CRC-1 and HEK293 (control, no RET expression) cells were seeded into 384 plates at 4000 and 1000 cells per well respectively in 30µL culture medium and confluence monitored at 4 hourly intervals using the IncuCyte ZOOM live cell imaging platform (Essen).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_22",
            "start": 433,
            "end": 689,
            "label": {}
        },
        {
            "ix": "5-1005_v2_22@4",
            "content": "After 48 hours, compounds were dispensed as described above and cells incubated until confluence of control cells reached 80–90%.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_22",
            "start": 691,
            "end": 819,
            "label": {}
        },
        {
            "ix": "5-1005_v2_22@5",
            "content": "Compound IC 50 s were calculated based on cell confluency at this time point normalised to control values.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_22",
            "start": 821,
            "end": 926,
            "label": {}
        },
        {
            "ix": "5-1005_v2_22@6",
            "content": "Non-specific toxicity margin was calculated by dividing IC 50 value obtained for the HEK293 control cells by that for the MZ-CRC-1 cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_22",
            "start": 928,
            "end": 1064,
            "label": {}
        },
        {
            "ix": "5-1005_v2_23@0",
            "content": "The POP assay has also been used to measure compound effects in other disease relevant cell lines, for example, LC-2/ad, an LAD cell line harbouring the CCDC6-RET fusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_23",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "5-1005_v2_23@1",
            "content": "LC-2/ad cells were seeded into 96 well plates at 4000 cells per well in 100µL serum free culture medium and incubated at 37°C in 5% CO 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_23",
            "start": 171,
            "end": 308,
            "label": {}
        },
        {
            "ix": "5-1005_v2_23@2",
            "content": "After 48 hours compounds were diluted to 2x final concentration and added to appropriate wells in 100µL serum-free culture medium.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_23",
            "start": 310,
            "end": 439,
            "label": {}
        },
        {
            "ix": "5-1005_v2_23@3",
            "content": "Once control cells had reached 80–90% confluence, protein content was measured using the sulforhodamine B (SRB) assay <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_23",
            "start": 441,
            "end": 568,
            "label": {}
        },
        {
            "ix": "5-1005_v2_23@4",
            "content": "Compound IC 50 s were based on protein content (proportional to cell number) normalised to control values.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_23",
            "start": 570,
            "end": 675,
            "label": {}
        },
        {
            "ix": "5-1005_v2_24@0",
            "content": "BaF3 POM assay",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_24",
            "start": 0,
            "end": 13,
            "label": {}
        },
        {
            "ix": "5-1005_v2_25@0",
            "content": "This assay was performed as described previously <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_25",
            "start": 0,
            "end": 57,
            "label": {}
        },
        {
            "ix": "5-1005_v2_25@1",
            "content": "Selectivity values were calculated as described above.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_25",
            "start": 59,
            "end": 112,
            "label": {}
        },
        {
            "ix": "5-1005_v2_26@0",
            "content": "Western blotting analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_26",
            "start": 0,
            "end": 24,
            "label": {}
        },
        {
            "ix": "5-1005_v2_27@0",
            "content": "Following compound treatment (1µM, 24 hours), MZ-CRC-1 cell lysates (50 μg) were subjected to polyacrylamide gel electrophoresis (PAGE) and semi-dry transfer to nitrocellulose membrane using the Bio-Rad Trans-Blot Turbo system and Trans-Blot Turbo transfer packs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_27",
            "start": 0,
            "end": 262,
            "label": {}
        },
        {
            "ix": "5-1005_v2_27@1",
            "content": "Membranes were blocked overnight at 4°C in phosphate-buffered saline containing 0.1% Tween (PBST; Sigma) and 5% non-fat dried milk powder (marvel).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_27",
            "start": 264,
            "end": 410,
            "label": {}
        },
        {
            "ix": "5-1005_v2_27@2",
            "content": "Primary and secondary antibody incubations were performed at room temperature in PBST/0.5% marvel with 3× PBST washes post incubation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_27",
            "start": 412,
            "end": 545,
            "label": {}
        },
        {
            "ix": "5-1005_v2_27@3",
            "content": "pRET (Santa Cruz #SC-20252-R) and total RET (Santa Cruz #sc-167) antibodies were used at 1:500 dilutions; GAPDH (Cell Signaling Technology #2118L) and secondary goat anti rabbit IgG HRP-linked (Cell Signaling Technology #7074) antibodies were used at 1:1000.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_27",
            "start": 547,
            "end": 804,
            "label": {}
        },
        {
            "ix": "5-1005_v2_27@4",
            "content": "Proteins were visualized by chemiluminescent detection of peroxidase activity using SuperSignal reagent (Pierce), and images were captured using the Syngene imager and GeneSys software.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_27",
            "start": 806,
            "end": 990,
            "label": {}
        },
        {
            "ix": "5-1005_v2_28@0",
            "content": "Results and discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_28",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@0",
            "content": "Our aim was to develop and validate a robust screening cascade to support the identification and development of potent and selective RET inhibitors using vandetanib as the starting point <REF-1> and to assess these attributes in clinical compounds reported to have RET activity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 0,
            "end": 277,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@1",
            "content": "All compounds were initially assayed biochemically for activity versus RET and KDR enzyme.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 279,
            "end": 368,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@2",
            "content": "Once potency and selectivity had been confirmed, and structure activity relationships (SAR) demonstrated, for a number of compounds within the anilinoquinazoline series <REF-1> , we performed further biochemical studies to investigate the mechanism of RET inhibition using selected compounds including our starting point, vandetanib ( Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 370,
            "end": 715,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@3",
            "content": "Some inhibitors bind to, or dissociate from the target enzyme slowly, leading to time dependent inhibition <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 717,
            "end": 833,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@4",
            "content": "Failure to identify this can lead to an underestimation of biochemical potency and misleading SAR.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 835,
            "end": 932,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@5",
            "content": "To investigate this, compounds were assayed under standard conditions but pre-incubated with RET for between 0 and 60 minutes prior to addition of ATP.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 934,
            "end": 1084,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@6",
            "content": "Pre-incubation did not significantly affect IC 50 values indicating that the anilinoquinazolines are not slow binders and that a 15 minutes pre-incubation, as used in our standard assay, is sufficient to allow the reaction to reach equilibrium ( Figure 1A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 1086,
            "end": 1343,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@7",
            "content": "Although diverse in primary amino acid sequence, the human kinases share a great degree of similarity in their 3D structures, especially in their catalytically active kinase domain where the ATP-binding pocket is located.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 1345,
            "end": 1565,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@8",
            "content": "Kinase inhibitors can be grouped into two classes, based on binding mode: irreversible and reversible.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 1567,
            "end": 1668,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@9",
            "content": "The former tend to bind covalently with a reactive nucleophilic cysteine residue proximal to the ATP-binding site, resulting in the blockage of the ATP site and irreversible inhibition.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 1670,
            "end": 1854,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@10",
            "content": "Reversible inhibitors can be further classified into four main types, competitive, non-competitive, uncompetitive and mixed inhibition <REF-26> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 1856,
            "end": 2000,
            "label": {}
        },
        {
            "ix": "5-1005_v2_29@11",
            "content": "Our data ( Figure 1B ) indicates that the anilinoquinazolines under investigation here fall into the reversible, ATP competitive category which is not surprising since it has been demonstrated previously that vandetanib, a related compound and our starting point, exhibits this mode of binding <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_29",
            "start": 2002,
            "end": 2305,
            "label": {}
        },
        {
            "ix": "5-1005_v2_30@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_30",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "5-1005_v2_32@0",
            "content": "Compounds meeting defined criteria for potency and selectivity in the biochemical assay were then assessed in a cellular POM assay.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_32",
            "start": 0,
            "end": 130,
            "label": {}
        },
        {
            "ix": "5-1005_v2_32@1",
            "content": "Initially we developed an ELISA-based POM assay, measuring changes in levels of (active) phosphorylated RET (M918T) and KDR, within the same MTC cell line (MZ-CRC-1).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_32",
            "start": 132,
            "end": 297,
            "label": {}
        },
        {
            "ix": "5-1005_v2_33@0",
            "content": "However, it soon became apparent that compared to KDR there was a poor correlation between RET biochemical and cell-based IC 50 measurements ( Figures 2A & B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_33",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "5-1005_v2_33@1",
            "content": "In addition, the drop off in potency from the biochemical to cellular assay was generally much greater for RET than KDR, in effect compressing the selectivity margins, often from >100-fold in the biochemical assay to parity (or worse) in the cellular assay.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_33",
            "start": 161,
            "end": 417,
            "label": {}
        },
        {
            "ix": "5-1005_v2_33@2",
            "content": "Compound permeability was not believed to be the cause of the disparity as the magnitude of the drop off was not the same for both RET and KDR, despite measurement of both proteins in the same cell lysate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_33",
            "start": 419,
            "end": 623,
            "label": {}
        },
        {
            "ix": "5-1005_v2_33@3",
            "content": "A previous report <REF-28> had indicated that a single mutation within the kinase domain of RET could alter compound inhibitory activity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_33",
            "start": 625,
            "end": 761,
            "label": {}
        },
        {
            "ix": "5-1005_v2_33@4",
            "content": "In order to address the possibility that some of the discrepancy could be due to our measurement of WT protein activity biochemically but mutant RET (M918T) protein in the MZ-CRC-1 cells, we compared the biochemical activity of selected compounds versus both RET (WT) and RET (M918T) protein.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_33",
            "start": 763,
            "end": 1054,
            "label": {}
        },
        {
            "ix": "5-1005_v2_33@5",
            "content": "The compound IC 50 data for the two proteins correlate well ( Figure 2C ) and therefore indicate that the mutation does not significantly affect biochemical activity for this class of compound.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_33",
            "start": 1056,
            "end": 1248,
            "label": {}
        },
        {
            "ix": "5-1005_v2_33@6",
            "content": "In order to follow this up in the cellular context we extended our repertoire of assays to enable robust measurement of RET activity in TT <REF-29> , LC-2/ad <REF-30> , <REF-31> and mouse BaF3 <REF-10> cells harbouring a C634W mutation, a CCDC6-RET fusion and a KIF5B-RET fusion respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_33",
            "start": 1250,
            "end": 1541,
            "label": {}
        },
        {
            "ix": "5-1005_v2_33@7",
            "content": "We assessed relative RET potencies for a number of tool compounds (including vandetanib and cabozantinib) across these cell lines and found that activities correlated well ( Supplementary Figure 1 ), further supporting the notion that this class of compounds are equally active versus mutant and WT forms of the protein.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_33",
            "start": 1543,
            "end": 1862,
            "label": {}
        },
        {
            "ix": "5-1005_v2_34@0",
            "content": "In order to demonstrate POP in a disease relevant cell line, we developed and validated a proliferation endpoint assay in the MTC line MZ-CRC-1; non-specific toxicity was evaluated by measuring the same endpoint in HEK293, a human embryonic kidney line which does not express RET.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_34",
            "start": 0,
            "end": 279,
            "label": {}
        },
        {
            "ix": "5-1005_v2_34@1",
            "content": "Compounds exhibiting RET potency (<500nM) and selectivity (>10x) in the POM assay were selected for POP assay screening.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_34",
            "start": 281,
            "end": 400,
            "label": {}
        },
        {
            "ix": "5-1005_v2_34@2",
            "content": "Our data show that there is a good correlation between the POM and POP IC 50 values measured in the MZ-CRC-1 ( Figure 3A ) cells and other RET models (e.g. LC-2/ad, Supplementary Figure 2 ) indicating that the RET inhibitory activity that we observe in our POM assay translates into anti-proliferative effects in our MTC and LAD disease models.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_34",
            "start": 402,
            "end": 745,
            "label": {}
        },
        {
            "ix": "5-1005_v2_34@3",
            "content": "In addition, we have assayed a selection of representative compounds for anti-proliferative effects in LC-2/ad and as for the POM assay, data correlate well with that obtained in MZ-CRC-1 ( Figure 3B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_34",
            "start": 747,
            "end": 948,
            "label": {}
        },
        {
            "ix": "5-1005_v2_34@4",
            "content": "Therefore, we are confident that activities observed in our routine MZ-CRC-1 POM and POP screens are predictive for the other cell line models.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_34",
            "start": 950,
            "end": 1092,
            "label": {}
        },
        {
            "ix": "5-1005_v2_35@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_35",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "5-1005_v2_37@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_37",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "5-1005_v2_39@0",
            "content": "Although at this stage we were confident that we could drive our internal chemistry effort based on the cellular data, it was clear that performance in the biochemical assay was not always a good predictor of RET cellular activity and therefore should not be used as a pre-screen for this chemical series.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_39",
            "start": 0,
            "end": 304,
            "label": {}
        },
        {
            "ix": "5-1005_v2_39@1",
            "content": "To address this issue this we developed and validated a higher throughput POM assay allowing parallel assessment of all compounds in both cellular and biochemical assays.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_39",
            "start": 306,
            "end": 475,
            "label": {}
        },
        {
            "ix": "5-1005_v2_39@2",
            "content": "This BaF3 proliferation assay platform, employing cell lines dependent upon RET or KDR for survival alongside WT IL-3 dependent control cells, is robust with 4x higher throughput than the original MZ-CRC-1 POM ELISA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_39",
            "start": 477,
            "end": 692,
            "label": {}
        },
        {
            "ix": "5-1005_v2_39@3",
            "content": "More importantly the proliferation IC 50 for both RET ( Figure 3C ) and KDR in the BaF3 models correlate well with those generated using the respective phosphorylation endpoint assays thus maintaining the selectivity values previously observed ( Figure 3D ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_39",
            "start": 694,
            "end": 951,
            "label": {}
        },
        {
            "ix": "5-1005_v2_39@4",
            "content": "Accordingly, we introduced this as the routine POM screening assay with the option to further evaluate compound effects on phosphoprotein levels using the ELISA POM if necessary.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_39",
            "start": 953,
            "end": 1130,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@0",
            "content": "Chemical optimisation of the series ultimately led to the identification of a number of potent and selective RET inhibitors ( e.g. PDD16860 and PDD16964; Table 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 0,
            "end": 163,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@1",
            "content": "Clinical RET compounds currently under investigation in LAD were also profiled using the screening cascade ( Table 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 165,
            "end": 283,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@2",
            "content": "With the possible exception of alectinib, which it was not possible to dose at the highest concentrations due to solubility issues, none of the kinase inhibitors tested met our criteria for selectivity versus KDR ( i.e . >10x).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 285,
            "end": 511,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@3",
            "content": "Several reports in the literature <REF-21> , <REF-32> , which we have subsequently confirmed in-house (data not shown), demonstrate that alectinib is a much better cellular inhibitor of ALK (IC 50 in H2228 cells = 10nM) than RET (IC 50 in MZ-CRC-1 cells = 80nM).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 513,
            "end": 774,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@4",
            "content": "Given this, along with its limited solubility and required dosing of 300–600mg bid for clinical efficacy in ALK driven LAD, therapeutic inhibition of RET is unlikely at clinically relevant doses.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 776,
            "end": 970,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@5",
            "content": "Although not a direct inhibitor of RET activity, we have also profiled ganetespib, a HSP90 inhibitor.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 972,
            "end": 1072,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@6",
            "content": "Ganetespib did reduce levels of active RET, through protein degradation ( Supplementary Figure 3 ) but was not RET-selective and exhibited more toxicity (toxicity margin = 0.7x) in the control non-RET driven HEK293 cells compared to the MTC RET-driven model, MZ-CRC-1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 1074,
            "end": 1341,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@7",
            "content": "This indicates that the pleiotropic effects of HSP90 inhibition on numerous client proteins (including KDR) is likely to elicit non-specific toxicity at therapeutically active doses.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 1343,
            "end": 1524,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@8",
            "content": "Other aspects of the screening cascade ( Figure 4 ) are already in place and as discussed in an earlier publication <REF-1> , selected compounds have been assessed in in vitro DMPK assays as part of the chemical optimisation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 1526,
            "end": 1750,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@9",
            "content": "Furthermore, in vivo models and capabilities ( Figure 4 ) have been established and validated (data not shown) and several tool compounds are currently undergoing assessment in PK/PD and efficacy studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 1752,
            "end": 1955,
            "label": {}
        },
        {
            "ix": "5-1005_v2_40@10",
            "content": "To date, our robust screening workflows have proved very successful in identifying potent, selective tool compounds and will continue to support our active pursuit of clinical candidates suitable for evaluation in RET fusion positive LAD patients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_40",
            "start": 1957,
            "end": 2203,
            "label": {}
        },
        {
            "ix": "5-1005_v2_41@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_41",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "5-1005_v2_43@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_43",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "5-1005_v2_45@0",
            "content": "Conclusions",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_45",
            "start": 0,
            "end": 10,
            "label": {}
        },
        {
            "ix": "5-1005_v2_46@0",
            "content": "We have established a robust screening cascade to enable the identification and development of a clinical candidate compound demonstrating potent and selective RET activity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_46",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "5-1005_v2_46@1",
            "content": "Furthermore we have profiled clinical compounds currently under investigation for treatment of LAD confirming that they do not meet our target profile.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_46",
            "start": 174,
            "end": 324,
            "label": {}
        },
        {
            "ix": "5-1005_v2_46@2",
            "content": "We are continuing our efforts to develop a clinical candidate and will report on further progress in a future publication.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_46",
            "start": 326,
            "end": 447,
            "label": {}
        },
        {
            "ix": "5-1005_v2_48@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_48",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "5-1005_v2_49@0",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2016 Watson AJ et al.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_49",
            "start": 0,
            "end": 131,
            "label": {}
        },
        {
            "ix": "5-1005_v2_50@0",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_50",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "5-1005_v2_51@0",
            "content": "F1000Research : Dataset 1. Datasets: selective inhibitors of RET and comparison with current clinical candidates through development and validation of a robust screening cascade, 10.5256/f1000research.8724.d122280 <REF-33>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_51",
            "start": 0,
            "end": 221,
            "label": {}
        },
        {
            "ix": "5-1005_v2_52@0",
            "content": "<REF-1> Newton R Bowler KA Burns EM : The discovery of 2-substituted phenol quinazolines as potent RET kinase inhibitors with improved KDR selectivity. Eur J Med Chem. 2016 ; 112 : 20 – 32 . 26874741 10.1016/j.ejmech.2016.01.039 4896931",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_52",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "5-1005_v2_53@0",
            "content": "<REF-2> Arighi E Borrello MG Sariola H : RET tyrosine kinase signaling in development and cancer. Cytokine Growth Factor Rev. 2005 ; 16 ( 4–5 ): 441 – 467 . 15982921 10.1016/j.cytogfr.2005.05.010",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_53",
            "start": 0,
            "end": 194,
            "label": {}
        },
        {
            "ix": "5-1005_v2_54@0",
            "content": "<REF-3> Santoro M Carlomagno F Melillo RM : Dysfunction of the RET receptor in human cancer. Cell Mol Life Sci. 2004 ; 61 ( 23 ): 2954 – 2964 . 15583857 10.1007/s00018-004-4276-8",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_54",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "5-1005_v2_55@0",
            "content": "<REF-4> Santoro M Carlomagno F : Drug insight: Small-molecule inhibitors of protein kinases in the treatment of thyroid cancer. Nat Clin Pract Endocrinol Metab. 2006 ; 2 ( 1 ): 42 – 52 . 16932252 10.1038/ncpendmet0073",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_55",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "5-1005_v2_56@0",
            "content": "<REF-5> Wells SA Jr Santoro M : Targeting the RET pathway in thyroid cancer. Clin Cancer Res. 2009 ; 15 ( 23 ): 7119 – 23 . 19934298 10.1158/1078-0432.CCR-08-2742",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_56",
            "start": 0,
            "end": 161,
            "label": {}
        },
        {
            "ix": "5-1005_v2_57@0",
            "content": "<REF-6> Elisei R Cosci B Romei C : Prognostic significance of somatic RET oncogene mutations in sporadic medullary thyroid cancer: a 10-year follow-up study. J Clin Endocrinol Metab. 2008 ; 93 ( 3 ): 682 – 687 . 18073307 10.1210/jc.2007-1714",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_57",
            "start": 0,
            "end": 240,
            "label": {}
        },
        {
            "ix": "5-1005_v2_58@0",
            "content": "<REF-7> Ju YS Lee WC Shin JY : A transforming KIF5B and RET gene fusion in lung adenocarcinoma revealed from whole-genome and transcriptome sequencing. Genome Res. 2012 ; 22 ( 3 ): 436 – 45 . 22194472 10.1101/gr.133645.111 3290779",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_58",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "5-1005_v2_59@0",
            "content": "<REF-10> Lipson D Capelletti M Yelensky R : Identification of new ALK and RET gene fusions from colorectal and lung cancer biopsies. Nat Med. 2012 ; 18 ( 3 ): 382 – 384 . 22327622 10.1038/nm.2673 3916180",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_59",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "5-1005_v2_60@0",
            "content": "<REF-11> Drilon A Wang L Hasanovic A : Response to Cabozantinib in patients with RET fusion-positive lung adenocarcinomas. Cancer Discov. 2013 ; 3 ( 6 ): 630 – 635 . 23533264 10.1158/2159-8290.CD-13-0035 4160032",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_60",
            "start": 0,
            "end": 210,
            "label": {}
        },
        {
            "ix": "5-1005_v2_61@0",
            "content": "<REF-12> Wells SA Jr Robinson BG Gagel RF : Vandetanib in patients with locally advanced or metastatic medullary thyroid cancer: a randomized, double-blind phase III trial. J Clin Oncol. 2012 ; 30 ( 2 ): 134 – 141 . 22025146 10.1200/JCO.2011.35.5040 3675689",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_61",
            "start": 0,
            "end": 256,
            "label": {}
        },
        {
            "ix": "5-1005_v2_62@0",
            "content": "<REF-13> Elisei R Schlumberger MJ Müller SP : Cabozantinib in progressive medullary thyroid cancer. J Clin Oncol. 2013 ; 31 ( 29 ): 3639 – 3646 . 24002501 10.1200/JCO.2012.48.4659 4164813",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_62",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "5-1005_v2_63@0",
            "content": "<REF-14> https://clinicaltrials.gov/ (accessed February 2016).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_63",
            "start": 0,
            "end": 61,
            "label": {}
        },
        {
            "ix": "5-1005_v2_64@0",
            "content": "<REF-15> Gautschi O Zander T Keller FA : A patient with lung adenocarcinoma and RET fusion treated with vandetanib. J Thorac Oncol. 2013 ; 8 ( 5 ): e43 – 44 . 23584301 10.1097/JTO.0b013e31828a4d07",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_64",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "5-1005_v2_65@0",
            "content": "<REF-16> Suguwara M Ly T Hershman JM : Medullary thyroid cancer--current treatment strategy, novel therapies and perspectives for the future. Horm Cancer. 2012 ; 3 ( 5–6 ): 218 – 226 . 23011723 10.1007/s12672-012-0119-5",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_65",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "5-1005_v2_66@0",
            "content": "<REF-17> Mulligan LM : RET revisited: expanding the oncogenic portfolio. Nat Rev Cancer. 2014 ; 14 ( 3 ): 173 – 186 . 24561444 10.1038/nrc3680",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_66",
            "start": 0,
            "end": 141,
            "label": {}
        },
        {
            "ix": "5-1005_v2_67@0",
            "content": "<REF-18> Song M : Progress in Discovery of KIF5B-RET Kinase Inhibitors for the Treatment of Non-Small-Cell Lung Cancer. J Med Chem. 2015 ; 58 ( 9 ): 3672 – 3681 . 25625428 10.1021/jm501464c",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_67",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "5-1005_v2_68@0",
            "content": "<REF-19> Schlumberger M Jarzab B Cabanillas ME : A Phase II Trial of the Multitargeted Tyrosine Kinase Inhibitor Lenvatinib (E7080) in Advanced Medullary Thyroid Cancer. Clin Cancer Res. 2016 ; 22 ( 1 ): 44 – 53 . 26311725 10.1158/1078-0432.CCR-15-1127",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_68",
            "start": 0,
            "end": 251,
            "label": {}
        },
        {
            "ix": "5-1005_v2_69@0",
            "content": "<REF-20> De Falco V Buonocore P Muthu M : Ponatinib (AP24534) is a novel potent inhibitor of oncogenic RET mutants associated with thyroid cancer. J Clin Enocrinol Metab. 2013 ; 98 ( 5 ): E811 – E819 . 23526464 10.1210/jc.2012-2672",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_69",
            "start": 0,
            "end": 230,
            "label": {}
        },
        {
            "ix": "5-1005_v2_70@0",
            "content": "<REF-21> Kodama T Tsukaguchi T Satoh Y : Alectinib shows potent antitumor activity against RET -rearranged non-small cell lung cancer. Mol Cancer Ther. 2014 ; 13 ( 12 ): 2910 – 2918 . 25349307 10.1158/1535-7163.MCT-14-0274",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_70",
            "start": 0,
            "end": 221,
            "label": {}
        },
        {
            "ix": "5-1005_v2_71@0",
            "content": "<REF-22> Alfano L Guida T Provitero L : RET is a heat shock protein 90 (HSP90) client protein and is knocked down upon HSP90 pharmacological block. J Clin Endocrinol Metab. 2010 ; 95 ( 7 ): 3552 – 3557 . 20444924 10.1210/jc.2009-2315",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_71",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "5-1005_v2_72@0",
            "content": "<REF-23> Taipale M Jarosz DF Lindquist S : HSP90 at the hub of protein homeostasis: emerging mechanistic insights. Nat Rev Mol Cell Biol. 2010 ; 11 ( 7 ): 515 – 528 . 20531426 10.1038/nrm2918",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_72",
            "start": 0,
            "end": 190,
            "label": {}
        },
        {
            "ix": "5-1005_v2_73@0",
            "content": "<REF-24> Vichai V Kirtikara K : Sulforhodamine B colorimetric assay for cytotoxicity screening. Nat Protoc. 2006 ; 1 ( 3 ): 1112 – 1116 . 17406391 10.1038/nprot.2006.179",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_73",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "5-1005_v2_74@0",
            "content": "<REF-25> Rudolph J Xiao Y Pardi A : Slow inhibition and conformation selective properties of extracellular signal-regulated kinase 1 and 2 inhibitors. Biochemistry. 2015 ; 54 ( 1 ): 22 – 31 . 25350931 10.1021/bi501101v 4724192",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_74",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "5-1005_v2_75@0",
            "content": "<REF-26> Wu P Nielsen TE Clausen MH : FDA-approved small-molecule kinase inhibitors. Trends Pharmacol Sci. 2015 ; 36 ( 7 ): 422 – 39 . 25975227 10.1016/j.tips.2015.04.005",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_75",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "5-1005_v2_76@0",
            "content": "<REF-27> Knowles PP Murray-Rust J Kjaer S : Structure and chemical inhibition of the RET tyrosine kinase domain. J Biol Chem. 2006 ; 281 ( 44 ): 33577 – 33587 . 16928683 10.1074/jbc.M605604200",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_76",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "5-1005_v2_77@0",
            "content": "<REF-28> Verbeek HH Alves MM de Groot JW : The effects of four different tyrosine kinase inhibitors on medullary and papillary thyroid cancer cells. J Clin Endocrinol Metab. 2011 ; 96 ( 6 ): E991 – 5 . 21470995 10.1210/jc.2010-2381",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_77",
            "start": 0,
            "end": 230,
            "label": {}
        },
        {
            "ix": "5-1005_v2_78@0",
            "content": "<REF-29> Carlomagno F Salvatore D Santoro M : Point mutation of the RET proto-oncogene in the TT human medullary thyroid carcinoma cell line. Biochem Biophys Res Commun. 1995 ; 207 ( 3 ): 1022 – 1028 . 7864888 10.1006/bbrc.1995.1287",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_78",
            "start": 0,
            "end": 231,
            "label": {}
        },
        {
            "ix": "5-1005_v2_79@0",
            "content": "<REF-30> Matsubara D Kanai Y Ishikawa S : Identification of CCDC6-RET fusion in the human lung adenocarcinoma cell line, LC-2/ad. J Thorac Oncol. 2012 ; 7 ( 12 ): 1872 – 1876 . 23154560 10.1097/JTO.0b013e3182721ed1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_79",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "5-1005_v2_80@0",
            "content": "<REF-31> Suzuki M Makinoshima H Matsumoto S : Identification of a lung adenocarcinoma cell line with CCDC6-RET fusion gene and the effect of RET inhibitors in vitro and in vivo . Cancer Sci. 2013 ; 104 ( 7 ): 896 – 903 . 23578175 10.1111/cas.12175",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_80",
            "start": 0,
            "end": 246,
            "label": {}
        },
        {
            "ix": "5-1005_v2_81@0",
            "content": "<REF-32> Sakamoto H Tsukaguchi T Hiroshima S : CH5424802, a selective ALK inhibitor capable of blocking the resistant gatekeeper mutant. Cancer Cell. 2011 ; 19 ( 5 ): 679 – 690 . 21575866 10.1016/j.ccr.2011.04.004",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_81",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "5-1005_v2_82@0",
            "content": "<REF-33> Watson AJ Hopkins GV Hitchin S : Dataset 1 in: identification of selective inhibitors of RET and comparison with current clinical candidates through development and validation of a robust screening cascade. F1000Research. 2016 . Data Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1005_v2_82",
            "start": 0,
            "end": 248,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "5-1005_v2_0",
            "tgt_ix": "5-1005_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_1",
            "tgt_ix": "5-1005_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_1",
            "tgt_ix": "5-1005_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_1",
            "tgt_ix": "5-1005_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_0",
            "tgt_ix": "5-1005_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_5",
            "tgt_ix": "5-1005_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_5",
            "tgt_ix": "5-1005_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_5",
            "tgt_ix": "5-1005_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_5",
            "tgt_ix": "5-1005_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_5",
            "tgt_ix": "5-1005_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_0",
            "tgt_ix": "5-1005_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_11",
            "tgt_ix": "5-1005_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_12",
            "tgt_ix": "5-1005_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_11",
            "tgt_ix": "5-1005_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_14",
            "tgt_ix": "5-1005_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_11",
            "tgt_ix": "5-1005_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_16",
            "tgt_ix": "5-1005_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_11",
            "tgt_ix": "5-1005_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_18",
            "tgt_ix": "5-1005_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_18",
            "tgt_ix": "5-1005_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_11",
            "tgt_ix": "5-1005_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_21",
            "tgt_ix": "5-1005_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_21",
            "tgt_ix": "5-1005_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_11",
            "tgt_ix": "5-1005_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_24",
            "tgt_ix": "5-1005_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_11",
            "tgt_ix": "5-1005_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_26",
            "tgt_ix": "5-1005_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_0",
            "tgt_ix": "5-1005_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_30",
            "tgt_ix": "5-1005_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_35",
            "tgt_ix": "5-1005_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_37",
            "tgt_ix": "5-1005_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_41",
            "tgt_ix": "5-1005_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_43",
            "tgt_ix": "5-1005_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_0",
            "tgt_ix": "5-1005_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_45",
            "tgt_ix": "5-1005_v2_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_45",
            "tgt_ix": "5-1005_v2_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_0",
            "tgt_ix": "5-1005_v2_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_48",
            "tgt_ix": "5-1005_v2_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_48",
            "tgt_ix": "5-1005_v2_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_48",
            "tgt_ix": "5-1005_v2_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_0",
            "tgt_ix": "5-1005_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_1",
            "tgt_ix": "5-1005_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_2",
            "tgt_ix": "5-1005_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_3",
            "tgt_ix": "5-1005_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_4",
            "tgt_ix": "5-1005_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_5",
            "tgt_ix": "5-1005_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_6",
            "tgt_ix": "5-1005_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_10",
            "tgt_ix": "5-1005_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_11",
            "tgt_ix": "5-1005_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_12",
            "tgt_ix": "5-1005_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_13",
            "tgt_ix": "5-1005_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_14",
            "tgt_ix": "5-1005_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_16",
            "tgt_ix": "5-1005_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_17",
            "tgt_ix": "5-1005_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_18",
            "tgt_ix": "5-1005_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_20",
            "tgt_ix": "5-1005_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_21",
            "tgt_ix": "5-1005_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_22",
            "tgt_ix": "5-1005_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_23",
            "tgt_ix": "5-1005_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_24",
            "tgt_ix": "5-1005_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_25",
            "tgt_ix": "5-1005_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_26",
            "tgt_ix": "5-1005_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_27",
            "tgt_ix": "5-1005_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_30",
            "tgt_ix": "5-1005_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_31",
            "tgt_ix": "5-1005_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_32",
            "tgt_ix": "5-1005_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_34",
            "tgt_ix": "5-1005_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_35",
            "tgt_ix": "5-1005_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_36",
            "tgt_ix": "5-1005_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_37",
            "tgt_ix": "5-1005_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_38",
            "tgt_ix": "5-1005_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_39",
            "tgt_ix": "5-1005_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_41",
            "tgt_ix": "5-1005_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_42",
            "tgt_ix": "5-1005_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_43",
            "tgt_ix": "5-1005_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_44",
            "tgt_ix": "5-1005_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_45",
            "tgt_ix": "5-1005_v2_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_46",
            "tgt_ix": "5-1005_v2_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_47",
            "tgt_ix": "5-1005_v2_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_48",
            "tgt_ix": "5-1005_v2_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_49",
            "tgt_ix": "5-1005_v2_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_50",
            "tgt_ix": "5-1005_v2_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_10",
            "tgt_ix": "5-1005_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_6",
            "tgt_ix": "5-1005_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_6",
            "tgt_ix": "5-1005_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_23",
            "tgt_ix": "5-1005_v2_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_51",
            "tgt_ix": "5-1005_v2_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_31",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_36",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_34",
            "tgt_ix": "5-1005_v2_38",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_42",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_44",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1005_v2_0",
            "tgt_ix": "5-1005_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_1",
            "tgt_ix": "5-1005_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_2",
            "tgt_ix": "5-1005_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_2",
            "tgt_ix": "5-1005_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_3",
            "tgt_ix": "5-1005_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_3",
            "tgt_ix": "5-1005_v2_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_3",
            "tgt_ix": "5-1005_v2_3@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_4",
            "tgt_ix": "5-1005_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_4",
            "tgt_ix": "5-1005_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_4",
            "tgt_ix": "5-1005_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_5",
            "tgt_ix": "5-1005_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_6",
            "tgt_ix": "5-1005_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_6",
            "tgt_ix": "5-1005_v2_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_6",
            "tgt_ix": "5-1005_v2_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_6",
            "tgt_ix": "5-1005_v2_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_7@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_7@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_7@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_7",
            "tgt_ix": "5-1005_v2_7@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_8@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_8@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_8@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_8@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_8",
            "tgt_ix": "5-1005_v2_8@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@14",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@15",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_9",
            "tgt_ix": "5-1005_v2_9@16",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_10",
            "tgt_ix": "5-1005_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_11",
            "tgt_ix": "5-1005_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_12",
            "tgt_ix": "5-1005_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_13",
            "tgt_ix": "5-1005_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_13",
            "tgt_ix": "5-1005_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_13",
            "tgt_ix": "5-1005_v2_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_14",
            "tgt_ix": "5-1005_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_15",
            "tgt_ix": "5-1005_v2_15@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_16",
            "tgt_ix": "5-1005_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_17",
            "tgt_ix": "5-1005_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_17",
            "tgt_ix": "5-1005_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_17",
            "tgt_ix": "5-1005_v2_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_18",
            "tgt_ix": "5-1005_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_19",
            "tgt_ix": "5-1005_v2_19@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_20",
            "tgt_ix": "5-1005_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_21",
            "tgt_ix": "5-1005_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_22",
            "tgt_ix": "5-1005_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_22",
            "tgt_ix": "5-1005_v2_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_22",
            "tgt_ix": "5-1005_v2_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_22",
            "tgt_ix": "5-1005_v2_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_22",
            "tgt_ix": "5-1005_v2_22@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_22",
            "tgt_ix": "5-1005_v2_22@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_22",
            "tgt_ix": "5-1005_v2_22@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_23",
            "tgt_ix": "5-1005_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_23",
            "tgt_ix": "5-1005_v2_23@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_23",
            "tgt_ix": "5-1005_v2_23@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_23",
            "tgt_ix": "5-1005_v2_23@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_23",
            "tgt_ix": "5-1005_v2_23@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_24",
            "tgt_ix": "5-1005_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_25",
            "tgt_ix": "5-1005_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_25",
            "tgt_ix": "5-1005_v2_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_26",
            "tgt_ix": "5-1005_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_27",
            "tgt_ix": "5-1005_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_27",
            "tgt_ix": "5-1005_v2_27@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_27",
            "tgt_ix": "5-1005_v2_27@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_27",
            "tgt_ix": "5-1005_v2_27@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_27",
            "tgt_ix": "5-1005_v2_27@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_28",
            "tgt_ix": "5-1005_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_29",
            "tgt_ix": "5-1005_v2_29@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_30",
            "tgt_ix": "5-1005_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_32",
            "tgt_ix": "5-1005_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_32",
            "tgt_ix": "5-1005_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_33@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_33@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_33@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_33@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_33@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_33@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_33",
            "tgt_ix": "5-1005_v2_33@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_34",
            "tgt_ix": "5-1005_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_34",
            "tgt_ix": "5-1005_v2_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_34",
            "tgt_ix": "5-1005_v2_34@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_34",
            "tgt_ix": "5-1005_v2_34@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_34",
            "tgt_ix": "5-1005_v2_34@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_35",
            "tgt_ix": "5-1005_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_37",
            "tgt_ix": "5-1005_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_39",
            "tgt_ix": "5-1005_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_39",
            "tgt_ix": "5-1005_v2_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_39",
            "tgt_ix": "5-1005_v2_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_39",
            "tgt_ix": "5-1005_v2_39@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_39",
            "tgt_ix": "5-1005_v2_39@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_40",
            "tgt_ix": "5-1005_v2_40@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_41",
            "tgt_ix": "5-1005_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_43",
            "tgt_ix": "5-1005_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_45",
            "tgt_ix": "5-1005_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_46",
            "tgt_ix": "5-1005_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_46",
            "tgt_ix": "5-1005_v2_46@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_46",
            "tgt_ix": "5-1005_v2_46@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_48",
            "tgt_ix": "5-1005_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_49",
            "tgt_ix": "5-1005_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_50",
            "tgt_ix": "5-1005_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_51",
            "tgt_ix": "5-1005_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_52",
            "tgt_ix": "5-1005_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_53",
            "tgt_ix": "5-1005_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_54",
            "tgt_ix": "5-1005_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_55",
            "tgt_ix": "5-1005_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_56",
            "tgt_ix": "5-1005_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_57",
            "tgt_ix": "5-1005_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_58",
            "tgt_ix": "5-1005_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_59",
            "tgt_ix": "5-1005_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_60",
            "tgt_ix": "5-1005_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_61",
            "tgt_ix": "5-1005_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_62",
            "tgt_ix": "5-1005_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_63",
            "tgt_ix": "5-1005_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_64",
            "tgt_ix": "5-1005_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_65",
            "tgt_ix": "5-1005_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_66",
            "tgt_ix": "5-1005_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_67",
            "tgt_ix": "5-1005_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_68",
            "tgt_ix": "5-1005_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_69",
            "tgt_ix": "5-1005_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_70",
            "tgt_ix": "5-1005_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_71",
            "tgt_ix": "5-1005_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_72",
            "tgt_ix": "5-1005_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_73",
            "tgt_ix": "5-1005_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_74",
            "tgt_ix": "5-1005_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_75",
            "tgt_ix": "5-1005_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_76",
            "tgt_ix": "5-1005_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_77",
            "tgt_ix": "5-1005_v2_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_78",
            "tgt_ix": "5-1005_v2_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_79",
            "tgt_ix": "5-1005_v2_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_80",
            "tgt_ix": "5-1005_v2_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_81",
            "tgt_ix": "5-1005_v2_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1005_v2_82",
            "tgt_ix": "5-1005_v2_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "5-1005_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.8724.2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Identification of selective inhibitors of RET and comparison with current clinical candidates through development and validation of a robust screening cascade",
        "abstract": "RET (REarranged during Transfection) is a receptor tyrosine kinase, which plays pivotal roles in regulating cell survival, differentiation, proliferation, migration and chemotaxis. Activation of RET is a mechanism of oncogenesis in medullary thyroid carcinomas where both germline and sporadic activating somatic mutations are prevalent. At present, there are no known specific RET inhibitors in clinical development, although many potent inhibitors of RET have been opportunistically identified through selectivity profiling of compounds initially designed to target other tyrosine kinases. Vandetanib and cabozantinib, both multi-kinase inhibitors with RET activity, are approved for use in medullary thyroid carcinoma, but additional pharmacological activities, most notably inhibition of vascular endothelial growth factor - VEGFR2 (KDR), lead to dose-limiting toxicity. The recent identification of RET fusions present in ~1% of lung adenocarcinoma patients has renewed interest in the identification and development of more selective RET inhibitors lacking the toxicities associated with the current treatments. In an earlier publication [Newton et al , 2016; 1] we reported the discovery of a series of 2-substituted phenol quinazolines as potent and selective RET kinase inhibitors. Here we describe the development of the robust screening cascade which allowed the identification and advancement of this chemical series. Furthermore we have profiled a panel of RET-active clinical compounds both to validate the cascade and to confirm that none display a RET-selective target profile.",
        "contributors": [
            {
                "surname": "Watson",
                "given-names": "Amanda J."
            },
            {
                "surname": "Hopkins",
                "given-names": "Gemma V."
            },
            {
                "surname": "Hitchin",
                "given-names": "Samantha"
            },
            {
                "surname": "Begum",
                "given-names": "Habiba"
            },
            {
                "surname": "Jones",
                "given-names": "Stuart"
            },
            {
                "surname": "Jordan",
                "given-names": "Allan"
            },
            {
                "surname": "Holt",
                "given-names": "Sarah"
            },
            {
                "surname": "March",
                "given-names": "H. Nikki"
            },
            {
                "surname": "Newton",
                "given-names": "Rebecca"
            },
            {
                "surname": "Small",
                "given-names": "Helen"
            },
            {
                "surname": "Stowell",
                "given-names": "Alex"
            },
            {
                "surname": "Waddell",
                "given-names": "Ian D."
            },
            {
                "surname": "Waszkowycz",
                "given-names": "Bohdan"
            },
            {
                "surname": "Ogilvie",
                "given-names": "Donald J."
            }
        ],
        "url": "https://f1000research.com/articles/5-1005/v2/",
        "doc_id": "5-1005",
        "version": 2,
        "ix_counter": 362,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}