{
    "nodes": [
        {
            "ix": "1-12_v2_0",
            "content": "Diversion at the ER: How Plasmodium falciparum exports proteins into host erythrocytes",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_2",
            "content": "Malaria is caused by parasites which live in host erythrocytes and remodel these cells to provide optimally for the parasites’ needs by exporting effector proteins into the host cells. Eight years ago the discovery of a host cell targeting sequence present in both soluble and transmembrane P. falciparum exported proteins generated a starting point for investigating the mechanism of parasite protein transport into infected erythrocytes. Since then many confusing facts about this targeting signal have emerged. In this paper, I try to make sense of them.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_3",
            "content": "The problem",
            "ntype": "title",
            "meta": {
                "section": "1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_4",
            "content": "P. falciparum infects erythrocytes and causes malaria in humans. The parasite resides intracellularly in a parasitophorous vacuole (PV), and exports proteins into the erythrocyte that are important for parasite survival ( Figure 1 ) <REF-1> , <REF-2> . The identification of a host cell targeting signal in exported P. falciparum proteins was an important first step towards understanding the export mechanism, but left cell biologists puzzled: Marti et al. (2004) and Hiller and colleagues (2004) identified a short sequence, RxLxE/Q, which is present in many proteins in the P. falciparum genome known to be exported from the parasite into the erythrocyte <REF-3> , <REF-4> . This P. falciparum protein export element (PEXEL) was found by both groups to be necessary and sufficient for protein export into the host cell <REF-3> , <REF-4> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_5",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "The problem. P. falciparum (blue) resides in red blood cells (pale orange) inside a parasitophorous vacuole (white). In order to survive, P. falciparum needs to export numerous proteins into the red blood cell, which remodel the host cell to suit the purposes of the parasite. The mechanism by which these proteins are exported is still unclear (Figure modified from Römisch, 2005) <REF-6> .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/551/acf45aaa-8f08-4622-85f7-ee1da1043676_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_6",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>The problem.</title> <p> <italic>P. falciparum</italic> (blue) resides in red blood cells (pale orange) inside a parasitophorous vacuole (white). In order to survive, <italic>P. falciparum</italic> needs to export numerous proteins into the red blood cell, which remodel the host cell to suit the purposes of the parasite. The mechanism by which these proteins are exported is still unclear (Figure modified from R&#246;misch, 2005) <sup> <xref ref-type=\"bibr\" rid=\"ref-6\">6</xref> </sup>.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/551/acf45aaa-8f08-4622-85f7-ee1da1043676_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "The problem. P. falciparum (blue) resides in red blood cells (pale orange) inside a parasitophorous vacuole (white). In order to survive, P. falciparum needs to export numerous proteins into the red blood cell, which remodel the host cell to suit the purposes of the parasite. The mechanism by which these proteins are exported is still unclear (Figure modified from Römisch, 2005) <REF-6> .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/551/acf45aaa-8f08-4622-85f7-ee1da1043676_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_7",
            "content": "What remains unclear to date is the mechanism by which an export signal present in both soluble and transmembrane proteins can mediate transport of both types of protein into the erythrocyte. This issue was debated hotly, but our ideas at the time were limited, because they were solely based on the classical secretory pathway in mammalian cells <REF-5> – <REF-7> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_8",
            "content": "The fact(or)s",
            "ntype": "title",
            "meta": {
                "section": "2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_9",
            "content": "Since then, a lot more data related to the PEXEL sequence have been generated, but rather than clarify they seem to confuse the issue further. Meanwhile it has been shown that:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_10",
            "content": "- The secretory signal peptides of the exported soluble proteins, which are located 20–40 amino acids upstream of the host cell targeting signals, are not cleaved upon endoplasmic reticulum (ER) targeting <REF-8> , <REF-9> .\n- The host cell targeting signal is cleaved and the new N-terminus is N-acetylated at the ER membrane <REF-9> – <REF-11> .\n- The protease responsible for the cleavage has been identified <REF-9> – <REF-12> .\n- Cleavage by this protease is a prerequisite for transport into the erythrocyte <REF-9> , <REF-10> ; if you generate the cleaved N-terminus by modifying the gene and combine it with a cleavable signal peptide, the resulting protein is secreted into the PV and remains there <REF-9> .\n- The uncleaved targeting signal binds PI3P at the ER membrane with the same specificity required for protease cleavage and host cell targeting; the cleaved signal no longer binds PI3P <REF-13> .\n- A putative 'translocator' complex resides in the PV membrane (PVM); it consists of 5 proteins that coprecipitate some of the proteins bearing a host cell targeting signal, but a function of the complex has not been demonstrated in any way, nor has it been investigated whether the association of the complex and the PEXEL proteins is mediated by the PEXEL signal <REF-14> , <REF-15> .",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_11",
            "content": "The hypothesis",
            "ntype": "title",
            "meta": {
                "section": "3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_12",
            "content": "The authors of the respective papers assume that proteolytic cleavage, N-acetylation, and PI3P binding take place in the ER lumen ( Figure 2A ) <REF-9> , <REF-10> , <REF-13> . This cannot be right: N-acetylation is a cytosolic modification, based on the biochemical and sequence data characterizing the protease plasmepsin V, its active site is almost certainly on the cytoplasmic face of the membrane, and the only possible location for PI3P at the ER membrane is in the cytosolic leaflet. In detail:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_13",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "A ) The hypothesis. Most proteins targeted for export into the host cell have a signal sequence (yellow) or transmembrane domain, which leads to their SRP-mediated targeting to the protein translocation channel (Sec61) in the ER membrane of the parasite (1). Many but not all of the P. falciparum exported proteins have an N-terminal extension (red zigzag) whose function is unknown. In addition, host cell targeted proteins contain, in a distance of 20–40 amino acids from the signal peptide, a PEXEL sequence (RxLxE), which is also required for binding to phosphoinositol-3-phosphate (PI3P; orange balls) and for cleavage by the ER-membrane associated protease plasmepsin V (PM5). The current hypothesis in the field is that, after signal-peptide mediated translocation into the ER lumen, the PEXEL sequence binds to PI3P in the lumenal face of the ER membrane and is cleaved by PM5 (2). The cleaved protein is released from PM5 (3) and continues through the P. falciparum secretory pathway by vesicular transport (4). Note that this model cannot explain the NatD-mediated N-acetylation of the PM5-cleaved N-terminus, because NatD resides in the cytosplasm. B ) The alternative . After SRP-mediated targeting of the protein destined for export to the parasite ER (1) and insertion into the Sec61 channel, the N-terminal extension of the signal peptide (red zigzag) delays signal cleavage, perhaps by preventing reorientation of the signal peptide in the Sec61 channel. This delay in completing translocation allows the RxLxE sequence to bind to PI3P (orange balls) on the cytoplasmic face of the ER membrane, which creates a recognition signal for PM5 and results in proteolytic cleavage (2). Cleavage releases the protein from the translocation machinery and allows N-acetylation by NatD (3). The mature protein is handed over to a PI3P-associated putative transmembrane receptor (R; 4), which may itself be a PEXEL protein.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/551/acf45aaa-8f08-4622-85f7-ee1da1043676_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_14",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <p> <bold>A</bold>) <bold>The hypothesis.</bold> Most proteins targeted for export into the host cell have a signal sequence (yellow) or transmembrane domain, which leads to their SRP-mediated targeting to the protein translocation channel (Sec61) in the ER membrane of the parasite (1). Many but not all of the <italic>P. falciparum</italic> exported proteins have an N-terminal extension (red zigzag) whose function is unknown. In addition, host cell targeted proteins contain, in a distance of 20&#8211;40 amino acids from the signal peptide, a PEXEL sequence (RxLxE), which is also required for binding to phosphoinositol-3-phosphate (PI3P; orange balls) and for cleavage by the ER-membrane associated protease plasmepsin V (PM5). The current hypothesis in the field is that, after signal-peptide mediated translocation into the ER lumen, the PEXEL sequence binds to PI3P in the lumenal face of the ER membrane and is cleaved by PM5 (2). The cleaved protein is released from PM5 (3) and continues through the <italic>P. falciparum</italic> secretory pathway by vesicular transport (4). Note that this model cannot explain the NatD-mediated N-acetylation of the PM5-cleaved N-terminus, because NatD resides in the cytosplasm. <bold>B</bold>) <bold>The alternative</bold>. After SRP-mediated targeting of the protein destined for export to the parasite ER (1) and insertion into the Sec61 channel, the N-terminal extension of the signal peptide (red zigzag) delays signal cleavage, perhaps by preventing reorientation of the signal peptide in the Sec61 channel. This delay in completing translocation allows the RxLxE sequence to bind to PI3P (orange balls) on the cytoplasmic face of the ER membrane, which creates a recognition signal for PM5 and results in proteolytic cleavage (2). Cleavage releases the protein from the translocation machinery and allows N-acetylation by NatD (3). The mature protein is handed over to a PI3P-associated putative transmembrane receptor (R; 4), which may itself be a PEXEL protein.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/551/acf45aaa-8f08-4622-85f7-ee1da1043676_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "A ) The hypothesis. Most proteins targeted for export into the host cell have a signal sequence (yellow) or transmembrane domain, which leads to their SRP-mediated targeting to the protein translocation channel (Sec61) in the ER membrane of the parasite (1). Many but not all of the P. falciparum exported proteins have an N-terminal extension (red zigzag) whose function is unknown. In addition, host cell targeted proteins contain, in a distance of 20–40 amino acids from the signal peptide, a PEXEL sequence (RxLxE), which is also required for binding to phosphoinositol-3-phosphate (PI3P; orange balls) and for cleavage by the ER-membrane associated protease plasmepsin V (PM5). The current hypothesis in the field is that, after signal-peptide mediated translocation into the ER lumen, the PEXEL sequence binds to PI3P in the lumenal face of the ER membrane and is cleaved by PM5 (2). The cleaved protein is released from PM5 (3) and continues through the P. falciparum secretory pathway by vesicular transport (4). Note that this model cannot explain the NatD-mediated N-acetylation of the PM5-cleaved N-terminus, because NatD resides in the cytosplasm. B ) The alternative . After SRP-mediated targeting of the protein destined for export to the parasite ER (1) and insertion into the Sec61 channel, the N-terminal extension of the signal peptide (red zigzag) delays signal cleavage, perhaps by preventing reorientation of the signal peptide in the Sec61 channel. This delay in completing translocation allows the RxLxE sequence to bind to PI3P (orange balls) on the cytoplasmic face of the ER membrane, which creates a recognition signal for PM5 and results in proteolytic cleavage (2). Cleavage releases the protein from the translocation machinery and allows N-acetylation by NatD (3). The mature protein is handed over to a PI3P-associated putative transmembrane receptor (R; 4), which may itself be a PEXEL protein.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/551/acf45aaa-8f08-4622-85f7-ee1da1043676_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_15",
            "content": "All known enzyme complexes mediating N-acetylation including NatD, which is likely responsible for the N-acetylation of proteolytically cleaved PEXEL proteins, are located in the cytosol <REF-16> . The presence of a secretory signal sequence indeed strongly reduces the likelihood of proteins being N-acetylated, confirming that N-acetylation does not take place inside compartments of the secretory pathway <REF-17> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_16",
            "content": "In the initial characterization of plasmepsin V, Klemba & Goldberg (2005) <REF-12> found a hydrophobic region at the N-terminus, which they described as a putative signal sequence. There is no discernible signal peptidase cleavage site C-terminal of this hydrophobic region and indeed Klemba and Goldberg did not observe processing of the N-terminus of plasmepsin V in pulse-chase experiment. Russo and colleagues showed later (2010) <REF-10> that fusion of this region of plasmepsin V to a fluorescent reporter protein resulted in ring-shaped staining around the parasite cytoplasm indicative of location in the PV or at the parasite plasma membrane, and suggesting entry of the protein into the ER and transport to the cell surface. Since the N-terminal hydrophobic domain of plasmepsin V is not cleaved <REF-12> , it is likely a transmembrane signal anchor. Both TMHMM and TopPred predict it to insert into the ER membrane with the N-terminus in the lumen such that the subsequent soluble region containing the active site would be in the cytoplasm. In the same paper Russo and colleagues demonstrated that the C-terminal hydrophobic region of plasmepsin V was required for ER retention of the protein <REF-10> . Both Russo and colleagues and Klemba and Goldberg describe this region as a transmembrane domain, but Klemba and Goldberg show that 50% of plasmepsin V can be extracted from the membrane by carbonate, pH 11.0 <REF-12> . A standard feature of a transmembrane protein, however, is that it is resistant to carbonate extraction at pH 11.5 <REF-18> . Altogether these data suggest that plasmepsin V is tethered to the ER membrane by hydrophobic regions at both termini, and that its active site is in the cytoplasm.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_17",
            "content": "Localization of PI3P has been investigated in yeast and mammalian cells where it is found on early and late endosomes and transiently at the plasma membrane <REF-19> . PI3P is generated by PI3-kinases on the cytoplasmic leaflet of intracellular membranes and regulates membrane trafficking events <REF-20> . The localization of the kinase determines the localization of the PI3P patch <REF-20> . There are no PI3 kinases inside the secretory pathway. The only known example of PI3P occurring at the ER is during formation of autophagosomal membrane precursors, the so-called omegasomes <REF-21> . Even in this case, PI3P is generated by the Vps34 PI3-kinase in the cytoplasmic leaflet of the ER membrane <REF-22> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_18",
            "content": "The alternative",
            "ntype": "title",
            "meta": {
                "section": "4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_19",
            "content": "An alternative explanation for most of the available data is that their secretory signal peptides target PEXEL proteins to the P. falciparum ER, but are inefficiently cleaved - perhaps due to their long N-terminal extensions ( Figure 2B, (1) ). This is similar to the biogenesis of some autotransporters in pathogenic E. coli , where delayed signal peptide cleavage due to N-terminal signal peptide extension allows the passenger domain to remain unfolded in the periplasm while the porin domain assembles in the E. coli outer membrane <REF-23> . Stuck in the protein translocation channel in the P. falciparum ER membrane, the PEXEL protein in transit is oriented such that the host cell targeting signal can bind PI3P at the cytoplasmic face of the ER membrane ( Figure 2B, (2) ). Binding creates the cleavage site for the protease plasmepsin V ( Figure 2B, (2) ). This possibility has also been mentioned, but not been pursued experimentally, in Bhattacharjee et al. <REF-13> . After cleavage and N-acetylation ( Figure 2B, (3) ) the new N-terminus is not released, but the protein remains membrane-tethered or associated with a transmembrane protein ( Figure 2B, (4) ) until it reaches the cell surface from where it is transferred to the erythrocyte, perhaps by vesicular transport ( Figure 3 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_20",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "The way out. Cleaved N-acetylated PEXEL proteins (red triangles) associated with their receptor (black bar) could be transported to the cell surface in a complex (1) in one of two ways. Either the receptor/soluble protein complex remains associated with the PI3P patch (green) in the ER membrane. The patch and associated proteins are transported by vesicle budding (2A) and fusion through the parasite secretory pathway to the cell surface, where a further budding event (3A) liberates vesicles containing the PI3P patch and the PEXEL proteins. These vesicles then fuse with the PVM (4A). Alternatively, similar to the formation of omegasomes during autophagy, the PI3P patch may trigger the budding of processed PEXEL protein-containing vesicles into the ER (2B). PEXEL proteins would then be transported through the secretory pathway in double membrane vesicles (DMV), and released into the PV by fusion of the outer membrane with the parasite plasma membrane (3B). The released vesicle may then fuse with the PVM (4B) (Figure modified from Römisch, 2005) <REF-6> .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/551/acf45aaa-8f08-4622-85f7-ee1da1043676_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_21",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>The way out.</title> <p>Cleaved N-acetylated PEXEL proteins (red triangles) associated with their receptor (black bar) could be transported to the cell surface in a complex (1) in one of two ways. Either the receptor/soluble protein complex remains associated with the PI3P patch (green) in the ER membrane. The patch and associated proteins are transported by vesicle budding (2A) and fusion through the parasite secretory pathway to the cell surface, where a further budding event (3A) liberates vesicles containing the PI3P patch and the PEXEL proteins. These vesicles then fuse with the PVM (4A). Alternatively, similar to the formation of omegasomes during autophagy, the PI3P patch may trigger the budding of processed PEXEL protein-containing vesicles into the ER (2B). PEXEL proteins would then be transported through the secretory pathway in double membrane vesicles (DMV), and released into the PV by fusion of the outer membrane with the parasite plasma membrane (3B). The released vesicle may then fuse with the PVM (4B) (Figure modified from R&#246;misch, 2005) <sup> <xref ref-type=\"bibr\" rid=\"ref-6\">6</xref> </sup>.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/551/acf45aaa-8f08-4622-85f7-ee1da1043676_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "The way out. Cleaved N-acetylated PEXEL proteins (red triangles) associated with their receptor (black bar) could be transported to the cell surface in a complex (1) in one of two ways. Either the receptor/soluble protein complex remains associated with the PI3P patch (green) in the ER membrane. The patch and associated proteins are transported by vesicle budding (2A) and fusion through the parasite secretory pathway to the cell surface, where a further budding event (3A) liberates vesicles containing the PI3P patch and the PEXEL proteins. These vesicles then fuse with the PVM (4A). Alternatively, similar to the formation of omegasomes during autophagy, the PI3P patch may trigger the budding of processed PEXEL protein-containing vesicles into the ER (2B). PEXEL proteins would then be transported through the secretory pathway in double membrane vesicles (DMV), and released into the PV by fusion of the outer membrane with the parasite plasma membrane (3B). The released vesicle may then fuse with the PVM (4B) (Figure modified from Römisch, 2005) <REF-6> .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/551/acf45aaa-8f08-4622-85f7-ee1da1043676_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_22",
            "content": "Unusual biogenesis of a host cell targeted P. falciparum membrane protein has already been shown: the protein PfEMP-1 remains peripherally membrane-associated throughout the P. falciparum secretory pathway and only becomes transmembrane in the erythrocyte <REF-24> . But conventional transmembrane proteins, i.e. proteins that become membrane-integrated in the parasite ER membrane, with PEXEL signals also exist <REF-25> . The biogenesis of a soluble PEXEL protein has not been studied in similar detail to date.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_23",
            "content": "The key: PI3P in the ER",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_24",
            "content": "Recruitment of PEXEL proteins to specific locations within the ER membrane shows interesting parallels to autophagosomal membrane formation at the ER membrane <REF-21> , <REF-22> . As mentioned above, the only known example of PI3P occurring in ER membranes is during the induction of autophagosome formation <REF-22> . Here the Atg14L protein recruits the Vps34 PI3-kinase to the cytosolic face of ER membranes; during amino acid starvation this leads to the formation of membrane patches or bulges, which seem to be attached to the ER and contain PI3P <REF-21> , <REF-22> . These patches recruit proteins with PI3P-binding domains, promoting formation of so-called omegasomes, which are invaginations into the ER that ultimately lead to pinching off of a crescent-shaped membrane structure <REF-21> , <REF-22> . The mechanism responsible for omegasome formation is not understood <REF-21> , <REF-22> , <REF-26> . In order to be recruited to the right place, the proteins binding to PI3P at the cytosolic face of the ER membrane have to contain, in addition to their PI3P-binding domains, a not yet characterized ER-targeting signal <REF-21> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_25",
            "content": "So maybe during erythrocyte invasion, which is controlled by IP3 signalling and calcium release from the ER <REF-27> , a PI3-kinase is recruited to or activated at the P. falciparum ER. This PI3-kinase generates PI3P in patches localized in the cytoplasmic leaflet of the ER membrane in proximity to the protein translocation channel (Sec61 channel) or the SRP receptor ( Figure 2B ). The signal peptide of soluble PEXEL proteins promotes their targeting to the ER membrane where the signal peptide inserts into the Sec61 channel ( Figure 2B ). The as yet unexplained long N-terminal extensions of many of the PEXEL protein signal peptides may lead to their inefficient cleavage by signal peptidase in the ER lumen, similar to delayed signal sequence cleavage in bacterial autotransporters with long N-terminal extensions <REF-23> . Delayed cleavage may be caused by the extension preventing reorientation to an N-cytoplasmic/C-lumenal topology in the protein translocation channel as shown in Figure 2B <REF-28> . Alternatively, the N-terminal signal peptide extension may interact with a cytoplasmic domain of the Sec61 channel, which in turn may interfere with signal peptidase access to the cleavage site in the ER lumen (topology shown in Figure 2A ). At least some of the N-terminal hydrophobic regions of PEXEL proteins also simply do not contain signal peptidase cleavage sites <REF-6> . Delayed signal cleavage will lead to prolonged residence of the nascent PEXEL protein in the Sec61 channel, which in turn would allow interaction of the still cytosolic PEXEL signal with PI3P in the cytosolic leaflet of the ER membrane ( Figure 2B ). This interaction keeps the protein from entering the ER and thus the conventional secretory pathway. It may also generate a protein conformation recognized by the cytosolically located active site of plasmepsin V and result in cleavage of the PEXEL signal, which liberates the protein from the Sec61 channel, and aborts translocation into the ER ( Figure 2B ). Plasmepsin V might itself be a PI3P-binding protein, or interact with the Sec61 channel. After cleavage the cytosolic NatD complex would acetylate the new N-terminus ( Figure 2B ). Importantly, the interaction of the PEXEL protein with plasmepsin V leads to a handing over of the cleaved protein to a receptor protein (or complex) in the PI3P-patch ( Figure 2B ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_26",
            "content": "Transmembrane PEXEL proteins are similarly targeted to the Sec61 channel in the ER membrane, but released laterally into the lipid bilayer which allows their cytosolically exposed PEXEL sequence to bind to PI3P and be recruited into the patch ( Figure 2B ). In this case the topology of the PEXEL/PI3P interaction may prevent cleavage by plasmepsin V. That transmembrane proteins can be recruited to PI3P in the ER membrane has also been shown during autophagosomal membrane formation at the ER <REF-21> . One or more of the transmembrane PEXEL proteins may form the receptor in the PI3P patch for soluble plasmepsin V-cleaved PEXEL proteins ( Figure 2B ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_27",
            "content": "The way out",
            "ntype": "title",
            "meta": {
                "section": "6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_28",
            "content": "One option is that the PI3P patches and their associated proteins are simply packaged into a specific subset of ER-to-Golgi transport vesicles, and are then transported through the secretory pathway by a series of vesicle budding and fusion events ( Figure 3 , pathway A). After transport vesicle fusion at the plasma membrane, the plasma membrane then could either bud vesicles outwardly that subsequently fuse with the PVM ( Figure 3 ), or there might be a transient fusion of parasite plasma membrane and PVM to transmit the proteins perhaps by interaction of the PI3P patch with a receptor in the PVM ( Figure 3 ). Release of soluble proteins from the PI3P patch might be triggered by different (ion etc.) conditions in the erythrocyte cytosol. Membrane proteins would be transported by vesicular transport from the PVM to Maurer's clefts where their release from the PI3P patches could be triggered by a PI3P-phosphatase.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_29",
            "content": "Alternatively, similar to what has been observed during autophagosomal membrane formation at the ER, the recruitment of specific proteins to the PI3P patch may lead to an invagination of the ER membrane, resulting in vesicles inside the ER containing the PEXEL proteins ( Figure 3 , pathway B). These proteins could then be transported through the secretory pathway as double membrane vesicles (DMVs) whose outer layer would ultimately fuse with the parasite plasma membrane ( Figure 3, 3B ). DMVs have been detected in electron micrographs of P. falciparum , and fusion with the parasite plasma membrane and vesicle release into the PV have been reported <REF-5> . The released vesicles might subsequently be able to fuse with the PVM ( Figure 3, 4B ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_30",
            "content": "Either of the transport pathways depicted in Figure 3 would satisfy the Brefeldin A sensitivity of (at least some) protein transport into the erythrocyte <REF-29> , <REF-30> . Either would explain how soluble and transmembrane proteins can be targeted into the host cell using the same signal <REF-3> , <REF-4> . Both scenarios could also explain how proteins without a PEXEL signal or proteins without a signal sequence or transmembrane domain could end up in the erythrocyte: these proteins could be packaged into the PEXEL-protein containing vesicles by interaction with these on the cytoplasmic face of the ER membrane <REF-6> , <REF-31> . Both hypotheses could also explain how the PEXEL signal leads to targeting to the erythrocyte even though the signal itself is cleaved already at the parasite ER <REF-13> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_31",
            "content": "If the key decision - entry into the conventional secretory pathway or entry into a distinct export pathway that ultimately leads to arrival in the erythrocyte - is already made during PEXEL protein biogenesis at the parasite ER, this would explain why a protein that has been engineered to contain a conventional signal peptide and an N-terminus equivalent to the cleaved PEXEL signal ends up in the PV, not in the erythrocyte <REF-9> . The construct with the conventional signal peptide is fully translocated into the secretory pathway, and hence separated from the PI3P patch-associated PEXEL proteins ( Figure 2B ). It will therefore, like conventional secretory proteins, follow the classical secretory pathway and be secreted into the PV, from which there seems to be no direct access into the erythrocyte.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_32",
            "content": "That this is true is also confirmed by a carefully done set of experiments by Gehde and colleagues (2008) <REF-32> . The authors aimed to investigate whether protein folding has an effect on PEXEL protein access to the erythrocyte. They generated fusion proteins that contained the signal peptide and PEXEL region from either the transmembrane protein STEVOR or the soluble protein GBP130 fused to dihydrofolate reductase (DHFR), followed by green fluorescent protein (GFP) and expressed these fusion proteins in P. falciparum . They found that in the absence of folate analogues (which promote DHFR folding) these constructs were targeted to the erythrocyte. In the presence of folate analogues, the constructs were found in the PV. Strikingly, only newly synthesized proteins could be transported into the erythrocyte, i.e. it was impossible to chase pre-existing fusion proteins from the PV into the erythrocyte after washout of the folate analogue. The authors' interpretation of the data was that proteins must be unfolded in order to be transported across the PVM into the erythrocyte, that the PVM therefore contained a protein-conducting channel with similar requirements for transport as the Sec61 channel in the ER membrane, and that the time window after synthesis during which proteins were transport-competent was limited.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_33",
            "content": "The scenario depicted in Figure 2B suggests a different interpretation of the data. Immediately after targeting of a PEXEL protein to the Sec61 channel in the ER membrane, there is a competition between full translocation of the fusion protein into the ER lumen and binding of the PEXEL region to PI3P on the cytoplasmic leaflet of the ER membrane, which ultimately leads to an abortion of translocation. At this stage the signal peptide and PEXEL regions of the fusion protein are already synthesized, but the ribosome is still associated with the nascent chain and protein synthesis is still going on (between step 1 and step 2 in Figure 2B , not shown). When the DHFR part of the protein emerges from the ribosome, it is initially located in the ER lumen. In the absence of the folate analogue, the DHFR chain remains sufficiently flexible for the PEXEL signal to interact with PI3P, plasmepsin V cleavage occurs, and translocation is aborted; as a result the fusion protein remains in the cytosol associated with the PI3P patch as in Figure 2B . In the presence of a folate analogue, DHFR will fold tightly in the ER lumen during its synthesis and this will interfere with or override the interaction of PEXEL with PI3P in the cytoplasm. As a result the fusion protein will be fully translocated and end up inside the secretory pathway. That folding accelerates translocation into the ER has been shown <REF-33> . If protein folding in the ER lumen and PI3P-binding at the cytoplasmic leaflet of the ER membrane interfere with each other this might also explain why some of the PEXEL proteins contain large intrinsically unstructured regions <REF-34> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_34",
            "content": "On the whole the model depicted in Figure 2B and Figure 3 makes sense of the vast majority of the available data on trafficking of proteins from P. falciparum into the host cell and suggests that the decision of where to go is made early during biogenesis of exported proteins at the parasite ER membrane. My hypothesis has a number of easily testable elements that might give the research in this field the appropriate direction for a full understanding of the mechanism of protein export from P. falciparum into the erythrocyte.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_35",
            "content": "<REF-1> Maier AG Cooke BM Cowman AF : Malaria parasite proteins that remodel the host erythrocyte. Nat Rev Microbiol. 2009 ; 7 ( 5 ): 341 – 354 . 19369950 10.1038/nrmicro2110",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_36",
            "content": "<REF-2> Goldberg DE Cowman AF : Moving in and renovating: exporting proteins from Plasmodium into host erythrocytes. Nat Rev Microbiol. 2010 ; 8 ( 9 ): 617 – 621 . 20706280 10.1038/nrmicro2420",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_37",
            "content": "<REF-3> Marti M Good RT Rug M : Targeting malaria virulence and remodeling proteins to the host erythrocyte. Science. 2004 ; 306 ( 5703 ): 1930 – 1933 . 15591202 10.1126/science.1102452",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_38",
            "content": "<REF-4> Hiller NL Bhattacharjee S van Ooij C : A host-targeting signal in virulence proteins reveals a secretome in malarial infection. Science. 2004 ; 306 ( 5703 ): 1934 – 1937 . 15591203 10.1126/science.1102737",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_39",
            "content": "<REF-5> Cooke BM Lingelbach K Bannister LH : Protein trafficking in Plasmodium falciparum -infected red blood cells. Trends Parasitol. 2004 ; 20 ( 12 ): 581 – 589 . 15522668 10.1016/j.pt.2004.09.008",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_40",
            "content": "<REF-6> Römisch K : Protein targeting from malaria parasites to host erythrocytes. Traffic. 2005 ; 6 ( 8 ): 706 – 709 . 15998325 10.1111/j.1600-0854.2005.00310.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_41",
            "content": "<REF-7> Lingelbach K Przyborski JM : The long and winding road: Protein trafficking mechanisms in the Plasmodium falciparum infected erythrocyte. Mol Biochem Parasitol. 2006 ; 147 ( 1 ): 1 – 8 . 16540187 10.1016/j.molbiopara.2006.01.014",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_42",
            "content": "<REF-9> Boddey JA Hodder AN Günther S : An aspartyl protease directs malaria effector proteins to the host cell. Nature. 2010 ; 463 ( 7281 ): 627 – 631 . 20130643 10.1038/nature08728 2818761",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_43",
            "content": "<REF-10> Russo I Babbit S Muralidharan V : Plasmepsin V licenses Plasmodium proteins for export into the host erythrocyte. Nature. 2010 ; 463 ( 7281 ): 632 – 636 . 20130644 10.1038/nature08726 2826791",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_44",
            "content": "<REF-12> Klemba M Goldberg DE : Characterization of plasmepsin V, a membrane-bound aspartic protease homolog in the endoplasmic reticulum of Plasmodium falciparum. Mol Biochem Parasitol. 2005 ; 143 ( 2 ): 183 – 191 . 16024107 10.1016/j.molbiopara.2005.05.015",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_45",
            "content": "<REF-13> Bhattacharjee S Stahelin RV Speicher KD : Endoplasmic reticulum PI(3)P lipid binding targets malaria proteins to the host cell. Cell. 2012 ; 148 ( 1–2 ): 201 – 212 . 22265412 10.1016/j.cell.2011.10.051 3268671",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_46",
            "content": "<REF-16> Arnesen T : Towards a functional understanding of protein N-Terminal Acetylation. PLoS Biol. 2011 ; 9 ( 5 ): e1001074 . 21655309 10.1371/journal.pbio.1001074 3104970",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_47",
            "content": "<REF-17> Forte GM Pool MR Stirling CJ : N-Terminal acetylation inhibits protein targeting to the endoplasmic reticulum. PLoS Biol. 2011 ; 9 ( 5 ): e1001073 . 21655302 10.1371/journal.pbio.1001073 3104963",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_48",
            "content": "<REF-18> Fujiki Y Hubbard AL Fowler S : Isolation of intracellular membranes by means of sodium carbonate treatment: application to endoplasmic reticulum. J Cell Biol. 1982 ; 93 ( 1 ): 97 – 102 . 7068762 10.1083/jcb.93.1.97 2112113",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_49",
            "content": "<REF-19> Gillooly DJ Morrow IC Lindsay M : Localization of phosphatidylinositol 3-phosphate in yeast and mammalian cells. EMBO J. 2000 ; 19 ( 17 ): 4577 – 4588 . 10970851 10.1093/emboj/19.17.4577 302054",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_50",
            "content": "<REF-20> Lindmo K Stenmark H : Regulation of membrane traffic by phosphoinositide 3-kinases. J Cell Sci. 2006 ; 119 ( Pt 4 ): 605 – 614 . 16467569 10.1242/jcs.02855",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_51",
            "content": "<REF-21> Axe EL Walker SA Manigava M : Autophagosome formation from membrane compartments enriched in phosphatidylinositol 3-phosphate and dynamically connected to the endoplasmic reticulum. J Cell Biol. 2008 ; 182 ( 4 ): 685 – 701 . 18725538 10.1083/jcb.200803137 2518708",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_52",
            "content": "<REF-22> Matsunaga K Morita E Saitoh T : Autophagy requires endoplasmic reticulum targeting of the PI3-kinase complex via Atg14L. J Cell Biol. 2010 ; 190 ( 4 ): 511 – 521 . 20713597 10.1083/jcb.200911141 2928018",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_53",
            "content": "<REF-23> Dautin N Bernstein HD : Protein secretion in gram-negative bacteria via the autotransporter pathway. Annu Rev Microbiol. 2007 ; 61 : 89 – 112 . 17506669 10.1146/annurev.micro.61.080706.093233",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_54",
            "content": "<REF-24> Papakrivos J Newbold CI Lingelbach K : A potential novel mechanism for the insertion of a membrane protein revealed by a biochemical analysis of the Plasmodium falciparum cytoadherence molecule PfEMP-1. Mol Microbiol. 2005 ; 55 ( 4 ): 1272 – 1284 . 15686570 10.1111/j.1365-2958.2004.04468.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_55",
            "content": "<REF-25> Przyborski JM Miller SK Pfahler JM : Trafficking of STEVOR to the Maurer’s clefts in Plasmodium falciparum -infected erythrocytes. EMBO J. 2005 ; 24 ( 13 ): 2306 – 17 . 15961998 10.1038/sj.emboj.7600720 1173160",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_56",
            "content": "<REF-26> Simonsen A Stenmark H : Self-eating from an ER-associated cup. J Cell Biol. 2008 ; 182 ( 4 ): 621 – 622 . 18725534 10.1083/jcb.200807061 2518700",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_57",
            "content": "<REF-27> Gaur D Chitnis CE : Molecular interactions and signaling mechanisms during erythrocyte invasion by malaria parasites. Curr Opinion Microbiol. 2011 ; 14 ( 4 ): 422 – 428 . 21803641 10.1016/j.mib.2011.07.018",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_58",
            "content": "<REF-28> Goder V Spiess M : Molecular mechanism of signal sequence orientation in the endoplasmic reticulum. EMBO J. 2003 ; 22 ( 14 ): 3645 – 3653 . 12853479 10.1093/emboj/cdg361 165631",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_59",
            "content": "<REF-29> Benting J Mattei D Lingelbach K : Brefeldin A inhibits transport of the glycophorin-binding protein from Plasmodium falciparum into the host erythrocyte. Biochem J. 1994 ; 300 ( Pt 3 ): 821 – 826 . 8010965 1138239",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_60",
            "content": "<REF-30> Wickham ME Rug M Ralph SA : Trafficking and assembly of the cytoadherence complex in Plasmodium falciparum -infected human erythrocytes. EMBO J. 2001 ; 20 ( 20 ): 5636 – 5649 . 11598007 10.1093/emboj/20.20.5636 125667",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_61",
            "content": "<REF-31> Spielmann T Gilberger TW : Protein export in malaria parasites: do multiple export motifs add up to multiple export pathways? Trends Parasitol. 2010 ; 26 ( 1 ): 6 – 10 . 19879191 10.1016/j.pt.2009.10.001",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_62",
            "content": "<REF-32> Gehde N Hinrichs C Montilla I : Protein unfolding is an essential requirement for transport across the parasitophorous vacuolar membrane of Plasmodium falciparum . Mol Microbiol. 2009 ; 71 ( 3 ): 613 – 28 . 19040635 10.1111/j.1365-2958.2008.06552.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_63",
            "content": "<REF-33> Scheper W Thaminy S Kais S : Coordination of N -glycosylation and protein translocation across the Endoplasmic Reticulum membrane by Sss1 protein. J Biol Chem. 2003 ; 278 ( 39 ): 37998 – 38003 . 12860997 10.1074/jbc.M300176200",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-12_v2_64",
            "content": "<REF-34> Feng ZP Zhang X Han P : Abundance of intrinsically unstructured proteins in P. falciparum and other apicomplexan parasite proteomes. Mol Biochem Parasitol. 2006 ; 150 ( 2 ): 256 – 267 . 17010454 10.1016/j.molbiopara.2006.08.011",
            "ntype": "ref",
            "meta": {
                "id": "ref-34",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "1-12_v2_0@0",
            "content": "Diversion at the ER: How Plasmodium falciparum exports proteins into host erythrocytes",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_0",
            "start": 0,
            "end": 85,
            "label": {}
        },
        {
            "ix": "1-12_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "1-12_v2_2@0",
            "content": "Malaria is caused by parasites which live in host erythrocytes and remodel these cells to provide optimally for the parasites’ needs by exporting effector proteins into the host cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_2",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "1-12_v2_2@1",
            "content": "Eight years ago the discovery of a host cell targeting sequence present in both soluble and transmembrane P. falciparum exported proteins generated a starting point for investigating the mechanism of parasite protein transport into infected erythrocytes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_2",
            "start": 185,
            "end": 438,
            "label": {}
        },
        {
            "ix": "1-12_v2_2@2",
            "content": "Since then many confusing facts about this targeting signal have emerged.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_2",
            "start": 440,
            "end": 512,
            "label": {}
        },
        {
            "ix": "1-12_v2_2@3",
            "content": "In this paper, I try to make sense of them.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_2",
            "start": 514,
            "end": 556,
            "label": {}
        },
        {
            "ix": "1-12_v2_3@0",
            "content": "The problem",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_3",
            "start": 0,
            "end": 10,
            "label": {}
        },
        {
            "ix": "1-12_v2_4@0",
            "content": "P. falciparum infects erythrocytes and causes malaria in humans.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_4",
            "start": 0,
            "end": 63,
            "label": {}
        },
        {
            "ix": "1-12_v2_4@1",
            "content": "The parasite resides intracellularly in a parasitophorous vacuole (PV), and exports proteins into the erythrocyte that are important for parasite survival ( Figure 1 ) <REF-1> , <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_4",
            "start": 65,
            "end": 251,
            "label": {}
        },
        {
            "ix": "1-12_v2_4@2",
            "content": "The identification of a host cell targeting signal in exported P. falciparum proteins was an important first step towards understanding the export mechanism, but left cell biologists puzzled: Marti et al. (2004) and Hiller and colleagues (2004) identified a short sequence, RxLxE/Q, which is present in many proteins in the P. falciparum genome known to be exported from the parasite into the erythrocyte <REF-3> , <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_4",
            "start": 253,
            "end": 676,
            "label": {}
        },
        {
            "ix": "1-12_v2_4@3",
            "content": "This P. falciparum protein export element (PEXEL) was found by both groups to be necessary and sufficient for protein export into the host cell <REF-3> , <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_4",
            "start": 678,
            "end": 840,
            "label": {}
        },
        {
            "ix": "1-12_v2_5@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_5",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "1-12_v2_7@0",
            "content": "What remains unclear to date is the mechanism by which an export signal present in both soluble and transmembrane proteins can mediate transport of both types of protein into the erythrocyte.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_7",
            "start": 0,
            "end": 190,
            "label": {}
        },
        {
            "ix": "1-12_v2_7@1",
            "content": "This issue was debated hotly, but our ideas at the time were limited, because they were solely based on the classical secretory pathway in mammalian cells <REF-5> – <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_7",
            "start": 192,
            "end": 365,
            "label": {}
        },
        {
            "ix": "1-12_v2_8@0",
            "content": "The fact(or)s",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_8",
            "start": 0,
            "end": 12,
            "label": {}
        },
        {
            "ix": "1-12_v2_9@0",
            "content": "Since then, a lot more data related to the PEXEL sequence have been generated, but rather than clarify they seem to confuse the issue further.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_9",
            "start": 0,
            "end": 141,
            "label": {}
        },
        {
            "ix": "1-12_v2_9@1",
            "content": "Meanwhile it has been shown that:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_9",
            "start": 143,
            "end": 175,
            "label": {}
        },
        {
            "ix": "1-12_v2_10@0",
            "content": "- The secretory signal peptides of the exported soluble proteins, which are located 20–40 amino acids upstream of the host cell targeting signals, are not cleaved upon endoplasmic reticulum (ER) targeting <REF-8> , <REF-9> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_10",
            "start": 0,
            "end": 223,
            "label": {}
        },
        {
            "ix": "1-12_v2_10@1",
            "content": "- The host cell targeting signal is cleaved and the new N-terminus is N-acetylated at the ER membrane <REF-9> – <REF-11> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_10",
            "start": 225,
            "end": 346,
            "label": {}
        },
        {
            "ix": "1-12_v2_10@2",
            "content": "- The protease responsible for the cleavage has been identified <REF-9> – <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_10",
            "start": 348,
            "end": 431,
            "label": {}
        },
        {
            "ix": "1-12_v2_10@3",
            "content": "- Cleavage by this protease is a prerequisite for transport into the erythrocyte <REF-9> , <REF-10> ; if you generate the cleaved N-terminus by modifying the gene and combine it with a cleavable signal peptide, the resulting protein is secreted into the PV and remains there <REF-9> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_10",
            "start": 433,
            "end": 716,
            "label": {}
        },
        {
            "ix": "1-12_v2_10@4",
            "content": "- The uncleaved targeting signal binds PI3P at the ER membrane with the same specificity required for protease cleavage and host cell targeting; the cleaved signal no longer binds PI3P <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_10",
            "start": 718,
            "end": 912,
            "label": {}
        },
        {
            "ix": "1-12_v2_10@5",
            "content": "- A putative 'translocator' complex resides in the PV membrane (PVM); it consists of 5 proteins that coprecipitate some of the proteins bearing a host cell targeting signal, but a function of the complex has not been demonstrated in any way, nor has it been investigated whether the association of the complex and the PEXEL proteins is mediated by the PEXEL signal <REF-14> , <REF-15> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_10",
            "start": 914,
            "end": 1299,
            "label": {}
        },
        {
            "ix": "1-12_v2_11@0",
            "content": "The hypothesis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_11",
            "start": 0,
            "end": 13,
            "label": {}
        },
        {
            "ix": "1-12_v2_12@0",
            "content": "The authors of the respective papers assume that proteolytic cleavage, N-acetylation, and PI3P binding take place in the ER lumen ( Figure 2A ) <REF-9> , <REF-10> , <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_12",
            "start": 0,
            "end": 174,
            "label": {}
        },
        {
            "ix": "1-12_v2_12@1",
            "content": "This cannot be right: N-acetylation is a cytosolic modification, based on the biochemical and sequence data characterizing the protease plasmepsin V, its active site is almost certainly on the cytoplasmic face of the membrane, and the only possible location for PI3P at the ER membrane is in the cytosolic leaflet.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_12",
            "start": 176,
            "end": 489,
            "label": {}
        },
        {
            "ix": "1-12_v2_12@2",
            "content": "In detail:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_12",
            "start": 491,
            "end": 500,
            "label": {}
        },
        {
            "ix": "1-12_v2_13@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_13",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "1-12_v2_15@0",
            "content": "All known enzyme complexes mediating N-acetylation including NatD, which is likely responsible for the N-acetylation of proteolytically cleaved PEXEL proteins, are located in the cytosol <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_15",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "1-12_v2_15@1",
            "content": "The presence of a secretory signal sequence indeed strongly reduces the likelihood of proteins being N-acetylated, confirming that N-acetylation does not take place inside compartments of the secretory pathway <REF-17> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_15",
            "start": 198,
            "end": 417,
            "label": {}
        },
        {
            "ix": "1-12_v2_16@0",
            "content": "In the initial characterization of plasmepsin V, Klemba & Goldberg (2005) <REF-12> found a hydrophobic region at the N-terminus, which they described as a putative signal sequence.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_16",
            "start": 0,
            "end": 179,
            "label": {}
        },
        {
            "ix": "1-12_v2_16@1",
            "content": "There is no discernible signal peptidase cleavage site C-terminal of this hydrophobic region and indeed Klemba and Goldberg did not observe processing of the N-terminus of plasmepsin V in pulse-chase experiment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_16",
            "start": 181,
            "end": 391,
            "label": {}
        },
        {
            "ix": "1-12_v2_16@2",
            "content": "Russo and colleagues showed later (2010) <REF-10> that fusion of this region of plasmepsin V to a fluorescent reporter protein resulted in ring-shaped staining around the parasite cytoplasm indicative of location in the PV or at the parasite plasma membrane, and suggesting entry of the protein into the ER and transport to the cell surface.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_16",
            "start": 393,
            "end": 733,
            "label": {}
        },
        {
            "ix": "1-12_v2_16@3",
            "content": "Since the N-terminal hydrophobic domain of plasmepsin V is not cleaved <REF-12> , it is likely a transmembrane signal anchor.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_16",
            "start": 735,
            "end": 859,
            "label": {}
        },
        {
            "ix": "1-12_v2_16@4",
            "content": "Both TMHMM and TopPred predict it to insert into the ER membrane with the N-terminus in the lumen such that the subsequent soluble region containing the active site would be in the cytoplasm.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_16",
            "start": 861,
            "end": 1051,
            "label": {}
        },
        {
            "ix": "1-12_v2_16@5",
            "content": "In the same paper Russo and colleagues demonstrated that the C-terminal hydrophobic region of plasmepsin V was required for ER retention of the protein <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_16",
            "start": 1053,
            "end": 1214,
            "label": {}
        },
        {
            "ix": "1-12_v2_16@6",
            "content": "Both Russo and colleagues and Klemba and Goldberg describe this region as a transmembrane domain, but Klemba and Goldberg show that 50% of plasmepsin V can be extracted from the membrane by carbonate, pH 11.0 <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_16",
            "start": 1216,
            "end": 1434,
            "label": {}
        },
        {
            "ix": "1-12_v2_16@7",
            "content": "A standard feature of a transmembrane protein, however, is that it is resistant to carbonate extraction at pH 11.5 <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_16",
            "start": 1436,
            "end": 1560,
            "label": {}
        },
        {
            "ix": "1-12_v2_16@8",
            "content": "Altogether these data suggest that plasmepsin V is tethered to the ER membrane by hydrophobic regions at both termini, and that its active site is in the cytoplasm.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_16",
            "start": 1562,
            "end": 1725,
            "label": {}
        },
        {
            "ix": "1-12_v2_17@0",
            "content": "Localization of PI3P has been investigated in yeast and mammalian cells where it is found on early and late endosomes and transiently at the plasma membrane <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_17",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "1-12_v2_17@1",
            "content": "PI3P is generated by PI3-kinases on the cytoplasmic leaflet of intracellular membranes and regulates membrane trafficking events <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_17",
            "start": 168,
            "end": 306,
            "label": {}
        },
        {
            "ix": "1-12_v2_17@2",
            "content": "The localization of the kinase determines the localization of the PI3P patch <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_17",
            "start": 308,
            "end": 394,
            "label": {}
        },
        {
            "ix": "1-12_v2_17@3",
            "content": "There are no PI3 kinases inside the secretory pathway.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_17",
            "start": 396,
            "end": 449,
            "label": {}
        },
        {
            "ix": "1-12_v2_17@4",
            "content": "The only known example of PI3P occurring at the ER is during formation of autophagosomal membrane precursors, the so-called omegasomes <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_17",
            "start": 451,
            "end": 595,
            "label": {}
        },
        {
            "ix": "1-12_v2_17@5",
            "content": "Even in this case, PI3P is generated by the Vps34 PI3-kinase in the cytoplasmic leaflet of the ER membrane <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_17",
            "start": 597,
            "end": 713,
            "label": {}
        },
        {
            "ix": "1-12_v2_18@0",
            "content": "The alternative",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_18",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "1-12_v2_19@0",
            "content": "An alternative explanation for most of the available data is that their secretory signal peptides target PEXEL proteins to the P. falciparum ER, but are inefficiently cleaved - perhaps due to their long N-terminal extensions ( Figure 2B, (1) ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_19",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "1-12_v2_19@1",
            "content": "This is similar to the biogenesis of some autotransporters in pathogenic E. coli , where delayed signal peptide cleavage due to N-terminal signal peptide extension allows the passenger domain to remain unfolded in the periplasm while the porin domain assembles in the E. coli outer membrane <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_19",
            "start": 245,
            "end": 545,
            "label": {}
        },
        {
            "ix": "1-12_v2_19@2",
            "content": "Stuck in the protein translocation channel in the P. falciparum ER membrane, the PEXEL protein in transit is oriented such that the host cell targeting signal can bind PI3P at the cytoplasmic face of the ER membrane ( Figure 2B, (2) ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_19",
            "start": 547,
            "end": 781,
            "label": {}
        },
        {
            "ix": "1-12_v2_19@3",
            "content": "Binding creates the cleavage site for the protease plasmepsin V ( Figure 2B, (2) ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_19",
            "start": 783,
            "end": 865,
            "label": {}
        },
        {
            "ix": "1-12_v2_19@4",
            "content": "This possibility has also been mentioned, but not been pursued experimentally, in Bhattacharjee et al. <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_19",
            "start": 867,
            "end": 979,
            "label": {}
        },
        {
            "ix": "1-12_v2_19@5",
            "content": "After cleavage and N-acetylation ( Figure 2B, (3) ) the new N-terminus is not released, but the protein remains membrane-tethered or associated with a transmembrane protein ( Figure 2B, (4) ) until it reaches the cell surface from where it is transferred to the erythrocyte, perhaps by vesicular transport ( Figure 3 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_19",
            "start": 981,
            "end": 1299,
            "label": {}
        },
        {
            "ix": "1-12_v2_20@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_20",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "1-12_v2_22@0",
            "content": "Unusual biogenesis of a host cell targeted P. falciparum membrane protein has already been shown: the protein PfEMP-1 remains peripherally membrane-associated throughout the P. falciparum secretory pathway and only becomes transmembrane in the erythrocyte <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_22",
            "start": 0,
            "end": 265,
            "label": {}
        },
        {
            "ix": "1-12_v2_22@1",
            "content": "But conventional transmembrane proteins, i.e. proteins that become membrane-integrated in the parasite ER membrane, with PEXEL signals also exist <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_22",
            "start": 267,
            "end": 422,
            "label": {}
        },
        {
            "ix": "1-12_v2_22@2",
            "content": "The biogenesis of a soluble PEXEL protein has not been studied in similar detail to date.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_22",
            "start": 424,
            "end": 512,
            "label": {}
        },
        {
            "ix": "1-12_v2_23@0",
            "content": "The key: PI3P in the ER",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_23",
            "start": 0,
            "end": 22,
            "label": {}
        },
        {
            "ix": "1-12_v2_24@0",
            "content": "Recruitment of PEXEL proteins to specific locations within the ER membrane shows interesting parallels to autophagosomal membrane formation at the ER membrane <REF-21> , <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_24",
            "start": 0,
            "end": 179,
            "label": {}
        },
        {
            "ix": "1-12_v2_24@1",
            "content": "As mentioned above, the only known example of PI3P occurring in ER membranes is during the induction of autophagosome formation <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_24",
            "start": 181,
            "end": 318,
            "label": {}
        },
        {
            "ix": "1-12_v2_24@2",
            "content": "Here the Atg14L protein recruits the Vps34 PI3-kinase to the cytosolic face of ER membranes; during amino acid starvation this leads to the formation of membrane patches or bulges, which seem to be attached to the ER and contain PI3P <REF-21> , <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_24",
            "start": 320,
            "end": 574,
            "label": {}
        },
        {
            "ix": "1-12_v2_24@3",
            "content": "These patches recruit proteins with PI3P-binding domains, promoting formation of so-called omegasomes, which are invaginations into the ER that ultimately lead to pinching off of a crescent-shaped membrane structure <REF-21> , <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_24",
            "start": 576,
            "end": 812,
            "label": {}
        },
        {
            "ix": "1-12_v2_24@4",
            "content": "The mechanism responsible for omegasome formation is not understood <REF-21> , <REF-22> , <REF-26> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_24",
            "start": 814,
            "end": 913,
            "label": {}
        },
        {
            "ix": "1-12_v2_24@5",
            "content": "In order to be recruited to the right place, the proteins binding to PI3P at the cytosolic face of the ER membrane have to contain, in addition to their PI3P-binding domains, a not yet characterized ER-targeting signal <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_24",
            "start": 915,
            "end": 1143,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@0",
            "content": "So maybe during erythrocyte invasion, which is controlled by IP3 signalling and calcium release from the ER <REF-27> , a PI3-kinase is recruited to or activated at the P. falciparum ER.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@1",
            "content": "This PI3-kinase generates PI3P in patches localized in the cytoplasmic leaflet of the ER membrane in proximity to the protein translocation channel (Sec61 channel) or the SRP receptor ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 186,
            "end": 383,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@2",
            "content": "The signal peptide of soluble PEXEL proteins promotes their targeting to the ER membrane where the signal peptide inserts into the Sec61 channel ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 385,
            "end": 543,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@3",
            "content": "The as yet unexplained long N-terminal extensions of many of the PEXEL protein signal peptides may lead to their inefficient cleavage by signal peptidase in the ER lumen, similar to delayed signal sequence cleavage in bacterial autotransporters with long N-terminal extensions <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 545,
            "end": 831,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@4",
            "content": "Delayed cleavage may be caused by the extension preventing reorientation to an N-cytoplasmic/C-lumenal topology in the protein translocation channel as shown in Figure 2B <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 833,
            "end": 1013,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@5",
            "content": "Alternatively, the N-terminal signal peptide extension may interact with a cytoplasmic domain of the Sec61 channel, which in turn may interfere with signal peptidase access to the cleavage site in the ER lumen (topology shown in Figure 2A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 1015,
            "end": 1255,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@6",
            "content": "At least some of the N-terminal hydrophobic regions of PEXEL proteins also simply do not contain signal peptidase cleavage sites <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 1257,
            "end": 1394,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@7",
            "content": "Delayed signal cleavage will lead to prolonged residence of the nascent PEXEL protein in the Sec61 channel, which in turn would allow interaction of the still cytosolic PEXEL signal with PI3P in the cytosolic leaflet of the ER membrane ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 1396,
            "end": 1645,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@8",
            "content": "This interaction keeps the protein from entering the ER and thus the conventional secretory pathway.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 1647,
            "end": 1746,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@9",
            "content": "It may also generate a protein conformation recognized by the cytosolically located active site of plasmepsin V and result in cleavage of the PEXEL signal, which liberates the protein from the Sec61 channel, and aborts translocation into the ER ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 1748,
            "end": 2006,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@10",
            "content": "Plasmepsin V might itself be a PI3P-binding protein, or interact with the Sec61 channel.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 2008,
            "end": 2095,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@11",
            "content": "After cleavage the cytosolic NatD complex would acetylate the new N-terminus ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 2097,
            "end": 2187,
            "label": {}
        },
        {
            "ix": "1-12_v2_25@12",
            "content": "Importantly, the interaction of the PEXEL protein with plasmepsin V leads to a handing over of the cleaved protein to a receptor protein (or complex) in the PI3P-patch ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_25",
            "start": 2189,
            "end": 2370,
            "label": {}
        },
        {
            "ix": "1-12_v2_26@0",
            "content": "Transmembrane PEXEL proteins are similarly targeted to the Sec61 channel in the ER membrane, but released laterally into the lipid bilayer which allows their cytosolically exposed PEXEL sequence to bind to PI3P and be recruited into the patch ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_26",
            "start": 0,
            "end": 256,
            "label": {}
        },
        {
            "ix": "1-12_v2_26@1",
            "content": "In this case the topology of the PEXEL/PI3P interaction may prevent cleavage by plasmepsin V. That transmembrane proteins can be recruited to PI3P in the ER membrane has also been shown during autophagosomal membrane formation at the ER <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_26",
            "start": 258,
            "end": 504,
            "label": {}
        },
        {
            "ix": "1-12_v2_26@2",
            "content": "One or more of the transmembrane PEXEL proteins may form the receptor in the PI3P patch for soluble plasmepsin V-cleaved PEXEL proteins ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_26",
            "start": 506,
            "end": 655,
            "label": {}
        },
        {
            "ix": "1-12_v2_27@0",
            "content": "The way out",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_27",
            "start": 0,
            "end": 10,
            "label": {}
        },
        {
            "ix": "1-12_v2_28@0",
            "content": "One option is that the PI3P patches and their associated proteins are simply packaged into a specific subset of ER-to-Golgi transport vesicles, and are then transported through the secretory pathway by a series of vesicle budding and fusion events ( Figure 3 , pathway A).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_28",
            "start": 0,
            "end": 271,
            "label": {}
        },
        {
            "ix": "1-12_v2_28@1",
            "content": "After transport vesicle fusion at the plasma membrane, the plasma membrane then could either bud vesicles outwardly that subsequently fuse with the PVM ( Figure 3 ), or there might be a transient fusion of parasite plasma membrane and PVM to transmit the proteins perhaps by interaction of the PI3P patch with a receptor in the PVM ( Figure 3 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_28",
            "start": 273,
            "end": 617,
            "label": {}
        },
        {
            "ix": "1-12_v2_28@2",
            "content": "Release of soluble proteins from the PI3P patch might be triggered by different (ion etc.) conditions in the erythrocyte cytosol.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_28",
            "start": 619,
            "end": 747,
            "label": {}
        },
        {
            "ix": "1-12_v2_28@3",
            "content": "Membrane proteins would be transported by vesicular transport from the PVM to Maurer's clefts where their release from the PI3P patches could be triggered by a PI3P-phosphatase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_28",
            "start": 749,
            "end": 925,
            "label": {}
        },
        {
            "ix": "1-12_v2_29@0",
            "content": "Alternatively, similar to what has been observed during autophagosomal membrane formation at the ER, the recruitment of specific proteins to the PI3P patch may lead to an invagination of the ER membrane, resulting in vesicles inside the ER containing the PEXEL proteins ( Figure 3 , pathway B).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_29",
            "start": 0,
            "end": 293,
            "label": {}
        },
        {
            "ix": "1-12_v2_29@1",
            "content": "These proteins could then be transported through the secretory pathway as double membrane vesicles (DMVs) whose outer layer would ultimately fuse with the parasite plasma membrane ( Figure 3, 3B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_29",
            "start": 295,
            "end": 491,
            "label": {}
        },
        {
            "ix": "1-12_v2_29@2",
            "content": "DMVs have been detected in electron micrographs of P. falciparum , and fusion with the parasite plasma membrane and vesicle release into the PV have been reported <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_29",
            "start": 493,
            "end": 664,
            "label": {}
        },
        {
            "ix": "1-12_v2_29@3",
            "content": "The released vesicles might subsequently be able to fuse with the PVM ( Figure 3, 4B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_29",
            "start": 666,
            "end": 752,
            "label": {}
        },
        {
            "ix": "1-12_v2_30@0",
            "content": "Either of the transport pathways depicted in Figure 3 would satisfy the Brefeldin A sensitivity of (at least some) protein transport into the erythrocyte <REF-29> , <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_30",
            "start": 0,
            "end": 174,
            "label": {}
        },
        {
            "ix": "1-12_v2_30@1",
            "content": "Either would explain how soluble and transmembrane proteins can be targeted into the host cell using the same signal <REF-3> , <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_30",
            "start": 176,
            "end": 311,
            "label": {}
        },
        {
            "ix": "1-12_v2_30@2",
            "content": "Both scenarios could also explain how proteins without a PEXEL signal or proteins without a signal sequence or transmembrane domain could end up in the erythrocyte: these proteins could be packaged into the PEXEL-protein containing vesicles by interaction with these on the cytoplasmic face of the ER membrane <REF-6> , <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_30",
            "start": 313,
            "end": 642,
            "label": {}
        },
        {
            "ix": "1-12_v2_30@3",
            "content": "Both hypotheses could also explain how the PEXEL signal leads to targeting to the erythrocyte even though the signal itself is cleaved already at the parasite ER <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_30",
            "start": 644,
            "end": 815,
            "label": {}
        },
        {
            "ix": "1-12_v2_31@0",
            "content": "If the key decision - entry into the conventional secretory pathway or entry into a distinct export pathway that ultimately leads to arrival in the erythrocyte - is already made during PEXEL protein biogenesis at the parasite ER, this would explain why a protein that has been engineered to contain a conventional signal peptide and an N-terminus equivalent to the cleaved PEXEL signal ends up in the PV, not in the erythrocyte <REF-9> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_31",
            "start": 0,
            "end": 436,
            "label": {}
        },
        {
            "ix": "1-12_v2_31@1",
            "content": "The construct with the conventional signal peptide is fully translocated into the secretory pathway, and hence separated from the PI3P patch-associated PEXEL proteins ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_31",
            "start": 438,
            "end": 618,
            "label": {}
        },
        {
            "ix": "1-12_v2_31@2",
            "content": "It will therefore, like conventional secretory proteins, follow the classical secretory pathway and be secreted into the PV, from which there seems to be no direct access into the erythrocyte.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_31",
            "start": 620,
            "end": 811,
            "label": {}
        },
        {
            "ix": "1-12_v2_32@0",
            "content": "That this is true is also confirmed by a carefully done set of experiments by Gehde and colleagues (2008) <REF-32> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_32",
            "start": 0,
            "end": 115,
            "label": {}
        },
        {
            "ix": "1-12_v2_32@1",
            "content": "The authors aimed to investigate whether protein folding has an effect on PEXEL protein access to the erythrocyte.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_32",
            "start": 117,
            "end": 230,
            "label": {}
        },
        {
            "ix": "1-12_v2_32@2",
            "content": "They generated fusion proteins that contained the signal peptide and PEXEL region from either the transmembrane protein STEVOR or the soluble protein GBP130 fused to dihydrofolate reductase (DHFR), followed by green fluorescent protein (GFP) and expressed these fusion proteins in P. falciparum .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_32",
            "start": 232,
            "end": 527,
            "label": {}
        },
        {
            "ix": "1-12_v2_32@3",
            "content": "They found that in the absence of folate analogues (which promote DHFR folding) these constructs were targeted to the erythrocyte.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_32",
            "start": 529,
            "end": 658,
            "label": {}
        },
        {
            "ix": "1-12_v2_32@4",
            "content": "In the presence of folate analogues, the constructs were found in the PV.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_32",
            "start": 660,
            "end": 732,
            "label": {}
        },
        {
            "ix": "1-12_v2_32@5",
            "content": "Strikingly, only newly synthesized proteins could be transported into the erythrocyte, i.e. it was impossible to chase pre-existing fusion proteins from the PV into the erythrocyte after washout of the folate analogue.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_32",
            "start": 734,
            "end": 951,
            "label": {}
        },
        {
            "ix": "1-12_v2_32@6",
            "content": "The authors' interpretation of the data was that proteins must be unfolded in order to be transported across the PVM into the erythrocyte, that the PVM therefore contained a protein-conducting channel with similar requirements for transport as the Sec61 channel in the ER membrane, and that the time window after synthesis during which proteins were transport-competent was limited.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_32",
            "start": 953,
            "end": 1334,
            "label": {}
        },
        {
            "ix": "1-12_v2_33@0",
            "content": "The scenario depicted in Figure 2B suggests a different interpretation of the data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_33",
            "start": 0,
            "end": 82,
            "label": {}
        },
        {
            "ix": "1-12_v2_33@1",
            "content": "Immediately after targeting of a PEXEL protein to the Sec61 channel in the ER membrane, there is a competition between full translocation of the fusion protein into the ER lumen and binding of the PEXEL region to PI3P on the cytoplasmic leaflet of the ER membrane, which ultimately leads to an abortion of translocation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_33",
            "start": 84,
            "end": 403,
            "label": {}
        },
        {
            "ix": "1-12_v2_33@2",
            "content": "At this stage the signal peptide and PEXEL regions of the fusion protein are already synthesized, but the ribosome is still associated with the nascent chain and protein synthesis is still going on (between step 1 and step 2 in Figure 2B , not shown).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_33",
            "start": 405,
            "end": 655,
            "label": {}
        },
        {
            "ix": "1-12_v2_33@3",
            "content": "When the DHFR part of the protein emerges from the ribosome, it is initially located in the ER lumen.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_33",
            "start": 657,
            "end": 757,
            "label": {}
        },
        {
            "ix": "1-12_v2_33@4",
            "content": "In the absence of the folate analogue, the DHFR chain remains sufficiently flexible for the PEXEL signal to interact with PI3P, plasmepsin V cleavage occurs, and translocation is aborted; as a result the fusion protein remains in the cytosol associated with the PI3P patch as in Figure 2B .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_33",
            "start": 759,
            "end": 1048,
            "label": {}
        },
        {
            "ix": "1-12_v2_33@5",
            "content": "In the presence of a folate analogue, DHFR will fold tightly in the ER lumen during its synthesis and this will interfere with or override the interaction of PEXEL with PI3P in the cytoplasm.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_33",
            "start": 1050,
            "end": 1240,
            "label": {}
        },
        {
            "ix": "1-12_v2_33@6",
            "content": "As a result the fusion protein will be fully translocated and end up inside the secretory pathway.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_33",
            "start": 1242,
            "end": 1339,
            "label": {}
        },
        {
            "ix": "1-12_v2_33@7",
            "content": "That folding accelerates translocation into the ER has been shown <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_33",
            "start": 1341,
            "end": 1416,
            "label": {}
        },
        {
            "ix": "1-12_v2_33@8",
            "content": "If protein folding in the ER lumen and PI3P-binding at the cytoplasmic leaflet of the ER membrane interfere with each other this might also explain why some of the PEXEL proteins contain large intrinsically unstructured regions <REF-34> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_33",
            "start": 1418,
            "end": 1655,
            "label": {}
        },
        {
            "ix": "1-12_v2_34@0",
            "content": "On the whole the model depicted in Figure 2B and Figure 3 makes sense of the vast majority of the available data on trafficking of proteins from P. falciparum into the host cell and suggests that the decision of where to go is made early during biogenesis of exported proteins at the parasite ER membrane.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_34",
            "start": 0,
            "end": 304,
            "label": {}
        },
        {
            "ix": "1-12_v2_34@1",
            "content": "My hypothesis has a number of easily testable elements that might give the research in this field the appropriate direction for a full understanding of the mechanism of protein export from P. falciparum into the erythrocyte.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_34",
            "start": 306,
            "end": 529,
            "label": {}
        },
        {
            "ix": "1-12_v2_35@0",
            "content": "<REF-1> Maier AG Cooke BM Cowman AF : Malaria parasite proteins that remodel the host erythrocyte. Nat Rev Microbiol. 2009 ; 7 ( 5 ): 341 – 354 . 19369950 10.1038/nrmicro2110",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_35",
            "start": 0,
            "end": 173,
            "label": {}
        },
        {
            "ix": "1-12_v2_36@0",
            "content": "<REF-2> Goldberg DE Cowman AF : Moving in and renovating: exporting proteins from Plasmodium into host erythrocytes. Nat Rev Microbiol. 2010 ; 8 ( 9 ): 617 – 621 . 20706280 10.1038/nrmicro2420",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_36",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "1-12_v2_37@0",
            "content": "<REF-3> Marti M Good RT Rug M : Targeting malaria virulence and remodeling proteins to the host erythrocyte. Science. 2004 ; 306 ( 5703 ): 1930 – 1933 . 15591202 10.1126/science.1102452",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_37",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "1-12_v2_38@0",
            "content": "<REF-4> Hiller NL Bhattacharjee S van Ooij C : A host-targeting signal in virulence proteins reveals a secretome in malarial infection. Science. 2004 ; 306 ( 5703 ): 1934 – 1937 . 15591203 10.1126/science.1102737",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_38",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "1-12_v2_39@0",
            "content": "<REF-5> Cooke BM Lingelbach K Bannister LH : Protein trafficking in Plasmodium falciparum -infected red blood cells. Trends Parasitol. 2004 ; 20 ( 12 ): 581 – 589 . 15522668 10.1016/j.pt.2004.09.008",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_39",
            "start": 0,
            "end": 197,
            "label": {}
        },
        {
            "ix": "1-12_v2_40@0",
            "content": "<REF-6> Römisch K : Protein targeting from malaria parasites to host erythrocytes. Traffic. 2005 ; 6 ( 8 ): 706 – 709 . 15998325 10.1111/j.1600-0854.2005.00310.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_40",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "1-12_v2_41@0",
            "content": "<REF-7> Lingelbach K Przyborski JM : The long and winding road: Protein trafficking mechanisms in the Plasmodium falciparum infected erythrocyte. Mol Biochem Parasitol. 2006 ; 147 ( 1 ): 1 – 8 . 16540187 10.1016/j.molbiopara.2006.01.014",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_41",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "1-12_v2_42@0",
            "content": "<REF-9> Boddey JA Hodder AN Günther S : An aspartyl protease directs malaria effector proteins to the host cell. Nature. 2010 ; 463 ( 7281 ): 627 – 631 . 20130643 10.1038/nature08728 2818761",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_42",
            "start": 0,
            "end": 189,
            "label": {}
        },
        {
            "ix": "1-12_v2_43@0",
            "content": "<REF-10> Russo I Babbit S Muralidharan V : Plasmepsin V licenses Plasmodium proteins for export into the host erythrocyte. Nature. 2010 ; 463 ( 7281 ): 632 – 636 . 20130644 10.1038/nature08726 2826791",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_43",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "1-12_v2_44@0",
            "content": "<REF-12> Klemba M Goldberg DE : Characterization of plasmepsin V, a membrane-bound aspartic protease homolog in the endoplasmic reticulum of Plasmodium falciparum. Mol Biochem Parasitol. 2005 ; 143 ( 2 ): 183 – 191 . 16024107 10.1016/j.molbiopara.2005.05.015",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_44",
            "start": 0,
            "end": 257,
            "label": {}
        },
        {
            "ix": "1-12_v2_45@0",
            "content": "<REF-13> Bhattacharjee S Stahelin RV Speicher KD : Endoplasmic reticulum PI(3)P lipid binding targets malaria proteins to the host cell. Cell. 2012 ; 148 ( 1–2 ): 201 – 212 . 22265412 10.1016/j.cell.2011.10.051 3268671",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_45",
            "start": 0,
            "end": 217,
            "label": {}
        },
        {
            "ix": "1-12_v2_46@0",
            "content": "<REF-16> Arnesen T : Towards a functional understanding of protein N-Terminal Acetylation. PLoS Biol. 2011 ; 9 ( 5 ): e1001074 . 21655309 10.1371/journal.pbio.1001074 3104970",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_46",
            "start": 0,
            "end": 173,
            "label": {}
        },
        {
            "ix": "1-12_v2_47@0",
            "content": "<REF-17> Forte GM Pool MR Stirling CJ : N-Terminal acetylation inhibits protein targeting to the endoplasmic reticulum. PLoS Biol. 2011 ; 9 ( 5 ): e1001073 . 21655302 10.1371/journal.pbio.1001073 3104963",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_47",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "1-12_v2_48@0",
            "content": "<REF-18> Fujiki Y Hubbard AL Fowler S : Isolation of intracellular membranes by means of sodium carbonate treatment: application to endoplasmic reticulum. J Cell Biol. 1982 ; 93 ( 1 ): 97 – 102 . 7068762 10.1083/jcb.93.1.97 2112113",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_48",
            "start": 0,
            "end": 230,
            "label": {}
        },
        {
            "ix": "1-12_v2_49@0",
            "content": "<REF-19> Gillooly DJ Morrow IC Lindsay M : Localization of phosphatidylinositol 3-phosphate in yeast and mammalian cells. EMBO J. 2000 ; 19 ( 17 ): 4577 – 4588 . 10970851 10.1093/emboj/19.17.4577 302054",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_49",
            "start": 0,
            "end": 201,
            "label": {}
        },
        {
            "ix": "1-12_v2_50@0",
            "content": "<REF-20> Lindmo K Stenmark H : Regulation of membrane traffic by phosphoinositide 3-kinases. J Cell Sci. 2006 ; 119 ( Pt 4 ): 605 – 614 . 16467569 10.1242/jcs.02855",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_50",
            "start": 0,
            "end": 163,
            "label": {}
        },
        {
            "ix": "1-12_v2_51@0",
            "content": "<REF-21> Axe EL Walker SA Manigava M : Autophagosome formation from membrane compartments enriched in phosphatidylinositol 3-phosphate and dynamically connected to the endoplasmic reticulum. J Cell Biol. 2008 ; 182 ( 4 ): 685 – 701 . 18725538 10.1083/jcb.200803137 2518708",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_51",
            "start": 0,
            "end": 271,
            "label": {}
        },
        {
            "ix": "1-12_v2_52@0",
            "content": "<REF-22> Matsunaga K Morita E Saitoh T : Autophagy requires endoplasmic reticulum targeting of the PI3-kinase complex via Atg14L. J Cell Biol. 2010 ; 190 ( 4 ): 511 – 521 . 20713597 10.1083/jcb.200911141 2928018",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_52",
            "start": 0,
            "end": 210,
            "label": {}
        },
        {
            "ix": "1-12_v2_53@0",
            "content": "<REF-23> Dautin N Bernstein HD : Protein secretion in gram-negative bacteria via the autotransporter pathway. Annu Rev Microbiol. 2007 ; 61 : 89 – 112 . 17506669 10.1146/annurev.micro.61.080706.093233",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_53",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "1-12_v2_54@0",
            "content": "<REF-24> Papakrivos J Newbold CI Lingelbach K : A potential novel mechanism for the insertion of a membrane protein revealed by a biochemical analysis of the Plasmodium falciparum cytoadherence molecule PfEMP-1. Mol Microbiol. 2005 ; 55 ( 4 ): 1272 – 1284 . 15686570 10.1111/j.1365-2958.2004.04468.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_54",
            "start": 0,
            "end": 298,
            "label": {}
        },
        {
            "ix": "1-12_v2_55@0",
            "content": "<REF-25> Przyborski JM Miller SK Pfahler JM : Trafficking of STEVOR to the Maurer’s clefts in Plasmodium falciparum -infected erythrocytes. EMBO J. 2005 ; 24 ( 13 ): 2306 – 17 . 15961998 10.1038/sj.emboj.7600720 1173160",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_55",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "1-12_v2_56@0",
            "content": "<REF-26> Simonsen A Stenmark H : Self-eating from an ER-associated cup. J Cell Biol. 2008 ; 182 ( 4 ): 621 – 622 . 18725534 10.1083/jcb.200807061 2518700",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_56",
            "start": 0,
            "end": 152,
            "label": {}
        },
        {
            "ix": "1-12_v2_57@0",
            "content": "<REF-27> Gaur D Chitnis CE : Molecular interactions and signaling mechanisms during erythrocyte invasion by malaria parasites. Curr Opinion Microbiol. 2011 ; 14 ( 4 ): 422 – 428 . 21803641 10.1016/j.mib.2011.07.018",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_57",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "1-12_v2_58@0",
            "content": "<REF-28> Goder V Spiess M : Molecular mechanism of signal sequence orientation in the endoplasmic reticulum. EMBO J. 2003 ; 22 ( 14 ): 3645 – 3653 . 12853479 10.1093/emboj/cdg361 165631",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_58",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "1-12_v2_59@0",
            "content": "<REF-29> Benting J Mattei D Lingelbach K : Brefeldin A inhibits transport of the glycophorin-binding protein from Plasmodium falciparum into the host erythrocyte. Biochem J. 1994 ; 300 ( Pt 3 ): 821 – 826 . 8010965 1138239",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_59",
            "start": 0,
            "end": 221,
            "label": {}
        },
        {
            "ix": "1-12_v2_60@0",
            "content": "<REF-30> Wickham ME Rug M Ralph SA : Trafficking and assembly of the cytoadherence complex in Plasmodium falciparum -infected human erythrocytes. EMBO J. 2001 ; 20 ( 20 ): 5636 – 5649 . 11598007 10.1093/emboj/20.20.5636 125667",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_60",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "1-12_v2_61@0",
            "content": "<REF-31> Spielmann T Gilberger TW : Protein export in malaria parasites: do multiple export motifs add up to multiple export pathways? Trends Parasitol. 2010 ; 26 ( 1 ): 6 – 10 . 19879191 10.1016/j.pt.2009.10.001",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_61",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "1-12_v2_62@0",
            "content": "<REF-32> Gehde N Hinrichs C Montilla I : Protein unfolding is an essential requirement for transport across the parasitophorous vacuolar membrane of Plasmodium falciparum . Mol Microbiol. 2009 ; 71 ( 3 ): 613 – 28 . 19040635 10.1111/j.1365-2958.2008.06552.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_62",
            "start": 0,
            "end": 256,
            "label": {}
        },
        {
            "ix": "1-12_v2_63@0",
            "content": "<REF-33> Scheper W Thaminy S Kais S : Coordination of N -glycosylation and protein translocation across the Endoplasmic Reticulum membrane by Sss1 protein. J Biol Chem. 2003 ; 278 ( 39 ): 37998 – 38003 . 12860997 10.1074/jbc.M300176200",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_63",
            "start": 0,
            "end": 234,
            "label": {}
        },
        {
            "ix": "1-12_v2_64@0",
            "content": "<REF-34> Feng ZP Zhang X Han P : Abundance of intrinsically unstructured proteins in P. falciparum and other apicomplexan parasite proteomes. Mol Biochem Parasitol. 2006 ; 150 ( 2 ): 256 – 267 . 17010454 10.1016/j.molbiopara.2006.08.011",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-12_v2_64",
            "start": 0,
            "end": 235,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "1-12_v2_0",
            "tgt_ix": "1-12_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_1",
            "tgt_ix": "1-12_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_0",
            "tgt_ix": "1-12_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_3",
            "tgt_ix": "1-12_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_3",
            "tgt_ix": "1-12_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_5",
            "tgt_ix": "1-12_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_3",
            "tgt_ix": "1-12_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_0",
            "tgt_ix": "1-12_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_8",
            "tgt_ix": "1-12_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_8",
            "tgt_ix": "1-12_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_0",
            "tgt_ix": "1-12_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_11",
            "tgt_ix": "1-12_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_11",
            "tgt_ix": "1-12_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_13",
            "tgt_ix": "1-12_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_11",
            "tgt_ix": "1-12_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_11",
            "tgt_ix": "1-12_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_11",
            "tgt_ix": "1-12_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_0",
            "tgt_ix": "1-12_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_18",
            "tgt_ix": "1-12_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_18",
            "tgt_ix": "1-12_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_20",
            "tgt_ix": "1-12_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_18",
            "tgt_ix": "1-12_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_0",
            "tgt_ix": "1-12_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_23",
            "tgt_ix": "1-12_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_23",
            "tgt_ix": "1-12_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_23",
            "tgt_ix": "1-12_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_0",
            "tgt_ix": "1-12_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_27",
            "tgt_ix": "1-12_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_27",
            "tgt_ix": "1-12_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_27",
            "tgt_ix": "1-12_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_27",
            "tgt_ix": "1-12_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_27",
            "tgt_ix": "1-12_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_27",
            "tgt_ix": "1-12_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_27",
            "tgt_ix": "1-12_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_0",
            "tgt_ix": "1-12_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_1",
            "tgt_ix": "1-12_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_2",
            "tgt_ix": "1-12_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_3",
            "tgt_ix": "1-12_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_4",
            "tgt_ix": "1-12_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_5",
            "tgt_ix": "1-12_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_6",
            "tgt_ix": "1-12_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_7",
            "tgt_ix": "1-12_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_8",
            "tgt_ix": "1-12_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_9",
            "tgt_ix": "1-12_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_10",
            "tgt_ix": "1-12_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_11",
            "tgt_ix": "1-12_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_12",
            "tgt_ix": "1-12_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_13",
            "tgt_ix": "1-12_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_14",
            "tgt_ix": "1-12_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_15",
            "tgt_ix": "1-12_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_18",
            "tgt_ix": "1-12_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_19",
            "tgt_ix": "1-12_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_20",
            "tgt_ix": "1-12_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_21",
            "tgt_ix": "1-12_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_22",
            "tgt_ix": "1-12_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_23",
            "tgt_ix": "1-12_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_24",
            "tgt_ix": "1-12_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_26",
            "tgt_ix": "1-12_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_27",
            "tgt_ix": "1-12_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_28",
            "tgt_ix": "1-12_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_29",
            "tgt_ix": "1-12_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_30",
            "tgt_ix": "1-12_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_31",
            "tgt_ix": "1-12_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_32",
            "tgt_ix": "1-12_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_4",
            "tgt_ix": "1-12_v2_35",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_4",
            "tgt_ix": "1-12_v2_36",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_4",
            "tgt_ix": "1-12_v2_37",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_4",
            "tgt_ix": "1-12_v2_38",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_7",
            "tgt_ix": "1-12_v2_39",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_40",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_7",
            "tgt_ix": "1-12_v2_41",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_12",
            "tgt_ix": "1-12_v2_42",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_12",
            "tgt_ix": "1-12_v2_43",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_44",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_12",
            "tgt_ix": "1-12_v2_45",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_15",
            "tgt_ix": "1-12_v2_46",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_15",
            "tgt_ix": "1-12_v2_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_48",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_19",
            "tgt_ix": "1-12_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_22",
            "tgt_ix": "1-12_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_22",
            "tgt_ix": "1-12_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_24",
            "tgt_ix": "1-12_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_30",
            "tgt_ix": "1-12_v2_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_30",
            "tgt_ix": "1-12_v2_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_30",
            "tgt_ix": "1-12_v2_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_32",
            "tgt_ix": "1-12_v2_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_4",
            "tgt_ix": "1-12_v2_6",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_12",
            "tgt_ix": "1-12_v2_14",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_19",
            "tgt_ix": "1-12_v2_21",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-12_v2_0",
            "tgt_ix": "1-12_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_1",
            "tgt_ix": "1-12_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_2",
            "tgt_ix": "1-12_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_2",
            "tgt_ix": "1-12_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_2",
            "tgt_ix": "1-12_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_2",
            "tgt_ix": "1-12_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_3",
            "tgt_ix": "1-12_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_4",
            "tgt_ix": "1-12_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_4",
            "tgt_ix": "1-12_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_4",
            "tgt_ix": "1-12_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_4",
            "tgt_ix": "1-12_v2_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_5",
            "tgt_ix": "1-12_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_7",
            "tgt_ix": "1-12_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_7",
            "tgt_ix": "1-12_v2_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_8",
            "tgt_ix": "1-12_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_9",
            "tgt_ix": "1-12_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_9",
            "tgt_ix": "1-12_v2_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_10",
            "tgt_ix": "1-12_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_10",
            "tgt_ix": "1-12_v2_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_10",
            "tgt_ix": "1-12_v2_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_10",
            "tgt_ix": "1-12_v2_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_10",
            "tgt_ix": "1-12_v2_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_10",
            "tgt_ix": "1-12_v2_10@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_11",
            "tgt_ix": "1-12_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_12",
            "tgt_ix": "1-12_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_12",
            "tgt_ix": "1-12_v2_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_12",
            "tgt_ix": "1-12_v2_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_13",
            "tgt_ix": "1-12_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_15",
            "tgt_ix": "1-12_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_15",
            "tgt_ix": "1-12_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_16@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_16@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_16@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_16@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_16@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_16",
            "tgt_ix": "1-12_v2_16@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_17@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_17",
            "tgt_ix": "1-12_v2_17@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_18",
            "tgt_ix": "1-12_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_19",
            "tgt_ix": "1-12_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_19",
            "tgt_ix": "1-12_v2_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_19",
            "tgt_ix": "1-12_v2_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_19",
            "tgt_ix": "1-12_v2_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_19",
            "tgt_ix": "1-12_v2_19@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_19",
            "tgt_ix": "1-12_v2_19@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_20",
            "tgt_ix": "1-12_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_22",
            "tgt_ix": "1-12_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_22",
            "tgt_ix": "1-12_v2_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_22",
            "tgt_ix": "1-12_v2_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_23",
            "tgt_ix": "1-12_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_24",
            "tgt_ix": "1-12_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_24",
            "tgt_ix": "1-12_v2_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_24",
            "tgt_ix": "1-12_v2_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_24",
            "tgt_ix": "1-12_v2_24@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_24",
            "tgt_ix": "1-12_v2_24@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_24",
            "tgt_ix": "1-12_v2_24@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_25",
            "tgt_ix": "1-12_v2_25@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_26",
            "tgt_ix": "1-12_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_26",
            "tgt_ix": "1-12_v2_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_26",
            "tgt_ix": "1-12_v2_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_27",
            "tgt_ix": "1-12_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_28",
            "tgt_ix": "1-12_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_28",
            "tgt_ix": "1-12_v2_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_28",
            "tgt_ix": "1-12_v2_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_28",
            "tgt_ix": "1-12_v2_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_29",
            "tgt_ix": "1-12_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_29",
            "tgt_ix": "1-12_v2_29@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_29",
            "tgt_ix": "1-12_v2_29@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_29",
            "tgt_ix": "1-12_v2_29@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_30",
            "tgt_ix": "1-12_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_30",
            "tgt_ix": "1-12_v2_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_30",
            "tgt_ix": "1-12_v2_30@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_30",
            "tgt_ix": "1-12_v2_30@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_31",
            "tgt_ix": "1-12_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_31",
            "tgt_ix": "1-12_v2_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_31",
            "tgt_ix": "1-12_v2_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_32",
            "tgt_ix": "1-12_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_32",
            "tgt_ix": "1-12_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_32",
            "tgt_ix": "1-12_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_32",
            "tgt_ix": "1-12_v2_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_32",
            "tgt_ix": "1-12_v2_32@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_32",
            "tgt_ix": "1-12_v2_32@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_32",
            "tgt_ix": "1-12_v2_32@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_33@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_33@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_33@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_33@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_33@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_33@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_33@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_33",
            "tgt_ix": "1-12_v2_33@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_34",
            "tgt_ix": "1-12_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_34",
            "tgt_ix": "1-12_v2_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_35",
            "tgt_ix": "1-12_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_36",
            "tgt_ix": "1-12_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_37",
            "tgt_ix": "1-12_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_38",
            "tgt_ix": "1-12_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_39",
            "tgt_ix": "1-12_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_40",
            "tgt_ix": "1-12_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_41",
            "tgt_ix": "1-12_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_42",
            "tgt_ix": "1-12_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_43",
            "tgt_ix": "1-12_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_44",
            "tgt_ix": "1-12_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_45",
            "tgt_ix": "1-12_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_46",
            "tgt_ix": "1-12_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_47",
            "tgt_ix": "1-12_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_48",
            "tgt_ix": "1-12_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_49",
            "tgt_ix": "1-12_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_50",
            "tgt_ix": "1-12_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_51",
            "tgt_ix": "1-12_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_52",
            "tgt_ix": "1-12_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_53",
            "tgt_ix": "1-12_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_54",
            "tgt_ix": "1-12_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_55",
            "tgt_ix": "1-12_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_56",
            "tgt_ix": "1-12_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_57",
            "tgt_ix": "1-12_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_58",
            "tgt_ix": "1-12_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_59",
            "tgt_ix": "1-12_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_60",
            "tgt_ix": "1-12_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_61",
            "tgt_ix": "1-12_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_62",
            "tgt_ix": "1-12_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_63",
            "tgt_ix": "1-12_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-12_v2_64",
            "tgt_ix": "1-12_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "1-12_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.1-12.v2",
        "atype": "opinion-article",
        "license": "http://creativecommons.org/licenses/by/3.0/",
        "title": "Diversion at the ER: How \n                     Plasmodium falciparum  exports proteins into host erythrocytes",
        "abstract": "Malaria is caused by parasites which live in host erythrocytes and remodel these cells to provide optimally for the parasites’ needs by exporting effector proteins into the host cells. Eight years ago the discovery of a host cell targeting sequence present in both soluble and transmembrane P. falciparum exported proteins generated a starting point for investigating the mechanism of parasite protein transport into infected erythrocytes. Since then many confusing facts about this targeting signal have emerged. In this paper, I try to make sense of them.",
        "contributors": [
            {
                "surname": "Römisch",
                "given-names": "Karin"
            }
        ],
        "url": "https://f1000research.com/articles/1-12/v2/",
        "doc_id": "1-12",
        "version": 2,
        "ix_counter": 272,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}