{
    "nodes": [
        {
            "ix": "331-ARR_v1_0",
            "content": "Multi Task Learning For Zero Shot Performance Prediction of Multilingual Models",
            "ntype": "article-title",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_2",
            "content": "Massively Multilingual Transformer based Language Models have been observed to be surprisingly effective on zero-shot transfer across languages, though the performance varies from language to language depending on the pivot language(s) used for fine-tuning. In this work, we build upon some of the existing techniques for predicting the zero-shot performance on a task, by modeling it as a multi-task learning problem. We jointly train predictive models for different tasks which helps us build more accurate predictors for tasks where we have test data in very few languages to measure the actual performance of the model. Our approach also lends us the ability to perform a much more robust feature selection, and identify a common set of features that influence zero-shot performance across a variety of tasks.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1"
            }
        },
        {
            "ix": "331-ARR_v1_4",
            "content": "Multilingual models like mBERT (Devlin et al., 2019) and XLM-R (Conneau et al., 2020) have been recently shown to be surprisingly effective for zero-shot transfer (Pires et al., 2019) (Wu and Dredze, 2019), where on fine-tuning for a task on one or a few languages, called pivots, they can perform well on languages unseen during training. The zero-shot performance however, is often not uniform across the languages and the multilingual models turn out to be much less effective for low resource languages (Wu and Dredze, 2020;Lauscher et al., 2020) and the languages that are typologically distant from the pivots (Lauscher et al., 2020). What affects the zero-shot transfer across different languages is a subject of considerable interest and importance (K et al., 2019;Pires et al., 2019;Wu and Dredze, 2019;Lauscher et al., 2020), however there is little conclusive evidence and a few papers even show contradictory findings. Lauscher et al. (2020) recently, showed that it is possible to predict the zero shot performance of mBERT and XLM-R on different languages by formulating it as a regression problem, with pretraining data size and typological similarities between the pivot and target languages as the input features, and the performance on downstream task as the prediction target. Along similar lines Srinivasan et al. (2021) and Dolicki and Spanakis (2021) explore zero-shot performance prediction with a larger set of features and different regression techniques.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_5",
            "content": "However, the efficacy of these solutions are severely limited by the lack of training data, that is, the number of languages for which performance metrics are available for a given task. For instance, for most tasks in the popular XTREME-R benchmark, there are data points for 7-11 languages. This not only makes zero-shot performance prediction a challenging problem, but also a very important one because for practical deployment of such multilingual models, one would ideally like to know its performance for all the languages the model is supposed to handle. As Srinivasan et al. (2021) shows, accurate performance predictors can also help us build better and fairer multilingual models by suggesting data labeling strategies.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_6",
            "content": "In this work, we propose multi-task learning (Zhang and Yang, 2017) as an approach to mitigate training-data constraints and consequent over-fitting of the performance predictors to tasks and/or datasets. The contributions of our work are fourfold. First, we experiment with different multitask learning approaches, such as Group Lasso (Yuan and Lin, 2006), Collective Matrix Factorization (Cortes, 2018), Multi-Task Deep Gaussian Process Regression (Bonilla et al., 2008) and Meta Agnostic Meta Learning (Finn et al., 2017) for 11 tasks. We observe an overall 10% reduction in performance prediction errors compared to the best performing single-task models. The gains are even stronger when we just consider the tasks with very few data points (≤ 10), where we see a 20% drop in the mean absolute errors. Second, an interesting consequence of modelling this problem via multi-task learning is that we are able to predict performance on low resource languages much more accurately, where in some cases single-task approaches may perform even worse than the simple averaging baselines. Third, apart from the features used for zero-shot performance prediction in the previous work (Lauscher et al., 2020;Srinivasan et al., 2021;Dolicki and Spanakis, 2021), we also utilize metrics quantifying the quality of multilingual tokenizers as proposed in (Rust et al., 2021) as features in our predictive models, which turn out to have strong predictive power for certain tasks. To the best of our knowledge, our work is the first to explore the impact of tokenizer quality specifically on zero-shot transfer. And fourth, our multi-task framework in general lends us with a much more robust selection of features affecting the zero-shot performance. This, in turn, lets us investigate the critical open question on what influences the zero-shot performances across languages more rigorously. As we shall see, our findings corroborate some of the previous conclusions, while others are extended or annulled.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_7",
            "content": "Background and Related Work",
            "ntype": "title",
            "meta": {
                "section": "2"
            }
        },
        {
            "ix": "331-ARR_v1_8",
            "content": "Zero Shot Transfer. Multilingual models like mBERT (Devlin et al., 2019) and XLM-R (Conneau et al., 2020) have shown surprising effectiveness in zero-shot transfer, where fine-tuning the MMLM on a task in some source language often leads to impressive performance on the same task in other languages as well without explicitly training on them. Pires et al. (2019) first observed this phenomenon for NER (Tjong Kim Sang, 2002;Tjong Kim Sang and De Meulder, 2003;Levow, 2006) and POS tagging (Nivre et al., 2018) tasks. Concurrently, Wu and Dredze (2019) also showed this surprisingly cross lingual transfer ability of mBERT additionally on tasks like Document Classification (Schwenk and Li, 2018), Natural Language Inference (Conneau et al., 2018) and Dependency Parsing (Nivre et al., 2018). Factors Affecting Zero Shot Transfer. Pires et al. (2019) showed that vocabulary memorization played little role in zero-shot generalization as language pairs with little word piece overlap also exhibited impressive crosslingual performance. K et al. arrived at a similar conclusion by training BERT on an artificially generated language to zero out the word overlap with the target languages, and observed only minor drops in the performance compared to training the model on English. On the contrary Wu and Dredze (2019), observed strong correlations between the sub-word overlap and the zero-shot performance in four out of five tasks. Wu and Dredze (2020) showed that mBERT performed much worse for zero-shot transfer to low resource languages (i.e., less pre-training data) than high resource ones on POS Tagging, NER and Dependency Parsing tasks. Lauscher et al. (2020) also had a similar observation on tasks like XNLI and XQuAD (Artetxe et al., 2020), though they found that the zero-shot performance on NER, POS tagging and Dependency Parsing tasks might not strictly depend on the pre-training size and could be better explained by different linguistic relatedness features like syntactic and phonological similarities between the language pair. Similar dependence on the typological relatedness such as word order had also been observed by Pires et al. (2019).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_9",
            "content": "Performance Prediction. Prior work has explored predicting the performance of machine learning models from unlabelled data by either measuring (dis)agreements between multiple classifiers (Platanios et al., 2014(Platanios et al., , 2017 or by utilizing underlying information about data distribution (Domhan et al., 2015). In the context of NLP Birch et al. (2008) explored predicting the performance of a Machine Translation system by utilizing different explanatory variables for the language pairs. Lin et al. (2019) proposed a learning to rank approach to choose transfer languages for cross lingual learning using several linguistic and dataset specific features. Specifically predicting the zero-shot performance of MMLMs was first explored in Lauscher et al. (2020), where they used a linear regression model to estimate the cross-lingual transfer performance based on pre-training data size and linguistic relatedness features. Srinivasan et al. (2021) tackled this problem by utilizing XGBoost Regressor for the prediction along with a larger set of features. Recently, Dolicki and Spanakis (2021) explored individual syntactic features for zero-shot performance prediction instead of working with aggregate similarity values, and showed about 2 to 4 times gain in performance. We extend these work by considering a multi-task learning approach, where performance prediction in a task utilizes not only the data available for that task, but also the patterns observed for other tasks.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_10",
            "content": "Problem Setup",
            "ntype": "title",
            "meta": {
                "section": "3"
            }
        },
        {
            "ix": "331-ARR_v1_11",
            "content": "We begin by defining the multi-task performance prediction problem and then describe the different linguistic and MMLM specific features used.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_12",
            "content": "Multi-Task Performance Prediction Problem",
            "ntype": "title",
            "meta": {
                "section": "3.1"
            }
        },
        {
            "ix": "331-ARR_v1_13",
            "content": "Consider a pre-trained multilingual model M, trained using self supervision on a set of languages L. Let T be the set of downstream NLP tasks, P be the set of pivot (source) languages for which training data is available for the downstream tasks for fine-tuning and T be the set of target languages for which validation/test data is available. Note that P ⊂ L and T ⊆ L. We use the zero-shot setting similar to Lauscher et al. (2020) which enforces P and T to be disjoint sets 1 , i.e., P ∩ T = ∅.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_14",
            "content": "We then define y M,t p,t ∈ R as the zero-shot performance on language t ∈ T on finetuning M on task t ∈ T in pivot language p ∈ P. Let x M p,t ∈ R n be the n-dimensional feature vector representing the corresponding train-test configuration. Since for our experiments we train and evaluate the performance prediction for a single model at a time, we will simplify the notations to y t p,t and x p,t . The predictor model can then be defined as the function f Θ,Φ : R n × T → R, where Θ ∈ R dg denotes the shared parameters across the tasks and the task specific parameters are given by Φ ∈ R ds×|T| . The objective function for training such a predictor model can be defined as:",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_15",
            "content": "J(Θ, Φ) = t∈T p∈P t∈T ∥f (x p,t , t; Θ, Φ) − y t p,j ∥ 2 2 + λ g ∥Θ∥ 1 + λ s ∥Φ∥ 1,1 + λ group ∥Φ∥ 1,q(1)",
            "ntype": "formula",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_16",
            "content": "The second and third terms regularize the global and task specific parameters independently, while the last term, l 1 /l q norm with q > 1, ensures a block sparse selection of the task specific parameters. This term ensures a multi-task learning behavior even when there are no parameters shared across the tasks (i.e., Θ = ∅) through selection of common features across the tasks. Setting Θ = ∅ and λ group = 0 leads to the single task setup of Lauscher et al. (2020) and Srinivasan et al. (2021).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_17",
            "content": "Features",
            "ntype": "title",
            "meta": {
                "section": "3.2"
            }
        },
        {
            "ix": "331-ARR_v1_18",
            "content": "We divide the set of features into two higher level categories, viz. the pairwise features defined for the pivot and target that measure the typological relatedness of the languages, and the individual features defined for the target language reflecting the state of its representation in M.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_19",
            "content": "Pairwise Features",
            "ntype": "title",
            "meta": {
                "section": "3.2.1"
            }
        },
        {
            "ix": "331-ARR_v1_20",
            "content": "Instead of directly using the different typological properties of the the two languages as features, we use the pairwise relatedness to avoid feature explosion. Subword Overlap : We define the subword overlap as the percentage of unique tokens that are common to the vocabularies of both the pivot and target languages. Let V p and V t be the subword vocabularies of p and t. The subword overlap is then defined as :",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_21",
            "content": "o sw (p, t) = |V p ∩ V t | |V p ∪ V t | (2)",
            "ntype": "formula",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_22",
            "content": "Similarity between Lang2Vec vectors: Following Lin et al. (2019) and Lauscher et al. (2020), we compute the typological relatedness between p and t from the linguistic features provided by the URIEL project (Littell et al., 2017). We use syntactic (s syn (p, t)), phonological similarity (s pho (p, t)), genetic similarity (s gen (p, t)) and geographic distance (d geo (p, t)). For details, please see Littell et al. (2017).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_23",
            "content": "Individual Features",
            "ntype": "title",
            "meta": {
                "section": "3.2.2"
            }
        },
        {
            "ix": "331-ARR_v1_24",
            "content": "Pre-training Size: We use the log 10 of the size (in words) of the pre-training corpus in the target language, SIZE(t), as a feature. Rare Typological Traits: Srinivasan et al. (2021) proposed this metric to capture the rarity of the typological features of a language in the representation of M. Every typological feature in WALS database is ranked based on the amount of pretraining data for the languages that contain the feature. For the language t, Mean Reciprocal Rank (MRR) of all of its features is then calculated and used as a feature -WMRR(t).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_25",
            "content": "Tokenizer Features : In their recent work, Rust et al. (2021) proposed two metrics, viz. tokenizer's fertility and proportion of continued words, to evaluate the quality of multilingual tokenizers on a given language. For target t, they define the tokenizer's fertility, FERT(t), as the average number of sub-words produced for every tokenized word in t's corpus. On the other hand, the proportion of continued words, PCW(t), measures how often the tokenizer chooses to continue a word across at least two tokens. They show that the multilingual models perform much worse on a task than their monolingual counterparts when the values of these metrics are higher for the multilingual tokenizer. We include FERT(t) and PCW(t) as features.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_26",
            "content": "Approaches",
            "ntype": "title",
            "meta": {
                "section": "4"
            }
        },
        {
            "ix": "331-ARR_v1_27",
            "content": "We extensively experiment with a wide-array of multi-task as well as single-task regression models to provide a fair comparison between different approaches to zero-shot performance prediction.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_28",
            "content": "Baselines",
            "ntype": "title",
            "meta": {
                "section": "4.1"
            }
        },
        {
            "ix": "331-ARR_v1_29",
            "content": "Average Score Within a Task (AWT) : The performance for a pivot-target pair (p , t) on a task t is approximated by taking the average of the performance on all other target languages (pivot being fixed) in the same task t, i.e., f (x p,t , t) =",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_30",
            "content": "1 |T |−1 t ′ ∈T −{t} y t p,t ′ .",
            "ntype": "formula",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_31",
            "content": "Average Score across the Tasks (AAT) : Here instead of averaging over all the target languages within a task, we approximate the performance on a given target language by averaging the scores for that language across the other tasks, i.e.,",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_32",
            "content": "f (x p,t , t) = 1 |T|−1 t ′ ∈T−{t} y t ′ p,t .",
            "ntype": "formula",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_33",
            "content": "Single Task Models",
            "ntype": "title",
            "meta": {
                "section": "4.2"
            }
        },
        {
            "ix": "331-ARR_v1_34",
            "content": "Lasso Regression: Lauscher et al. ( 2020) train different linear regression models for each task.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_35",
            "content": "Along similar lines, we experiment with linear regression, but also add an L1 regularization term, as we observed it usually leads to better predictors.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_36",
            "content": "XGBoost Regressor: As shown in Srinivasan et al. (2021), XGBoost (Chen and Guestrin, 2016) generally obtains impressive performance on this task, and hence we include it in our experiments as well.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_37",
            "content": "Multi Task Models",
            "ntype": "title",
            "meta": {
                "section": "4.3"
            }
        },
        {
            "ix": "331-ARR_v1_38",
            "content": "Group Lasso: l 1 /l q norm based blockregularization has been shown to be effective for multi-task learning in the setting of multi-linear regression (Yuan and Lin, 2006;Argyriou et al., 2008). For each task, consider separate linear regression models represented by the weight matrix Φ ∈ R n×|T| . The l 1 /l q regularization term is given as:",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_39",
            "content": "∥Φ∥ i,q = n j=1 ( |T| t=1 |Φ jt | q ) 1/q",
            "ntype": "formula",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_40",
            "content": ", where Φ jt denotes the weight for the feature j in the task t. For q > 1, minimizing this term pushes the l q -norms corresponding to the weights of a given feature across the tasks to be sparse, which encourages multiple predictors to share similar sparsity patterns. In other words, a common set of features is selected for all the tasks. We use q = 2 for the group regularization term.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_41",
            "content": "Since this can be restrictive in certain scenarios, some natural extensions to Group Lasso, such as Dirty Models (Jalali et al., 2010) and Multi Level Lasso (Lozano and Swirszcz, 2012), have been proposed that separate out the task specific and global parameters. We experimented with these methods and observed equivalent or worse performance compared to Group Lasso. Collective Matrix Factorization (CMF) with Side Information: Low rank approximation for the task weights matrices forms one family of methods for multi-task learning (Zhang and Yang, 2017;Pong et al., 2010;Ando et al., 2005). As a direct analogue with collaborative filtering, here we can think of the tasks as users and pivot-target pairs as items. Consider the matrix Y ∈ R |T|×|P×T | , where each element of the matrix correspond to y t p,t . We can then decompose the matrix into task and language-pair specific factors as",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_42",
            "content": "Y ∼ TL T (3)",
            "ntype": "formula",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_43",
            "content": "where T ∈ R |T|×d latent and L ∈ R |P×T |×d latent are the task and language-pair factor matrices, and d latent is the number of factors. Additionally, in order to incorporate the feature information about the language pairs as discussed in section 3.2, we incorporate Collective Matrix Factorization approach (Cortes, 2018). It incorporates the attribute information about items and/or users in the factorization algorithm by decomposing the language-pair feature matrix X ∈ R |P×T |×n as LF T , such that L is shared across both decompositions. This helps to learn the latent representations for the pivot-language pairs from the task-wise performance as well as different linguistic and MMLM specific features 2 . In relation to Equation 1, we can think of task factors T to correspond to the task specific parameters Φ, languagepair factors L as the shared parameters Θ and the predictor model as f (x p,t , t; Θ, Φ) = (TL T ) (p,t),t . Both L and T are regularized seperately, but there is no group regularization term (λ group = 0).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_44",
            "content": "We use the multi-task variant of Gaussian Processes proposed in Bonilla et al. (2008) and utilize deep neural networks to define the kernel functions as in Deep GPs (Wilson et al., 2016). For comparison, we also report the scores of the single-task variant of this method which we denote as DGPR. See Appendix (section A.1) for details.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_45",
            "content": "Apart from these we also explore other multitask methods like Model Agnostic Meta Learning (MAML) (Finn et al., 2017), details of which we leave in the appendix (section A.1).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_46",
            "content": "Experimental Setup",
            "ntype": "title",
            "meta": {
                "section": "5"
            }
        },
        {
            "ix": "331-ARR_v1_47",
            "content": "In this section, we discuss our test conditions, datasets and training parameters for the different experiments.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_48",
            "content": "Test Conditions",
            "ntype": "title",
            "meta": {
                "section": "5.1"
            }
        },
        {
            "ix": "331-ARR_v1_49",
            "content": "We consider two different test conditions: Leave One Language Out (LOLO) and Leave Low Resource Languages Out (LLRO). Leave One Language Out: LOLO is a popular setup for multilingual performance prediction (Lauscher et al., 2020;Srinivasan et al., 2021), where for a given task, we choose a target language and move all of its instances from the prediction dataset to the test data. The models are then trained on the remaining languages and evaluated on the unseen test language. This is done for all the target languages available for a task, and the Mean Absolute Error (MAE) across languages is reported. In the multi-task setting we evaluate on one task at a time while considering the rest as helper tasks for which the entire data is used including the test language 3 . Leave Low Resource Languages Out: Through this evaluation strategy we try to emulate the real world use case where we only have test data available in high resource languages such as English, German and Chinese, and would like to estimate the performance on under-represented languages such as Swahili and Bengali. We use the language taxonomy provided by Joshi et al. (2020) to categorize the languages into six classes (0 = low to 5 = high) based on the number of resources available. We then move languages belonging to class 3 or below to our test set and train the models on class 4 and 5 languages only. Similar to LOLO, here too we allow the helper tasks to retain all the languages.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_50",
            "content": "Tasks and Datasets",
            "ntype": "title",
            "meta": {
                "section": "5.2"
            }
        },
        {
            "ix": "331-ARR_v1_51",
            "content": "We use the following 11 tasks provided in XTREME (Hu et al., 2020) and XTREME-R benchmarks: 1. Classification: XNLI (Conneau et al., 2018) , PAWS-X (Yang et al., 2019), andXCOPA (Ponti et al., 2020) 2. Structure Prediction: UDPOS (Nivre et al., 2018), and NER (Pan et al., 2017) 3. Question Answering: XQUAD (Artetxe et al., 2020), MLQA (Lewis et al., 2020), and TyDiQA-GoldP (Clark et al., 2020) 4. Retrieval: Tatoeba (Artetxe and Schwenk, 2019), Mewsli-X (Botha et al., 2020;, and LAReQA (Roy et al., 2020) All of these datasets have training data present only in English i.e. P = {en}, and majority of the tasks have fewer than 10 target languages.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_52",
            "content": "Training Details",
            "ntype": "title",
            "meta": {
                "section": "5.3"
            }
        },
        {
            "ix": "331-ARR_v1_53",
            "content": "We train and evaluate our performance prediction models for mBERT (bert-base-multilingual-cased) and XLM-R (xlm-roberta-large). For training XG-Boost, we used 100 estimators with a maximum depth of 10. For Group Lasso, we used the implementation provided in the MuTaR software package 4 , and used a regularization strength of 0.01. We optimized CMF's objective function using Alternating Least Squares (ALS), used 5 latent factors with a regularization parameter equal to 0.1, and used the Collective Matrix Factorization python library 5 . In case of MDGPR, we used Radial Basis Function as the kernel and a two-layer MLP for learning latent features, with 50 and 10 units followed by ReLU activation. We set the learning rate and epochs as 0.01 and 200, and implemented it using GPyTorch 6 .",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_54",
            "content": "Results and Discussion",
            "ntype": "title",
            "meta": {
                "section": "6"
            }
        },
        {
            "ix": "331-ARR_v1_55",
            "content": "LOLO Results",
            "ntype": "title",
            "meta": {
                "section": "6.1"
            }
        },
        {
            "ix": "331-ARR_v1_56",
            "content": "Table 1 shows MAE (in %) for LOLO for different single-task and multi-task models on the tasks. For XLMR, we observe that multi-task models, primarily MDGPR, often outperform the best singletask models by significant margins, and for tasks Note that the Average across task baseline is quite competitive and performs better than singletask XGBoost and MAML in average, and better than all models for LAReQA.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_57",
            "content": "Figure 2 plots the dependence of the number of helper tasks on the performance of the multi-task models. As expected, MAE decreases as helper tasks increase, especially for MDGPR and CMF. On a related note, the Pearson Correlation coefficient between MAE and number of tasks a target language is part of is found to be −0.39, though the trend in this case is not as clear.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_58",
            "content": "LLRO Results",
            "ntype": "title",
            "meta": {
                "section": "6.2"
            }
        },
        {
            "ix": "331-ARR_v1_59",
            "content": "Predicting the performance on low resource languages, for which often standard training and test datasets are not available, can be an important use case where multi-task performance prediction can be helpful. Figure 6 in appendix shows the classwise (Joshi et al., 2020) distribution of languages for the tasks that we consider in our experiments. As one would expect, for most tasks, test data is available for languages belonging to class-4 and class-5. Training performance prediction models without any task to transfer from can therefore, possibly lead to poor generalization on the low resource languages. On the other hand, for the same reason -lack of test data, building accurate predictors for low-resource languages is necessary.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_60",
            "content": "MAE values for the LLRO evaluation setup are shown in figure 1 for XLMR. Results for mBERT follow similar trends and are reported in the Appendix (figure 7). For both XLMR and mBERT we observe that the three main multi-task models -Group Lasso, CMF and MDGPR -outperform the single-task models and baselines. Interestingly, for XLMR, the single task models XGBoost and Lasso perform even worse than the Average within Tasks baseline. Overall we see around 18% and 11% drop in MAE for Group Lasso over the best performing single-task model, for XLMR and mBERT respectively.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_61",
            "content": "Feature Importance",
            "ntype": "title",
            "meta": {
                "section": "6.3"
            }
        },
        {
            "ix": "331-ARR_v1_62",
            "content": "An interesting consequence of zero-shot performance prediction is that the models can be directly used to infer the correlation (and possibly causation) between linguistic relatedness and pretraining conditions and zero-shot transferability. Multi-task learning, in this context, help us make more robust inferences, as the models are less prone to overfitting to a particular task or dataset.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_63",
            "content": "Figure 3 shows the SHAP values of the features for the Group Lasso model trained on XLMR's zero-shot performance data. As expected for Group Lasso, we see a block-sparsity behavior among the tasks. Features such as Rare Typological Traits (WMRR(t)), Tokenizer's Fertility (FERT(t)) and Genetic Similarity (s gen (p, t)) are ignored in all the tasks. In contrast, for the single-task lasso regression (Figure 9 in Appendix), we see different sets of features selected for different tasks, which for the scale at which we operate, might not be indicative of the actual factors that affect the zero-shot performance in these tasks. Subword Overlap. Among the features that get selected for all tasks, we observe that Subword Overlap (o sw (p, t)) typically gets higher importance in retrieval (LAReQA and MewsliX) and sentence classification tasks (PAWS-X, XNLI). Since the retrieval tasks that we consider, as described in , measure the alignment between the cross lingual representations of semantically similar sentences, having a shared vocabulary between the languages can leak information from one to another (Wu and Dredze, 2019) which might improve the retrieval performance. Interestingly, if we compare this with the feature importance scores for the single task lasso model (Figure 9 in Appendix), we do see MewsliX task getting higher importance for the subword overlap, but LAReQA gets virtually zero SHAP value for this feature, showcasing how single-task models can misinterpret two similar tasks as requiring very different features. Our observation reinforce the generally held notion that vocabulary overlap between the pivot and target is beneficial for zero-shot transfer (Wu and Dredze, 2019), especially for retrieval tasks, though some studies have argued otherwise (Pires et al., 2019;K et al., 2019). Tokenizer Features. For structure prediction (UDPOS and WikiAnn) and question answering (XQUAD and TyDiQA) tasks that require making predictions for each token in the input, we see that the tokenizer feature, PCW(t), receive a higher SHAP value. In contrast, for single-task lasso, here too we do not observe high importance of this feature across these related tasks. Rust et al. (2021) note that languages such as Arabic where mBERT's multilingual tokenizer was found to be much worse than it's monolingual counterpart, there was a sharper drop in performance of mBERT compared to the monolingual model for QA, UDPOS and NER tasks than for sentiment classification. We believe that XLMR's surprisingly worse performance than mBERT for Chinese and Japanese on UDPOS might be correlated with it's significantly worse tokenizer for these languages based on the fertility (FERT) and Percentage Continued Words (PCW) feature values (see Appendix A.2 for exact values). The high SHAP values for PCW(t) further strengthen our belief 7 . Pre-training Size. Similar to the findings of Lauscher et al. (2020), we observe that pre-training corpus size has low SHAP value, and therefore, lower importance for lower level tasks such as UDPOS and NER, and higher SHAP values for higher level tasks like XNLI. Additionally, we extend their observations to tasks such as XCOPA, Tatoeba, MLQA and LAReQA where pre-training size seem to play a significant role in the performance prediction. Again, compared to single Lasso Regression model, we see a different selection pattern: Pre-training size receives a high SHAP value for UDPOS while for XNLI it is negligible. This neither fully conforms with our observations on the multi-task feature selections, nor with the previous work (Lauscher et al., 2020).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_64",
            "content": "Typological Relatedness Features. Out of all the typological relatedness features, we found Geographical Distance (d geo (p, t)) receiving highest SHAP values for all tasks, implying that geographical proximity between the pivot-target pair is an important factor in determining the zero-shot transferability between them. Lauscher et al. (2020) also observe positive correlations between geographical relatedness and zero-shot performance. The crosstask importance of geographic distance (unlike the other relatedness features) might be attributed to the 100% coverage across languages for the geographical vectors in the URIEL database. In contrast, Syntactic and Phonological vectors have missing values for a majority of the languages (Littell et al., 2017).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_65",
            "content": "Like Lauscher et al. (2020), we also see some dependence on syntactic (s syn (p, t)) and phonological (s pho (p, t)) similarities for XLMR's zero shot performance on XNLI and XQUAD tasks respectively. However, in both cases we found that the tokenizer feature PCW(t) receives a much higher SHAP value. Interestingly, genetic similarity (s gen (p, t)) is not selected for any task, arguably due to the block sparsity in feature selection of Group Lasso. We do see some tasks receiving high SHAP values for s gen (p, t) in single-task lasso (Figure 9 in Appendix). However, the number of such tasks as well as the SHAP values are on the lower side, implying that genetic similarity might not provide any additional information for zero-shot transfer over and above the geographical, syntactic and phonological similarities. Similar trends are observed in the case of mBERT as well (Figure 10 in appendix), with some minor differences. For instance, instead of PCW(t), FERT(t) receives higher SHAP value; s syn (p, t) also receives higher importance, especially for tasks like UDPOS and XNLI, which is consistent with the findings of Lauscher et al. (2020).",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_66",
            "content": "Conclusion and Future Work",
            "ntype": "title",
            "meta": {
                "section": "7"
            }
        },
        {
            "ix": "331-ARR_v1_67",
            "content": "In this paper, we showed that the zero-shot performance prediction problem can be much more effectively and robustly solved by using multi-task learning approaches. We see significant reduction in errors compared to the baselines and single-task models, specifically for the tasks which have test sets available in a very few languages or when trying to predict the performance for low resource languages. Additionally, this approach allows us to robustly identify factors that influence zero-shot performance. Our findings in this context can be summarized as follows.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_68",
            "content": "1. Subword overlap between the pivot and target has a strong positive influence on zero-shot transfer, especially for Retrieval tasks. 2. Quality of the target tokenizer, defined in terms of how often or how aggressively it splits the target tokens negatively influences zero-shot performance for word-level tasks such as POS tagging and Span extraction. 3. Pre-training size of the target positively influences zero-shot performance in many tasks, including XCOPA, Tatoeba, MLQA and LAReQA. 4. Geographical proximity between pivot and target is found to be uniformly important across all the tasks, unlike syntactic and phonological similarities, which are important for only some tasks.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_69",
            "content": "This last finding is especially interesting. As described earlier, geographical proximity is a more clear, noise-free and complete feature compared to the other relatedness metrics. However, one could also argue that since neighboring languages tend to have high vocabulary and typological feature overlap due to contact processes and shared areal features, geographical distance is an extremely informative feature for zero-shot transfer. Two direct implications of these findings are: (1) for effective use of MMLMs, one should develop resources in at least one pivot language per geographic regions, and (2) one should work towards multilingual tokenizers that are effective for most languages.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_70",
            "content": "There are a number of directions that can be explored in future related to our work. The prediction models can be extended to a multi-pivot and few-shot settings, as described in Srinivasan et al. (2021). Further probing experiments could be designed to understand the role of sub-word overlap on zero-shot transfer of Retrieval tasks. two tokenizers, however for languages like Chinese and Japanese, there is a dramatic increase in the values for XLMR. Interestingly, when we compare the zero-shot performance between mBERT and XLMR on structure prediction tasks like UD-POS and WikiANN, we see a surprisingly large drop (upto 20% absolute drop) in the performance for XLMR on these both Chinese and Japanese, whereas usually XLMR outperforms mBERT on these tasks (Refer to figure 5). This observation along with the feature importance for the tokenizer features that we observed for Group Lasso (3) indicate that tokenizer quality might play some role in the zero-shot transfer capabilities of the multilingual models. Table 2: Mean Absolute Errors (Scaled by 100 for readability) for different models trained to predict the zero shot performance of mBERT. In the \"Average\" row we average the MAEs across all the tasks and in the \"Average Low\" Res Tasks\", we consider the tasks with fewer than 10 target languages and take the average of the MAEs for those tasks.",
            "ntype": "p",
            "meta": null
        },
        {
            "ix": "331-ARR_v1_71",
            "content": "Tong Rie Kubota Ando, Peter Zhang,  Bartlett, A framework for learning predictive structures from multiple tasks and unlabeled data, 2005, Journal of Machine Learning Research, .",
            "ntype": "ref",
            "meta": {
                "xid": "b0",
                "authors": [
                    "Tong Rie Kubota Ando",
                    "Peter Zhang",
                    " Bartlett"
                ],
                "title": "A framework for learning predictive structures from multiple tasks and unlabeled data",
                "pub_date": "2005",
                "pub_title": "Journal of Machine Learning Research",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_72",
            "content": "Andreas Argyriou, Theodoros Evgeniou, Massimiliano Pontil, Convex multi-task feature learning, 2008, Machine learning, .",
            "ntype": "ref",
            "meta": {
                "xid": "b1",
                "authors": [
                    "Andreas Argyriou",
                    "Theodoros Evgeniou",
                    "Massimiliano Pontil"
                ],
                "title": "Convex multi-task feature learning",
                "pub_date": "2008",
                "pub_title": "Machine learning",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_73",
            "content": "Mikel Artetxe, Sebastian Ruder, Dani Yogatama, On the Cross-lingual Transferability of Monolingual Representations, 2020, Proceedings of ACL 2020, .",
            "ntype": "ref",
            "meta": {
                "xid": "b2",
                "authors": [
                    "Mikel Artetxe",
                    "Sebastian Ruder",
                    "Dani Yogatama"
                ],
                "title": "On the Cross-lingual Transferability of Monolingual Representations",
                "pub_date": "2020",
                "pub_title": "Proceedings of ACL 2020",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_74",
            "content": "Mikel Artetxe, Holger Schwenk, Massively Multilingual Sentence Embeddings for Zero-Shot Cross-Lingual Transfer and Beyond, 2019, Transactions of the ACL, .",
            "ntype": "ref",
            "meta": {
                "xid": "b3",
                "authors": [
                    "Mikel Artetxe",
                    "Holger Schwenk"
                ],
                "title": "Massively Multilingual Sentence Embeddings for Zero-Shot Cross-Lingual Transfer and Beyond",
                "pub_date": "2019",
                "pub_title": "Transactions of the ACL",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_75",
            "content": "Alexandra Birch, Miles Osborne, Philipp Koehn, Predicting success in machine translation, 2008, Proceedings of the 2008 Conference on Empirical Methods in Natural Language Processing, .",
            "ntype": "ref",
            "meta": {
                "xid": "b4",
                "authors": [
                    "Alexandra Birch",
                    "Miles Osborne",
                    "Philipp Koehn"
                ],
                "title": "Predicting success in machine translation",
                "pub_date": "2008",
                "pub_title": "Proceedings of the 2008 Conference on Empirical Methods in Natural Language Processing",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_76",
            "content": "V Edwin, Kian Bonilla, Christopher Chai,  Williams, Multi-task gaussian process prediction, 2008, Advances in Neural Information Processing Systems, Curran Associates, Inc.",
            "ntype": "ref",
            "meta": {
                "xid": "b5",
                "authors": [
                    "V Edwin",
                    "Kian Bonilla",
                    "Christopher Chai",
                    " Williams"
                ],
                "title": "Multi-task gaussian process prediction",
                "pub_date": "2008",
                "pub_title": "Advances in Neural Information Processing Systems",
                "pub": "Curran Associates, Inc"
            }
        },
        {
            "ix": "331-ARR_v1_77",
            "content": "Jan Botha, Zifei Shan, Daniel Gillick, Entity Linking in 100 Languages, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), Online. Association for Computational Linguistics.",
            "ntype": "ref",
            "meta": {
                "xid": "b6",
                "authors": [
                    "Jan Botha",
                    "Zifei Shan",
                    "Daniel Gillick"
                ],
                "title": "Entity Linking in 100 Languages",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP)",
                "pub": "Online. Association for Computational Linguistics"
            }
        },
        {
            "ix": "331-ARR_v1_78",
            "content": "Tianqi Chen, Carlos Guestrin, Xgboost: A scalable tree boosting system, 2016, Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD '16, Association for Computing Machinery.",
            "ntype": "ref",
            "meta": {
                "xid": "b7",
                "authors": [
                    "Tianqi Chen",
                    "Carlos Guestrin"
                ],
                "title": "Xgboost: A scalable tree boosting system",
                "pub_date": "2016",
                "pub_title": "Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD '16",
                "pub": "Association for Computing Machinery"
            }
        },
        {
            "ix": "331-ARR_v1_79",
            "content": "Jonathan Clark, Eunsol Choi, Michael Collins, Dan Garrette, Tom Kwiatkowski, Vitaly Nikolaev, Jennimaria Palomaki, TyDi QA: A Benchmark for Information-Seeking Question Answering in Typologically Diverse Languages, 2020, Transactions of the Association of Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b8",
                "authors": [
                    "Jonathan Clark",
                    "Eunsol Choi",
                    "Michael Collins",
                    "Dan Garrette",
                    "Tom Kwiatkowski",
                    "Vitaly Nikolaev",
                    "Jennimaria Palomaki"
                ],
                "title": "TyDi QA: A Benchmark for Information-Seeking Question Answering in Typologically Diverse Languages",
                "pub_date": "2020",
                "pub_title": "Transactions of the Association of Computational Linguistics",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_80",
            "content": "Alexis Conneau, Kartikay Khandelwal, Naman Goyal, Vishrav Chaudhary, Guillaume Wenzek, Francisco Guzmán, Edouard Grave, Myle Ott, Luke Zettlemoyer, Veselin Stoyanov, Unsupervised cross-lingual representation learning at scale, 2020, Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b9",
                "authors": [
                    "Alexis Conneau",
                    "Kartikay Khandelwal",
                    "Naman Goyal",
                    "Vishrav Chaudhary",
                    "Guillaume Wenzek",
                    "Francisco Guzmán",
                    "Edouard Grave",
                    "Myle Ott",
                    "Luke Zettlemoyer",
                    "Veselin Stoyanov"
                ],
                "title": "Unsupervised cross-lingual representation learning at scale",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_81",
            "content": "UNKNOWN, None, , , Holger Schwenk,.",
            "ntype": "ref",
            "meta": {
                "xid": "b10",
                "authors": null,
                "title": null,
                "pub_date": null,
                "pub_title": null,
                "pub": "Holger Schwenk,"
            }
        },
        {
            "ix": "331-ARR_v1_82",
            "content": "Veselin Stoyanov, XNLI: Evaluating crosslingual sentence representations, 2018, Proceedings of EMNLP 2018, .",
            "ntype": "ref",
            "meta": {
                "xid": "b11",
                "authors": [
                    "Veselin Stoyanov"
                ],
                "title": "XNLI: Evaluating crosslingual sentence representations",
                "pub_date": "2018",
                "pub_title": "Proceedings of EMNLP 2018",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_83",
            "content": "UNKNOWN, None, 2018, Cold-start recommendations in collective matrix factorization, .",
            "ntype": "ref",
            "meta": {
                "xid": "b12",
                "authors": null,
                "title": null,
                "pub_date": "2018",
                "pub_title": "Cold-start recommendations in collective matrix factorization",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_84",
            "content": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, Kristina Toutanova, BERT: Pre-training of deep bidirectional transformers for language understanding, 2019, Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Association for Computational Linguistics.",
            "ntype": "ref",
            "meta": {
                "xid": "b13",
                "authors": [
                    "Jacob Devlin",
                    "Ming-Wei Chang",
                    "Kenton Lee",
                    "Kristina Toutanova"
                ],
                "title": "BERT: Pre-training of deep bidirectional transformers for language understanding",
                "pub_date": "2019",
                "pub_title": "Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies",
                "pub": "Association for Computational Linguistics"
            }
        },
        {
            "ix": "331-ARR_v1_85",
            "content": "UNKNOWN, None, 2021, Analysing the impact of linguistic features on crosslingual transfer, .",
            "ntype": "ref",
            "meta": {
                "xid": "b14",
                "authors": null,
                "title": null,
                "pub_date": "2021",
                "pub_title": "Analysing the impact of linguistic features on crosslingual transfer",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_86",
            "content": "Tobias Domhan, Jost Springenberg, Frank Hutter, Speeding up automatic hyperparameter optimization of deep neural networks by extrapolation of learning curves, 2015, Twenty-fourth international joint conference on artificial intelligence, .",
            "ntype": "ref",
            "meta": {
                "xid": "b15",
                "authors": [
                    "Tobias Domhan",
                    "Jost Springenberg",
                    "Frank Hutter"
                ],
                "title": "Speeding up automatic hyperparameter optimization of deep neural networks by extrapolation of learning curves",
                "pub_date": "2015",
                "pub_title": "Twenty-fourth international joint conference on artificial intelligence",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_87",
            "content": "Chelsea Finn, Pieter Abbeel, Sergey Levine, Model-agnostic meta-learning for fast adaptation of deep networks, 2017, International Conference on Machine Learning, PMLR.",
            "ntype": "ref",
            "meta": {
                "xid": "b16",
                "authors": [
                    "Chelsea Finn",
                    "Pieter Abbeel",
                    "Sergey Levine"
                ],
                "title": "Model-agnostic meta-learning for fast adaptation of deep networks",
                "pub_date": "2017",
                "pub_title": "International Conference on Machine Learning",
                "pub": "PMLR"
            }
        },
        {
            "ix": "331-ARR_v1_88",
            "content": "UNKNOWN, None, 2003, Xtreme: A massively multilingual multi-task benchmark for evaluating cross-lingual generalization, .",
            "ntype": "ref",
            "meta": {
                "xid": "b17",
                "authors": null,
                "title": null,
                "pub_date": "2003",
                "pub_title": "Xtreme: A massively multilingual multi-task benchmark for evaluating cross-lingual generalization",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_89",
            "content": "Ali Jalali, Sujay Sanghavi, Chao Ruan, Pradeep Ravikumar, A dirty model for multi-task learning, 2010, Advances in Neural Information Processing Systems, Curran Associates, Inc.",
            "ntype": "ref",
            "meta": {
                "xid": "b18",
                "authors": [
                    "Ali Jalali",
                    "Sujay Sanghavi",
                    "Chao Ruan",
                    "Pradeep Ravikumar"
                ],
                "title": "A dirty model for multi-task learning",
                "pub_date": "2010",
                "pub_title": "Advances in Neural Information Processing Systems",
                "pub": "Curran Associates, Inc"
            }
        },
        {
            "ix": "331-ARR_v1_90",
            "content": "Pratik Joshi, Sebastin Santy, Amar Budhiraja, Kalika Bali, Monojit Choudhury, The state and fate of linguistic diversity and inclusion in the NLP world, 2020, Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, Online. Association for Computational Linguistics.",
            "ntype": "ref",
            "meta": {
                "xid": "b19",
                "authors": [
                    "Pratik Joshi",
                    "Sebastin Santy",
                    "Amar Budhiraja",
                    "Kalika Bali",
                    "Monojit Choudhury"
                ],
                "title": "The state and fate of linguistic diversity and inclusion in the NLP world",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics",
                "pub": "Online. Association for Computational Linguistics"
            }
        },
        {
            "ix": "331-ARR_v1_91",
            "content": "UNKNOWN, None, 2019, Cross-lingual ability of multilingual bert: An empirical study, .",
            "ntype": "ref",
            "meta": {
                "xid": "b20",
                "authors": null,
                "title": null,
                "pub_date": "2019",
                "pub_title": "Cross-lingual ability of multilingual bert: An empirical study",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_92",
            "content": "Anne Lauscher, Vinit Ravishankar, Ivan Vulić, Goran Glavaš, From zero to hero: On the limitations of zero-shot language transfer with multilingual Transformers, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), Association for Computational Linguistics.",
            "ntype": "ref",
            "meta": {
                "xid": "b21",
                "authors": [
                    "Anne Lauscher",
                    "Vinit Ravishankar",
                    "Ivan Vulić",
                    "Goran Glavaš"
                ],
                "title": "From zero to hero: On the limitations of zero-shot language transfer with multilingual Transformers",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP)",
                "pub": "Association for Computational Linguistics"
            }
        },
        {
            "ix": "331-ARR_v1_93",
            "content": "Gina-Anne Levow, The third international Chinese language processing bakeoff: Word segmentation and named entity recognition, 2006, Proceedings of the Fifth SIGHAN Workshop on Chinese Language Processing, Association for Computational Linguistics.",
            "ntype": "ref",
            "meta": {
                "xid": "b22",
                "authors": [
                    "Gina-Anne Levow"
                ],
                "title": "The third international Chinese language processing bakeoff: Word segmentation and named entity recognition",
                "pub_date": "2006",
                "pub_title": "Proceedings of the Fifth SIGHAN Workshop on Chinese Language Processing",
                "pub": "Association for Computational Linguistics"
            }
        },
        {
            "ix": "331-ARR_v1_94",
            "content": "Patrick Lewis, Barlas Oguz, Ruty Rinott, Sebastian Riedel, Holger Schwenk, MLQA: Evaluating Cross-lingual Extractive Question Answering, 2020, Proceedings of ACL 2020, .",
            "ntype": "ref",
            "meta": {
                "xid": "b23",
                "authors": [
                    "Patrick Lewis",
                    "Barlas Oguz",
                    "Ruty Rinott",
                    "Sebastian Riedel",
                    "Holger Schwenk"
                ],
                "title": "MLQA: Evaluating Cross-lingual Extractive Question Answering",
                "pub_date": "2020",
                "pub_title": "Proceedings of ACL 2020",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_95",
            "content": "Yu-Hsiang Lin, Chian-Yu Chen, Jean Lee, Zirui Li, Yuyan Zhang, Mengzhou Xia, Shruti Rijhwani, Junxian He, Zhisong Zhang, Xuezhe Ma, Antonios Anastasopoulos, Patrick Littell, and Graham Neubig, 2019, Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b24",
                "authors": [
                    "Yu-Hsiang Lin",
                    "Chian-Yu Chen",
                    "Jean Lee",
                    "Zirui Li",
                    "Yuyan Zhang",
                    "Mengzhou Xia",
                    "Shruti Rijhwani",
                    "Junxian He",
                    "Zhisong Zhang",
                    "Xuezhe Ma"
                ],
                "title": "Antonios Anastasopoulos, Patrick Littell, and Graham Neubig",
                "pub_date": "2019",
                "pub_title": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_96",
            "content": "Patrick Littell, David Mortensen, Ke Lin, Katherine Kairis, Carlisle Turner, Lori Levin, URIEL and lang2vec: Representing languages as typological, geographical, and phylogenetic vectors, 2017, Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics, Association for Computational Linguistics.",
            "ntype": "ref",
            "meta": {
                "xid": "b25",
                "authors": [
                    "Patrick Littell",
                    "David Mortensen",
                    "Ke Lin",
                    "Katherine Kairis",
                    "Carlisle Turner",
                    "Lori Levin"
                ],
                "title": "URIEL and lang2vec: Representing languages as typological, geographical, and phylogenetic vectors",
                "pub_date": "2017",
                "pub_title": "Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics",
                "pub": "Association for Computational Linguistics"
            }
        },
        {
            "ix": "331-ARR_v1_97",
            "content": "C Aurelie, Grzegorz Lozano,  Swirszcz, Multilevel lasso for sparse multi-task regression, 2012, Proceedings of the 29th International Coference on International Conference on Machine Learning, .",
            "ntype": "ref",
            "meta": {
                "xid": "b26",
                "authors": [
                    "C Aurelie",
                    "Grzegorz Lozano",
                    " Swirszcz"
                ],
                "title": "Multilevel lasso for sparse multi-task regression",
                "pub_date": "2012",
                "pub_title": "Proceedings of the 29th International Coference on International Conference on Machine Learning",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_98",
            "content": "UNKNOWN, None, , , Mohammed Attia.",
            "ntype": "ref",
            "meta": {
                "xid": "b27",
                "authors": null,
                "title": null,
                "pub_date": null,
                "pub_title": null,
                "pub": "Mohammed Attia"
            }
        },
        {
            "ix": "331-ARR_v1_99",
            "content": "Xiaoman Pan, Boliang Zhang, Jonathan May, Joel Nothman, Kevin Knight, Heng Ji, Cross-lingual name tagging and linking for 282 languages, 2017, Proceedings of ACL 2017, .",
            "ntype": "ref",
            "meta": {
                "xid": "b28",
                "authors": [
                    "Xiaoman Pan",
                    "Boliang Zhang",
                    "Jonathan May",
                    "Joel Nothman",
                    "Kevin Knight",
                    "Heng Ji"
                ],
                "title": "Cross-lingual name tagging and linking for 282 languages",
                "pub_date": "2017",
                "pub_title": "Proceedings of ACL 2017",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_100",
            "content": "Telmo Pires, Eva Schlinger, Dan Garrette, How multilingual is multilingual BERT?, 2019, Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b29",
                "authors": [
                    "Telmo Pires",
                    "Eva Schlinger",
                    "Dan Garrette"
                ],
                "title": "How multilingual is multilingual BERT?",
                "pub_date": "2019",
                "pub_title": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_101",
            "content": "UNKNOWN, None, 2017, Estimating accuracy from unlabeled data: A probabilistic logic approach, .",
            "ntype": "ref",
            "meta": {
                "xid": "b30",
                "authors": null,
                "title": null,
                "pub_date": "2017",
                "pub_title": "Estimating accuracy from unlabeled data: A probabilistic logic approach",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_102",
            "content": "UNKNOWN, None, 2014, Estimating accuracy from unlabeled data, .",
            "ntype": "ref",
            "meta": {
                "xid": "b31",
                "authors": null,
                "title": null,
                "pub_date": "2014",
                "pub_title": "Estimating accuracy from unlabeled data",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_103",
            "content": "Paul Ting Kei Pong, Shuiwang Tseng, Jieping Ji,  Ye, Trace norm regularization: Reformulations, algorithms, and multi-task learning, 2010, SIAM Journal on Optimization, .",
            "ntype": "ref",
            "meta": {
                "xid": "b32",
                "authors": [
                    "Paul Ting Kei Pong",
                    "Shuiwang Tseng",
                    "Jieping Ji",
                    " Ye"
                ],
                "title": "Trace norm regularization: Reformulations, algorithms, and multi-task learning",
                "pub_date": "2010",
                "pub_title": "SIAM Journal on Optimization",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_104",
            "content": "Goran Edoardo Maria Ponti, Olga Glavaš, Qianchu Majewska, Ivan Liu, Anna Vulić,  Korhonen, XCOPA: A multilingual dataset for causal commonsense reasoning, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), .",
            "ntype": "ref",
            "meta": {
                "xid": "b33",
                "authors": [
                    "Goran Edoardo Maria Ponti",
                    "Olga Glavaš",
                    "Qianchu Majewska",
                    "Ivan Liu",
                    "Anna Vulić",
                    " Korhonen"
                ],
                "title": "XCOPA: A multilingual dataset for causal commonsense reasoning",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP)",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_105",
            "content": "Uma Roy, Noah Constant, Rami Al-Rfou, Aditya Barua, Aaron Phillips, Yinfei Yang, LAReQA: Language-agnostic answer retrieval from a multilingual pool, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), Online. Association for Computational Linguistics.",
            "ntype": "ref",
            "meta": {
                "xid": "b34",
                "authors": [
                    "Uma Roy",
                    "Noah Constant",
                    "Rami Al-Rfou",
                    "Aditya Barua",
                    "Aaron Phillips",
                    "Yinfei Yang"
                ],
                "title": "LAReQA: Language-agnostic answer retrieval from a multilingual pool",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP)",
                "pub": "Online. Association for Computational Linguistics"
            }
        },
        {
            "ix": "331-ARR_v1_106",
            "content": "UNKNOWN, None, 2021, Xtremer: Towards more challenging and nuanced multilingual evaluation, .",
            "ntype": "ref",
            "meta": {
                "xid": "b35",
                "authors": null,
                "title": null,
                "pub_date": "2021",
                "pub_title": "Xtremer: Towards more challenging and nuanced multilingual evaluation",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_107",
            "content": "Phillip Rust, Jonas Pfeiffer, Ivan Vulić, Sebastian Ruder, Iryna Gurevych, How good is your tokenizer? on the monolingual performance of multilingual language models, 2021, Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing, Long Papers.",
            "ntype": "ref",
            "meta": {
                "xid": "b36",
                "authors": [
                    "Phillip Rust",
                    "Jonas Pfeiffer",
                    "Ivan Vulić",
                    "Sebastian Ruder",
                    "Iryna Gurevych"
                ],
                "title": "How good is your tokenizer? on the monolingual performance of multilingual language models",
                "pub_date": "2021",
                "pub_title": "Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing",
                "pub": "Long Papers"
            }
        },
        {
            "ix": "331-ARR_v1_108",
            "content": "Holger Schwenk, Xian Li, A corpus for multilingual document classification in eight languages, 2018, Proceedings of the Eleventh International Conference on Language Resources and Evaluation (LREC 2018), .",
            "ntype": "ref",
            "meta": {
                "xid": "b37",
                "authors": [
                    "Holger Schwenk",
                    "Xian Li"
                ],
                "title": "A corpus for multilingual document classification in eight languages",
                "pub_date": "2018",
                "pub_title": "Proceedings of the Eleventh International Conference on Language Resources and Evaluation (LREC 2018)",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_109",
            "content": "UNKNOWN, None, 2021, Sandipan Dandapat, Kalika Bali, and Monojit Choudhury, .",
            "ntype": "ref",
            "meta": {
                "xid": "b38",
                "authors": null,
                "title": null,
                "pub_date": "2021",
                "pub_title": "Sandipan Dandapat, Kalika Bali, and Monojit Choudhury",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_110",
            "content": "Erik , Tjong Kim Sang, Introduction to the CoNLL-2002 shared task: Language-independent named entity recognition, 2002, COLING-02: The 6th Conference on Natural Language Learning, .",
            "ntype": "ref",
            "meta": {
                "xid": "b39",
                "authors": [
                    "Erik ",
                    "Tjong Kim Sang"
                ],
                "title": "Introduction to the CoNLL-2002 shared task: Language-independent named entity recognition",
                "pub_date": "2002",
                "pub_title": "COLING-02: The 6th Conference on Natural Language Learning",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_111",
            "content": "Erik Tjong, Kim Sang, Fien De Meulder, Introduction to the CoNLL-2003 shared task: Language-independent named entity recognition, 2003, Proceedings of the Seventh Conference on Natural Language Learning at HLT-NAACL 2003, .",
            "ntype": "ref",
            "meta": {
                "xid": "b40",
                "authors": [
                    "Erik Tjong",
                    "Kim Sang",
                    "Fien De Meulder"
                ],
                "title": "Introduction to the CoNLL-2003 shared task: Language-independent named entity recognition",
                "pub_date": "2003",
                "pub_title": "Proceedings of the Seventh Conference on Natural Language Learning at HLT-NAACL 2003",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_112",
            "content": "Zhiting Andrew Gordon Wilson, Ruslan Hu, Eric Salakhutdinov,  Xing, Deep kernel learning, 2016, Proceedings of the 19th International Conference on Artificial Intelligence and Statistics, .",
            "ntype": "ref",
            "meta": {
                "xid": "b41",
                "authors": [
                    "Zhiting Andrew Gordon Wilson",
                    "Ruslan Hu",
                    "Eric Salakhutdinov",
                    " Xing"
                ],
                "title": "Deep kernel learning",
                "pub_date": "2016",
                "pub_title": "Proceedings of the 19th International Conference on Artificial Intelligence and Statistics",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_113",
            "content": "Shijie Wu, Mark Dredze, Beto, bentz, becas: The surprising cross-lingual effectiveness of BERT, 2019, Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP), .",
            "ntype": "ref",
            "meta": {
                "xid": "b42",
                "authors": [
                    "Shijie Wu",
                    "Mark Dredze"
                ],
                "title": "Beto, bentz, becas: The surprising cross-lingual effectiveness of BERT",
                "pub_date": "2019",
                "pub_title": "Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP)",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_114",
            "content": "Shijie Wu, Mark Dredze, Are all languages created equal in multilingual BERT?, 2020, Proceedings of the 5th Workshop on Representation Learning for NLP, .",
            "ntype": "ref",
            "meta": {
                "xid": "b43",
                "authors": [
                    "Shijie Wu",
                    "Mark Dredze"
                ],
                "title": "Are all languages created equal in multilingual BERT?",
                "pub_date": "2020",
                "pub_title": "Proceedings of the 5th Workshop on Representation Learning for NLP",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_115",
            "content": "Yinfei Yang, Yuan Zhang, Chris Tar, Jason Baldridge, PAWS-X: A cross-lingual adversarial dataset for paraphrase identification, 2019, Proceedings of EMNLP 2019, .",
            "ntype": "ref",
            "meta": {
                "xid": "b44",
                "authors": [
                    "Yinfei Yang",
                    "Yuan Zhang",
                    "Chris Tar",
                    "Jason Baldridge"
                ],
                "title": "PAWS-X: A cross-lingual adversarial dataset for paraphrase identification",
                "pub_date": "2019",
                "pub_title": "Proceedings of EMNLP 2019",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_116",
            "content": "Ming Yuan, Yi Lin, Model selection and estimation in regression with grouped variables, 2006, Journal of the Royal Statistical Society: Series B (Statistical Methodology), .",
            "ntype": "ref",
            "meta": {
                "xid": "b45",
                "authors": [
                    "Ming Yuan",
                    "Yi Lin"
                ],
                "title": "Model selection and estimation in regression with grouped variables",
                "pub_date": "2006",
                "pub_title": "Journal of the Royal Statistical Society: Series B (Statistical Methodology)",
                "pub": null
            }
        },
        {
            "ix": "331-ARR_v1_117",
            "content": "Yu Zhang, Qiang Yang, A survey on multitask learning, 2017, IEEE Transactions on Knowledge and Data Engineering, .",
            "ntype": "ref",
            "meta": {
                "xid": "b46",
                "authors": [
                    "Yu Zhang",
                    "Qiang Yang"
                ],
                "title": "A survey on multitask learning",
                "pub_date": "2017",
                "pub_title": "IEEE Transactions on Knowledge and Data Engineering",
                "pub": null
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "331-ARR_v1_0@0",
            "content": "Multi Task Learning For Zero Shot Performance Prediction of Multilingual Models",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_0",
            "start": 0,
            "end": 78,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_2@0",
            "content": "Massively Multilingual Transformer based Language Models have been observed to be surprisingly effective on zero-shot transfer across languages, though the performance varies from language to language depending on the pivot language(s) used for fine-tuning.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_2",
            "start": 0,
            "end": 256,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_2@1",
            "content": "In this work, we build upon some of the existing techniques for predicting the zero-shot performance on a task, by modeling it as a multi-task learning problem.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_2",
            "start": 258,
            "end": 417,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_2@2",
            "content": "We jointly train predictive models for different tasks which helps us build more accurate predictors for tasks where we have test data in very few languages to measure the actual performance of the model.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_2",
            "start": 419,
            "end": 622,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_2@3",
            "content": "Our approach also lends us the ability to perform a much more robust feature selection, and identify a common set of features that influence zero-shot performance across a variety of tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_2",
            "start": 624,
            "end": 812,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_4@0",
            "content": "Multilingual models like mBERT (Devlin et al., 2019) and XLM-R (Conneau et al., 2020) have been recently shown to be surprisingly effective for zero-shot transfer (Pires et al., 2019) (Wu and Dredze, 2019), where on fine-tuning for a task on one or a few languages, called pivots, they can perform well on languages unseen during training.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_4",
            "start": 0,
            "end": 338,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_4@1",
            "content": "The zero-shot performance however, is often not uniform across the languages and the multilingual models turn out to be much less effective for low resource languages (Wu and Dredze, 2020;Lauscher et al., 2020) and the languages that are typologically distant from the pivots (Lauscher et al., 2020).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_4",
            "start": 340,
            "end": 639,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_4@2",
            "content": "What affects the zero-shot transfer across different languages is a subject of considerable interest and importance (K et al., 2019;Pires et al., 2019;Wu and Dredze, 2019;Lauscher et al., 2020), however there is little conclusive evidence and a few papers even show contradictory findings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_4",
            "start": 641,
            "end": 929,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_4@3",
            "content": "Lauscher et al. (2020) recently, showed that it is possible to predict the zero shot performance of mBERT and XLM-R on different languages by formulating it as a regression problem, with pretraining data size and typological similarities between the pivot and target languages as the input features, and the performance on downstream task as the prediction target.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_4",
            "start": 931,
            "end": 1294,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_4@4",
            "content": "Along similar lines Srinivasan et al. (2021) and Dolicki and Spanakis (2021) explore zero-shot performance prediction with a larger set of features and different regression techniques.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_4",
            "start": 1296,
            "end": 1479,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_5@0",
            "content": "However, the efficacy of these solutions are severely limited by the lack of training data, that is, the number of languages for which performance metrics are available for a given task.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_5",
            "start": 0,
            "end": 185,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_5@1",
            "content": "For instance, for most tasks in the popular XTREME-R benchmark, there are data points for 7-11 languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_5",
            "start": 187,
            "end": 291,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_5@2",
            "content": "This not only makes zero-shot performance prediction a challenging problem, but also a very important one because for practical deployment of such multilingual models, one would ideally like to know its performance for all the languages the model is supposed to handle.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_5",
            "start": 293,
            "end": 561,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_5@3",
            "content": "As Srinivasan et al. (2021) shows, accurate performance predictors can also help us build better and fairer multilingual models by suggesting data labeling strategies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_5",
            "start": 563,
            "end": 729,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_6@0",
            "content": "In this work, we propose multi-task learning (Zhang and Yang, 2017) as an approach to mitigate training-data constraints and consequent over-fitting of the performance predictors to tasks and/or datasets.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_6",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_6@1",
            "content": "The contributions of our work are fourfold.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_6",
            "start": 205,
            "end": 247,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_6@2",
            "content": "First, we experiment with different multitask learning approaches, such as Group Lasso (Yuan and Lin, 2006), Collective Matrix Factorization (Cortes, 2018), Multi-Task Deep Gaussian Process Regression (Bonilla et al., 2008) and Meta Agnostic Meta Learning (Finn et al., 2017) for 11 tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_6",
            "start": 249,
            "end": 537,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_6@3",
            "content": "We observe an overall 10% reduction in performance prediction errors compared to the best performing single-task models.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_6",
            "start": 539,
            "end": 658,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_6@4",
            "content": "The gains are even stronger when we just consider the tasks with very few data points (≤ 10), where we see a 20% drop in the mean absolute errors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_6",
            "start": 660,
            "end": 805,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_6@5",
            "content": "Second, an interesting consequence of modelling this problem via multi-task learning is that we are able to predict performance on low resource languages much more accurately, where in some cases single-task approaches may perform even worse than the simple averaging baselines.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_6",
            "start": 807,
            "end": 1084,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_6@6",
            "content": "Third, apart from the features used for zero-shot performance prediction in the previous work (Lauscher et al., 2020;Srinivasan et al., 2021;Dolicki and Spanakis, 2021), we also utilize metrics quantifying the quality of multilingual tokenizers as proposed in (Rust et al., 2021) as features in our predictive models, which turn out to have strong predictive power for certain tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_6",
            "start": 1086,
            "end": 1468,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_6@7",
            "content": "To the best of our knowledge, our work is the first to explore the impact of tokenizer quality specifically on zero-shot transfer. And fourth, our multi-task framework in general lends us with a much more robust selection of features affecting the zero-shot performance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_6",
            "start": 1470,
            "end": 1739,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_6@8",
            "content": "This, in turn, lets us investigate the critical open question on what influences the zero-shot performances across languages more rigorously.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_6",
            "start": 1741,
            "end": 1881,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_6@9",
            "content": "As we shall see, our findings corroborate some of the previous conclusions, while others are extended or annulled.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_6",
            "start": 1883,
            "end": 1996,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_7@0",
            "content": "Background and Related Work",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_7",
            "start": 0,
            "end": 26,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@0",
            "content": "Zero Shot Transfer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 0,
            "end": 18,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@1",
            "content": "Multilingual models like mBERT (Devlin et al., 2019) and XLM-R (Conneau et al., 2020) have shown surprising effectiveness in zero-shot transfer, where fine-tuning the MMLM on a task in some source language often leads to impressive performance on the same task in other languages as well without explicitly training on them.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 20,
            "end": 343,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@2",
            "content": "Pires et al. (2019) first observed this phenomenon for NER (Tjong Kim Sang, 2002;Tjong Kim Sang and De Meulder, 2003;Levow, 2006) and POS tagging (Nivre et al., 2018) tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 345,
            "end": 517,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@3",
            "content": "Concurrently, Wu and Dredze (2019) also showed this surprisingly cross lingual transfer ability of mBERT additionally on tasks like Document Classification (Schwenk and Li, 2018), Natural Language Inference (Conneau et al., 2018) and Dependency Parsing (Nivre et al., 2018).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 519,
            "end": 792,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@4",
            "content": "Factors Affecting Zero Shot Transfer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 794,
            "end": 830,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@5",
            "content": "Pires et al. (2019) showed that vocabulary memorization played little role in zero-shot generalization as language pairs with little word piece overlap also exhibited impressive crosslingual performance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 832,
            "end": 1034,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@6",
            "content": "K et al. arrived at a similar conclusion by training BERT on an artificially generated language to zero out the word overlap with the target languages, and observed only minor drops in the performance compared to training the model on English.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 1036,
            "end": 1278,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@7",
            "content": "On the contrary Wu and Dredze (2019), observed strong correlations between the sub-word overlap and the zero-shot performance in four out of five tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 1280,
            "end": 1431,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@8",
            "content": "Wu and Dredze (2020) showed that mBERT performed much worse for zero-shot transfer to low resource languages (i.e., less pre-training data) than high resource ones on POS Tagging, NER and Dependency Parsing tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 1433,
            "end": 1645,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@9",
            "content": "Lauscher et al. (2020) also had a similar observation on tasks like XNLI and XQuAD (Artetxe et al., 2020), though they found that the zero-shot performance on NER, POS tagging and Dependency Parsing tasks might not strictly depend on the pre-training size and could be better explained by different linguistic relatedness features like syntactic and phonological similarities between the language pair.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 1647,
            "end": 2048,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_8@10",
            "content": "Similar dependence on the typological relatedness such as word order had also been observed by Pires et al. (2019).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_8",
            "start": 2050,
            "end": 2164,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_9@0",
            "content": "Performance Prediction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_9",
            "start": 0,
            "end": 22,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_9@1",
            "content": "Prior work has explored predicting the performance of machine learning models from unlabelled data by either measuring (dis)agreements between multiple classifiers (Platanios et al., 2014(Platanios et al., , 2017 or by utilizing underlying information about data distribution (Domhan et al., 2015).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_9",
            "start": 24,
            "end": 321,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_9@2",
            "content": "In the context of NLP Birch et al. (2008) explored predicting the performance of a Machine Translation system by utilizing different explanatory variables for the language pairs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_9",
            "start": 323,
            "end": 500,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_9@3",
            "content": "Lin et al. (2019) proposed a learning to rank approach to choose transfer languages for cross lingual learning using several linguistic and dataset specific features.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_9",
            "start": 502,
            "end": 667,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_9@4",
            "content": "Specifically predicting the zero-shot performance of MMLMs was first explored in Lauscher et al. (2020), where they used a linear regression model to estimate the cross-lingual transfer performance based on pre-training data size and linguistic relatedness features.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_9",
            "start": 669,
            "end": 934,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_9@5",
            "content": "Srinivasan et al. (2021) tackled this problem by utilizing XGBoost Regressor for the prediction along with a larger set of features.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_9",
            "start": 936,
            "end": 1067,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_9@6",
            "content": "Recently, Dolicki and Spanakis (2021) explored individual syntactic features for zero-shot performance prediction instead of working with aggregate similarity values, and showed about 2 to 4 times gain in performance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_9",
            "start": 1069,
            "end": 1285,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_9@7",
            "content": "We extend these work by considering a multi-task learning approach, where performance prediction in a task utilizes not only the data available for that task, but also the patterns observed for other tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_9",
            "start": 1287,
            "end": 1492,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_10@0",
            "content": "Problem Setup",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_10",
            "start": 0,
            "end": 12,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_11@0",
            "content": "We begin by defining the multi-task performance prediction problem and then describe the different linguistic and MMLM specific features used.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_11",
            "start": 0,
            "end": 141,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_12@0",
            "content": "Multi-Task Performance Prediction Problem",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_12",
            "start": 0,
            "end": 40,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_13@0",
            "content": "Consider a pre-trained multilingual model M, trained using self supervision on a set of languages L. Let T be the set of downstream NLP tasks, P be the set of pivot (source) languages for which training data is available for the downstream tasks for fine-tuning and T be the set of target languages for which validation/test data is available.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_13",
            "start": 0,
            "end": 342,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_13@1",
            "content": "Note that P ⊂ L and T ⊆ L. We use the zero-shot setting similar to Lauscher et al. (2020) which enforces P and T to be disjoint sets 1 , i.e., P ∩ T = ∅.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_13",
            "start": 344,
            "end": 496,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_14@0",
            "content": "We then define y M,t p,t ∈ R as the zero-shot performance on language t ∈ T on finetuning M on task t ∈ T in pivot language p ∈ P. Let x M p,t ∈ R n be the n-dimensional feature vector representing the corresponding train-test configuration.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_14",
            "start": 0,
            "end": 240,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_14@1",
            "content": "Since for our experiments we train and evaluate the performance prediction for a single model at a time, we will simplify the notations to y t p,t and x p,t .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_14",
            "start": 242,
            "end": 399,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_14@2",
            "content": "The predictor model can then be defined as the function f Θ,Φ : R n × T → R, where Θ ∈ R dg denotes the shared parameters across the tasks and the task specific parameters are given by Φ ∈ R ds×|T| .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_14",
            "start": 401,
            "end": 599,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_14@3",
            "content": "The objective function for training such a predictor model can be defined as:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_14",
            "start": 601,
            "end": 677,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_15@0",
            "content": "J(Θ, Φ) = t∈T p∈P t∈T ∥f (x p,t , t; Θ, Φ) − y t p,j ∥ 2 2 + λ g ∥Θ∥ 1 + λ s ∥Φ∥ 1,1 + λ group ∥Φ∥ 1,q(1)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_15",
            "start": 0,
            "end": 104,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_16@0",
            "content": "The second and third terms regularize the global and task specific parameters independently, while the last term, l 1 /l q norm with q > 1, ensures a block sparse selection of the task specific parameters.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_16",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_16@1",
            "content": "This term ensures a multi-task learning behavior even when there are no parameters shared across the tasks (i.e., Θ = ∅) through selection of common features across the tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_16",
            "start": 206,
            "end": 380,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_16@2",
            "content": "Setting Θ = ∅ and λ group = 0 leads to the single task setup of Lauscher et al. (2020) and Srinivasan et al. (2021).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_16",
            "start": 382,
            "end": 497,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_17@0",
            "content": "Features",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_17",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_18@0",
            "content": "We divide the set of features into two higher level categories, viz. the pairwise features defined for the pivot and target that measure the typological relatedness of the languages, and the individual features defined for the target language reflecting the state of its representation in M.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_18",
            "start": 0,
            "end": 290,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_19@0",
            "content": "Pairwise Features",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_19",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_20@0",
            "content": "Instead of directly using the different typological properties of the the two languages as features, we use the pairwise relatedness to avoid feature explosion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_20",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_20@1",
            "content": "Subword Overlap : We define the subword overlap as the percentage of unique tokens that are common to the vocabularies of both the pivot and target languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_20",
            "start": 161,
            "end": 318,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_20@2",
            "content": "Let V p and V t be the subword vocabularies of p and t. The subword overlap is then defined as :",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_20",
            "start": 320,
            "end": 415,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_21@0",
            "content": "o sw (p, t) = |V p ∩ V t | |V p ∪ V t | (2)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_21",
            "start": 0,
            "end": 42,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_22@0",
            "content": "Similarity between Lang2Vec vectors: Following Lin et al. (2019) and Lauscher et al. (2020), we compute the typological relatedness between p and t from the linguistic features provided by the URIEL project (Littell et al., 2017).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_22",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_22@1",
            "content": "We use syntactic (s syn (p, t)), phonological similarity (s pho (p, t)), genetic similarity (s gen (p, t)) and geographic distance (d geo (p, t)).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_22",
            "start": 231,
            "end": 376,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_22@2",
            "content": "For details, please see Littell et al. (2017).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_22",
            "start": 378,
            "end": 423,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_23@0",
            "content": "Individual Features",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_23",
            "start": 0,
            "end": 18,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_24@0",
            "content": "Pre-training Size: We use the log 10 of the size (in words) of the pre-training corpus in the target language, SIZE(t), as a feature.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_24",
            "start": 0,
            "end": 132,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_24@1",
            "content": "Rare Typological Traits: Srinivasan et al. (2021) proposed this metric to capture the rarity of the typological features of a language in the representation of M. Every typological feature in WALS database is ranked based on the amount of pretraining data for the languages that contain the feature.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_24",
            "start": 134,
            "end": 432,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_24@2",
            "content": "For the language t, Mean Reciprocal Rank (MRR) of all of its features is then calculated and used as a feature -WMRR(t).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_24",
            "start": 434,
            "end": 553,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_25@0",
            "content": "Tokenizer Features : In their recent work, Rust et al. (2021) proposed two metrics, viz. tokenizer's fertility and proportion of continued words, to evaluate the quality of multilingual tokenizers on a given language.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_25",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_25@1",
            "content": "For target t, they define the tokenizer's fertility, FERT(t), as the average number of sub-words produced for every tokenized word in t's corpus.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_25",
            "start": 218,
            "end": 362,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_25@2",
            "content": "On the other hand, the proportion of continued words, PCW(t), measures how often the tokenizer chooses to continue a word across at least two tokens.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_25",
            "start": 364,
            "end": 512,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_25@3",
            "content": "They show that the multilingual models perform much worse on a task than their monolingual counterparts when the values of these metrics are higher for the multilingual tokenizer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_25",
            "start": 514,
            "end": 692,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_25@4",
            "content": "We include FERT(t) and PCW(t) as features.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_25",
            "start": 694,
            "end": 735,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_26@0",
            "content": "Approaches",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_26",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_27@0",
            "content": "We extensively experiment with a wide-array of multi-task as well as single-task regression models to provide a fair comparison between different approaches to zero-shot performance prediction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_27",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_28@0",
            "content": "Baselines",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_28",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_29@0",
            "content": "Average Score Within a Task (AWT) : The performance for a pivot-target pair (p , t) on a task t is approximated by taking the average of the performance on all other target languages (pivot being fixed) in the same task t, i.e., f (x p,t , t) =",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_29",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_30@0",
            "content": "1 |T |−1 t ′ ∈T −{t} y t p,t ′ .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_30",
            "start": 0,
            "end": 31,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_31@0",
            "content": "Average Score across the Tasks (AAT) : Here instead of averaging over all the target languages within a task, we approximate the performance on a given target language by averaging the scores for that language across the other tasks, i.e.,",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_31",
            "start": 0,
            "end": 238,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_32@0",
            "content": "f (x p,t , t) = 1 |T|−1 t ′ ∈T−{t} y t ′ p,t .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_32",
            "start": 0,
            "end": 45,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_33@0",
            "content": "Single Task Models",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_33",
            "start": 0,
            "end": 17,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_34@0",
            "content": "Lasso Regression: Lauscher et al. ( 2020) train different linear regression models for each task.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_34",
            "start": 0,
            "end": 96,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_35@0",
            "content": "Along similar lines, we experiment with linear regression, but also add an L1 regularization term, as we observed it usually leads to better predictors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_35",
            "start": 0,
            "end": 151,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_36@0",
            "content": "XGBoost Regressor: As shown in Srinivasan et al. (2021), XGBoost (Chen and Guestrin, 2016) generally obtains impressive performance on this task, and hence we include it in our experiments as well.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_36",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_37@0",
            "content": "Multi Task Models",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_37",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_38@0",
            "content": "Group Lasso: l 1 /l q norm based blockregularization has been shown to be effective for multi-task learning in the setting of multi-linear regression (Yuan and Lin, 2006;Argyriou et al., 2008).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_38",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_38@1",
            "content": "For each task, consider separate linear regression models represented by the weight matrix Φ ∈ R n×|T| .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_38",
            "start": 194,
            "end": 297,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_38@2",
            "content": "The l 1 /l q regularization term is given as:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_38",
            "start": 299,
            "end": 343,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_39@0",
            "content": "∥Φ∥ i,q = n j=1 ( |T| t=1 |Φ jt | q ) 1/q",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_39",
            "start": 0,
            "end": 40,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_40@0",
            "content": ", where Φ jt denotes the weight for the feature j in the task t. For q > 1, minimizing this term pushes the l q -norms corresponding to the weights of a given feature across the tasks to be sparse, which encourages multiple predictors to share similar sparsity patterns.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_40",
            "start": 0,
            "end": 269,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_40@1",
            "content": "In other words, a common set of features is selected for all the tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_40",
            "start": 271,
            "end": 341,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_40@2",
            "content": "We use q = 2 for the group regularization term.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_40",
            "start": 343,
            "end": 389,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_41@0",
            "content": "Since this can be restrictive in certain scenarios, some natural extensions to Group Lasso, such as Dirty Models (Jalali et al., 2010) and Multi Level Lasso (Lozano and Swirszcz, 2012), have been proposed that separate out the task specific and global parameters.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_41",
            "start": 0,
            "end": 262,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_41@1",
            "content": "We experimented with these methods and observed equivalent or worse performance compared to Group Lasso.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_41",
            "start": 264,
            "end": 367,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_41@2",
            "content": "Collective Matrix Factorization (CMF) with Side Information: Low rank approximation for the task weights matrices forms one family of methods for multi-task learning (Zhang and Yang, 2017;Pong et al., 2010;Ando et al., 2005).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_41",
            "start": 369,
            "end": 593,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_41@3",
            "content": "As a direct analogue with collaborative filtering, here we can think of the tasks as users and pivot-target pairs as items.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_41",
            "start": 595,
            "end": 717,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_41@4",
            "content": "Consider the matrix Y ∈ R |T|×|P×T | , where each element of the matrix correspond to y t p,t .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_41",
            "start": 719,
            "end": 813,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_41@5",
            "content": "We can then decompose the matrix into task and language-pair specific factors as",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_41",
            "start": 815,
            "end": 894,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_42@0",
            "content": "Y ∼ TL T (3)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_42",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_43@0",
            "content": "where T ∈ R |T|×d latent and L ∈ R |P×T |×d latent are the task and language-pair factor matrices, and d latent is the number of factors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_43",
            "start": 0,
            "end": 136,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_43@1",
            "content": "Additionally, in order to incorporate the feature information about the language pairs as discussed in section 3.2, we incorporate Collective Matrix Factorization approach (Cortes, 2018).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_43",
            "start": 138,
            "end": 324,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_43@2",
            "content": "It incorporates the attribute information about items and/or users in the factorization algorithm by decomposing the language-pair feature matrix X ∈ R |P×T |×n as LF T , such that L is shared across both decompositions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_43",
            "start": 326,
            "end": 545,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_43@3",
            "content": "This helps to learn the latent representations for the pivot-language pairs from the task-wise performance as well as different linguistic and MMLM specific features 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_43",
            "start": 547,
            "end": 715,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_43@4",
            "content": "In relation to Equation 1, we can think of task factors T to correspond to the task specific parameters Φ, languagepair factors L as the shared parameters Θ and the predictor model as f (x p,t , t; Θ, Φ) = (TL T ) (p,t),t .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_43",
            "start": 717,
            "end": 939,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_43@5",
            "content": "Both L and T are regularized seperately, but there is no group regularization term (λ group = 0).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_43",
            "start": 941,
            "end": 1037,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_44@0",
            "content": "We use the multi-task variant of Gaussian Processes proposed in Bonilla et al. (2008) and utilize deep neural networks to define the kernel functions as in Deep GPs (Wilson et al., 2016).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_44",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_44@1",
            "content": "For comparison, we also report the scores of the single-task variant of this method which we denote as DGPR.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_44",
            "start": 188,
            "end": 295,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_44@2",
            "content": "See Appendix (section A.1) for details.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_44",
            "start": 297,
            "end": 335,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_45@0",
            "content": "Apart from these we also explore other multitask methods like Model Agnostic Meta Learning (MAML) (Finn et al., 2017), details of which we leave in the appendix (section A.1).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_45",
            "start": 0,
            "end": 174,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_46@0",
            "content": "Experimental Setup",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_46",
            "start": 0,
            "end": 17,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_47@0",
            "content": "In this section, we discuss our test conditions, datasets and training parameters for the different experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_47",
            "start": 0,
            "end": 111,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_48@0",
            "content": "Test Conditions",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_48",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_49@0",
            "content": "We consider two different test conditions: Leave One Language Out (LOLO) and Leave Low Resource Languages Out (LLRO).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_49",
            "start": 0,
            "end": 116,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_49@1",
            "content": "Leave One Language Out: LOLO is a popular setup for multilingual performance prediction (Lauscher et al., 2020;Srinivasan et al., 2021), where for a given task, we choose a target language and move all of its instances from the prediction dataset to the test data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_49",
            "start": 118,
            "end": 381,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_49@2",
            "content": "The models are then trained on the remaining languages and evaluated on the unseen test language.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_49",
            "start": 383,
            "end": 479,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_49@3",
            "content": "This is done for all the target languages available for a task, and the Mean Absolute Error (MAE) across languages is reported.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_49",
            "start": 481,
            "end": 607,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_49@4",
            "content": "In the multi-task setting we evaluate on one task at a time while considering the rest as helper tasks for which the entire data is used including the test language 3 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_49",
            "start": 609,
            "end": 776,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_49@5",
            "content": "Leave Low Resource Languages Out: Through this evaluation strategy we try to emulate the real world use case where we only have test data available in high resource languages such as English, German and Chinese, and would like to estimate the performance on under-represented languages such as Swahili and Bengali.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_49",
            "start": 778,
            "end": 1091,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_49@6",
            "content": "We use the language taxonomy provided by Joshi et al. (2020) to categorize the languages into six classes (0 = low to 5 = high) based on the number of resources available.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_49",
            "start": 1093,
            "end": 1263,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_49@7",
            "content": "We then move languages belonging to class 3 or below to our test set and train the models on class 4 and 5 languages only.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_49",
            "start": 1265,
            "end": 1386,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_49@8",
            "content": "Similar to LOLO, here too we allow the helper tasks to retain all the languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_49",
            "start": 1388,
            "end": 1467,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_50@0",
            "content": "Tasks and Datasets",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_50",
            "start": 0,
            "end": 17,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_51@0",
            "content": "We use the following 11 tasks provided in XTREME (Hu et al., 2020) and XTREME-R benchmarks:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_51",
            "start": 0,
            "end": 90,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_51@1",
            "content": "1. Classification: XNLI (Conneau et al., 2018) , PAWS-X (Yang et al., 2019), andXCOPA (Ponti et al., 2020)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_51",
            "start": 92,
            "end": 197,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_51@2",
            "content": "2. Structure Prediction: UDPOS (Nivre et al., 2018), and NER (Pan et al., 2017)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_51",
            "start": 199,
            "end": 277,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_51@3",
            "content": "3. Question Answering: XQUAD (Artetxe et al., 2020), MLQA (Lewis et al., 2020), and TyDiQA-GoldP (Clark et al., 2020)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_51",
            "start": 279,
            "end": 395,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_51@4",
            "content": "4. Retrieval: Tatoeba (Artetxe and Schwenk, 2019), Mewsli-X (Botha et al., 2020;, and LAReQA (Roy et al., 2020) All of these datasets have training data present only in English i.e. P = {en}, and majority of the tasks have fewer than 10 target languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_51",
            "start": 397,
            "end": 650,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_52@0",
            "content": "Training Details",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_52",
            "start": 0,
            "end": 15,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_53@0",
            "content": "We train and evaluate our performance prediction models for mBERT (bert-base-multilingual-cased) and XLM-R (xlm-roberta-large).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_53",
            "start": 0,
            "end": 126,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_53@1",
            "content": "For training XG-Boost, we used 100 estimators with a maximum depth of 10.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_53",
            "start": 128,
            "end": 200,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_53@2",
            "content": "For Group Lasso, we used the implementation provided in the MuTaR software package 4 , and used a regularization strength of 0.01.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_53",
            "start": 202,
            "end": 331,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_53@3",
            "content": "We optimized CMF's objective function using Alternating Least Squares (ALS), used 5 latent factors with a regularization parameter equal to 0.1, and used the Collective Matrix Factorization python library 5 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_53",
            "start": 333,
            "end": 540,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_53@4",
            "content": "In case of MDGPR, we used Radial Basis Function as the kernel and a two-layer MLP for learning latent features, with 50 and 10 units followed by ReLU activation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_53",
            "start": 542,
            "end": 702,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_53@5",
            "content": "We set the learning rate and epochs as 0.01 and 200, and implemented it using GPyTorch 6 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_53",
            "start": 704,
            "end": 793,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_54@0",
            "content": "Results and Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_54",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_55@0",
            "content": "LOLO Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_55",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_56@0",
            "content": "Table 1 shows MAE (in %) for LOLO for different single-task and multi-task models on the tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_56",
            "start": 0,
            "end": 94,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_56@1",
            "content": "For XLMR, we observe that multi-task models, primarily MDGPR, often outperform the best singletask models by significant margins, and for tasks Note that the Average across task baseline is quite competitive and performs better than singletask XGBoost and MAML in average, and better than all models for LAReQA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_56",
            "start": 96,
            "end": 406,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_57@0",
            "content": "Figure 2 plots the dependence of the number of helper tasks on the performance of the multi-task models.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_57",
            "start": 0,
            "end": 103,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_57@1",
            "content": "As expected, MAE decreases as helper tasks increase, especially for MDGPR and CMF.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_57",
            "start": 105,
            "end": 186,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_57@2",
            "content": "On a related note, the Pearson Correlation coefficient between MAE and number of tasks a target language is part of is found to be −0.39, though the trend in this case is not as clear.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_57",
            "start": 188,
            "end": 371,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_58@0",
            "content": "LLRO Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_58",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_59@0",
            "content": "Predicting the performance on low resource languages, for which often standard training and test datasets are not available, can be an important use case where multi-task performance prediction can be helpful.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_59",
            "start": 0,
            "end": 208,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_59@1",
            "content": "Figure 6 in appendix shows the classwise (Joshi et al., 2020) distribution of languages for the tasks that we consider in our experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_59",
            "start": 210,
            "end": 347,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_59@2",
            "content": "As one would expect, for most tasks, test data is available for languages belonging to class-4 and class-5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_59",
            "start": 349,
            "end": 455,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_59@3",
            "content": "Training performance prediction models without any task to transfer from can therefore, possibly lead to poor generalization on the low resource languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_59",
            "start": 457,
            "end": 611,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_59@4",
            "content": "On the other hand, for the same reason -lack of test data, building accurate predictors for low-resource languages is necessary.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_59",
            "start": 613,
            "end": 740,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_60@0",
            "content": "MAE values for the LLRO evaluation setup are shown in figure 1 for XLMR.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_60",
            "start": 0,
            "end": 71,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_60@1",
            "content": "Results for mBERT follow similar trends and are reported in the Appendix (figure 7).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_60",
            "start": 73,
            "end": 156,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_60@2",
            "content": "For both XLMR and mBERT we observe that the three main multi-task models -Group Lasso, CMF and MDGPR -outperform the single-task models and baselines.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_60",
            "start": 158,
            "end": 307,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_60@3",
            "content": "Interestingly, for XLMR, the single task models XGBoost and Lasso perform even worse than the Average within Tasks baseline.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_60",
            "start": 309,
            "end": 432,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_60@4",
            "content": "Overall we see around 18% and 11% drop in MAE for Group Lasso over the best performing single-task model, for XLMR and mBERT respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_60",
            "start": 434,
            "end": 571,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_61@0",
            "content": "Feature Importance",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_61",
            "start": 0,
            "end": 17,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_62@0",
            "content": "An interesting consequence of zero-shot performance prediction is that the models can be directly used to infer the correlation (and possibly causation) between linguistic relatedness and pretraining conditions and zero-shot transferability.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_62",
            "start": 0,
            "end": 240,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_62@1",
            "content": "Multi-task learning, in this context, help us make more robust inferences, as the models are less prone to overfitting to a particular task or dataset.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_62",
            "start": 242,
            "end": 392,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@0",
            "content": "Figure 3 shows the SHAP values of the features for the Group Lasso model trained on XLMR's zero-shot performance data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 0,
            "end": 117,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@1",
            "content": "As expected for Group Lasso, we see a block-sparsity behavior among the tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 119,
            "end": 196,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@2",
            "content": "Features such as Rare Typological Traits (WMRR(t)), Tokenizer's Fertility (FERT(t)) and Genetic Similarity (s gen (p, t)) are ignored in all the tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 198,
            "end": 348,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@3",
            "content": "In contrast, for the single-task lasso regression (Figure 9 in Appendix), we see different sets of features selected for different tasks, which for the scale at which we operate, might not be indicative of the actual factors that affect the zero-shot performance in these tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 350,
            "end": 627,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@4",
            "content": "Subword Overlap.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 629,
            "end": 644,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@5",
            "content": "Among the features that get selected for all tasks, we observe that Subword Overlap (o sw (p, t)) typically gets higher importance in retrieval (LAReQA and MewsliX) and sentence classification tasks (PAWS-X, XNLI).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 646,
            "end": 859,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@6",
            "content": "Since the retrieval tasks that we consider, as described in , measure the alignment between the cross lingual representations of semantically similar sentences, having a shared vocabulary between the languages can leak information from one to another (Wu and Dredze, 2019) which might improve the retrieval performance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 861,
            "end": 1179,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@7",
            "content": "Interestingly, if we compare this with the feature importance scores for the single task lasso model (Figure 9 in Appendix), we do see MewsliX task getting higher importance for the subword overlap, but LAReQA gets virtually zero SHAP value for this feature, showcasing how single-task models can misinterpret two similar tasks as requiring very different features.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 1181,
            "end": 1545,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@8",
            "content": "Our observation reinforce the generally held notion that vocabulary overlap between the pivot and target is beneficial for zero-shot transfer (Wu and Dredze, 2019), especially for retrieval tasks, though some studies have argued otherwise (Pires et al., 2019;K et al., 2019).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 1547,
            "end": 1821,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@9",
            "content": "Tokenizer Features.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 1823,
            "end": 1841,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@10",
            "content": "For structure prediction (UDPOS and WikiAnn) and question answering (XQUAD and TyDiQA) tasks that require making predictions for each token in the input, we see that the tokenizer feature, PCW(t), receive a higher SHAP value.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 1843,
            "end": 2067,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@11",
            "content": "In contrast, for single-task lasso, here too we do not observe high importance of this feature across these related tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 2069,
            "end": 2190,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@12",
            "content": "Rust et al. (2021) note that languages such as Arabic where mBERT's multilingual tokenizer was found to be much worse than it's monolingual counterpart, there was a sharper drop in performance of mBERT compared to the monolingual model for QA, UDPOS and NER tasks than for sentiment classification.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 2192,
            "end": 2489,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@13",
            "content": "We believe that XLMR's surprisingly worse performance than mBERT for Chinese and Japanese on UDPOS might be correlated with it's significantly worse tokenizer for these languages based on the fertility (FERT) and Percentage Continued Words (PCW) feature values (see Appendix A.2 for exact values).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 2491,
            "end": 2787,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@14",
            "content": "The high SHAP values for PCW(t) further strengthen our belief 7 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 2789,
            "end": 2853,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@15",
            "content": "Pre-training Size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 2855,
            "end": 2872,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@16",
            "content": "Similar to the findings of Lauscher et al. (2020), we observe that pre-training corpus size has low SHAP value, and therefore, lower importance for lower level tasks such as UDPOS and NER, and higher SHAP values for higher level tasks like XNLI.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 2874,
            "end": 3118,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@17",
            "content": "Additionally, we extend their observations to tasks such as XCOPA, Tatoeba, MLQA and LAReQA where pre-training size seem to play a significant role in the performance prediction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 3120,
            "end": 3297,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@18",
            "content": "Again, compared to single Lasso Regression model, we see a different selection pattern: Pre-training size receives a high SHAP value for UDPOS while for XNLI it is negligible.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 3299,
            "end": 3473,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_63@19",
            "content": "This neither fully conforms with our observations on the multi-task feature selections, nor with the previous work (Lauscher et al., 2020).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_63",
            "start": 3475,
            "end": 3613,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_64@0",
            "content": "Typological Relatedness Features.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_64",
            "start": 0,
            "end": 32,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_64@1",
            "content": "Out of all the typological relatedness features, we found Geographical Distance (d geo (p, t)) receiving highest SHAP values for all tasks, implying that geographical proximity between the pivot-target pair is an important factor in determining the zero-shot transferability between them.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_64",
            "start": 34,
            "end": 321,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_64@2",
            "content": "Lauscher et al. (2020) also observe positive correlations between geographical relatedness and zero-shot performance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_64",
            "start": 323,
            "end": 439,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_64@3",
            "content": "The crosstask importance of geographic distance (unlike the other relatedness features) might be attributed to the 100% coverage across languages for the geographical vectors in the URIEL database.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_64",
            "start": 441,
            "end": 637,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_64@4",
            "content": "In contrast, Syntactic and Phonological vectors have missing values for a majority of the languages (Littell et al., 2017).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_64",
            "start": 639,
            "end": 761,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_65@0",
            "content": "Like Lauscher et al. (2020), we also see some dependence on syntactic (s syn (p, t)) and phonological (s pho (p, t)) similarities for XLMR's zero shot performance on XNLI and XQUAD tasks respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_65",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_65@1",
            "content": "However, in both cases we found that the tokenizer feature PCW(t) receives a much higher SHAP value.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_65",
            "start": 201,
            "end": 300,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_65@2",
            "content": "Interestingly, genetic similarity (s gen (p, t)) is not selected for any task, arguably due to the block sparsity in feature selection of Group Lasso.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_65",
            "start": 302,
            "end": 451,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_65@3",
            "content": "We do see some tasks receiving high SHAP values for s gen (p, t) in single-task lasso (Figure 9 in Appendix).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_65",
            "start": 453,
            "end": 561,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_65@4",
            "content": "However, the number of such tasks as well as the SHAP values are on the lower side, implying that genetic similarity might not provide any additional information for zero-shot transfer over and above the geographical, syntactic and phonological similarities.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_65",
            "start": 563,
            "end": 820,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_65@5",
            "content": "Similar trends are observed in the case of mBERT as well (Figure 10 in appendix), with some minor differences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_65",
            "start": 822,
            "end": 931,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_65@6",
            "content": "For instance, instead of PCW(t), FERT(t) receives higher SHAP value; s syn (p, t) also receives higher importance, especially for tasks like UDPOS and XNLI, which is consistent with the findings of Lauscher et al. (2020).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_65",
            "start": 933,
            "end": 1153,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_66@0",
            "content": "Conclusion and Future Work",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_66",
            "start": 0,
            "end": 25,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_67@0",
            "content": "In this paper, we showed that the zero-shot performance prediction problem can be much more effectively and robustly solved by using multi-task learning approaches.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_67",
            "start": 0,
            "end": 163,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_67@1",
            "content": "We see significant reduction in errors compared to the baselines and single-task models, specifically for the tasks which have test sets available in a very few languages or when trying to predict the performance for low resource languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_67",
            "start": 165,
            "end": 404,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_67@2",
            "content": "Additionally, this approach allows us to robustly identify factors that influence zero-shot performance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_67",
            "start": 406,
            "end": 509,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_67@3",
            "content": "Our findings in this context can be summarized as follows.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_67",
            "start": 511,
            "end": 568,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_68@0",
            "content": "1. Subword overlap between the pivot and target has a strong positive influence on zero-shot transfer, especially for Retrieval tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_68",
            "start": 0,
            "end": 133,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_68@1",
            "content": "2. Quality of the target tokenizer, defined in terms of how often or how aggressively it splits the target tokens negatively influences zero-shot performance for word-level tasks such as POS tagging and Span extraction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_68",
            "start": 135,
            "end": 353,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_68@2",
            "content": "3. Pre-training size of the target positively influences zero-shot performance in many tasks, including XCOPA, Tatoeba, MLQA and LAReQA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_68",
            "start": 355,
            "end": 490,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_68@3",
            "content": "4. Geographical proximity between pivot and target is found to be uniformly important across all the tasks, unlike syntactic and phonological similarities, which are important for only some tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_68",
            "start": 492,
            "end": 687,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_69@0",
            "content": "This last finding is especially interesting.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_69",
            "start": 0,
            "end": 43,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_69@1",
            "content": "As described earlier, geographical proximity is a more clear, noise-free and complete feature compared to the other relatedness metrics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_69",
            "start": 45,
            "end": 180,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_69@2",
            "content": "However, one could also argue that since neighboring languages tend to have high vocabulary and typological feature overlap due to contact processes and shared areal features, geographical distance is an extremely informative feature for zero-shot transfer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_69",
            "start": 182,
            "end": 438,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_69@3",
            "content": "Two direct implications of these findings are: (1) for effective use of MMLMs, one should develop resources in at least one pivot language per geographic regions, and (2) one should work towards multilingual tokenizers that are effective for most languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_69",
            "start": 440,
            "end": 696,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_70@0",
            "content": "There are a number of directions that can be explored in future related to our work.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_70",
            "start": 0,
            "end": 83,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_70@1",
            "content": "The prediction models can be extended to a multi-pivot and few-shot settings, as described in Srinivasan et al. (2021).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_70",
            "start": 85,
            "end": 203,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_70@2",
            "content": "Further probing experiments could be designed to understand the role of sub-word overlap on zero-shot transfer of Retrieval tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_70",
            "start": 205,
            "end": 334,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_70@3",
            "content": "two tokenizers, however for languages like Chinese and Japanese, there is a dramatic increase in the values for XLMR.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_70",
            "start": 336,
            "end": 452,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_70@4",
            "content": "Interestingly, when we compare the zero-shot performance between mBERT and XLMR on structure prediction tasks like UD-POS and WikiANN, we see a surprisingly large drop (upto 20% absolute drop) in the performance for XLMR on these both Chinese and Japanese, whereas usually XLMR outperforms mBERT on these tasks (Refer to figure 5).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_70",
            "start": 454,
            "end": 784,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_70@5",
            "content": "This observation along with the feature importance for the tokenizer features that we observed for Group Lasso (3) indicate that tokenizer quality might play some role in the zero-shot transfer capabilities of the multilingual models.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_70",
            "start": 786,
            "end": 1019,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_70@6",
            "content": "Table 2: Mean Absolute Errors (Scaled by 100 for readability) for different models trained to predict the zero shot performance of mBERT.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_70",
            "start": 1021,
            "end": 1157,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_70@7",
            "content": "In the \"Average\" row we average the MAEs across all the tasks and in the \"Average Low\" Res Tasks\", we consider the tasks with fewer than 10 target languages and take the average of the MAEs for those tasks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_70",
            "start": 1159,
            "end": 1364,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_71@0",
            "content": "Tong Rie Kubota Ando, Peter Zhang,  Bartlett, A framework for learning predictive structures from multiple tasks and unlabeled data, 2005, Journal of Machine Learning Research, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_71",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_72@0",
            "content": "Andreas Argyriou, Theodoros Evgeniou, Massimiliano Pontil, Convex multi-task feature learning, 2008, Machine learning, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_72",
            "start": 0,
            "end": 119,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_73@0",
            "content": "Mikel Artetxe, Sebastian Ruder, Dani Yogatama, On the Cross-lingual Transferability of Monolingual Representations, 2020, Proceedings of ACL 2020, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_73",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_74@0",
            "content": "Mikel Artetxe, Holger Schwenk, Massively Multilingual Sentence Embeddings for Zero-Shot Cross-Lingual Transfer and Beyond, 2019, Transactions of the ACL, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_74",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_75@0",
            "content": "Alexandra Birch, Miles Osborne, Philipp Koehn, Predicting success in machine translation, 2008, Proceedings of the 2008 Conference on Empirical Methods in Natural Language Processing, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_75",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_76@0",
            "content": "V Edwin, Kian Bonilla, Christopher Chai,  Williams, Multi-task gaussian process prediction, 2008, Advances in Neural Information Processing Systems, Curran Associates, Inc.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_76",
            "start": 0,
            "end": 171,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_77@0",
            "content": "Jan Botha, Zifei Shan, Daniel Gillick, Entity Linking in 100 Languages, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), Online. Association for Computational Linguistics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_77",
            "start": 0,
            "end": 223,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_78@0",
            "content": "Tianqi Chen, Carlos Guestrin, Xgboost: A scalable tree boosting system, 2016, Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD '16, Association for Computing Machinery.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_78",
            "start": 0,
            "end": 222,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_79@0",
            "content": "Jonathan Clark, Eunsol Choi, Michael Collins, Dan Garrette, Tom Kwiatkowski, Vitaly Nikolaev, Jennimaria Palomaki, TyDi QA: A Benchmark for Information-Seeking Question Answering in Typologically Diverse Languages, 2020, Transactions of the Association of Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_79",
            "start": 0,
            "end": 283,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_80@0",
            "content": "Alexis Conneau, Kartikay Khandelwal, Naman Goyal, Vishrav Chaudhary, Guillaume Wenzek, Francisco Guzmán, Edouard Grave, Myle Ott, Luke Zettlemoyer, Veselin Stoyanov, Unsupervised cross-lingual representation learning at scale, 2020, Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_80",
            "start": 0,
            "end": 322,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_81@0",
            "content": "UNKNOWN, None, , , Holger Schwenk,.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_81",
            "start": 0,
            "end": 34,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_82@0",
            "content": "Veselin Stoyanov, XNLI: Evaluating crosslingual sentence representations, 2018, Proceedings of EMNLP 2018, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_82",
            "start": 0,
            "end": 107,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_83@0",
            "content": "UNKNOWN, None, 2018, Cold-start recommendations in collective matrix factorization, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_83",
            "start": 0,
            "end": 84,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_84@0",
            "content": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, Kristina Toutanova, BERT: Pre-training of deep bidirectional transformers for language understanding, 2019, Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Association for Computational Linguistics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_84",
            "start": 0,
            "end": 335,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_85@0",
            "content": "UNKNOWN, None, 2021, Analysing the impact of linguistic features on crosslingual transfer, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_85",
            "start": 0,
            "end": 91,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_86@0",
            "content": "Tobias Domhan, Jost Springenberg, Frank Hutter, Speeding up automatic hyperparameter optimization of deep neural networks by extrapolation of learning curves, 2015, Twenty-fourth international joint conference on artificial intelligence, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_86",
            "start": 0,
            "end": 238,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_87@0",
            "content": "Chelsea Finn, Pieter Abbeel, Sergey Levine, Model-agnostic meta-learning for fast adaptation of deep networks, 2017, International Conference on Machine Learning, PMLR.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_87",
            "start": 0,
            "end": 167,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_88@0",
            "content": "UNKNOWN, None, 2003, Xtreme: A massively multilingual multi-task benchmark for evaluating cross-lingual generalization, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_88",
            "start": 0,
            "end": 120,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_89@0",
            "content": "Ali Jalali, Sujay Sanghavi, Chao Ruan, Pradeep Ravikumar, A dirty model for multi-task learning, 2010, Advances in Neural Information Processing Systems, Curran Associates, Inc.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_89",
            "start": 0,
            "end": 176,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_90@0",
            "content": "Pratik Joshi, Sebastin Santy, Amar Budhiraja, Kalika Bali, Monojit Choudhury, The state and fate of linguistic diversity and inclusion in the NLP world, 2020, Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, Online. Association for Computational Linguistics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_90",
            "start": 0,
            "end": 297,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_91@0",
            "content": "UNKNOWN, None, 2019, Cross-lingual ability of multilingual bert: An empirical study, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_91",
            "start": 0,
            "end": 85,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_92@0",
            "content": "Anne Lauscher, Vinit Ravishankar, Ivan Vulić, Goran Glavaš, From zero to hero: On the limitations of zero-shot language transfer with multilingual Transformers, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), Association for Computational Linguistics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_92",
            "start": 0,
            "end": 304,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_93@0",
            "content": "Gina-Anne Levow, The third international Chinese language processing bakeoff: Word segmentation and named entity recognition, 2006, Proceedings of the Fifth SIGHAN Workshop on Chinese Language Processing, Association for Computational Linguistics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_93",
            "start": 0,
            "end": 246,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_94@0",
            "content": "Patrick Lewis, Barlas Oguz, Ruty Rinott, Sebastian Riedel, Holger Schwenk, MLQA: Evaluating Cross-lingual Extractive Question Answering, 2020, Proceedings of ACL 2020, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_94",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_95@0",
            "content": "Yu-Hsiang Lin, Chian-Yu Chen, Jean Lee, Zirui Li, Yuyan Zhang, Mengzhou Xia, Shruti Rijhwani, Junxian He, Zhisong Zhang, Xuezhe Ma, Antonios Anastasopoulos, Patrick Littell, and Graham Neubig, 2019, Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_95",
            "start": 0,
            "end": 288,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_96@0",
            "content": "Patrick Littell, David Mortensen, Ke Lin, Katherine Kairis, Carlisle Turner, Lori Levin, URIEL and lang2vec: Representing languages as typological, geographical, and phylogenetic vectors, 2017, Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics, Association for Computational Linguistics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_96",
            "start": 0,
            "end": 344,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_97@0",
            "content": "C Aurelie, Grzegorz Lozano,  Swirszcz, Multilevel lasso for sparse multi-task regression, 2012, Proceedings of the 29th International Coference on International Conference on Machine Learning, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_97",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_98@0",
            "content": "UNKNOWN, None, , , Mohammed Attia.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_98",
            "start": 0,
            "end": 33,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_99@0",
            "content": "Xiaoman Pan, Boliang Zhang, Jonathan May, Joel Nothman, Kevin Knight, Heng Ji, Cross-lingual name tagging and linking for 282 languages, 2017, Proceedings of ACL 2017, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_99",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_100@0",
            "content": "Telmo Pires, Eva Schlinger, Dan Garrette, How multilingual is multilingual BERT?, 2019, Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_100",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_101@0",
            "content": "UNKNOWN, None, 2017, Estimating accuracy from unlabeled data: A probabilistic logic approach, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_101",
            "start": 0,
            "end": 94,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_102@0",
            "content": "UNKNOWN, None, 2014, Estimating accuracy from unlabeled data, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_102",
            "start": 0,
            "end": 62,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_103@0",
            "content": "Paul Ting Kei Pong, Shuiwang Tseng, Jieping Ji,  Ye, Trace norm regularization: Reformulations, algorithms, and multi-task learning, 2010, SIAM Journal on Optimization, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_103",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_104@0",
            "content": "Goran Edoardo Maria Ponti, Olga Glavaš, Qianchu Majewska, Ivan Liu, Anna Vulić,  Korhonen, XCOPA: A multilingual dataset for causal commonsense reasoning, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_104",
            "start": 0,
            "end": 257,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_105@0",
            "content": "Uma Roy, Noah Constant, Rami Al-Rfou, Aditya Barua, Aaron Phillips, Yinfei Yang, LAReQA: Language-agnostic answer retrieval from a multilingual pool, 2020, Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), Online. Association for Computational Linguistics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_105",
            "start": 0,
            "end": 301,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_106@0",
            "content": "UNKNOWN, None, 2021, Xtremer: Towards more challenging and nuanced multilingual evaluation, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_106",
            "start": 0,
            "end": 92,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_107@0",
            "content": "Phillip Rust, Jonas Pfeiffer, Ivan Vulić, Sebastian Ruder, Iryna Gurevych, How good is your tokenizer? on the monolingual performance of multilingual language models, 2021, Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing, Long Papers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_107",
            "start": 0,
            "end": 348,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_108@0",
            "content": "Holger Schwenk, Xian Li, A corpus for multilingual document classification in eight languages, 2018, Proceedings of the Eleventh International Conference on Language Resources and Evaluation (LREC 2018), .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_108",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_109@0",
            "content": "UNKNOWN, None, 2021, Sandipan Dandapat, Kalika Bali, and Monojit Choudhury, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_109",
            "start": 0,
            "end": 76,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_110@0",
            "content": "Erik , Tjong Kim Sang, Introduction to the CoNLL-2002 shared task: Language-independent named entity recognition, 2002, COLING-02: The 6th Conference on Natural Language Learning, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_110",
            "start": 0,
            "end": 180,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_111@0",
            "content": "Erik Tjong, Kim Sang, Fien De Meulder, Introduction to the CoNLL-2003 shared task: Language-independent named entity recognition, 2003, Proceedings of the Seventh Conference on Natural Language Learning at HLT-NAACL 2003, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_111",
            "start": 0,
            "end": 222,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_112@0",
            "content": "Zhiting Andrew Gordon Wilson, Ruslan Hu, Eric Salakhutdinov,  Xing, Deep kernel learning, 2016, Proceedings of the 19th International Conference on Artificial Intelligence and Statistics, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_112",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_113@0",
            "content": "Shijie Wu, Mark Dredze, Beto, bentz, becas: The surprising cross-lingual effectiveness of BERT, 2019, Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP), .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_113",
            "start": 0,
            "end": 279,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_114@0",
            "content": "Shijie Wu, Mark Dredze, Are all languages created equal in multilingual BERT?, 2020, Proceedings of the 5th Workshop on Representation Learning for NLP, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_114",
            "start": 0,
            "end": 153,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_115@0",
            "content": "Yinfei Yang, Yuan Zhang, Chris Tar, Jason Baldridge, PAWS-X: A cross-lingual adversarial dataset for paraphrase identification, 2019, Proceedings of EMNLP 2019, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_115",
            "start": 0,
            "end": 161,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_116@0",
            "content": "Ming Yuan, Yi Lin, Model selection and estimation in regression with grouped variables, 2006, Journal of the Royal Statistical Society: Series B (Statistical Methodology), .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_116",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "331-ARR_v1_117@0",
            "content": "Yu Zhang, Qiang Yang, A survey on multitask learning, 2017, IEEE Transactions on Knowledge and Data Engineering, .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "331-ARR_v1_117",
            "start": 0,
            "end": 113,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "331-ARR_v1_0",
            "tgt_ix": "331-ARR_v1_1",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_0",
            "tgt_ix": "331-ARR_v1_1",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_1",
            "tgt_ix": "331-ARR_v1_2",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_1",
            "tgt_ix": "331-ARR_v1_2",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_0",
            "tgt_ix": "331-ARR_v1_3",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_2",
            "tgt_ix": "331-ARR_v1_3",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_4",
            "tgt_ix": "331-ARR_v1_5",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_5",
            "tgt_ix": "331-ARR_v1_6",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_3",
            "tgt_ix": "331-ARR_v1_4",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_3",
            "tgt_ix": "331-ARR_v1_5",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_3",
            "tgt_ix": "331-ARR_v1_6",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_3",
            "tgt_ix": "331-ARR_v1_4",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_0",
            "tgt_ix": "331-ARR_v1_7",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_7",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_9",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_7",
            "tgt_ix": "331-ARR_v1_8",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_7",
            "tgt_ix": "331-ARR_v1_9",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_7",
            "tgt_ix": "331-ARR_v1_8",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_0",
            "tgt_ix": "331-ARR_v1_10",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_9",
            "tgt_ix": "331-ARR_v1_10",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_10",
            "tgt_ix": "331-ARR_v1_11",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_10",
            "tgt_ix": "331-ARR_v1_11",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_10",
            "tgt_ix": "331-ARR_v1_12",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_11",
            "tgt_ix": "331-ARR_v1_12",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_13",
            "tgt_ix": "331-ARR_v1_14",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_14",
            "tgt_ix": "331-ARR_v1_15",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_15",
            "tgt_ix": "331-ARR_v1_16",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_12",
            "tgt_ix": "331-ARR_v1_13",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_12",
            "tgt_ix": "331-ARR_v1_14",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_12",
            "tgt_ix": "331-ARR_v1_15",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_12",
            "tgt_ix": "331-ARR_v1_16",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_12",
            "tgt_ix": "331-ARR_v1_13",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_10",
            "tgt_ix": "331-ARR_v1_17",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_16",
            "tgt_ix": "331-ARR_v1_17",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_17",
            "tgt_ix": "331-ARR_v1_18",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_17",
            "tgt_ix": "331-ARR_v1_18",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_10",
            "tgt_ix": "331-ARR_v1_19",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_18",
            "tgt_ix": "331-ARR_v1_19",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_20",
            "tgt_ix": "331-ARR_v1_21",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_21",
            "tgt_ix": "331-ARR_v1_22",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_19",
            "tgt_ix": "331-ARR_v1_20",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_19",
            "tgt_ix": "331-ARR_v1_21",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_19",
            "tgt_ix": "331-ARR_v1_22",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_19",
            "tgt_ix": "331-ARR_v1_20",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_10",
            "tgt_ix": "331-ARR_v1_23",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_22",
            "tgt_ix": "331-ARR_v1_23",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_24",
            "tgt_ix": "331-ARR_v1_25",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_23",
            "tgt_ix": "331-ARR_v1_24",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_23",
            "tgt_ix": "331-ARR_v1_25",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_23",
            "tgt_ix": "331-ARR_v1_24",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_0",
            "tgt_ix": "331-ARR_v1_26",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_25",
            "tgt_ix": "331-ARR_v1_26",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_26",
            "tgt_ix": "331-ARR_v1_27",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_26",
            "tgt_ix": "331-ARR_v1_27",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_26",
            "tgt_ix": "331-ARR_v1_28",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_27",
            "tgt_ix": "331-ARR_v1_28",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_29",
            "tgt_ix": "331-ARR_v1_30",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_30",
            "tgt_ix": "331-ARR_v1_31",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_31",
            "tgt_ix": "331-ARR_v1_32",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_28",
            "tgt_ix": "331-ARR_v1_29",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_28",
            "tgt_ix": "331-ARR_v1_30",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_28",
            "tgt_ix": "331-ARR_v1_31",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_28",
            "tgt_ix": "331-ARR_v1_32",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_28",
            "tgt_ix": "331-ARR_v1_29",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_26",
            "tgt_ix": "331-ARR_v1_33",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_32",
            "tgt_ix": "331-ARR_v1_33",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_34",
            "tgt_ix": "331-ARR_v1_35",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_35",
            "tgt_ix": "331-ARR_v1_36",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_33",
            "tgt_ix": "331-ARR_v1_34",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_33",
            "tgt_ix": "331-ARR_v1_35",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_33",
            "tgt_ix": "331-ARR_v1_36",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_33",
            "tgt_ix": "331-ARR_v1_34",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_26",
            "tgt_ix": "331-ARR_v1_37",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_36",
            "tgt_ix": "331-ARR_v1_37",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_38",
            "tgt_ix": "331-ARR_v1_39",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_39",
            "tgt_ix": "331-ARR_v1_40",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_40",
            "tgt_ix": "331-ARR_v1_41",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_41",
            "tgt_ix": "331-ARR_v1_42",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_42",
            "tgt_ix": "331-ARR_v1_43",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_37",
            "tgt_ix": "331-ARR_v1_38",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_37",
            "tgt_ix": "331-ARR_v1_39",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_37",
            "tgt_ix": "331-ARR_v1_40",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_37",
            "tgt_ix": "331-ARR_v1_41",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_37",
            "tgt_ix": "331-ARR_v1_42",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_37",
            "tgt_ix": "331-ARR_v1_43",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_37",
            "tgt_ix": "331-ARR_v1_38",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_44",
            "tgt_ix": "331-ARR_v1_45",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_37",
            "tgt_ix": "331-ARR_v1_44",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_37",
            "tgt_ix": "331-ARR_v1_45",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_43",
            "tgt_ix": "331-ARR_v1_44",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_0",
            "tgt_ix": "331-ARR_v1_46",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_45",
            "tgt_ix": "331-ARR_v1_46",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_46",
            "tgt_ix": "331-ARR_v1_47",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_46",
            "tgt_ix": "331-ARR_v1_47",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_46",
            "tgt_ix": "331-ARR_v1_48",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_47",
            "tgt_ix": "331-ARR_v1_48",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_48",
            "tgt_ix": "331-ARR_v1_49",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_48",
            "tgt_ix": "331-ARR_v1_49",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_46",
            "tgt_ix": "331-ARR_v1_50",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_49",
            "tgt_ix": "331-ARR_v1_50",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_50",
            "tgt_ix": "331-ARR_v1_51",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_50",
            "tgt_ix": "331-ARR_v1_51",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_46",
            "tgt_ix": "331-ARR_v1_52",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_51",
            "tgt_ix": "331-ARR_v1_52",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_52",
            "tgt_ix": "331-ARR_v1_53",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_52",
            "tgt_ix": "331-ARR_v1_53",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_0",
            "tgt_ix": "331-ARR_v1_54",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_53",
            "tgt_ix": "331-ARR_v1_54",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_54",
            "tgt_ix": "331-ARR_v1_55",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_54",
            "tgt_ix": "331-ARR_v1_55",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_56",
            "tgt_ix": "331-ARR_v1_57",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_55",
            "tgt_ix": "331-ARR_v1_56",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_55",
            "tgt_ix": "331-ARR_v1_57",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_55",
            "tgt_ix": "331-ARR_v1_56",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_54",
            "tgt_ix": "331-ARR_v1_58",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_57",
            "tgt_ix": "331-ARR_v1_58",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_59",
            "tgt_ix": "331-ARR_v1_60",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_58",
            "tgt_ix": "331-ARR_v1_59",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_58",
            "tgt_ix": "331-ARR_v1_60",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_58",
            "tgt_ix": "331-ARR_v1_59",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_54",
            "tgt_ix": "331-ARR_v1_61",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_60",
            "tgt_ix": "331-ARR_v1_61",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_62",
            "tgt_ix": "331-ARR_v1_63",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_64",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_64",
            "tgt_ix": "331-ARR_v1_65",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_61",
            "tgt_ix": "331-ARR_v1_62",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_61",
            "tgt_ix": "331-ARR_v1_63",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_61",
            "tgt_ix": "331-ARR_v1_64",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_61",
            "tgt_ix": "331-ARR_v1_65",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_61",
            "tgt_ix": "331-ARR_v1_62",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_0",
            "tgt_ix": "331-ARR_v1_66",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_65",
            "tgt_ix": "331-ARR_v1_66",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_67",
            "tgt_ix": "331-ARR_v1_68",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_68",
            "tgt_ix": "331-ARR_v1_69",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_69",
            "tgt_ix": "331-ARR_v1_70",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_66",
            "tgt_ix": "331-ARR_v1_67",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_66",
            "tgt_ix": "331-ARR_v1_68",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_66",
            "tgt_ix": "331-ARR_v1_69",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_66",
            "tgt_ix": "331-ARR_v1_70",
            "etype": "parent",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_66",
            "tgt_ix": "331-ARR_v1_67",
            "etype": "next",
            "meta": null
        },
        {
            "src_ix": "331-ARR_v1_0",
            "tgt_ix": "331-ARR_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_1",
            "tgt_ix": "331-ARR_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_2",
            "tgt_ix": "331-ARR_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_2",
            "tgt_ix": "331-ARR_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_2",
            "tgt_ix": "331-ARR_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_2",
            "tgt_ix": "331-ARR_v1_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_3",
            "tgt_ix": "331-ARR_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_4",
            "tgt_ix": "331-ARR_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_4",
            "tgt_ix": "331-ARR_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_4",
            "tgt_ix": "331-ARR_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_4",
            "tgt_ix": "331-ARR_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_4",
            "tgt_ix": "331-ARR_v1_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_5",
            "tgt_ix": "331-ARR_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_5",
            "tgt_ix": "331-ARR_v1_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_5",
            "tgt_ix": "331-ARR_v1_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_5",
            "tgt_ix": "331-ARR_v1_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_6@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_6@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_6@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_6@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_6@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_6",
            "tgt_ix": "331-ARR_v1_6@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_7",
            "tgt_ix": "331-ARR_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_8",
            "tgt_ix": "331-ARR_v1_8@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_9",
            "tgt_ix": "331-ARR_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_9",
            "tgt_ix": "331-ARR_v1_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_9",
            "tgt_ix": "331-ARR_v1_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_9",
            "tgt_ix": "331-ARR_v1_9@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_9",
            "tgt_ix": "331-ARR_v1_9@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_9",
            "tgt_ix": "331-ARR_v1_9@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_9",
            "tgt_ix": "331-ARR_v1_9@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_9",
            "tgt_ix": "331-ARR_v1_9@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_10",
            "tgt_ix": "331-ARR_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_11",
            "tgt_ix": "331-ARR_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_12",
            "tgt_ix": "331-ARR_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_13",
            "tgt_ix": "331-ARR_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_13",
            "tgt_ix": "331-ARR_v1_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_14",
            "tgt_ix": "331-ARR_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_14",
            "tgt_ix": "331-ARR_v1_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_14",
            "tgt_ix": "331-ARR_v1_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_14",
            "tgt_ix": "331-ARR_v1_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_15",
            "tgt_ix": "331-ARR_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_16",
            "tgt_ix": "331-ARR_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_16",
            "tgt_ix": "331-ARR_v1_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_16",
            "tgt_ix": "331-ARR_v1_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_17",
            "tgt_ix": "331-ARR_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_18",
            "tgt_ix": "331-ARR_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_19",
            "tgt_ix": "331-ARR_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_20",
            "tgt_ix": "331-ARR_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_20",
            "tgt_ix": "331-ARR_v1_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_20",
            "tgt_ix": "331-ARR_v1_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_21",
            "tgt_ix": "331-ARR_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_22",
            "tgt_ix": "331-ARR_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_22",
            "tgt_ix": "331-ARR_v1_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_22",
            "tgt_ix": "331-ARR_v1_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_23",
            "tgt_ix": "331-ARR_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_24",
            "tgt_ix": "331-ARR_v1_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_24",
            "tgt_ix": "331-ARR_v1_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_24",
            "tgt_ix": "331-ARR_v1_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_25",
            "tgt_ix": "331-ARR_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_25",
            "tgt_ix": "331-ARR_v1_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_25",
            "tgt_ix": "331-ARR_v1_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_25",
            "tgt_ix": "331-ARR_v1_25@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_25",
            "tgt_ix": "331-ARR_v1_25@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_26",
            "tgt_ix": "331-ARR_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_27",
            "tgt_ix": "331-ARR_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_28",
            "tgt_ix": "331-ARR_v1_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_29",
            "tgt_ix": "331-ARR_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_30",
            "tgt_ix": "331-ARR_v1_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_31",
            "tgt_ix": "331-ARR_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_32",
            "tgt_ix": "331-ARR_v1_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_33",
            "tgt_ix": "331-ARR_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_34",
            "tgt_ix": "331-ARR_v1_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_35",
            "tgt_ix": "331-ARR_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_36",
            "tgt_ix": "331-ARR_v1_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_37",
            "tgt_ix": "331-ARR_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_38",
            "tgt_ix": "331-ARR_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_38",
            "tgt_ix": "331-ARR_v1_38@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_38",
            "tgt_ix": "331-ARR_v1_38@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_39",
            "tgt_ix": "331-ARR_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_40",
            "tgt_ix": "331-ARR_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_40",
            "tgt_ix": "331-ARR_v1_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_40",
            "tgt_ix": "331-ARR_v1_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_41",
            "tgt_ix": "331-ARR_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_41",
            "tgt_ix": "331-ARR_v1_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_41",
            "tgt_ix": "331-ARR_v1_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_41",
            "tgt_ix": "331-ARR_v1_41@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_41",
            "tgt_ix": "331-ARR_v1_41@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_41",
            "tgt_ix": "331-ARR_v1_41@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_42",
            "tgt_ix": "331-ARR_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_43",
            "tgt_ix": "331-ARR_v1_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_43",
            "tgt_ix": "331-ARR_v1_43@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_43",
            "tgt_ix": "331-ARR_v1_43@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_43",
            "tgt_ix": "331-ARR_v1_43@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_43",
            "tgt_ix": "331-ARR_v1_43@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_43",
            "tgt_ix": "331-ARR_v1_43@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_44",
            "tgt_ix": "331-ARR_v1_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_44",
            "tgt_ix": "331-ARR_v1_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_44",
            "tgt_ix": "331-ARR_v1_44@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_45",
            "tgt_ix": "331-ARR_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_46",
            "tgt_ix": "331-ARR_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_47",
            "tgt_ix": "331-ARR_v1_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_48",
            "tgt_ix": "331-ARR_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_49",
            "tgt_ix": "331-ARR_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_49",
            "tgt_ix": "331-ARR_v1_49@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_49",
            "tgt_ix": "331-ARR_v1_49@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_49",
            "tgt_ix": "331-ARR_v1_49@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_49",
            "tgt_ix": "331-ARR_v1_49@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_49",
            "tgt_ix": "331-ARR_v1_49@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_49",
            "tgt_ix": "331-ARR_v1_49@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_49",
            "tgt_ix": "331-ARR_v1_49@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_49",
            "tgt_ix": "331-ARR_v1_49@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_50",
            "tgt_ix": "331-ARR_v1_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_51",
            "tgt_ix": "331-ARR_v1_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_51",
            "tgt_ix": "331-ARR_v1_51@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_51",
            "tgt_ix": "331-ARR_v1_51@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_51",
            "tgt_ix": "331-ARR_v1_51@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_51",
            "tgt_ix": "331-ARR_v1_51@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_52",
            "tgt_ix": "331-ARR_v1_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_53",
            "tgt_ix": "331-ARR_v1_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_53",
            "tgt_ix": "331-ARR_v1_53@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_53",
            "tgt_ix": "331-ARR_v1_53@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_53",
            "tgt_ix": "331-ARR_v1_53@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_53",
            "tgt_ix": "331-ARR_v1_53@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_53",
            "tgt_ix": "331-ARR_v1_53@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_54",
            "tgt_ix": "331-ARR_v1_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_55",
            "tgt_ix": "331-ARR_v1_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_56",
            "tgt_ix": "331-ARR_v1_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_56",
            "tgt_ix": "331-ARR_v1_56@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_57",
            "tgt_ix": "331-ARR_v1_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_57",
            "tgt_ix": "331-ARR_v1_57@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_57",
            "tgt_ix": "331-ARR_v1_57@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_58",
            "tgt_ix": "331-ARR_v1_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_59",
            "tgt_ix": "331-ARR_v1_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_59",
            "tgt_ix": "331-ARR_v1_59@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_59",
            "tgt_ix": "331-ARR_v1_59@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_59",
            "tgt_ix": "331-ARR_v1_59@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_59",
            "tgt_ix": "331-ARR_v1_59@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_60",
            "tgt_ix": "331-ARR_v1_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_60",
            "tgt_ix": "331-ARR_v1_60@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_60",
            "tgt_ix": "331-ARR_v1_60@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_60",
            "tgt_ix": "331-ARR_v1_60@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_60",
            "tgt_ix": "331-ARR_v1_60@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_61",
            "tgt_ix": "331-ARR_v1_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_62",
            "tgt_ix": "331-ARR_v1_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_62",
            "tgt_ix": "331-ARR_v1_62@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@14",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@15",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@16",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@17",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@18",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_63",
            "tgt_ix": "331-ARR_v1_63@19",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_64",
            "tgt_ix": "331-ARR_v1_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_64",
            "tgt_ix": "331-ARR_v1_64@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_64",
            "tgt_ix": "331-ARR_v1_64@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_64",
            "tgt_ix": "331-ARR_v1_64@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_64",
            "tgt_ix": "331-ARR_v1_64@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_65",
            "tgt_ix": "331-ARR_v1_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_65",
            "tgt_ix": "331-ARR_v1_65@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_65",
            "tgt_ix": "331-ARR_v1_65@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_65",
            "tgt_ix": "331-ARR_v1_65@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_65",
            "tgt_ix": "331-ARR_v1_65@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_65",
            "tgt_ix": "331-ARR_v1_65@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_65",
            "tgt_ix": "331-ARR_v1_65@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_66",
            "tgt_ix": "331-ARR_v1_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_67",
            "tgt_ix": "331-ARR_v1_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_67",
            "tgt_ix": "331-ARR_v1_67@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_67",
            "tgt_ix": "331-ARR_v1_67@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_67",
            "tgt_ix": "331-ARR_v1_67@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_68",
            "tgt_ix": "331-ARR_v1_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_68",
            "tgt_ix": "331-ARR_v1_68@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_68",
            "tgt_ix": "331-ARR_v1_68@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_68",
            "tgt_ix": "331-ARR_v1_68@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_69",
            "tgt_ix": "331-ARR_v1_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_69",
            "tgt_ix": "331-ARR_v1_69@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_69",
            "tgt_ix": "331-ARR_v1_69@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_69",
            "tgt_ix": "331-ARR_v1_69@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_70",
            "tgt_ix": "331-ARR_v1_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_70",
            "tgt_ix": "331-ARR_v1_70@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_70",
            "tgt_ix": "331-ARR_v1_70@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_70",
            "tgt_ix": "331-ARR_v1_70@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_70",
            "tgt_ix": "331-ARR_v1_70@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_70",
            "tgt_ix": "331-ARR_v1_70@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_70",
            "tgt_ix": "331-ARR_v1_70@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_70",
            "tgt_ix": "331-ARR_v1_70@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_71",
            "tgt_ix": "331-ARR_v1_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_72",
            "tgt_ix": "331-ARR_v1_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_73",
            "tgt_ix": "331-ARR_v1_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_74",
            "tgt_ix": "331-ARR_v1_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_75",
            "tgt_ix": "331-ARR_v1_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_76",
            "tgt_ix": "331-ARR_v1_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_77",
            "tgt_ix": "331-ARR_v1_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_78",
            "tgt_ix": "331-ARR_v1_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_79",
            "tgt_ix": "331-ARR_v1_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_80",
            "tgt_ix": "331-ARR_v1_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_81",
            "tgt_ix": "331-ARR_v1_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_82",
            "tgt_ix": "331-ARR_v1_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_83",
            "tgt_ix": "331-ARR_v1_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_84",
            "tgt_ix": "331-ARR_v1_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_85",
            "tgt_ix": "331-ARR_v1_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_86",
            "tgt_ix": "331-ARR_v1_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_87",
            "tgt_ix": "331-ARR_v1_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_88",
            "tgt_ix": "331-ARR_v1_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_89",
            "tgt_ix": "331-ARR_v1_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_90",
            "tgt_ix": "331-ARR_v1_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_91",
            "tgt_ix": "331-ARR_v1_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_92",
            "tgt_ix": "331-ARR_v1_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_93",
            "tgt_ix": "331-ARR_v1_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_94",
            "tgt_ix": "331-ARR_v1_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_95",
            "tgt_ix": "331-ARR_v1_95@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_96",
            "tgt_ix": "331-ARR_v1_96@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_97",
            "tgt_ix": "331-ARR_v1_97@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_98",
            "tgt_ix": "331-ARR_v1_98@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_99",
            "tgt_ix": "331-ARR_v1_99@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_100",
            "tgt_ix": "331-ARR_v1_100@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_101",
            "tgt_ix": "331-ARR_v1_101@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_102",
            "tgt_ix": "331-ARR_v1_102@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_103",
            "tgt_ix": "331-ARR_v1_103@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_104",
            "tgt_ix": "331-ARR_v1_104@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_105",
            "tgt_ix": "331-ARR_v1_105@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_106",
            "tgt_ix": "331-ARR_v1_106@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_107",
            "tgt_ix": "331-ARR_v1_107@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_108",
            "tgt_ix": "331-ARR_v1_108@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_109",
            "tgt_ix": "331-ARR_v1_109@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_110",
            "tgt_ix": "331-ARR_v1_110@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_111",
            "tgt_ix": "331-ARR_v1_111@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_112",
            "tgt_ix": "331-ARR_v1_112@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_113",
            "tgt_ix": "331-ARR_v1_113@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_114",
            "tgt_ix": "331-ARR_v1_114@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_115",
            "tgt_ix": "331-ARR_v1_115@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_116",
            "tgt_ix": "331-ARR_v1_116@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "331-ARR_v1_117",
            "tgt_ix": "331-ARR_v1_117@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "paper.tei",
    "meta": {
        "ix_counter": 1379,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy",
        "position_tag_type": "from_draft",
        "doc_id": "331-ARR",
        "version": 1
    }
}