{
    "nodes": [
        {
            "ix": "3-169_v2_0",
            "content": "Myelin-specific T helper 17 cells promote adult hippocampal neurogenesis through indirect mechanisms",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_2",
            "content": "CD4 + T cells provide a neuro-immunological link in the regulation of adult hippocampal neurogenesis, but the exact mechanisms underlying enhanced neural precursor cell proliferation and the relative contribution of different T helper (Th) cell subsets have remained unclear. Here, we explored the pro-proliferative potential of interleukin 17-producing T helper (Th17) cells, a developmentally and functionally distinct Th cell subset that is a key mediator of autoimmune neurodegeneration. We found that base-line proliferation of hippocampal precursor cells in a T cell-deficient mouse model of impaired hippocampal neurogenesis can be restored upon adoptive transfer with homogeneous Th17 populations enriched for myelin-reactive T cell receptors (TCR). In these experiments, enhanced proliferation was independent of direct interactions of infiltrating Th17 cells with precursor cells or neighboring cells in the hippocampal neurogenic niche. Complementary studies in immunocompetent mice identified several receptors for Th17 cell-derived cytokines with mRNA expression in hippocampal precursor cells and dentate gyrus tissue, suggesting that Th17 cell activity in peripheral lymphoid tissues might promote hippocampal neurogenesis through secreted cytokines.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_3",
            "content": "Background",
            "ntype": "title",
            "meta": {
                "section": "1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_4",
            "content": "In the hippocampus of the adult brain, neurogenesis originates from neural precursor cells residing in the subgranular zone of the dentate gyrus that proliferate and differentiate in response to intrinsic and extrinsic stimuli, allowing adaptation of the neuronal network to changing needs throughout life <REF-1> , <REF-2> . Besides innate immune mechanisms <REF-3> , <REF-4> , CD4 + T cells of the adaptive immune system promote adult hippocampal neurogenesis and convey functional benefits in reversal learning that have been related to adult neurogenesis <REF-5> – <REF-7> . However the molecular and cellular mechanisms underlying CD4 + T cell-mediated enhancement of adult neurogenesis have largely remained unclear. For example, whether or not the infiltration of myelin-reactive T cells into the CNS is a prerequisite for the proneurogenic activity of CD4 + T cells has been controversially discussed <REF-5> , <REF-6> , <REF-8> , <REF-9> . Additionally, the relative contribution of the activation or differentiation status of the CD4 + T cells to their proneurogenic activity remains to be determined. This includes CD4 + T cell-derived soluble factors that could either act directly on hippocampal precursor cells or promote precursor cell activity through indirect mechanisms, e.g. by acting on neighbouring cells within the neurogenic niche of the adult hippocampus.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_5",
            "content": "Upon appropriate T cell and cytokine receptor signals, initially naïve CD4 + T cells can differentiate into different T helper (Th) cell subsets with distinct cytokine profiles and effector functions <REF-10> – <REF-12> . This includes interleukin-17 (IL-17)-producing Th17 cells that additionally express the orphan nuclear receptor ROR-γt. Besides mediating anti-microbial immunity at epithelial barriers <REF-13> – <REF-17> , ROR-γt + Th17 cells have been broadly linked to the pathogenesis of various autoimmune and chronic inflammatory conditions <REF-18> – <REF-23> , most notably demyelinating inflammatory disorders of the CNS, such as multiple sclerosis in humans and experimental autoimmune encephalomyelitis (EAE) in rodents. In EAE, a local reactivation of myelin-reactive Th17 cells that have crossed the blood-brain barrier initiates a cascade of neuroinflammatory responses, ultimately leading to demyelination in the CNS and neurodegeneration. More recent evidence suggests that there are different subsets of Th17 cells comprising a wide spectrum of effector phenotypes. Among these are nonpathogenic Th17 cells with regulatory properties that restrict tissue destruction during inflammatory responses and promote tissue remodeling and repair <REF-14> , <REF-24> – <REF-29> . This together with the broad expression of surface receptors for Th17-derived cytokines on both immune and non-immune cells <REF-15> , <REF-16> , <REF-30> , prompted us to assess the capacity of myelin-reactive Th17 cells to enhance precursor cell proliferation in an αβ T cell-deficient mouse model of impaired hippocampal neurogenesis. We concentrated on investigating proliferation as the most validated sub-process of adult hippocampal neurogenesis affected by T-cell alterations.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_6",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_7",
            "content": "Mice",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_8",
            "content": "C57BL/6 mice were purchased from Janvier. Nestin GFP <REF-31> , TCRα −/− <REF-32> , and 2D2 mice <REF-33> expressing a transgenic TCR recognizing amino acids 35-55 of myelin oligodendrocyte glycoprotein (MOG 35-55 ), were on the C57BL/6 background. 2D2 mice additionally expressed a transgenic Foxp3 GFP reporter (2D2 × Foxp3 GFP 34 ). C57BL/6 and TCRα –/– mice were intercrossed to obtain heterozygous TCRα +/– F1 mice. All mice were housed at the Experimental Center of the Medizinisch-Theoretisches Zentrum (Technische Universität Dresden, Germany) under specific pathogen-free (SPF) conditions. They received food (standard mouse food „R/M-H“ from Ssniff Spezialitäten GmbH, Soest, Germany) and water ad libitum and lived on a light/dark cycle of 12 h/12 h with lights on at 8 am. Animal experiments were approved by the responsible regulatory authority at Regierungspräsidium Dresden (Approval numbers 24-9168.24-1/2008-5 and 24-9168.11-1/2008-12).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_9",
            "content": "Flow cytometry and cell sorting",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_10",
            "content": "Single cell suspensions of pooled spleen and lymph nodes (mesenteric and subcutaneous) from four- to six-week-old 2D2 × Foxp3 GFP mice were prepared using 70 µm cell strainers (BD). Monoclonal antibodies (mAbs) to CD4 (Monoclonal Rat IgG, GK1.5, BD Biosciences, Cat. No. 5532728), CD25 (Monoclonal Rat IgG, PC61, BD Biosciences, Cat. No. 551071) and CD62L (Monoclonal Rat IgG, MEL-14, eBioscience, Cat. No. 17-0621) and Pacific Blue-conjugated streptavidin were purchased from eBioscience or BD Biosciences. Before FACS, for some experiments, CD4 + cells were enriched using biotinylated mAbs against CD4, streptavidin-conjugated microbeads and an AutoMACS (Miltenyi Biotec). Intracellular ROR-γt expression was analyzed using the Foxp3 staining buffer set (eBioscience) and an anti-ROR-γt mAb (Monoclonal Rat IgG, AFKJS-9, eBioscience, Cat. No. 12-6988). Intracellular cytokine staining was performed using the Cytofix/Cytoperm kit and mAbs to IL-17 (Monoclonal Rat IgG, TC11-18H10.1, eBioscience, Cat. No. 51-7172-80) and IFN-γ (Monoclonal Rat IgG, XMG1.2, BD Biosciences, Cat. No. 554412). Samples were analyzed on a FACSCalibur or sorted using a FACSAria II or III (BD Biosciences). Data were analyzed using FlowJo software (Tree Star, Inc.).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_11",
            "content": "T cell culture and adoptive T cell transfer",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_12",
            "content": "T cells were cultured in IMDM medium, supplemented with 10% FCS (v/v), 1 mM sodium pyruvate, 1 mM HEPES, 2 mM Glutamax, 100 U/ml Penicillin-Streptomycin, 0.1 mg/ml Gentamicin, 0.1 mM non-essential amino acids, and 0.55 mM β-mercaptoethanol (all Invitrogen), at 37°C and 5% CO 2 . For Th17 differentiation in vitro , FACS-purified naïve CD4 + T cells (CD4 + CD62L high CD25 − Foxp3 GFP− ) were cultured for one week in 24-well plates (0,5 × 10 6 cells/ml) together with 20 Gy irradiated T cell-depleted C57BL/6 splenocytes at a 1:5 ratio, in the presence of soluble anti-CD3ε (2 μg/ml, Monoclonal Armenian Hamster IgG, 145-2C11, BD Biosciences, Cat. No. 550275), recombinant human TGF-β1 (1 ng/ml), murine IL-6 (50 ng/ml) (PeproTech), and neutralizing mAbs to IL-4 (10 μg/ml, Monoclonal Rat IgG, 11B11, eBioscience, Cat. No. 14-7041) and IFN-γ (10 μg/ml, Monoclonal Rat IgG, XMG1.2, eBioscience, Cat. No. 16-7311). After 2–3 days, cultures were supplemented with fresh cytokines. Murine IL-23 (10 ng/ml; R&D Systems) was added on day 4. Prior to flow cytometry of cytokine expression, Th17 differentiation cultures were briefly (4 h) restimulated on day 7 with 50 ng/ml Phorbol 12-myristate 13-acetate (PMA; Sigma-Aldrich) and 200 ng/ml Ionomycin (Iono; Calbiochem), in the presence of 10 μg/ml brefeldin A (BFA; Sigma-Aldrich). On day 7 of Th17 differentiation cultures, 4 × 10 6 cells/200 μl PBS were injected i.v. into six-week-old TCRα −/− recipients. Control mice received PBS only. Adoptively transferred CD4 + T cells were tracked by flow cytometry after 2 weeks in the peripheral blood of recipients, as indicated.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_13",
            "content": "BrdU administration and immunohistochemistry",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_14",
            "content": "Eight-week-old mice received 3 consecutive i.p. injections of BrdU (50 mg/kg body weight in 100 μl NaCl; Sigma-Aldrich) at intervals of 6 hours. Twenty-four hours after the first injection, mice were killed with an overdose of anesthetics and perfused transcardially, first with ice-cold saline and then with 4% paraformaldehyde (Sigma-Aldrich). The brains were removed from the skull, postfixed overnight, washed with PBS and cryoprotected for ≥ 3 days in a 30% sucrose solution. Free-floating, 40 μm coronal sections were obtained on a freezing microtome (Leica SM2010R) and stored at 4°C. Immunohistochemistry was performed on 1-in-6 series of free-floating sections of each brain as previously described <REF-35> . To visualize the immune reaction we used the peroxidase method (ABC-Elite; Vector Laboratories) with biotinylated anti-rat and anti-rabbit antibodies (Jackson ImmunoResearch) and nickel-intensified diaminobenzidine (DAB; Sigma-Aldrich) as chromogen. Primary antibodies were rat anti-BrdU (Monoclonal Rat IgG, BU1/75 (ICR1), AbD Serotec, Cat. No. MCA2060) or polyclonal rabbit anti-CD3 (Abcam, Anti-CD3 antibody, ab 5690). Sections were mounted on gelatine-coated slides, air-dried, incubated in Neoclear (Merck) for 90 min and coverslipped. BrdU + cells in the granule cell layers and within two cell diameters below in the subgranular zone of the dentate gyrus on both sides were counted exhaustively throughout the rostro-caudal extension of the dentate gyrus by an observer blind to the treatment conditions on a light microscope (Leica DM750, 40x objective). Numbers of BrdU + cells in the selected coronal sections of each brain were multiplied by 6 as an estimate of total BrdU + cell numbers in both dentate gyri.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_15",
            "content": "Dentate gyrus microdissection and neural precursor cell culture",
            "ntype": "title",
            "meta": {
                "section": "2.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_16",
            "content": "For RNA isolation, dentate gyri of seven- to eight-week-old Nestin GFP mice were dissected as described before <REF-36> . For hippocampal precursor cell cultures from microdissected dentate gyri of adult seven- to eight-week-old C57BL/6 mice, tissue dissection, digestion and cell enrichment were performed as previously described <REF-37> , <REF-38> . After enrichment, 1 × 10 4 cells/cm 2 were cultured in poly-D-lysine- and laminin-coated (Sigma-Aldrich and Roche, respectively) T25 cell culture flasks (TPP) in proliferation medium, consisting of Neurobasal Medium supplemented with B27, Glutamax and 50 U/ml Penicillin-Streptomycin (all Invitrogen), as well as 20 ng/ml human Fibroblast Growth Factor-basic (FGF-2) and 20 ng/ml human Epidermal Growth Factor (EGF; both PeproTech). Every other day, 75% of the medium was replaced by fresh medium. Cells were passaged, when 80% of confluence was reached.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_17",
            "content": "RNA isolation and RT-PCR",
            "ntype": "title",
            "meta": {
                "section": "2.6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_18",
            "content": "For mRNA expression analysis of cells from microdissected dentate gyri, the tissue was passed several times through a 25-gauge needle in RLT buffer (QIAGEN) supplemented with 1% β-Mercaptoethanol (Bio-Rad). For mRNA expression analysis of isolated neural precursor cells, cultured cells were detached from the flask surface with Accutase (PAA) and washed with PBS prior to lysis in RLT buffer. Total RNA was extracted using the RNeasy Mini kit according to the manufacturer’s protocol (Qiagen), including on-column DNase I digestion to minimize genomic DNA contaminations. For real-time RT-PCR, cDNA was synthesized using SuperScript II reverse transcriptase (Invitrogen). cDNA was analyzed in duplicates using a Mastercycler ep realplex thermal cycler (Eppendorf), the QuantiFast SYBR Green PCR kit (Qiagen), and primers listed in Table 1. With the exception of GAPDH <REF-39> , primers were designed using NCBIPrimer-BLAST ( http://www.ncbi.nlm.nih.gov/tools/primer-blast/ ). Relative mRNA expression was calculated using the ΔCt method and GAPDH as housekeeping gene. Only mRNAs with an expression below ΔCt = 15 were considered to be expressed. PCR specificity was confirmed employing melting curve analysis and gel-electrophoresis of PCR products.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_19",
            "content": "Statistical analysis",
            "ntype": "title",
            "meta": {
                "section": "2.7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_20",
            "content": "Statistical analysis was performed with GraphPad Prism 5 software and the GraphPad web calculator ( http://www.graphpad.com/quickcalcs/ ). A two-tailed unpaired Student’s t-test was used for analysis of the experiments shown in Figure 2 . Data from the experiments shown in Figure 1 were analyzed with ANOVA followed by Dunnett’s Multiple Comparison Test. Differences were considered statistically significant at p < 0.05.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_21",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Impaired base-line proliferation in the hippocampus in the absence of αβ T cells. ( A ) Representative BrdU immunohistochemistry of the hippocampal dentate gyrus from eight week-old wild-type (A1), TCRα +/− (A2) and TCRα −/− (A3) mice, 24 hours after the first of 3 consecutive BrdU injections. Scale bar, 100 μm. ( B ) Quantification of BrdU + cells in the dentate gyrus of wild-type (n = 6), TCRα +/− (n = 7) and TCRα −/− (n = 8) mice. All numbers are mean ± SEM. ANOVA, * p < 0.05.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/12255/985e3961-2bf7-460a-864f-a3539c806e12_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_22",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Impaired base-line proliferation in the hippocampus in the absence of &#945;&#946; T cells.</title> <p>( <bold>A</bold>) Representative BrdU immunohistochemistry of the hippocampal dentate gyrus from eight week-old wild-type (A1), TCR&#945; <sup>+/&#8722;</sup> (A2) and TCR&#945; <sup>&#8722;/&#8722;</sup> (A3) mice, 24 hours after the first of 3 consecutive BrdU injections. Scale bar, 100 &#956;m. ( <bold>B</bold>) Quantification of BrdU <sup>+</sup> cells in the dentate gyrus of wild-type (n = 6), TCR&#945; <sup>+/&#8722;</sup> (n = 7) and TCR&#945; <sup>&#8722;/&#8722;</sup> (n = 8) mice. All numbers are mean &#177; SEM. ANOVA, * p &lt; 0.05.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/12255/985e3961-2bf7-460a-864f-a3539c806e12_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Impaired base-line proliferation in the hippocampus in the absence of αβ T cells. ( A ) Representative BrdU immunohistochemistry of the hippocampal dentate gyrus from eight week-old wild-type (A1), TCRα +/− (A2) and TCRα −/− (A3) mice, 24 hours after the first of 3 consecutive BrdU injections. Scale bar, 100 μm. ( B ) Quantification of BrdU + cells in the dentate gyrus of wild-type (n = 6), TCRα +/− (n = 7) and TCRα −/− (n = 8) mice. All numbers are mean ± SEM. ANOVA, * p < 0.05.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/12255/985e3961-2bf7-460a-864f-a3539c806e12_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_23",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Th17-polarized CD4 + T cells are sufficient to promote hippocampal precursor cell proliferation in adult TCRα –/– mice. ( A – C ) Th17 polarization in vitro . ( A ) Flow cytometry of encephalitogenic CD4 + T cells. Dot plots show pre-sort (left) and post-sort (right) analysis of naïve T cells (CD4 + CD62L high CD25 − Foxp3 GFP− ) from pooled spleen and lymph nodes of 2D2 x Foxp3 GFP mice. FACS-purified T cell populations were cultured under Th17-polarizing conditions, as described in the Methods section. On day 7, efficiency of Th17 cell differentiation was confirmed by intracellular flow cytometry of ( B ) the Th17 transcription factor ROR-γt and ( C ) the Th17 and Th1 signature cytokines IL-17 and IFN-γ, respectively. ( D – I ) Impact of adoptive Th17 cell transfer on hippocampal precursor cell proliferation in TCRα −/− mice. ( D ) On day 7, 4 × 10 6 total cells from Th17 polarization cultures were injected i.v. into adult TCRα −/− mice. (D1) Dot plots show representative flow cytometry of CD4 + T cells in peripheral blood of recipient mice that express the Vα3.2 subunit of the transgenic 2D2 TCR, two weeks after adoptive transfer. (D2) and (D3) Graphs show composite percentages of total CD4 + T cells (D2) and MOG 35-55 -reactive Vα3.2 + T cells among gated CD4 + T cell populations (D3) from peripheral blood of recipient mice. The arrowheads in (D2) and (D3) highlight an individual mouse that exhibited immune cell infiltrations in the brain (see below). Numbers in dot plots in ( A – D ) indicate the percentage of cells in the respective quadrant or gate. ( E , F ) Anti-CD3 immunohistochemistry. ( E ) Immunohistochemistry of the dentate gyrus of TCRα −/− recipient mice for the pan-T cell marker CD3, two weeks after adoptive Th17 cell transfer. Infiltrating CD3 + T cells were found to be below the level of detection in all mice analyzed (E1, scale bar, 100 μm), with the exception of an individual recipient mouse that exhibited CD3 + T cell and other immune cell infiltrations in some brain areas, including the hippocampus (E2, scale bar, 100 μm). ( F ) Anti-CD3 immunohistochemistry of the spleen from wild-type C57BL/6 mice was included as a positive control (F1, scale bar, 100 μm; F2, scale bar, 25 μm). The arrowhead in (F2) indicates an individual CD3 + T cell. ( G , H ) Quantification of hippocampal cell proliferation. ( G ) BrdU immunohistochemistry of the dentate gyrus of TCRα −/− mice, which had been injected with either (G1) PBS or (G2) Th17 cells two weeks earlier, was performed 24 hours after the first of 3 consecutive BrdU injections. (G3) depicts the dentate gyrus of the mouse exhibiting immune cell infiltrations (see E2). Scale bar, 100 μm. ( H ) Quantification of BrdU + cells in the dentate gyrus of TCRα −/− mice injected with either PBS (n = 7) or Th17 cells (n = 7). All numbers are mean ± SEM. t-test, * p < 0.05. ( I ) Scatter diagram to visualize a possible relationship between cell proliferation in the dentate gyrus and the percentage of MOG 35-55 -reactive Vα3.2 + T cells among CD4 + T cells in the peripheral blood of recipient mice two weeks after adoptive transfer. No statistically significant correlation was found.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/12255/985e3961-2bf7-460a-864f-a3539c806e12_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_24",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Th17-polarized CD4 <sup>+</sup> T cells are sufficient to promote hippocampal precursor cell proliferation in adult TCR&#945; <sup>&#8211;/&#8211;</sup> mice.</title> <p>( <bold>A</bold>&#8211; <bold>C</bold>) Th17 polarization <italic>in vitro</italic>. ( <bold>A</bold>) Flow cytometry of encephalitogenic CD4 <sup>+</sup> T cells. Dot plots show pre-sort (left) and post-sort (right) analysis of na&#239;ve T cells (CD4 <sup>+</sup>CD62L <sup>high</sup>CD25 <sup>&#8722;</sup>Foxp3 <sup>GFP&#8722;</sup>) from pooled spleen and lymph nodes of 2D2 x Foxp3 <sup>GFP</sup> mice. FACS-purified T cell populations were cultured under Th17-polarizing conditions, as described in the Methods section. On day 7, efficiency of Th17 cell differentiation was confirmed by intracellular flow cytometry of ( <bold>B</bold>) the Th17 transcription factor ROR-&#947;t and ( <bold>C</bold>) the Th17 and Th1 signature cytokines IL-17 and IFN-&#947;, respectively. ( <bold>D</bold>&#8211; <bold>I</bold>) Impact of adoptive Th17 cell transfer on hippocampal precursor cell proliferation in TCR&#945; <sup>&#8722;/&#8722;</sup> mice. ( <bold>D</bold>) On day 7, 4 &#215; 10 <sup>6</sup> total cells from Th17 polarization cultures were injected i.v. into adult TCR&#945; <sup>&#8722;/&#8722;</sup> mice. (D1) Dot plots show representative flow cytometry of CD4 <sup>+</sup> T cells in peripheral blood of recipient mice that express the V&#945;3.2 subunit of the transgenic 2D2 TCR, two weeks after adoptive transfer. (D2) and (D3) Graphs show composite percentages of total CD4 <sup>+</sup> T cells (D2) and MOG <sub>35-55</sub>-reactive V&#945;3.2 <sup>+</sup> T cells among gated CD4 <sup>+</sup> T cell populations (D3) from peripheral blood of recipient mice. The arrowheads in (D2) and (D3) highlight an individual mouse that exhibited immune cell infiltrations in the brain (see below). Numbers in dot plots in ( <bold>A</bold>&#8211; <bold>D</bold>) indicate the percentage of cells in the respective quadrant or gate. ( <bold>E</bold>, <bold>F</bold>) Anti-CD3 immunohistochemistry. ( <bold>E</bold>) Immunohistochemistry of the dentate gyrus of TCR&#945; <sup>&#8722;/&#8722;</sup> recipient mice for the pan-T cell marker CD3, two weeks after adoptive Th17 cell transfer. Infiltrating CD3 <sup>+</sup> T cells were found to be below the level of detection in all mice analyzed (E1, scale bar, 100 &#956;m), with the exception of an individual recipient mouse that exhibited CD3 <sup>+</sup> T cell and other immune cell infiltrations in some brain areas, including the hippocampus (E2, scale bar, 100 &#956;m). ( <bold>F</bold>) Anti-CD3 immunohistochemistry of the spleen from wild-type C57BL/6 mice was included as a positive control (F1, scale bar, 100 &#956;m; F2, scale bar, 25 &#956;m). The arrowhead in (F2) indicates an individual CD3 <sup>+</sup> T cell. ( <bold>G</bold>, <bold>H</bold>) Quantification of hippocampal cell proliferation. ( <bold>G</bold>) BrdU immunohistochemistry of the dentate gyrus of TCR&#945; <sup>&#8722;/&#8722;</sup> mice, which had been injected with either (G1) PBS or (G2) Th17 cells two weeks earlier, was performed 24 hours after the first of 3 consecutive BrdU injections. (G3) depicts the dentate gyrus of the mouse exhibiting immune cell infiltrations (see E2). Scale bar, 100 &#956;m. ( <bold>H</bold>) Quantification of BrdU <sup>+</sup> cells in the dentate gyrus of TCR&#945; <sup>&#8722;/&#8722;</sup> mice injected with either PBS (n = 7) or Th17 cells (n = 7). All numbers are mean &#177; SEM. t-test, * p &lt; 0.05. ( <bold>I</bold>) Scatter diagram to visualize a possible relationship between cell proliferation in the dentate gyrus and the percentage of MOG <sub>35-55</sub>-reactive V&#945;3.2 <sup>+</sup> T cells among CD4 <sup>+</sup> T cells in the peripheral blood of recipient mice two weeks after adoptive transfer. No statistically significant correlation was found.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/12255/985e3961-2bf7-460a-864f-a3539c806e12_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Th17-polarized CD4 + T cells are sufficient to promote hippocampal precursor cell proliferation in adult TCRα –/– mice. ( A – C ) Th17 polarization in vitro . ( A ) Flow cytometry of encephalitogenic CD4 + T cells. Dot plots show pre-sort (left) and post-sort (right) analysis of naïve T cells (CD4 + CD62L high CD25 − Foxp3 GFP− ) from pooled spleen and lymph nodes of 2D2 x Foxp3 GFP mice. FACS-purified T cell populations were cultured under Th17-polarizing conditions, as described in the Methods section. On day 7, efficiency of Th17 cell differentiation was confirmed by intracellular flow cytometry of ( B ) the Th17 transcription factor ROR-γt and ( C ) the Th17 and Th1 signature cytokines IL-17 and IFN-γ, respectively. ( D – I ) Impact of adoptive Th17 cell transfer on hippocampal precursor cell proliferation in TCRα −/− mice. ( D ) On day 7, 4 × 10 6 total cells from Th17 polarization cultures were injected i.v. into adult TCRα −/− mice. (D1) Dot plots show representative flow cytometry of CD4 + T cells in peripheral blood of recipient mice that express the Vα3.2 subunit of the transgenic 2D2 TCR, two weeks after adoptive transfer. (D2) and (D3) Graphs show composite percentages of total CD4 + T cells (D2) and MOG 35-55 -reactive Vα3.2 + T cells among gated CD4 + T cell populations (D3) from peripheral blood of recipient mice. The arrowheads in (D2) and (D3) highlight an individual mouse that exhibited immune cell infiltrations in the brain (see below). Numbers in dot plots in ( A – D ) indicate the percentage of cells in the respective quadrant or gate. ( E , F ) Anti-CD3 immunohistochemistry. ( E ) Immunohistochemistry of the dentate gyrus of TCRα −/− recipient mice for the pan-T cell marker CD3, two weeks after adoptive Th17 cell transfer. Infiltrating CD3 + T cells were found to be below the level of detection in all mice analyzed (E1, scale bar, 100 μm), with the exception of an individual recipient mouse that exhibited CD3 + T cell and other immune cell infiltrations in some brain areas, including the hippocampus (E2, scale bar, 100 μm). ( F ) Anti-CD3 immunohistochemistry of the spleen from wild-type C57BL/6 mice was included as a positive control (F1, scale bar, 100 μm; F2, scale bar, 25 μm). The arrowhead in (F2) indicates an individual CD3 + T cell. ( G , H ) Quantification of hippocampal cell proliferation. ( G ) BrdU immunohistochemistry of the dentate gyrus of TCRα −/− mice, which had been injected with either (G1) PBS or (G2) Th17 cells two weeks earlier, was performed 24 hours after the first of 3 consecutive BrdU injections. (G3) depicts the dentate gyrus of the mouse exhibiting immune cell infiltrations (see E2). Scale bar, 100 μm. ( H ) Quantification of BrdU + cells in the dentate gyrus of TCRα −/− mice injected with either PBS (n = 7) or Th17 cells (n = 7). All numbers are mean ± SEM. t-test, * p < 0.05. ( I ) Scatter diagram to visualize a possible relationship between cell proliferation in the dentate gyrus and the percentage of MOG 35-55 -reactive Vα3.2 + T cells among CD4 + T cells in the peripheral blood of recipient mice two weeks after adoptive transfer. No statistically significant correlation was found.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/12255/985e3961-2bf7-460a-864f-a3539c806e12_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_25",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_26",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS0\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/4439/6b242888-ea9e-42e2-89a3-fff8e0e7b506_Datasets.zip\"> <label>Hippocampal neurogenesis data from T helper 17 cell-deficient and control mice</label> <caption> <p> <italic>Dataset 1a.</italic> Baseline proliferation levels of hippocampal precursor cells in TCR&#945; <sup>&#8211;/&#8211;</sup> and TCR&#945; <sup>+/&#8211;</sup> mice compared to C57BL/6 controls. The values shown are the numbers of BrdU <sup>+</sup> cells in the bilateral dentate gyrus of each single animal in the three different groups. The data refer to the results presented in <xref ref-type=\"fig\" rid=\"f1\">Figure 1</xref>.</p> <p> <italic>Dataset 1b.</italic> Proliferation levels of hippocampal precursor cells in TCR&#945; <sup>&#8211;/&#8211;</sup> mice after adoptive Th17 cell transfer compared to sham-injected TCR&#945; <sup>&#8211;/&#8211;</sup> controls. The values shown are the numbers of BrdU <sup>+</sup> cells in the bilateral dentate gyrus of each single animal in the two different groups. The numbers in brackets represent the percentages of total CD4 <sup>+</sup> T cells/V&#945;3.2 <sup>+</sup> T cells among gated CD4 <sup>+</sup> T cell populations from the peripheral blood of recipient mice two weeks after adoptive Th17 cell transfer. The data refer to the results presented in <xref ref-type=\"fig\" rid=\"f2\">Figure 2</xref>. The last entry in the left-hand column was excluded from statistical analysis due to determination as significant outlier by Grubbs&#8217; test.</p> <p> <italic>Dataset 1c.</italic> Quantification of expression levels of cytokine receptor genes in cells of the neurogenic niche of the hippocampus and hippocampal precursor cells from cell culture by real-time RT-PCR. Shown are mean values for &#916;Ct and the relative expression levels &#177; range of duplicate samples, using the &#916;Ct-method and GAPDH for normalization. The data refer to the results presented in <xref ref-type=\"fig\" rid=\"f3\">Figure 3</xref>.</p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_27",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "Cytokine receptor expression in the neurogenic niche of the hippocampal dentate gyrus. Freshly microdissected tissue and cultured neural precursor cells from the dentate gyrus of adult Nestin GFP and C57BL/6 wild-type mice were subjected to mRNA expression analysis of T cell-relevant cytokine receptor genes by real-time RT-PCR, as indicated. ( A ) Gel electrophoresis of RT-PCR duplicate samples. For details on indicated cytokine receptor genes, see below. Total cells from spleen and pooled lymph nodes were included as positive control. ( B ) Quantification by real-time RT-PCR. Relative mRNA expression values of indicated genes encoding cytokine receptor subunits, as revealed by quantitative RT-PCR using GAPDH for normalization. Only mRNAs with an expression below ΔCt = 15 were considered to be expressed (n.d., not detected). Shown are mean values ± range of duplicate samples. (B1) Receptor subunits for essential T cell effector cytokines, including Th17 cell-derived cytokines, were expressed in the dentate gyrus as well as isolated precursor cells. TNFR1, IFN-γR1, IL-10Rβ and IL-17RC are components of the receptors for TNF-α, IFN-γ (Th1), IL-10 (Treg/Th2) as well as IL-22, IL-17A and IL-17F (Th17). (B2) Shared receptor subunits of class I cytokine receptors (glycoprotein 130, gp130; common beta subunit, β c ; common gamma subunit, γ c ) were expressed in the dentate gyrus but, with the exception of gp130, not by the isolated precursor cells. Similar results were obtained for TGF-βR1, TGF-βR2, IL-2Rα (ΔCt = 17,86), IL-2Rβ (ΔCt = 16.75), IL-4Rα, IL-6Rα, IL-10Rα, IL-13Rα1, IL-21R, IL-22Rα1 (ΔCt = 18.78) and GM-CSFRα (ΔCt = 19.22). As a representative example, relative mRNA expression values for TGF-βR1 are shown (B3). Expression of the cytokine receptor mRNA for IL-5Rα could be detected neither in microdissected tissue nor in cultured precursor cells from the dentate gyrus.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/12255/985e3961-2bf7-460a-864f-a3539c806e12_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_28",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>Cytokine receptor expression in the neurogenic niche of the hippocampal dentate gyrus.</title> <p>Freshly microdissected tissue and cultured neural precursor cells from the dentate gyrus of adult Nestin <sup>GFP</sup> and C57BL/6 wild-type mice were subjected to mRNA expression analysis of T cell-relevant cytokine receptor genes by real-time RT-PCR, as indicated. ( <bold>A</bold>) Gel electrophoresis of RT-PCR duplicate samples. For details on indicated cytokine receptor genes, see below. Total cells from spleen and pooled lymph nodes were included as positive control. ( <bold>B</bold>) Quantification by real-time RT-PCR. Relative mRNA expression values of indicated genes encoding cytokine receptor subunits, as revealed by quantitative RT-PCR using GAPDH for normalization. Only mRNAs with an expression below &#916;Ct = 15 were considered to be expressed (n.d., not detected). Shown are mean values &#177; range of duplicate samples. (B1) Receptor subunits for essential T cell effector cytokines, including Th17 cell-derived cytokines, were expressed in the dentate gyrus as well as isolated precursor cells. TNFR1, IFN-&#947;R1, IL-10R&#946; and IL-17RC are components of the receptors for TNF-&#945;, IFN-&#947; (Th1), IL-10 (Treg/Th2) as well as IL-22, IL-17A and IL-17F (Th17). (B2) Shared receptor subunits of class I cytokine receptors (glycoprotein 130, gp130; common beta subunit, &#946; <sub>c</sub>; common gamma subunit, &#947; <sub>c</sub>) were expressed in the dentate gyrus but, with the exception of gp130, not by the isolated precursor cells. Similar results were obtained for TGF-&#946;R1, TGF-&#946;R2, IL-2R&#945; (&#916;Ct = 17,86), IL-2R&#946; (&#916;Ct = 16.75), IL-4R&#945;, IL-6R&#945;, IL-10R&#945;, IL-13R&#945;1, IL-21R, IL-22R&#945;1 (&#916;Ct = 18.78) and GM-CSFR&#945; (&#916;Ct = 19.22). As a representative example, relative mRNA expression values for TGF-&#946;R1 are shown (B3). Expression of the cytokine receptor mRNA for IL-5R&#945; could be detected neither in microdissected tissue nor in cultured precursor cells from the dentate gyrus.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/12255/985e3961-2bf7-460a-864f-a3539c806e12_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "Cytokine receptor expression in the neurogenic niche of the hippocampal dentate gyrus. Freshly microdissected tissue and cultured neural precursor cells from the dentate gyrus of adult Nestin GFP and C57BL/6 wild-type mice were subjected to mRNA expression analysis of T cell-relevant cytokine receptor genes by real-time RT-PCR, as indicated. ( A ) Gel electrophoresis of RT-PCR duplicate samples. For details on indicated cytokine receptor genes, see below. Total cells from spleen and pooled lymph nodes were included as positive control. ( B ) Quantification by real-time RT-PCR. Relative mRNA expression values of indicated genes encoding cytokine receptor subunits, as revealed by quantitative RT-PCR using GAPDH for normalization. Only mRNAs with an expression below ΔCt = 15 were considered to be expressed (n.d., not detected). Shown are mean values ± range of duplicate samples. (B1) Receptor subunits for essential T cell effector cytokines, including Th17 cell-derived cytokines, were expressed in the dentate gyrus as well as isolated precursor cells. TNFR1, IFN-γR1, IL-10Rβ and IL-17RC are components of the receptors for TNF-α, IFN-γ (Th1), IL-10 (Treg/Th2) as well as IL-22, IL-17A and IL-17F (Th17). (B2) Shared receptor subunits of class I cytokine receptors (glycoprotein 130, gp130; common beta subunit, β c ; common gamma subunit, γ c ) were expressed in the dentate gyrus but, with the exception of gp130, not by the isolated precursor cells. Similar results were obtained for TGF-βR1, TGF-βR2, IL-2Rα (ΔCt = 17,86), IL-2Rβ (ΔCt = 16.75), IL-4Rα, IL-6Rα, IL-10Rα, IL-13Rα1, IL-21R, IL-22Rα1 (ΔCt = 18.78) and GM-CSFRα (ΔCt = 19.22). As a representative example, relative mRNA expression values for TGF-βR1 are shown (B3). Expression of the cytokine receptor mRNA for IL-5Rα could be detected neither in microdissected tissue nor in cultured precursor cells from the dentate gyrus.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/12255/985e3961-2bf7-460a-864f-a3539c806e12_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_29",
            "content": "Impaired base-line proliferation of hippocampal precursor cells in adult TCRα –/– mice",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_30",
            "content": "We first assessed steady-state levels of cell proliferation in the hippocampal dentate gyrus of adult, 8-week-old TCRα –/– mice, which are characterized by a complete lack of αβ T cells (both CD4 + and CD8 + ) due to targeted deletion of the gene encoding the TCRα subunit (TCRα –/– ). For in vivo labeling of dividing cells, TCRα –/– mice received three consecutive i.p. injections of the thymidine analog bromodeoxyuridine (BrdU) at intervals of six hours. In these experiments, age-matched cohorts of fully immunocompetent TCRα +/– and C57BL/6 wild-type mice were included for comparison. Twenty-four hours after the first BrdU injection, experimental mice were subjected to immunohistochemical quantification of BrdU + cells in the dentate gyrus ( Figure 1A ). Consistent with a published study in TCRα –/– mice based on endogenous Ki67 expression as proliferation marker <REF-7> , we found that TCRα –/– mice (10205 ± 492 BrdU + cells, n = 8) exhibited significantly reduced levels of proliferation compared to C57BL/6 wild-type mice (11843 ± 556, n = 6; ANOVA, F (2, 18) = 3.698, p < 0.05; Figure 1B ). TCRα +/– mice (11469 ± 273, n = 7) ranged between controls and knockouts. Overall, these results are in agreement with our previous observation that CD4 + T cells provide a neuro-immunological link in the base-line regulation of hippocampal precursor cell activity <REF-6> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_31",
            "content": "Th17 cell-mediated restoration of proliferation in adult TCRα –/– mice",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_32",
            "content": "To assess the impact of myelin-reactive Th17 cells on proliferation in vivo , we employed adoptive T cell transfers using six-week-old mice and quantified BrdU + cells in the hippocampus of TCRα -/- recipients two weeks later. For the generation of Th17 cells, naïve CD4 + T cells (CD4 + CD62L high CD25 − Foxp3 GFP− ) carrying the MOG 35-55 -specific 2D2 TCR as a transgene were FACS-purified from peripheral lymphoid tissues of four- to six-week-old 2D2 × Foxp3 GFP mice ( Figure 2A ) and cultured under T cell stimulatory conditions that promote efficient differentiation into Th17 cells with a ROR-γt + IL-17 + phenotype ( Figure 2B and C ). As expected based on previous observations with differentiated Th17 cells in vitro , these cultures exhibited limited IFN-γ production ( Figure 2C ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_33",
            "content": "On day 7 of Th17 differentiation cultures, 4 × 10 6 total cells were injected i.v. into adult, age-matched cohorts of TCRα –/– mice. TCRα –/– mice that received PBS only were included as controls. Two weeks later, small populations of adoptively transferred CD4 + T cells could be detected in the peripheral blood of recipient mice ( Figure 2D ). In these experiments, significant proportions of CD4 + Th17 cells expressed the MOG 35-55 -specific 2D2 TCR transgene (ranging from 15.6 % to 56.1%), as judged by flow cytometry of the TCRα subunit of the transgenic 2D2 TCR, employing anti-Vα3.2 mAbs ( Figure 2D ). Importantly, throughout the observation period, TCRα –/– recipients of in vitro generated Th17 cells appeared phenotypically healthy and exhibited no clinical symptoms of EAE. Consistently, immunohistochemistry for the pan-T cell marker CD3 revealed that infiltrating Th17 cells in the dentate gyrus were below the detection level in all mice analyzed ( Figure 2E and F ), with the exception of an individual recipient with immune cell infiltrates, including some CD3 + T cells ( Figure 2E2 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_34",
            "content": "Two weeks after adoptive T cell transfer, cell proliferation in the dentate gyrus of TCRα –/– recipients was assessed by immunohistochemical quantification of BrdU + cells, as described above. After applying Grubbs’ outlier test, one animal in the control group with exceptionally high numbers of BrdU-positive cells was excluded from further analysis. The results showed that TCRα –/– recipients of Th17 cells exhibit significantly increased numbers of BrdU + cells in the hippocampal dentate gyrus (11758 ± 347, n =7), as compared to control-injected TCRα –/– mice (10602 ± 214, n = 7; t-test, p < 0.05; Figure 2G and H ). Thus, populations of Th17 cells enriched for myelin-reactive TCRs appear sufficient to restore impaired base-line proliferation of hippocampal precursor cells in adult TCRα –/– recipient mice, in the absence of T cell infiltration and direct interaction with neural precursor cells or cellular components of the hippocampal neurogenic niche such as microglia. Consistently, the enhanced proliferative activity of precursor cells did not correlate with the proportion of Vα3.2 + Th17 cells that accumulated in recipient mice (Pearson’s r = –0.28, p = 0.538, 95% CI –0.85 to 0.60, n = 7; Figure 2I ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_35",
            "content": "Cytokine receptor expression in the neurogenic niche of immunocompetent mice",
            "ntype": "title",
            "meta": {
                "section": "3.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_36",
            "content": "Besides the signature cytokines IL-17A and IL-17F, ROR-γt + Th17 cells have been reported to produce a variety of cytokines such as TNF-α, IFN-γ, IL-9, IL-10, IL-21 and IL-22. In a first attempt to provide insight into possible mechanisms underlying the enhancement of hippocampal precursor cell proliferation by Th17 cell-secreted cytokines, we assessed expression levels of mRNAs encoding relevant cytokine receptors in the neurogenic niche. To this end, we performed quantitative RT-PCR analysis of freshly microdissected dentate gyrus as well as isolated precursor cells from the dentate gyrus of adult, immunocompetent C57BL/6 mice ( Figure 3 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_37",
            "content": "This approach identified several subunits of receptors for Th17-derived cytokines with detectable mRNA expression levels in both total dentate gyrus tissue and isolated precursor cells ( Figure 3A and B ), namely IL-17 receptor C (IL-17RC), tumor necrosis factor R1 (TNFR1), interferon-gamma R1 (IFN-γR1) as well as IL-10R beta (IL-10Rβ), a common subunit involved in the formation of the receptors for IL-10 and IL-22 <REF-40> . Next, we extended our analysis to the type I cytokine receptor family (glycoprotein 130: gp130, CD130; common γ subunit: γc, CD132; common β subunit: βc, CD131), which is involved in the formation of more than 20 different cytokine receptors. In these experiments, mRNA expression of all three receptor family members (gp130, βc, γc) could be detected in total dentate gyrus tissue ( Figure 3A and B ). Furthermore, mRNA encoding gp130, a subunit shared between the receptors for cytokines such as IL-6, leukemia inhibitory factor (LIF) and ciliary neurotrophic factor (CNTF), was also expressed in isolated neural precursor cells. Interestingly, IL-6, LIF and CNTF directly affect the differentiation of adult hippocampal precursor cells in vitro <REF-41> – <REF-44> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_38",
            "content": "Cytokine receptor subunits with detectable mRNA expression levels in microdissected total tissue but not in isolated precursor cells from the dentate gyrus included transforming growth factor beta receptor 1 and 2 (TGF-βR1 and TGF-βR2), IL-2R alpha and beta (IL-2Rα and IL-2Rβ), IL-4Rα, IL-10Rα, IL-13Rα1, IL-21R, IL-22Rα1 and granulocyte-macrophage colony stimulating factor receptor alpha (GM-CSFRα). Among these the ΔCt-values for IL-2Rα (ΔCt = 17,86), IL-2Rβ (ΔCt = 16.75), IL-22Rα1 (ΔCt = 18.78) and GM-CSFRα (ΔCt = 19.22) were found to be below the chosen cut-off (ΔCt < 15). Nevertheless, in all of these cases a specific product could be detected by gel electrophoresis of RT-PCR samples ( Figure 3A) . Additionally, and in contrast to previous reports on IL-6Rα mRNA expression in dentate gyrus-derived precursor cells <REF-42> , we found IL-6Rα mRNA to be expressed in whole dentate gyrus but not in isolated neural precursor cells. The underlying reason for this apparent discrepancy between studies remains to be determined, but may include methodological differences in the preparation and/or purity of isolated precursor cells. Lastly, among the cytokine receptor subunits whose expression was analyzed in the present study, we failed to detect mRNA expression for IL-5R alpha (IL-5Rα) in both microdissected tissue and isolated precursor cells ( Figure 3A ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_39",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_40",
            "content": "Previous studies on mice with transgenic expression of a myelin-specific TCR on CD4 + T cells <REF-5> and a non-TCR transgenic mouse model of MOG-inducible EAE <REF-9> have provided the first evidence that encephalitogenic CD4 + T cell activity can promote hippocampal precursor cell proliferation and adult neurogenesis. Here, we have extended these observations and show that, in the absence of autoimmune neuroinflammation, small numbers of myelin-reactive CD4 + T cells with a ROR-γt + IL-17 + phenotype are sufficient to restore base-line proliferation of hippocampal precursor cells in TCRα –/– mice that lack endogenous αβ T cells.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_41",
            "content": "Mechanistically, and consistent with the proneurogenic activity of non-infiltrating CD4 + T cells with a polyclonal TCR repertoire <REF-6> , <REF-7> , the overall absence of immune cell infiltrations in our Th17 adoptive transfer model emphasizes that direct cell-cell interaction is not a prerequisite of enhanced Th17-mediated hippocampal precursor cell proliferation. Alternatively, Th17 cells residing in peripheral lymphoid tissues outside the brain may secrete cytokines that are actively transported across the blood-brain barrier <REF-45> , <REF-46> and act on the hippocampal neurogenic niche to promote precursor cell proliferation. Indeed, it is becoming increasingly clear that the impact of inflammatory cytokines on hippocampal neurogenesis appears much more context-dependent than anticipated based on previous studies highlighting overall detrimental effects <REF-3> , <REF-4> , <REF-47> – <REF-49> . Factors that influence the impact of inflammatory cytokines on neurogenesis include the administration route and local cytokine concentrations, the strength and duration of enhanced cytokine receptor signalling as well as the target cell within the neurogenic niche. While the present study suggests that several receptors for Th17 cell-derived cytokines (TNF-α, IFN-γ, IL-17, IL-22) are expressed on hippocampal precursor cells as well as neighbouring cells in the dentate gyrus, it will be important to investigate whether the pattern of expressed cytokine receptors observed in mice under physiological baseline conditions is subject to differential regulation in response to intrinsic or extrinsic stimuli. Another important, unresolved question is whether the proneurogenic effect of Th17 cells can be attributed to an individual inflammatory cytokine or is rather mediated by the combined action of different Th17-cell derived factors.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_42",
            "content": "At present, cytokines with reported proneurogenic potential in hippocampal neurogenesis include IFN-γ <REF-50> , <REF-51> , TNF-α <REF-52> , <REF-53> , TGF-β <REF-54> , CNTF <REF-44> as well as IL-1β and IL-6 <REF-42> , <REF-55> . Interestingly, the Th17 signature cytokine IL-17 has recently been found to increase neurite outgrowth from adult postganglionic sympathetic neurons, a process that required NFkB activation <REF-28> . Importantly, the NFkB pathway, which is shared between many cytokine receptor signaling pathways, has previously been implicated in the regulation of neural precursor cell proliferation and differentiation <REF-56> , <REF-57> . Clearly, future studies are warranted to directly address a putative role of IL-17 and the NFkB pathway in hippocampal proliferation and neurogenesis.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_43",
            "content": "In summary, the present study exemplifies that the TCRα –/– mouse represents a suitable experimental model to assess the proneurogenic potential of homogeneous Th cell populations that had been generated under well-defined in vitro conditions. This is likely to facilitate mechanistic studies on the relative contribution of various CD4 + Th cell subsets (Th1, Th2, Th17 etc.) to the regulation of adult hippocampal neurogenesis.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_44",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_45",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2017 Niebling J et al.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_46",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_47",
            "content": "F1000Research: Dataset 1. Hippocampal neurogenesis data in T helper 17 cell-deficient and control mice , http://dx.doi.org/10.5256/f1000research.4439.d157588 <REF-58>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_48",
            "content": "<REF-1> Römer B Krebs J Overall RW : Adult hippocampal neurogenesis and plasticity in the infrapyramidal bundle of the mossy fiber projection: I. Co-regulation by activity. Front Neurosci. 2011 ; 5 : 107 . 21991243 10.3389/fnins.2011.00107 3180604",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_49",
            "content": "<REF-2> Krebs J Römer B Overall RW : Adult Hippocampal Neurogenesis and Plasticity in the Infrapyramidal Bundle of the Mossy Fiber Projection: II. Genetic Covariation and Identification of Nos1 as Linking Candidate Gene. Front Neurosci. 2011 ; 5 : 106 . 21960957 10.3389/fnins.2011.00106 3177083",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_50",
            "content": "<REF-3> Monje ML Toda H Palmer TD : Inflammatory blockade restores adult hippocampal neurogenesis. Science. 2003 ; 302 ( 5651 ): 1760 – 5 . 14615545 10.1126/science.1088417",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_51",
            "content": "<REF-4> Ekdahl CT Claasen JH Bonde S : Inflammation is detrimental for neurogenesis in adult brain. Proc Natl Acad Sci U S A. 2003 ; 100 ( 23 ): 13632 – 7 . 14581618 10.1073/pnas.2234031100 263865",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_52",
            "content": "<REF-5> Ziv Y Ron N Butovsky O : Immune cells contribute to the maintenance of neurogenesis and spatial learning abilities in adulthood. Nat Neurosci. 2006 ; 9 ( 2 ): 268 – 75 . 16415867 10.1038/nn1629",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_53",
            "content": "<REF-6> Wolf SA Steiner B Akpinarli A : CD4-positive T lymphocytes provide a neuroimmunological link in the control of adult hippocampal neurogenesis. J Immunol. 2009 ; 182 ( 7 ): 3979 – 84 . 19299695 10.4049/jimmunol.0801218",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_54",
            "content": "<REF-7> Huang GJ Smith AL Gray DH : A genetic and functional relationship between T cells and cellular proliferation in the adult hippocampus. PLoS Biol. 2010 ; 8 ( 12 ): e1000561 . 21179499 10.1371/journal.pbio.1000561 3001898",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_55",
            "content": "<REF-8> Ziv Y Schwartz M : Immune-based regulation of adult neurogenesis: implications for learning and memory. Brain Behav Immun. 2008 ; 22 ( 2 ): 167 – 76 . 17905567 10.1016/j.bbi.2007.08.006",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_56",
            "content": "<REF-9> Huehnchen P Prozorovski T Klaissle P : Modulation of adult hippocampal neurogenesis during myelin-directed autoimmune neuroinflammation. Glia. 2011 ; 59 ( 1 ): 132 – 42 . 20967885 10.1002/glia.21082",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_57",
            "content": "<REF-10> Mosmann TR Coffman RL : TH1 and TH2 cells: different patterns of lymphokine secretion lead to different functional properties. Annu Rev Immunol. 1989 ; 7 : 145 – 73 . 2523712 10.1146/annurev.immunol.7.1.145",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_58",
            "content": "<REF-12> Harrington LE Hatton RD Mangan PR : Interleukin 17-producing CD4 + effector T cells develop via a lineage distinct from the T helper type 1 and 2 lineages. Nat Immunol. 2005 ; 6 ( 11 ): 1123 – 32 . 16200070 10.1038/ni1254",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_59",
            "content": "<REF-13> Basu R Hatton RD Weaver CT : The Th17 family: flexibility follows function. Immunol Rev. 2013 ; 252 ( 1 ): 89 – 103 . 23405897 10.1111/imr.12035 3607325",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_60",
            "content": "<REF-14> Huber S Gagliani N Flavell RA : Life, death, and miracles: Th17 cells in the intestine. Eur J Immunol. 2012 ; 42 ( 9 ): 2238 – 45 . 22949322 10.1002/eji.201242619",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_61",
            "content": "<REF-15> Korn T Bettelli E Oukka M : IL-17 and Th17 Cells. Annu Rev Immunol. 2009 ; 27 : 485 – 517 . 19132915 10.1146/annurev.immunol.021908.132710",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_62",
            "content": "<REF-16> Miossec P Korn T Kuchroo VK : Interleukin-17 and type 17 helper T cells. N Engl J Med. 2009 ; 361 ( 9 ): 888 – 98 . 19710487 10.1056/NEJMra0707449",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_63",
            "content": "<REF-17> Wilson NJ Boniface K Chan JR : Development, cytokine profile and function of human interleukin 17-producing helper T cells. Nat Immunol. 2007 ; 8 ( 9 ): 950 – 7 . 17676044 10.1038/ni1497",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_64",
            "content": "<REF-18> Bettelli E Oukka M Kuchroo VK : T H -17 cells in the circle of immunity and autoimmunity. Nat Immunol. 2007 ; 8 ( 4 ): 345 – 50 . 17375096 10.1038/ni0407-345",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_65",
            "content": "<REF-23> Zepp J Wu L Li X : IL-17 receptor signaling and T helper 17-mediated autoimmune demyelinating disease. Trends Immunol. 2011 ; 32 ( 5 ): 232 – 9 . 21493143 10.1016/j.it.2011.02.007 3329781",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_66",
            "content": "<REF-24> Sugimoto K Ogawa A Mizoguchi E : IL-22 ameliorates intestinal inflammation in a mouse model of ulcerative colitis. J Clin Invest. 2008 ; 118 ( 2 ): 534 – 44 . 18172556 2157567",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_67",
            "content": "<REF-28> Chisholm SP Cervi AL Nagpal S : Interleukin-17A increases neurite outgrowth from adult postganglionic sympathetic neurons. J Neurosci. 2012 ; 32 ( 4 ): 1146 – 55 . 22279201 10.1523/JNEUROSCI.5343-11.2012",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_68",
            "content": "<REF-29> McGee HM Schmidt BA Booth CJ : IL-22 promotes fibroblast-mediated wound repair in the skin. J Invest Dermatol. 2013 ; 133 ( 5 ): 1321 – 9 . 23223145 10.1038/jid.2012.463 3610794",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_69",
            "content": "<REF-30> Eyerich S Eyerich K Cavani A : IL-17 and IL-22: siblings, not twins. Trends Immunol. 2010 ; 31 ( 9 ): 354 – 61 . 20691634 10.1016/j.it.2010.06.004",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_70",
            "content": "<REF-31> Yamaguchi M Saito H Suzuki M : Visualization of neurogenesis in the central nervous system using nestin promoter-GFP transgenic mice. Neuroreport. 2000 ; 11 ( 9 ): 1991 – 6 . 10884058 10.1097/00001756-200006260-00037",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_71",
            "content": "<REF-32> Mombaerts P Clarke AR Rudnicki MA : Mutations in T-cell antigen receptor genes alpha and beta block thymocyte development at different stages. Nature. 1992 ; 360 ( 6401 ): 225 – 31 . 1359428 10.1038/360225a0",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_72",
            "content": "<REF-33> Bettelli E Pagany M Weiner HL : Myelin oligodendrocyte glycoprotein-specific T cell receptor transgenic mice develop spontaneous autoimmune optic neuritis. J Exp Med. 2003 ; 197 ( 9 ): 1073 – 81 . 12732654 10.1084/jem.20021603 2193967",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_73",
            "content": "<REF-35> Kronenberg G Reuter K Steiner B : Subpopulations of proliferating cells of the adult hippocampus respond differently to physiologic neurogenic stimuli. J Comp Neurol. 2003 ; 467 ( 4 ): 455 – 63 . 14624480 10.1002/cne.10945",
            "ntype": "ref",
            "meta": {
                "id": "ref-35",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_74",
            "content": "<REF-36> Hagihara H Toyama K Yamasaki N : Dissection of hippocampal dentate gyrus from adult mouse. J Vis Exp. 2009 ; ( 33 ): 1 – 6 , pii: 1543. 19920804 10.3791/1543 3142893",
            "ntype": "ref",
            "meta": {
                "id": "ref-36",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_75",
            "content": "<REF-37> Babu H Cheung G Kettenmann H : Enriched monolayer precursor cell cultures from micro-dissected adult mouse dentate gyrus yield functional granule cell-like neurons. PLoS One. 2007 ; 2 ( 4 ): e388 . 17460755 10.1371/journal.pone.0000388 1849968",
            "ntype": "ref",
            "meta": {
                "id": "ref-37",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_76",
            "content": "<REF-38> Babu H Claasen JH Kannan S : A protocol for isolation and enriched monolayer cultivation of neural precursor cells from mouse dentate gyrus. Front Neurosci. 2011 ; 5 : 89 . 21811434 10.3389/fnins.2011.00089 3140691",
            "ntype": "ref",
            "meta": {
                "id": "ref-38",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_77",
            "content": "<REF-39> Lluís F Roma J Suelves M : Urokinase-dependent plasminogen activation is required for efficient skeletal muscle regeneration in vivo . Blood. 2001 ; 97 ( 6 ): 1703 – 11 . 11238111 10.1182/blood.V97.6.1703",
            "ntype": "ref",
            "meta": {
                "id": "ref-39",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_78",
            "content": "<REF-40> Ozaki K Leonard WJ : Cytokine and cytokine receptor pleiotropy and redundancy. J Biol Chem. 2002 ; 277 ( 33 ): 29355 – 8 . 12072446 10.1074/jbc.R200003200",
            "ntype": "ref",
            "meta": {
                "id": "ref-40",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_79",
            "content": "<REF-41> Nakanishi M Niidome T Matsuda S : Microglia-derived interleukin-6 and leukaemia inhibitory factor promote astrocytic differentiation of neural stem/progenitor cells. Eur J Neurosci. 2007 ; 25 ( 3 ): 649 – 58 . 17328769 10.1111/j.1460-9568.2007.05309.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-41",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_80",
            "content": "<REF-42> Barkho BZ Song H Aimone JB : Identification of astrocyte-expressed factors that modulate neural stem/progenitor cell differentiation. Stem Cells Dev. 2006 ; 15 ( 3 ): 407 – 421 . 16846377 10.1089/scd.2006.15.407 2777811",
            "ntype": "ref",
            "meta": {
                "id": "ref-42",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_81",
            "content": "<REF-44> Müller S Chakrapani BP Schwegler H : Neurogenesis in the dentate gyrus depends on ciliary neurotrophic factor and signal transducer and activator of transcription 3 signaling. Stem Cells. 2009 ; 27 ( 2 ): 431 – 41 . 19023034 10.1634/stemcells.2008-0234",
            "ntype": "ref",
            "meta": {
                "id": "ref-44",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_82",
            "content": "<REF-45> Banks WA Farr SA Morley JE : Entry of blood-borne cytokines into the central nervous system: effects on cognitive processes. Neuroimmunomodulation. 2002–2003 ; 10 ( 6 ): 319 – 27 . 12907838 10.1159/000071472",
            "ntype": "ref",
            "meta": {
                "id": "ref-45",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_83",
            "content": "<REF-46> Banks WA Erickson MA : The blood-brain barrier and immune function and dysfunction. Neurobiol Dis. 2010 ; 37 ( 1 ): 26 – 32 . 19664708 10.1016/j.nbd.2009.07.031",
            "ntype": "ref",
            "meta": {
                "id": "ref-46",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_84",
            "content": "<REF-47> Kaneko N Kudo K Mabuchi T : Suppression of cell proliferation by interferon-alpha through interleukin-1 production in adult rat dentate gyrus. Neuropsychopharmacology. 2006 ; 31 ( 12 ): 2619 – 26 . 16823390 10.1038/sj.npp.1301137",
            "ntype": "ref",
            "meta": {
                "id": "ref-47",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_85",
            "content": "<REF-49> Vallières L Campbell IL Gage FH : Reduced hippocampal neurogenesis in adult transgenic mice with chronic astrocytic production of interleukin-6. J Neurosci. 2002 ; 22 ( 2 ): 486 – 92 . 11784794",
            "ntype": "ref",
            "meta": {
                "id": "ref-49",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_86",
            "content": "<REF-50> Baron R Nemirovsky A Harpaz I : IFN-gamma enhances neurogenesis in wild-type mice and in a mouse model of Alzheimer’s disease. FASEB J. 2008 ; 22 ( 8 ): 2843 – 52 . 18390924 10.1096/fj.08-105866",
            "ntype": "ref",
            "meta": {
                "id": "ref-50",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_87",
            "content": "<REF-51> Wong G Goldshmit Y Turnley AM : Interferon-gamma but not TNF alpha promotes neuronal differentiation and neurite outgrowth of murine adult neural stem cells. Exp Neurol. 2004 ; 187 ( 1 ): 171 – 7 . 15081598 10.1016/j.expneurol.2004.01.009",
            "ntype": "ref",
            "meta": {
                "id": "ref-51",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_88",
            "content": "<REF-52> Iosif RE Ekdahl CT Ahlenius H : Tumor necrosis factor receptor 1 is a negative regulator of progenitor proliferation in adult hippocampal neurogenesis. J Neurosci. 2006 ; 26 ( 38 ): 9703 – 12 . 16988041 10.1523/JNEUROSCI.2723-06.2006",
            "ntype": "ref",
            "meta": {
                "id": "ref-52",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_89",
            "content": "<REF-53> Chen Z Palmer TD : Differential roles of TNFR1 and TNFR2 signaling in adult hippocampal neurogenesis. Brain Behav Immun. 2013 ; 30 : 45 – 53 . 23402793 10.1016/j.bbi.2013.01.083 3641155",
            "ntype": "ref",
            "meta": {
                "id": "ref-53",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_90",
            "content": "<REF-54> Battista D Ferrari CC Gage FH : Neurogenic niche modulation by activated microglia: transforming growth factor beta increases neurogenesis in the adult dentate gyrus. Eur J Neurosci. 2006 ; 23 ( 1 ): 83 – 93 . 16420418 10.1111/j.1460-9568.2005.04539.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-54",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_91",
            "content": "<REF-55> Seguin JA Brennan J Mangano E : Proinflammatory cytokines differentially influence adult hippocampal cell proliferation depending upon the route and chronicity of administration. Neuropsychiatr Dis Treat. 2009 ; 5 : 5 – 14 . 19557094 10.2147/NDT.S4476 2695223",
            "ntype": "ref",
            "meta": {
                "id": "ref-55",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_92",
            "content": "<REF-56> Young KM Bartlett PF Coulson EJ : Neural progenitor number is regulated by nuclear factor-kappaB p65 and p50 subunit-dependent proliferation rather than cell survival. J Neurosci Res. 2006 ; 83 ( 1 ): 39 – 49 . 16307445 10.1002/jnr.20702",
            "ntype": "ref",
            "meta": {
                "id": "ref-56",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_93",
            "content": "<REF-57> Zhang Y Liu J Yao S : Nuclear factor kappa B signaling initiates early differentiation of neural stem cells. Stem Cells. 2012 ; 30 ( 3 ): 510 – 24 . 22134901 10.1002/stem.1006 3707487",
            "ntype": "ref",
            "meta": {
                "id": "ref-57",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-169_v2_94",
            "content": "<REF-58> Niebling JE Rünker A Schallenberg S : Dataset 1 in: Myelin-specific T helper 17 cells promote adult hippocampal neurogenesis through indirect mechanisms. F1000Research. 2017 . Data Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-58",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "3-169_v2_0@0",
            "content": "Myelin-specific T helper 17 cells promote adult hippocampal neurogenesis through indirect mechanisms",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_0",
            "start": 0,
            "end": 99,
            "label": {}
        },
        {
            "ix": "3-169_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "3-169_v2_2@0",
            "content": "CD4 + T cells provide a neuro-immunological link in the regulation of adult hippocampal neurogenesis, but the exact mechanisms underlying enhanced neural precursor cell proliferation and the relative contribution of different T helper (Th) cell subsets have remained unclear.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_2",
            "start": 0,
            "end": 274,
            "label": {}
        },
        {
            "ix": "3-169_v2_2@1",
            "content": "Here, we explored the pro-proliferative potential of interleukin 17-producing T helper (Th17) cells, a developmentally and functionally distinct Th cell subset that is a key mediator of autoimmune neurodegeneration.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_2",
            "start": 276,
            "end": 490,
            "label": {}
        },
        {
            "ix": "3-169_v2_2@2",
            "content": "We found that base-line proliferation of hippocampal precursor cells in a T cell-deficient mouse model of impaired hippocampal neurogenesis can be restored upon adoptive transfer with homogeneous Th17 populations enriched for myelin-reactive T cell receptors (TCR).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_2",
            "start": 492,
            "end": 756,
            "label": {}
        },
        {
            "ix": "3-169_v2_2@3",
            "content": "In these experiments, enhanced proliferation was independent of direct interactions of infiltrating Th17 cells with precursor cells or neighboring cells in the hippocampal neurogenic niche.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_2",
            "start": 758,
            "end": 946,
            "label": {}
        },
        {
            "ix": "3-169_v2_2@4",
            "content": "Complementary studies in immunocompetent mice identified several receptors for Th17 cell-derived cytokines with mRNA expression in hippocampal precursor cells and dentate gyrus tissue, suggesting that Th17 cell activity in peripheral lymphoid tissues might promote hippocampal neurogenesis through secreted cytokines.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_2",
            "start": 948,
            "end": 1264,
            "label": {}
        },
        {
            "ix": "3-169_v2_3@0",
            "content": "Background",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_3",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "3-169_v2_4@0",
            "content": "In the hippocampus of the adult brain, neurogenesis originates from neural precursor cells residing in the subgranular zone of the dentate gyrus that proliferate and differentiate in response to intrinsic and extrinsic stimuli, allowing adaptation of the neuronal network to changing needs throughout life <REF-1> , <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_4",
            "start": 0,
            "end": 324,
            "label": {}
        },
        {
            "ix": "3-169_v2_4@1",
            "content": "Besides innate immune mechanisms <REF-3> , <REF-4> , CD4 + T cells of the adaptive immune system promote adult hippocampal neurogenesis and convey functional benefits in reversal learning that have been related to adult neurogenesis <REF-5> – <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_4",
            "start": 326,
            "end": 577,
            "label": {}
        },
        {
            "ix": "3-169_v2_4@2",
            "content": "However the molecular and cellular mechanisms underlying CD4 + T cell-mediated enhancement of adult neurogenesis have largely remained unclear.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_4",
            "start": 579,
            "end": 721,
            "label": {}
        },
        {
            "ix": "3-169_v2_4@3",
            "content": "For example, whether or not the infiltration of myelin-reactive T cells into the CNS is a prerequisite for the proneurogenic activity of CD4 + T cells has been controversially discussed <REF-5> , <REF-6> , <REF-8> , <REF-9> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_4",
            "start": 723,
            "end": 947,
            "label": {}
        },
        {
            "ix": "3-169_v2_4@4",
            "content": "Additionally, the relative contribution of the activation or differentiation status of the CD4 + T cells to their proneurogenic activity remains to be determined.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_4",
            "start": 949,
            "end": 1110,
            "label": {}
        },
        {
            "ix": "3-169_v2_4@5",
            "content": "This includes CD4 + T cell-derived soluble factors that could either act directly on hippocampal precursor cells or promote precursor cell activity through indirect mechanisms, e.g. by acting on neighbouring cells within the neurogenic niche of the adult hippocampus.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_4",
            "start": 1112,
            "end": 1378,
            "label": {}
        },
        {
            "ix": "3-169_v2_5@0",
            "content": "Upon appropriate T cell and cytokine receptor signals, initially naïve CD4 + T cells can differentiate into different T helper (Th) cell subsets with distinct cytokine profiles and effector functions <REF-10> – <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_5",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "3-169_v2_5@1",
            "content": "This includes interleukin-17 (IL-17)-producing Th17 cells that additionally express the orphan nuclear receptor ROR-γt.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_5",
            "start": 222,
            "end": 340,
            "label": {}
        },
        {
            "ix": "3-169_v2_5@2",
            "content": "Besides mediating anti-microbial immunity at epithelial barriers <REF-13> – <REF-17> , ROR-γt + Th17 cells have been broadly linked to the pathogenesis of various autoimmune and chronic inflammatory conditions <REF-18> – <REF-23> , most notably demyelinating inflammatory disorders of the CNS, such as multiple sclerosis in humans and experimental autoimmune encephalomyelitis (EAE) in rodents.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_5",
            "start": 342,
            "end": 735,
            "label": {}
        },
        {
            "ix": "3-169_v2_5@3",
            "content": "In EAE, a local reactivation of myelin-reactive Th17 cells that have crossed the blood-brain barrier initiates a cascade of neuroinflammatory responses, ultimately leading to demyelination in the CNS and neurodegeneration.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_5",
            "start": 737,
            "end": 958,
            "label": {}
        },
        {
            "ix": "3-169_v2_5@4",
            "content": "More recent evidence suggests that there are different subsets of Th17 cells comprising a wide spectrum of effector phenotypes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_5",
            "start": 960,
            "end": 1086,
            "label": {}
        },
        {
            "ix": "3-169_v2_5@5",
            "content": "Among these are nonpathogenic Th17 cells with regulatory properties that restrict tissue destruction during inflammatory responses and promote tissue remodeling and repair <REF-14> , <REF-24> – <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_5",
            "start": 1088,
            "end": 1291,
            "label": {}
        },
        {
            "ix": "3-169_v2_5@6",
            "content": "This together with the broad expression of surface receptors for Th17-derived cytokines on both immune and non-immune cells <REF-15> , <REF-16> , <REF-30> , prompted us to assess the capacity of myelin-reactive Th17 cells to enhance precursor cell proliferation in an αβ T cell-deficient mouse model of impaired hippocampal neurogenesis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_5",
            "start": 1293,
            "end": 1629,
            "label": {}
        },
        {
            "ix": "3-169_v2_5@7",
            "content": "We concentrated on investigating proliferation as the most validated sub-process of adult hippocampal neurogenesis affected by T-cell alterations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_5",
            "start": 1631,
            "end": 1776,
            "label": {}
        },
        {
            "ix": "3-169_v2_6@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_6",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "3-169_v2_7@0",
            "content": "Mice",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_7",
            "start": 0,
            "end": 3,
            "label": {}
        },
        {
            "ix": "3-169_v2_8@0",
            "content": "C57BL/6 mice were purchased from Janvier.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_8",
            "start": 0,
            "end": 40,
            "label": {}
        },
        {
            "ix": "3-169_v2_8@1",
            "content": "Nestin GFP <REF-31> , TCRα −/− <REF-32> , and 2D2 mice <REF-33> expressing a transgenic TCR recognizing amino acids 35-55 of myelin oligodendrocyte glycoprotein (MOG 35-55 ), were on the C57BL/6 background.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_8",
            "start": 42,
            "end": 247,
            "label": {}
        },
        {
            "ix": "3-169_v2_8@2",
            "content": "2D2 mice additionally expressed a transgenic Foxp3 GFP reporter (2D2 × Foxp3 GFP 34 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_8",
            "start": 249,
            "end": 334,
            "label": {}
        },
        {
            "ix": "3-169_v2_8@3",
            "content": "C57BL/6 and TCRα –/– mice were intercrossed to obtain heterozygous TCRα +/– F1 mice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_8",
            "start": 336,
            "end": 419,
            "label": {}
        },
        {
            "ix": "3-169_v2_8@4",
            "content": "All mice were housed at the Experimental Center of the Medizinisch-Theoretisches Zentrum (Technische Universität Dresden, Germany) under specific pathogen-free (SPF) conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_8",
            "start": 421,
            "end": 597,
            "label": {}
        },
        {
            "ix": "3-169_v2_8@5",
            "content": "They received food (standard mouse food „R/M-H“ from Ssniff Spezialitäten GmbH, Soest, Germany) and water ad libitum and lived on a light/dark cycle of 12 h/12 h with lights on at 8 am.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_8",
            "start": 599,
            "end": 783,
            "label": {}
        },
        {
            "ix": "3-169_v2_8@6",
            "content": "Animal experiments were approved by the responsible regulatory authority at Regierungspräsidium Dresden (Approval numbers 24-9168.24-1/2008-5 and 24-9168.11-1/2008-12).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_8",
            "start": 785,
            "end": 952,
            "label": {}
        },
        {
            "ix": "3-169_v2_9@0",
            "content": "Flow cytometry and cell sorting",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_9",
            "start": 0,
            "end": 30,
            "label": {}
        },
        {
            "ix": "3-169_v2_10@0",
            "content": "Single cell suspensions of pooled spleen and lymph nodes (mesenteric and subcutaneous) from four- to six-week-old 2D2 × Foxp3 GFP mice were prepared using 70 µm cell strainers (BD).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_10",
            "start": 0,
            "end": 180,
            "label": {}
        },
        {
            "ix": "3-169_v2_10@1",
            "content": "Monoclonal antibodies (mAbs) to CD4 (Monoclonal Rat IgG, GK1.5, BD Biosciences, Cat. No. 5532728), CD25 (Monoclonal Rat IgG, PC61, BD Biosciences, Cat. No. 551071) and CD62L (Monoclonal Rat IgG, MEL-14, eBioscience, Cat. No. 17-0621) and Pacific Blue-conjugated streptavidin were purchased from eBioscience or BD Biosciences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_10",
            "start": 182,
            "end": 506,
            "label": {}
        },
        {
            "ix": "3-169_v2_10@2",
            "content": "Before FACS, for some experiments, CD4 + cells were enriched using biotinylated mAbs against CD4, streptavidin-conjugated microbeads and an AutoMACS (Miltenyi Biotec).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_10",
            "start": 508,
            "end": 674,
            "label": {}
        },
        {
            "ix": "3-169_v2_10@3",
            "content": "Intracellular ROR-γt expression was analyzed using the Foxp3 staining buffer set (eBioscience) and an anti-ROR-γt mAb (Monoclonal Rat IgG, AFKJS-9, eBioscience, Cat. No. 12-6988).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_10",
            "start": 676,
            "end": 854,
            "label": {}
        },
        {
            "ix": "3-169_v2_10@4",
            "content": "Intracellular cytokine staining was performed using the Cytofix/Cytoperm kit and mAbs to IL-17 (Monoclonal Rat IgG, TC11-18H10.1, eBioscience, Cat. No. 51-7172-80) and IFN-γ (Monoclonal Rat IgG, XMG1.2, BD Biosciences, Cat. No. 554412).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_10",
            "start": 856,
            "end": 1091,
            "label": {}
        },
        {
            "ix": "3-169_v2_10@5",
            "content": "Samples were analyzed on a FACSCalibur or sorted using a FACSAria II or III (BD Biosciences).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_10",
            "start": 1093,
            "end": 1185,
            "label": {}
        },
        {
            "ix": "3-169_v2_10@6",
            "content": "Data were analyzed using FlowJo software (Tree Star, Inc.).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_10",
            "start": 1187,
            "end": 1245,
            "label": {}
        },
        {
            "ix": "3-169_v2_11@0",
            "content": "T cell culture and adoptive T cell transfer",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_11",
            "start": 0,
            "end": 42,
            "label": {}
        },
        {
            "ix": "3-169_v2_12@0",
            "content": "T cells were cultured in IMDM medium, supplemented with 10% FCS (v/v), 1 mM sodium pyruvate, 1 mM HEPES, 2 mM Glutamax, 100 U/ml Penicillin-Streptomycin, 0.1 mg/ml Gentamicin, 0.1 mM non-essential amino acids, and 0.55 mM β-mercaptoethanol (all Invitrogen), at 37°C and 5% CO 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_12",
            "start": 0,
            "end": 278,
            "label": {}
        },
        {
            "ix": "3-169_v2_12@1",
            "content": "For Th17 differentiation in vitro , FACS-purified naïve CD4 + T cells (CD4 + CD62L high CD25 − Foxp3 GFP− ) were cultured for one week in 24-well plates (0,5 × 10 6 cells/ml) together with 20 Gy irradiated T cell-depleted C57BL/6 splenocytes at a 1:5 ratio, in the presence of soluble anti-CD3ε (2 μg/ml, Monoclonal Armenian Hamster IgG, 145-2C11, BD Biosciences, Cat. No. 550275), recombinant human TGF-β1 (1 ng/ml), murine IL-6 (50 ng/ml) (PeproTech), and neutralizing mAbs to IL-4 (10 μg/ml, Monoclonal Rat IgG, 11B11, eBioscience, Cat. No. 14-7041) and IFN-γ (10 μg/ml, Monoclonal Rat IgG, XMG1.2, eBioscience, Cat. No. 16-7311).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_12",
            "start": 280,
            "end": 912,
            "label": {}
        },
        {
            "ix": "3-169_v2_12@2",
            "content": "After 2–3 days, cultures were supplemented with fresh cytokines.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_12",
            "start": 914,
            "end": 977,
            "label": {}
        },
        {
            "ix": "3-169_v2_12@3",
            "content": "Murine IL-23 (10 ng/ml; R&D Systems) was added on day 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_12",
            "start": 979,
            "end": 1034,
            "label": {}
        },
        {
            "ix": "3-169_v2_12@4",
            "content": "Prior to flow cytometry of cytokine expression, Th17 differentiation cultures were briefly (4 h) restimulated on day 7 with 50 ng/ml Phorbol 12-myristate 13-acetate (PMA; Sigma-Aldrich) and 200 ng/ml Ionomycin (Iono; Calbiochem), in the presence of 10 μg/ml brefeldin A (BFA; Sigma-Aldrich).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_12",
            "start": 1036,
            "end": 1326,
            "label": {}
        },
        {
            "ix": "3-169_v2_12@5",
            "content": "On day 7 of Th17 differentiation cultures, 4 × 10 6 cells/200 μl PBS were injected i.v. into six-week-old TCRα −/− recipients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_12",
            "start": 1328,
            "end": 1453,
            "label": {}
        },
        {
            "ix": "3-169_v2_12@6",
            "content": "Control mice received PBS only.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_12",
            "start": 1455,
            "end": 1485,
            "label": {}
        },
        {
            "ix": "3-169_v2_12@7",
            "content": "Adoptively transferred CD4 + T cells were tracked by flow cytometry after 2 weeks in the peripheral blood of recipients, as indicated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_12",
            "start": 1487,
            "end": 1620,
            "label": {}
        },
        {
            "ix": "3-169_v2_13@0",
            "content": "BrdU administration and immunohistochemistry",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_13",
            "start": 0,
            "end": 43,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@0",
            "content": "Eight-week-old mice received 3 consecutive i.p. injections of BrdU (50 mg/kg body weight in 100 μl NaCl; Sigma-Aldrich) at intervals of 6 hours.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 0,
            "end": 143,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@1",
            "content": "Twenty-four hours after the first injection, mice were killed with an overdose of anesthetics and perfused transcardially, first with ice-cold saline and then with 4% paraformaldehyde (Sigma-Aldrich).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 145,
            "end": 344,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@2",
            "content": "The brains were removed from the skull, postfixed overnight, washed with PBS and cryoprotected for ≥ 3 days in a 30% sucrose solution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 346,
            "end": 479,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@3",
            "content": "Free-floating, 40 μm coronal sections were obtained on a freezing microtome (Leica SM2010R) and stored at 4°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 481,
            "end": 590,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@4",
            "content": "Immunohistochemistry was performed on 1-in-6 series of free-floating sections of each brain as previously described <REF-35> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 592,
            "end": 717,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@5",
            "content": "To visualize the immune reaction we used the peroxidase method (ABC-Elite; Vector Laboratories) with biotinylated anti-rat and anti-rabbit antibodies (Jackson ImmunoResearch) and nickel-intensified diaminobenzidine (DAB; Sigma-Aldrich) as chromogen.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 719,
            "end": 967,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@6",
            "content": "Primary antibodies were rat anti-BrdU (Monoclonal Rat IgG, BU1/75 (ICR1), AbD Serotec, Cat.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 969,
            "end": 1059,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@7",
            "content": "No. MCA2060) or polyclonal rabbit anti-CD3 (Abcam, Anti-CD3 antibody, ab 5690).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 1061,
            "end": 1139,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@8",
            "content": "Sections were mounted on gelatine-coated slides, air-dried, incubated in Neoclear (Merck) for 90 min and coverslipped.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 1141,
            "end": 1258,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@9",
            "content": "BrdU + cells in the granule cell layers and within two cell diameters below in the subgranular zone of the dentate gyrus on both sides were counted exhaustively throughout the rostro-caudal extension of the dentate gyrus by an observer blind to the treatment conditions on a light microscope (Leica DM750, 40x objective).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 1260,
            "end": 1580,
            "label": {}
        },
        {
            "ix": "3-169_v2_14@10",
            "content": "Numbers of BrdU + cells in the selected coronal sections of each brain were multiplied by 6 as an estimate of total BrdU + cell numbers in both dentate gyri.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_14",
            "start": 1582,
            "end": 1738,
            "label": {}
        },
        {
            "ix": "3-169_v2_15@0",
            "content": "Dentate gyrus microdissection and neural precursor cell culture",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_15",
            "start": 0,
            "end": 62,
            "label": {}
        },
        {
            "ix": "3-169_v2_16@0",
            "content": "For RNA isolation, dentate gyri of seven- to eight-week-old Nestin GFP mice were dissected as described before <REF-36> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_16",
            "start": 0,
            "end": 120,
            "label": {}
        },
        {
            "ix": "3-169_v2_16@1",
            "content": "For hippocampal precursor cell cultures from microdissected dentate gyri of adult seven- to eight-week-old C57BL/6 mice, tissue dissection, digestion and cell enrichment were performed as previously described <REF-37> , <REF-38> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_16",
            "start": 122,
            "end": 351,
            "label": {}
        },
        {
            "ix": "3-169_v2_16@2",
            "content": "After enrichment, 1 × 10 4 cells/cm 2 were cultured in poly-D-lysine- and laminin-coated (Sigma-Aldrich and Roche, respectively) T25 cell culture flasks (TPP) in proliferation medium, consisting of Neurobasal Medium supplemented with B27, Glutamax and 50 U/ml Penicillin-Streptomycin (all Invitrogen), as well as 20 ng/ml human Fibroblast Growth Factor-basic (FGF-2) and 20 ng/ml human Epidermal Growth Factor (EGF; both PeproTech).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_16",
            "start": 353,
            "end": 784,
            "label": {}
        },
        {
            "ix": "3-169_v2_16@3",
            "content": "Every other day, 75% of the medium was replaced by fresh medium.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_16",
            "start": 786,
            "end": 849,
            "label": {}
        },
        {
            "ix": "3-169_v2_16@4",
            "content": "Cells were passaged, when 80% of confluence was reached.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_16",
            "start": 851,
            "end": 906,
            "label": {}
        },
        {
            "ix": "3-169_v2_17@0",
            "content": "RNA isolation and RT-PCR",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_17",
            "start": 0,
            "end": 23,
            "label": {}
        },
        {
            "ix": "3-169_v2_18@0",
            "content": "For mRNA expression analysis of cells from microdissected dentate gyri, the tissue was passed several times through a 25-gauge needle in RLT buffer (QIAGEN) supplemented with 1% β-Mercaptoethanol (Bio-Rad).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_18",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "3-169_v2_18@1",
            "content": "For mRNA expression analysis of isolated neural precursor cells, cultured cells were detached from the flask surface with Accutase (PAA) and washed with PBS prior to lysis in RLT buffer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_18",
            "start": 207,
            "end": 392,
            "label": {}
        },
        {
            "ix": "3-169_v2_18@2",
            "content": "Total RNA was extracted using the RNeasy Mini kit according to the manufacturer’s protocol (Qiagen), including on-column DNase I digestion to minimize genomic DNA contaminations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_18",
            "start": 394,
            "end": 571,
            "label": {}
        },
        {
            "ix": "3-169_v2_18@3",
            "content": "For real-time RT-PCR, cDNA was synthesized using SuperScript II reverse transcriptase (Invitrogen).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_18",
            "start": 573,
            "end": 671,
            "label": {}
        },
        {
            "ix": "3-169_v2_18@4",
            "content": "cDNA was analyzed in duplicates using a Mastercycler ep realplex thermal cycler (Eppendorf), the QuantiFast SYBR Green PCR kit (Qiagen), and primers listed in Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_18",
            "start": 673,
            "end": 839,
            "label": {}
        },
        {
            "ix": "3-169_v2_18@5",
            "content": "With the exception of GAPDH <REF-39> , primers were designed using NCBIPrimer-BLAST ( http://www.ncbi.nlm.nih.gov/tools/primer-blast/ ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_18",
            "start": 841,
            "end": 976,
            "label": {}
        },
        {
            "ix": "3-169_v2_18@6",
            "content": "Relative mRNA expression was calculated using the ΔCt method and GAPDH as housekeeping gene.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_18",
            "start": 978,
            "end": 1069,
            "label": {}
        },
        {
            "ix": "3-169_v2_18@7",
            "content": "Only mRNAs with an expression below ΔCt = 15 were considered to be expressed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_18",
            "start": 1071,
            "end": 1147,
            "label": {}
        },
        {
            "ix": "3-169_v2_18@8",
            "content": "PCR specificity was confirmed employing melting curve analysis and gel-electrophoresis of PCR products.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_18",
            "start": 1149,
            "end": 1251,
            "label": {}
        },
        {
            "ix": "3-169_v2_19@0",
            "content": "Statistical analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_19",
            "start": 0,
            "end": 19,
            "label": {}
        },
        {
            "ix": "3-169_v2_20@0",
            "content": "Statistical analysis was performed with GraphPad Prism 5 software and the GraphPad web calculator ( http://www.graphpad.com/quickcalcs/ ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_20",
            "start": 0,
            "end": 137,
            "label": {}
        },
        {
            "ix": "3-169_v2_20@1",
            "content": "A two-tailed unpaired Student’s t-test was used for analysis of the experiments shown in Figure 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_20",
            "start": 139,
            "end": 237,
            "label": {}
        },
        {
            "ix": "3-169_v2_20@2",
            "content": "Data from the experiments shown in Figure 1 were analyzed with ANOVA followed by Dunnett’s Multiple Comparison Test.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_20",
            "start": 239,
            "end": 354,
            "label": {}
        },
        {
            "ix": "3-169_v2_20@3",
            "content": "Differences were considered statistically significant at p < 0.05.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_20",
            "start": 356,
            "end": 421,
            "label": {}
        },
        {
            "ix": "3-169_v2_21@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_21",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-169_v2_23@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_23",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-169_v2_25@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_25",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "3-169_v2_27@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_27",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-169_v2_29@0",
            "content": "Impaired base-line proliferation of hippocampal precursor cells in adult TCRα –/– mice",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_29",
            "start": 0,
            "end": 85,
            "label": {}
        },
        {
            "ix": "3-169_v2_30@0",
            "content": "We first assessed steady-state levels of cell proliferation in the hippocampal dentate gyrus of adult, 8-week-old TCRα –/– mice, which are characterized by a complete lack of αβ T cells (both CD4 + and CD8 + ) due to targeted deletion of the gene encoding the TCRα subunit (TCRα –/– ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_30",
            "start": 0,
            "end": 284,
            "label": {}
        },
        {
            "ix": "3-169_v2_30@1",
            "content": "For in vivo labeling of dividing cells, TCRα –/– mice received three consecutive i.p. injections of the thymidine analog bromodeoxyuridine (BrdU) at intervals of six hours.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_30",
            "start": 286,
            "end": 457,
            "label": {}
        },
        {
            "ix": "3-169_v2_30@2",
            "content": "In these experiments, age-matched cohorts of fully immunocompetent TCRα +/– and C57BL/6 wild-type mice were included for comparison.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_30",
            "start": 459,
            "end": 590,
            "label": {}
        },
        {
            "ix": "3-169_v2_30@3",
            "content": "Twenty-four hours after the first BrdU injection, experimental mice were subjected to immunohistochemical quantification of BrdU + cells in the dentate gyrus ( Figure 1A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_30",
            "start": 592,
            "end": 763,
            "label": {}
        },
        {
            "ix": "3-169_v2_30@4",
            "content": "Consistent with a published study in TCRα –/– mice based on endogenous Ki67 expression as proliferation marker <REF-7> , we found that TCRα –/– mice (10205 ± 492 BrdU + cells, n = 8) exhibited significantly reduced levels of proliferation compared to C57BL/6 wild-type mice (11843 ± 556, n = 6; ANOVA, F (2, 18) = 3.698, p < 0.05; Figure 1B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_30",
            "start": 765,
            "end": 1107,
            "label": {}
        },
        {
            "ix": "3-169_v2_30@5",
            "content": "TCRα +/– mice (11469 ± 273, n = 7) ranged between controls and knockouts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_30",
            "start": 1109,
            "end": 1181,
            "label": {}
        },
        {
            "ix": "3-169_v2_30@6",
            "content": "Overall, these results are in agreement with our previous observation that CD4 + T cells provide a neuro-immunological link in the base-line regulation of hippocampal precursor cell activity <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_30",
            "start": 1183,
            "end": 1382,
            "label": {}
        },
        {
            "ix": "3-169_v2_31@0",
            "content": "Th17 cell-mediated restoration of proliferation in adult TCRα –/– mice",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_31",
            "start": 0,
            "end": 69,
            "label": {}
        },
        {
            "ix": "3-169_v2_32@0",
            "content": "To assess the impact of myelin-reactive Th17 cells on proliferation in vivo , we employed adoptive T cell transfers using six-week-old mice and quantified BrdU + cells in the hippocampus of TCRα -/- recipients two weeks later.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_32",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "3-169_v2_32@1",
            "content": "For the generation of Th17 cells, naïve CD4 + T cells (CD4 + CD62L high CD25 − Foxp3 GFP− ) carrying the MOG 35-55 -specific 2D2 TCR as a transgene were FACS-purified from peripheral lymphoid tissues of four- to six-week-old 2D2 × Foxp3 GFP mice ( Figure 2A ) and cultured under T cell stimulatory conditions that promote efficient differentiation into Th17 cells with a ROR-γt + IL-17 + phenotype ( Figure 2B and C ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_32",
            "start": 227,
            "end": 644,
            "label": {}
        },
        {
            "ix": "3-169_v2_32@2",
            "content": "As expected based on previous observations with differentiated Th17 cells in vitro , these cultures exhibited limited IFN-γ production ( Figure 2C ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_32",
            "start": 646,
            "end": 794,
            "label": {}
        },
        {
            "ix": "3-169_v2_33@0",
            "content": "On day 7 of Th17 differentiation cultures, 4 × 10 6 total cells were injected i.v. into adult, age-matched cohorts of TCRα –/– mice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_33",
            "start": 0,
            "end": 131,
            "label": {}
        },
        {
            "ix": "3-169_v2_33@1",
            "content": "TCRα –/– mice that received PBS only were included as controls.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_33",
            "start": 133,
            "end": 195,
            "label": {}
        },
        {
            "ix": "3-169_v2_33@2",
            "content": "Two weeks later, small populations of adoptively transferred CD4 + T cells could be detected in the peripheral blood of recipient mice ( Figure 2D ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_33",
            "start": 197,
            "end": 345,
            "label": {}
        },
        {
            "ix": "3-169_v2_33@3",
            "content": "In these experiments, significant proportions of CD4 + Th17 cells expressed the MOG 35-55 -specific 2D2 TCR transgene (ranging from 15.6 % to 56.1%), as judged by flow cytometry of the TCRα subunit of the transgenic 2D2 TCR, employing anti-Vα3.2 mAbs ( Figure 2D ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_33",
            "start": 347,
            "end": 611,
            "label": {}
        },
        {
            "ix": "3-169_v2_33@4",
            "content": "Importantly, throughout the observation period, TCRα –/– recipients of in vitro generated Th17 cells appeared phenotypically healthy and exhibited no clinical symptoms of EAE.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_33",
            "start": 613,
            "end": 787,
            "label": {}
        },
        {
            "ix": "3-169_v2_33@5",
            "content": "Consistently, immunohistochemistry for the pan-T cell marker CD3 revealed that infiltrating Th17 cells in the dentate gyrus were below the detection level in all mice analyzed ( Figure 2E and F ), with the exception of an individual recipient with immune cell infiltrates, including some CD3 + T cells ( Figure 2E2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_33",
            "start": 789,
            "end": 1105,
            "label": {}
        },
        {
            "ix": "3-169_v2_34@0",
            "content": "Two weeks after adoptive T cell transfer, cell proliferation in the dentate gyrus of TCRα –/– recipients was assessed by immunohistochemical quantification of BrdU + cells, as described above.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_34",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "3-169_v2_34@1",
            "content": "After applying Grubbs’ outlier test, one animal in the control group with exceptionally high numbers of BrdU-positive cells was excluded from further analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_34",
            "start": 193,
            "end": 351,
            "label": {}
        },
        {
            "ix": "3-169_v2_34@2",
            "content": "The results showed that TCRα –/– recipients of Th17 cells exhibit significantly increased numbers of BrdU + cells in the hippocampal dentate gyrus (11758 ± 347, n =7), as compared to control-injected TCRα –/– mice (10602 ± 214, n = 7; t-test, p < 0.05; Figure 2G and H ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_34",
            "start": 353,
            "end": 623,
            "label": {}
        },
        {
            "ix": "3-169_v2_34@3",
            "content": "Thus, populations of Th17 cells enriched for myelin-reactive TCRs appear sufficient to restore impaired base-line proliferation of hippocampal precursor cells in adult TCRα –/– recipient mice, in the absence of T cell infiltration and direct interaction with neural precursor cells or cellular components of the hippocampal neurogenic niche such as microglia.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_34",
            "start": 625,
            "end": 983,
            "label": {}
        },
        {
            "ix": "3-169_v2_34@4",
            "content": "Consistently, the enhanced proliferative activity of precursor cells did not correlate with the proportion of Vα3.2 + Th17 cells that accumulated in recipient mice (Pearson’s r = –0.28, p = 0.538, 95% CI –0.85 to 0.60, n = 7; Figure 2I ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_34",
            "start": 985,
            "end": 1222,
            "label": {}
        },
        {
            "ix": "3-169_v2_35@0",
            "content": "Cytokine receptor expression in the neurogenic niche of immunocompetent mice",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_35",
            "start": 0,
            "end": 75,
            "label": {}
        },
        {
            "ix": "3-169_v2_36@0",
            "content": "Besides the signature cytokines IL-17A and IL-17F, ROR-γt + Th17 cells have been reported to produce a variety of cytokines such as TNF-α, IFN-γ, IL-9, IL-10, IL-21 and IL-22.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_36",
            "start": 0,
            "end": 174,
            "label": {}
        },
        {
            "ix": "3-169_v2_36@1",
            "content": "In a first attempt to provide insight into possible mechanisms underlying the enhancement of hippocampal precursor cell proliferation by Th17 cell-secreted cytokines, we assessed expression levels of mRNAs encoding relevant cytokine receptors in the neurogenic niche.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_36",
            "start": 176,
            "end": 442,
            "label": {}
        },
        {
            "ix": "3-169_v2_36@2",
            "content": "To this end, we performed quantitative RT-PCR analysis of freshly microdissected dentate gyrus as well as isolated precursor cells from the dentate gyrus of adult, immunocompetent C57BL/6 mice ( Figure 3 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_36",
            "start": 444,
            "end": 649,
            "label": {}
        },
        {
            "ix": "3-169_v2_37@0",
            "content": "This approach identified several subunits of receptors for Th17-derived cytokines with detectable mRNA expression levels in both total dentate gyrus tissue and isolated precursor cells ( Figure 3A and B ), namely IL-17 receptor C (IL-17RC), tumor necrosis factor R1 (TNFR1), interferon-gamma R1 (IFN-γR1) as well as IL-10R beta (IL-10Rβ), a common subunit involved in the formation of the receptors for IL-10 and IL-22 <REF-40> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_37",
            "start": 0,
            "end": 428,
            "label": {}
        },
        {
            "ix": "3-169_v2_37@1",
            "content": "Next, we extended our analysis to the type I cytokine receptor family (glycoprotein 130: gp130, CD130; common γ subunit: γc, CD132; common β subunit: βc, CD131), which is involved in the formation of more than 20 different cytokine receptors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_37",
            "start": 430,
            "end": 671,
            "label": {}
        },
        {
            "ix": "3-169_v2_37@2",
            "content": "In these experiments, mRNA expression of all three receptor family members (gp130, βc, γc) could be detected in total dentate gyrus tissue ( Figure 3A and B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_37",
            "start": 673,
            "end": 831,
            "label": {}
        },
        {
            "ix": "3-169_v2_37@3",
            "content": "Furthermore, mRNA encoding gp130, a subunit shared between the receptors for cytokines such as IL-6, leukemia inhibitory factor (LIF) and ciliary neurotrophic factor (CNTF), was also expressed in isolated neural precursor cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_37",
            "start": 833,
            "end": 1060,
            "label": {}
        },
        {
            "ix": "3-169_v2_37@4",
            "content": "Interestingly, IL-6, LIF and CNTF directly affect the differentiation of adult hippocampal precursor cells in vitro <REF-41> – <REF-44> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_37",
            "start": 1062,
            "end": 1198,
            "label": {}
        },
        {
            "ix": "3-169_v2_38@0",
            "content": "Cytokine receptor subunits with detectable mRNA expression levels in microdissected total tissue but not in isolated precursor cells from the dentate gyrus included transforming growth factor beta receptor 1 and 2 (TGF-βR1 and TGF-βR2), IL-2R alpha and beta (IL-2Rα and IL-2Rβ), IL-4Rα, IL-10Rα, IL-13Rα1, IL-21R, IL-22Rα1 and granulocyte-macrophage colony stimulating factor receptor alpha (GM-CSFRα).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_38",
            "start": 0,
            "end": 401,
            "label": {}
        },
        {
            "ix": "3-169_v2_38@1",
            "content": "Among these the ΔCt-values for IL-2Rα (ΔCt = 17,86), IL-2Rβ (ΔCt = 16.75), IL-22Rα1 (ΔCt = 18.78) and GM-CSFRα (ΔCt = 19.22) were found to be below the chosen cut-off (ΔCt < 15).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_38",
            "start": 403,
            "end": 580,
            "label": {}
        },
        {
            "ix": "3-169_v2_38@2",
            "content": "Nevertheless, in all of these cases a specific product could be detected by gel electrophoresis of RT-PCR samples ( Figure 3A) .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_38",
            "start": 582,
            "end": 709,
            "label": {}
        },
        {
            "ix": "3-169_v2_38@3",
            "content": "Additionally, and in contrast to previous reports on IL-6Rα mRNA expression in dentate gyrus-derived precursor cells <REF-42> , we found IL-6Rα mRNA to be expressed in whole dentate gyrus but not in isolated neural precursor cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_38",
            "start": 711,
            "end": 941,
            "label": {}
        },
        {
            "ix": "3-169_v2_38@4",
            "content": "The underlying reason for this apparent discrepancy between studies remains to be determined, but may include methodological differences in the preparation and/or purity of isolated precursor cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_38",
            "start": 943,
            "end": 1140,
            "label": {}
        },
        {
            "ix": "3-169_v2_38@5",
            "content": "Lastly, among the cytokine receptor subunits whose expression was analyzed in the present study, we failed to detect mRNA expression for IL-5R alpha (IL-5Rα) in both microdissected tissue and isolated precursor cells ( Figure 3A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_38",
            "start": 1142,
            "end": 1372,
            "label": {}
        },
        {
            "ix": "3-169_v2_39@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_39",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "3-169_v2_40@0",
            "content": "Previous studies on mice with transgenic expression of a myelin-specific TCR on CD4 + T cells <REF-5> and a non-TCR transgenic mouse model of MOG-inducible EAE <REF-9> have provided the first evidence that encephalitogenic CD4 + T cell activity can promote hippocampal precursor cell proliferation and adult neurogenesis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_40",
            "start": 0,
            "end": 320,
            "label": {}
        },
        {
            "ix": "3-169_v2_40@1",
            "content": "Here, we have extended these observations and show that, in the absence of autoimmune neuroinflammation, small numbers of myelin-reactive CD4 + T cells with a ROR-γt + IL-17 + phenotype are sufficient to restore base-line proliferation of hippocampal precursor cells in TCRα –/– mice that lack endogenous αβ T cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_40",
            "start": 322,
            "end": 637,
            "label": {}
        },
        {
            "ix": "3-169_v2_41@0",
            "content": "Mechanistically, and consistent with the proneurogenic activity of non-infiltrating CD4 + T cells with a polyclonal TCR repertoire <REF-6> , <REF-7> , the overall absence of immune cell infiltrations in our Th17 adoptive transfer model emphasizes that direct cell-cell interaction is not a prerequisite of enhanced Th17-mediated hippocampal precursor cell proliferation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_41",
            "start": 0,
            "end": 369,
            "label": {}
        },
        {
            "ix": "3-169_v2_41@1",
            "content": "Alternatively, Th17 cells residing in peripheral lymphoid tissues outside the brain may secrete cytokines that are actively transported across the blood-brain barrier <REF-45> , <REF-46> and act on the hippocampal neurogenic niche to promote precursor cell proliferation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_41",
            "start": 371,
            "end": 641,
            "label": {}
        },
        {
            "ix": "3-169_v2_41@2",
            "content": "Indeed, it is becoming increasingly clear that the impact of inflammatory cytokines on hippocampal neurogenesis appears much more context-dependent than anticipated based on previous studies highlighting overall detrimental effects <REF-3> , <REF-4> , <REF-47> – <REF-49> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_41",
            "start": 643,
            "end": 915,
            "label": {}
        },
        {
            "ix": "3-169_v2_41@3",
            "content": "Factors that influence the impact of inflammatory cytokines on neurogenesis include the administration route and local cytokine concentrations, the strength and duration of enhanced cytokine receptor signalling as well as the target cell within the neurogenic niche.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_41",
            "start": 917,
            "end": 1182,
            "label": {}
        },
        {
            "ix": "3-169_v2_41@4",
            "content": "While the present study suggests that several receptors for Th17 cell-derived cytokines (TNF-α, IFN-γ, IL-17, IL-22) are expressed on hippocampal precursor cells as well as neighbouring cells in the dentate gyrus, it will be important to investigate whether the pattern of expressed cytokine receptors observed in mice under physiological baseline conditions is subject to differential regulation in response to intrinsic or extrinsic stimuli.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_41",
            "start": 1184,
            "end": 1626,
            "label": {}
        },
        {
            "ix": "3-169_v2_41@5",
            "content": "Another important, unresolved question is whether the proneurogenic effect of Th17 cells can be attributed to an individual inflammatory cytokine or is rather mediated by the combined action of different Th17-cell derived factors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_41",
            "start": 1628,
            "end": 1857,
            "label": {}
        },
        {
            "ix": "3-169_v2_42@0",
            "content": "At present, cytokines with reported proneurogenic potential in hippocampal neurogenesis include IFN-γ <REF-50> , <REF-51> , TNF-α <REF-52> , <REF-53> , TGF-β <REF-54> , CNTF <REF-44> as well as IL-1β and IL-6 <REF-42> , <REF-55> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_42",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "3-169_v2_42@1",
            "content": "Interestingly, the Th17 signature cytokine IL-17 has recently been found to increase neurite outgrowth from adult postganglionic sympathetic neurons, a process that required NFkB activation <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_42",
            "start": 231,
            "end": 430,
            "label": {}
        },
        {
            "ix": "3-169_v2_42@2",
            "content": "Importantly, the NFkB pathway, which is shared between many cytokine receptor signaling pathways, has previously been implicated in the regulation of neural precursor cell proliferation and differentiation <REF-56> , <REF-57> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_42",
            "start": 432,
            "end": 658,
            "label": {}
        },
        {
            "ix": "3-169_v2_42@3",
            "content": "Clearly, future studies are warranted to directly address a putative role of IL-17 and the NFkB pathway in hippocampal proliferation and neurogenesis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_42",
            "start": 660,
            "end": 809,
            "label": {}
        },
        {
            "ix": "3-169_v2_43@0",
            "content": "In summary, the present study exemplifies that the TCRα –/– mouse represents a suitable experimental model to assess the proneurogenic potential of homogeneous Th cell populations that had been generated under well-defined in vitro conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_43",
            "start": 0,
            "end": 242,
            "label": {}
        },
        {
            "ix": "3-169_v2_43@1",
            "content": "This is likely to facilitate mechanistic studies on the relative contribution of various CD4 + Th cell subsets (Th1, Th2, Th17 etc.) to the regulation of adult hippocampal neurogenesis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_43",
            "start": 244,
            "end": 428,
            "label": {}
        },
        {
            "ix": "3-169_v2_44@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_44",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "3-169_v2_45@0",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2017 Niebling J et al.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_45",
            "start": 0,
            "end": 132,
            "label": {}
        },
        {
            "ix": "3-169_v2_46@0",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_46",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "3-169_v2_47@0",
            "content": "F1000Research: Dataset 1. Hippocampal neurogenesis data in T helper 17 cell-deficient and control mice , http://dx.doi.org/10.5256/f1000research.4439.d157588 <REF-58>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_47",
            "start": 0,
            "end": 165,
            "label": {}
        },
        {
            "ix": "3-169_v2_48@0",
            "content": "<REF-1> Römer B Krebs J Overall RW : Adult hippocampal neurogenesis and plasticity in the infrapyramidal bundle of the mossy fiber projection: I. Co-regulation by activity. Front Neurosci. 2011 ; 5 : 107 . 21991243 10.3389/fnins.2011.00107 3180604",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_48",
            "start": 0,
            "end": 246,
            "label": {}
        },
        {
            "ix": "3-169_v2_49@0",
            "content": "<REF-2> Krebs J Römer B Overall RW : Adult Hippocampal Neurogenesis and Plasticity in the Infrapyramidal Bundle of the Mossy Fiber Projection: II. Genetic Covariation and Identification of Nos1 as Linking Candidate Gene. Front Neurosci. 2011 ; 5 : 106 . 21960957 10.3389/fnins.2011.00106 3177083",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_49",
            "start": 0,
            "end": 294,
            "label": {}
        },
        {
            "ix": "3-169_v2_50@0",
            "content": "<REF-3> Monje ML Toda H Palmer TD : Inflammatory blockade restores adult hippocampal neurogenesis. Science. 2003 ; 302 ( 5651 ): 1760 – 5 . 14615545 10.1126/science.1088417",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_50",
            "start": 0,
            "end": 171,
            "label": {}
        },
        {
            "ix": "3-169_v2_51@0",
            "content": "<REF-4> Ekdahl CT Claasen JH Bonde S : Inflammation is detrimental for neurogenesis in adult brain. Proc Natl Acad Sci U S A. 2003 ; 100 ( 23 ): 13632 – 7 . 14581618 10.1073/pnas.2234031100 263865",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_51",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "3-169_v2_52@0",
            "content": "<REF-5> Ziv Y Ron N Butovsky O : Immune cells contribute to the maintenance of neurogenesis and spatial learning abilities in adulthood. Nat Neurosci. 2006 ; 9 ( 2 ): 268 – 75 . 16415867 10.1038/nn1629",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_52",
            "start": 0,
            "end": 200,
            "label": {}
        },
        {
            "ix": "3-169_v2_53@0",
            "content": "<REF-6> Wolf SA Steiner B Akpinarli A : CD4-positive T lymphocytes provide a neuroimmunological link in the control of adult hippocampal neurogenesis. J Immunol. 2009 ; 182 ( 7 ): 3979 – 84 . 19299695 10.4049/jimmunol.0801218",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_53",
            "start": 0,
            "end": 224,
            "label": {}
        },
        {
            "ix": "3-169_v2_54@0",
            "content": "<REF-7> Huang GJ Smith AL Gray DH : A genetic and functional relationship between T cells and cellular proliferation in the adult hippocampus. PLoS Biol. 2010 ; 8 ( 12 ): e1000561 . 21179499 10.1371/journal.pbio.1000561 3001898",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_54",
            "start": 0,
            "end": 226,
            "label": {}
        },
        {
            "ix": "3-169_v2_55@0",
            "content": "<REF-8> Ziv Y Schwartz M : Immune-based regulation of adult neurogenesis: implications for learning and memory. Brain Behav Immun. 2008 ; 22 ( 2 ): 167 – 76 . 17905567 10.1016/j.bbi.2007.08.006",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_55",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "3-169_v2_56@0",
            "content": "<REF-9> Huehnchen P Prozorovski T Klaissle P : Modulation of adult hippocampal neurogenesis during myelin-directed autoimmune neuroinflammation. Glia. 2011 ; 59 ( 1 ): 132 – 42 . 20967885 10.1002/glia.21082",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_56",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "3-169_v2_57@0",
            "content": "<REF-10> Mosmann TR Coffman RL : TH1 and TH2 cells: different patterns of lymphokine secretion lead to different functional properties. Annu Rev Immunol. 1989 ; 7 : 145 – 73 . 2523712 10.1146/annurev.immunol.7.1.145",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_57",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "3-169_v2_58@0",
            "content": "<REF-12> Harrington LE Hatton RD Mangan PR : Interleukin 17-producing CD4 + effector T cells develop via a lineage distinct from the T helper type 1 and 2 lineages. Nat Immunol. 2005 ; 6 ( 11 ): 1123 – 32 . 16200070 10.1038/ni1254",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_58",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "3-169_v2_59@0",
            "content": "<REF-13> Basu R Hatton RD Weaver CT : The Th17 family: flexibility follows function. Immunol Rev. 2013 ; 252 ( 1 ): 89 – 103 . 23405897 10.1111/imr.12035 3607325",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_59",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "3-169_v2_60@0",
            "content": "<REF-14> Huber S Gagliani N Flavell RA : Life, death, and miracles: Th17 cells in the intestine. Eur J Immunol. 2012 ; 42 ( 9 ): 2238 – 45 . 22949322 10.1002/eji.201242619",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_60",
            "start": 0,
            "end": 170,
            "label": {}
        },
        {
            "ix": "3-169_v2_61@0",
            "content": "<REF-15> Korn T Bettelli E Oukka M : IL-17 and Th17 Cells. Annu Rev Immunol. 2009 ; 27 : 485 – 517 . 19132915 10.1146/annurev.immunol.021908.132710",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_61",
            "start": 0,
            "end": 146,
            "label": {}
        },
        {
            "ix": "3-169_v2_62@0",
            "content": "<REF-16> Miossec P Korn T Kuchroo VK : Interleukin-17 and type 17 helper T cells. N Engl J Med. 2009 ; 361 ( 9 ): 888 – 98 . 19710487 10.1056/NEJMra0707449",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_62",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "3-169_v2_63@0",
            "content": "<REF-17> Wilson NJ Boniface K Chan JR : Development, cytokine profile and function of human interleukin 17-producing helper T cells. Nat Immunol. 2007 ; 8 ( 9 ): 950 – 7 . 17676044 10.1038/ni1497",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_63",
            "start": 0,
            "end": 194,
            "label": {}
        },
        {
            "ix": "3-169_v2_64@0",
            "content": "<REF-18> Bettelli E Oukka M Kuchroo VK : T H -17 cells in the circle of immunity and autoimmunity. Nat Immunol. 2007 ; 8 ( 4 ): 345 – 50 . 17375096 10.1038/ni0407-345",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_64",
            "start": 0,
            "end": 165,
            "label": {}
        },
        {
            "ix": "3-169_v2_65@0",
            "content": "<REF-23> Zepp J Wu L Li X : IL-17 receptor signaling and T helper 17-mediated autoimmune demyelinating disease. Trends Immunol. 2011 ; 32 ( 5 ): 232 – 9 . 21493143 10.1016/j.it.2011.02.007 3329781",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_65",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "3-169_v2_66@0",
            "content": "<REF-24> Sugimoto K Ogawa A Mizoguchi E : IL-22 ameliorates intestinal inflammation in a mouse model of ulcerative colitis. J Clin Invest. 2008 ; 118 ( 2 ): 534 – 44 . 18172556 2157567",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_66",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "3-169_v2_67@0",
            "content": "<REF-28> Chisholm SP Cervi AL Nagpal S : Interleukin-17A increases neurite outgrowth from adult postganglionic sympathetic neurons. J Neurosci. 2012 ; 32 ( 4 ): 1146 – 55 . 22279201 10.1523/JNEUROSCI.5343-11.2012",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_67",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "3-169_v2_68@0",
            "content": "<REF-29> McGee HM Schmidt BA Booth CJ : IL-22 promotes fibroblast-mediated wound repair in the skin. J Invest Dermatol. 2013 ; 133 ( 5 ): 1321 – 9 . 23223145 10.1038/jid.2012.463 3610794",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_68",
            "start": 0,
            "end": 185,
            "label": {}
        },
        {
            "ix": "3-169_v2_69@0",
            "content": "<REF-30> Eyerich S Eyerich K Cavani A : IL-17 and IL-22: siblings, not twins. Trends Immunol. 2010 ; 31 ( 9 ): 354 – 61 . 20691634 10.1016/j.it.2010.06.004",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_69",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "3-169_v2_70@0",
            "content": "<REF-31> Yamaguchi M Saito H Suzuki M : Visualization of neurogenesis in the central nervous system using nestin promoter-GFP transgenic mice. Neuroreport. 2000 ; 11 ( 9 ): 1991 – 6 . 10884058 10.1097/00001756-200006260-00037",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_70",
            "start": 0,
            "end": 224,
            "label": {}
        },
        {
            "ix": "3-169_v2_71@0",
            "content": "<REF-32> Mombaerts P Clarke AR Rudnicki MA : Mutations in T-cell antigen receptor genes alpha and beta block thymocyte development at different stages. Nature. 1992 ; 360 ( 6401 ): 225 – 31 . 1359428 10.1038/360225a0",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_71",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "3-169_v2_72@0",
            "content": "<REF-33> Bettelli E Pagany M Weiner HL : Myelin oligodendrocyte glycoprotein-specific T cell receptor transgenic mice develop spontaneous autoimmune optic neuritis. J Exp Med. 2003 ; 197 ( 9 ): 1073 – 81 . 12732654 10.1084/jem.20021603 2193967",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_72",
            "start": 0,
            "end": 242,
            "label": {}
        },
        {
            "ix": "3-169_v2_73@0",
            "content": "<REF-35> Kronenberg G Reuter K Steiner B : Subpopulations of proliferating cells of the adult hippocampus respond differently to physiologic neurogenic stimuli. J Comp Neurol. 2003 ; 467 ( 4 ): 455 – 63 . 14624480 10.1002/cne.10945",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_73",
            "start": 0,
            "end": 230,
            "label": {}
        },
        {
            "ix": "3-169_v2_74@0",
            "content": "<REF-36> Hagihara H Toyama K Yamasaki N : Dissection of hippocampal dentate gyrus from adult mouse. J Vis Exp. 2009 ; ( 33 ): 1 – 6 , pii: 1543. 19920804 10.3791/1543 3142893",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_74",
            "start": 0,
            "end": 173,
            "label": {}
        },
        {
            "ix": "3-169_v2_75@0",
            "content": "<REF-37> Babu H Cheung G Kettenmann H : Enriched monolayer precursor cell cultures from micro-dissected adult mouse dentate gyrus yield functional granule cell-like neurons. PLoS One. 2007 ; 2 ( 4 ): e388 . 17460755 10.1371/journal.pone.0000388 1849968",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_75",
            "start": 0,
            "end": 251,
            "label": {}
        },
        {
            "ix": "3-169_v2_76@0",
            "content": "<REF-38> Babu H Claasen JH Kannan S : A protocol for isolation and enriched monolayer cultivation of neural precursor cells from mouse dentate gyrus. Front Neurosci. 2011 ; 5 : 89 . 21811434 10.3389/fnins.2011.00089 3140691",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_76",
            "start": 0,
            "end": 222,
            "label": {}
        },
        {
            "ix": "3-169_v2_77@0",
            "content": "<REF-39> Lluís F Roma J Suelves M : Urokinase-dependent plasminogen activation is required for efficient skeletal muscle regeneration in vivo . Blood. 2001 ; 97 ( 6 ): 1703 – 11 . 11238111 10.1182/blood.V97.6.1703",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_77",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "3-169_v2_78@0",
            "content": "<REF-40> Ozaki K Leonard WJ : Cytokine and cytokine receptor pleiotropy and redundancy. J Biol Chem. 2002 ; 277 ( 33 ): 29355 – 8 . 12072446 10.1074/jbc.R200003200",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_78",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "3-169_v2_79@0",
            "content": "<REF-41> Nakanishi M Niidome T Matsuda S : Microglia-derived interleukin-6 and leukaemia inhibitory factor promote astrocytic differentiation of neural stem/progenitor cells. Eur J Neurosci. 2007 ; 25 ( 3 ): 649 – 58 . 17328769 10.1111/j.1460-9568.2007.05309.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_79",
            "start": 0,
            "end": 259,
            "label": {}
        },
        {
            "ix": "3-169_v2_80@0",
            "content": "<REF-42> Barkho BZ Song H Aimone JB : Identification of astrocyte-expressed factors that modulate neural stem/progenitor cell differentiation. Stem Cells Dev. 2006 ; 15 ( 3 ): 407 – 421 . 16846377 10.1089/scd.2006.15.407 2777811",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_80",
            "start": 0,
            "end": 227,
            "label": {}
        },
        {
            "ix": "3-169_v2_81@0",
            "content": "<REF-44> Müller S Chakrapani BP Schwegler H : Neurogenesis in the dentate gyrus depends on ciliary neurotrophic factor and signal transducer and activator of transcription 3 signaling. Stem Cells. 2009 ; 27 ( 2 ): 431 – 41 . 19023034 10.1634/stemcells.2008-0234",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_81",
            "start": 0,
            "end": 260,
            "label": {}
        },
        {
            "ix": "3-169_v2_82@0",
            "content": "<REF-45> Banks WA Farr SA Morley JE : Entry of blood-borne cytokines into the central nervous system: effects on cognitive processes. Neuroimmunomodulation. 2002–2003 ; 10 ( 6 ): 319 – 27 . 12907838 10.1159/000071472",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_82",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "3-169_v2_83@0",
            "content": "<REF-46> Banks WA Erickson MA : The blood-brain barrier and immune function and dysfunction. Neurobiol Dis. 2010 ; 37 ( 1 ): 26 – 32 . 19664708 10.1016/j.nbd.2009.07.031",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_83",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "3-169_v2_84@0",
            "content": "<REF-47> Kaneko N Kudo K Mabuchi T : Suppression of cell proliferation by interferon-alpha through interleukin-1 production in adult rat dentate gyrus. Neuropsychopharmacology. 2006 ; 31 ( 12 ): 2619 – 26 . 16823390 10.1038/sj.npp.1301137",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_84",
            "start": 0,
            "end": 237,
            "label": {}
        },
        {
            "ix": "3-169_v2_85@0",
            "content": "<REF-49> Vallières L Campbell IL Gage FH : Reduced hippocampal neurogenesis in adult transgenic mice with chronic astrocytic production of interleukin-6. J Neurosci. 2002 ; 22 ( 2 ): 486 – 92 . 11784794",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_85",
            "start": 0,
            "end": 201,
            "label": {}
        },
        {
            "ix": "3-169_v2_86@0",
            "content": "<REF-50> Baron R Nemirovsky A Harpaz I : IFN-gamma enhances neurogenesis in wild-type mice and in a mouse model of Alzheimer’s disease. FASEB J. 2008 ; 22 ( 8 ): 2843 – 52 . 18390924 10.1096/fj.08-105866",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_86",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "3-169_v2_87@0",
            "content": "<REF-51> Wong G Goldshmit Y Turnley AM : Interferon-gamma but not TNF alpha promotes neuronal differentiation and neurite outgrowth of murine adult neural stem cells. Exp Neurol. 2004 ; 187 ( 1 ): 171 – 7 . 15081598 10.1016/j.expneurol.2004.01.009",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_87",
            "start": 0,
            "end": 246,
            "label": {}
        },
        {
            "ix": "3-169_v2_88@0",
            "content": "<REF-52> Iosif RE Ekdahl CT Ahlenius H : Tumor necrosis factor receptor 1 is a negative regulator of progenitor proliferation in adult hippocampal neurogenesis. J Neurosci. 2006 ; 26 ( 38 ): 9703 – 12 . 16988041 10.1523/JNEUROSCI.2723-06.2006",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_88",
            "start": 0,
            "end": 241,
            "label": {}
        },
        {
            "ix": "3-169_v2_89@0",
            "content": "<REF-53> Chen Z Palmer TD : Differential roles of TNFR1 and TNFR2 signaling in adult hippocampal neurogenesis. Brain Behav Immun. 2013 ; 30 : 45 – 53 . 23402793 10.1016/j.bbi.2013.01.083 3641155",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_89",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "3-169_v2_90@0",
            "content": "<REF-54> Battista D Ferrari CC Gage FH : Neurogenic niche modulation by activated microglia: transforming growth factor beta increases neurogenesis in the adult dentate gyrus. Eur J Neurosci. 2006 ; 23 ( 1 ): 83 – 93 . 16420418 10.1111/j.1460-9568.2005.04539.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_90",
            "start": 0,
            "end": 259,
            "label": {}
        },
        {
            "ix": "3-169_v2_91@0",
            "content": "<REF-55> Seguin JA Brennan J Mangano E : Proinflammatory cytokines differentially influence adult hippocampal cell proliferation depending upon the route and chronicity of administration. Neuropsychiatr Dis Treat. 2009 ; 5 : 5 – 14 . 19557094 10.2147/NDT.S4476 2695223",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_91",
            "start": 0,
            "end": 267,
            "label": {}
        },
        {
            "ix": "3-169_v2_92@0",
            "content": "<REF-56> Young KM Bartlett PF Coulson EJ : Neural progenitor number is regulated by nuclear factor-kappaB p65 and p50 subunit-dependent proliferation rather than cell survival. J Neurosci Res. 2006 ; 83 ( 1 ): 39 – 49 . 16307445 10.1002/jnr.20702",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_92",
            "start": 0,
            "end": 245,
            "label": {}
        },
        {
            "ix": "3-169_v2_93@0",
            "content": "<REF-57> Zhang Y Liu J Yao S : Nuclear factor kappa B signaling initiates early differentiation of neural stem cells. Stem Cells. 2012 ; 30 ( 3 ): 510 – 24 . 22134901 10.1002/stem.1006 3707487",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_93",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "3-169_v2_94@0",
            "content": "<REF-58> Niebling JE Rünker A Schallenberg S : Dataset 1 in: Myelin-specific T helper 17 cells promote adult hippocampal neurogenesis through indirect mechanisms. F1000Research. 2017 . Data Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-169_v2_94",
            "start": 0,
            "end": 195,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "3-169_v2_0",
            "tgt_ix": "3-169_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_1",
            "tgt_ix": "3-169_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_0",
            "tgt_ix": "3-169_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_3",
            "tgt_ix": "3-169_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_3",
            "tgt_ix": "3-169_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_0",
            "tgt_ix": "3-169_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_6",
            "tgt_ix": "3-169_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_7",
            "tgt_ix": "3-169_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_6",
            "tgt_ix": "3-169_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_9",
            "tgt_ix": "3-169_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_6",
            "tgt_ix": "3-169_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_11",
            "tgt_ix": "3-169_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_6",
            "tgt_ix": "3-169_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_13",
            "tgt_ix": "3-169_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_6",
            "tgt_ix": "3-169_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_15",
            "tgt_ix": "3-169_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_6",
            "tgt_ix": "3-169_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_17",
            "tgt_ix": "3-169_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_6",
            "tgt_ix": "3-169_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_19",
            "tgt_ix": "3-169_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_19",
            "tgt_ix": "3-169_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_21",
            "tgt_ix": "3-169_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_19",
            "tgt_ix": "3-169_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_23",
            "tgt_ix": "3-169_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_0",
            "tgt_ix": "3-169_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_25",
            "tgt_ix": "3-169_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_25",
            "tgt_ix": "3-169_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_27",
            "tgt_ix": "3-169_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_25",
            "tgt_ix": "3-169_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_29",
            "tgt_ix": "3-169_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_25",
            "tgt_ix": "3-169_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_31",
            "tgt_ix": "3-169_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_31",
            "tgt_ix": "3-169_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_31",
            "tgt_ix": "3-169_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_25",
            "tgt_ix": "3-169_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_35",
            "tgt_ix": "3-169_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_35",
            "tgt_ix": "3-169_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_35",
            "tgt_ix": "3-169_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_0",
            "tgt_ix": "3-169_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_39",
            "tgt_ix": "3-169_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_39",
            "tgt_ix": "3-169_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_39",
            "tgt_ix": "3-169_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_39",
            "tgt_ix": "3-169_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_0",
            "tgt_ix": "3-169_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_44",
            "tgt_ix": "3-169_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_44",
            "tgt_ix": "3-169_v2_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_44",
            "tgt_ix": "3-169_v2_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_0",
            "tgt_ix": "3-169_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_1",
            "tgt_ix": "3-169_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_2",
            "tgt_ix": "3-169_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_3",
            "tgt_ix": "3-169_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_6",
            "tgt_ix": "3-169_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_7",
            "tgt_ix": "3-169_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_9",
            "tgt_ix": "3-169_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_10",
            "tgt_ix": "3-169_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_11",
            "tgt_ix": "3-169_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_12",
            "tgt_ix": "3-169_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_13",
            "tgt_ix": "3-169_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_15",
            "tgt_ix": "3-169_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_16",
            "tgt_ix": "3-169_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_17",
            "tgt_ix": "3-169_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_19",
            "tgt_ix": "3-169_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_20",
            "tgt_ix": "3-169_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_21",
            "tgt_ix": "3-169_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_22",
            "tgt_ix": "3-169_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_23",
            "tgt_ix": "3-169_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_24",
            "tgt_ix": "3-169_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_25",
            "tgt_ix": "3-169_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_26",
            "tgt_ix": "3-169_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_27",
            "tgt_ix": "3-169_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_28",
            "tgt_ix": "3-169_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_29",
            "tgt_ix": "3-169_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_30",
            "tgt_ix": "3-169_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_31",
            "tgt_ix": "3-169_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_32",
            "tgt_ix": "3-169_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_33",
            "tgt_ix": "3-169_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_34",
            "tgt_ix": "3-169_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_35",
            "tgt_ix": "3-169_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_36",
            "tgt_ix": "3-169_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_37",
            "tgt_ix": "3-169_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_38",
            "tgt_ix": "3-169_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_39",
            "tgt_ix": "3-169_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_40",
            "tgt_ix": "3-169_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_43",
            "tgt_ix": "3-169_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_44",
            "tgt_ix": "3-169_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_45",
            "tgt_ix": "3-169_v2_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_46",
            "tgt_ix": "3-169_v2_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_48",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_16",
            "tgt_ix": "3-169_v2_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_16",
            "tgt_ix": "3-169_v2_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_16",
            "tgt_ix": "3-169_v2_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_37",
            "tgt_ix": "3-169_v2_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_37",
            "tgt_ix": "3-169_v2_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_38",
            "tgt_ix": "3-169_v2_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_37",
            "tgt_ix": "3-169_v2_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_90",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_91",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_92",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_93",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_47",
            "tgt_ix": "3-169_v2_94",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_20",
            "tgt_ix": "3-169_v2_22",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_20",
            "tgt_ix": "3-169_v2_24",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_36",
            "tgt_ix": "3-169_v2_28",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-169_v2_0",
            "tgt_ix": "3-169_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_1",
            "tgt_ix": "3-169_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_2",
            "tgt_ix": "3-169_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_2",
            "tgt_ix": "3-169_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_2",
            "tgt_ix": "3-169_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_2",
            "tgt_ix": "3-169_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_2",
            "tgt_ix": "3-169_v2_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_3",
            "tgt_ix": "3-169_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_4",
            "tgt_ix": "3-169_v2_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_5@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_5@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_5@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_5",
            "tgt_ix": "3-169_v2_5@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_6",
            "tgt_ix": "3-169_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_7",
            "tgt_ix": "3-169_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_8@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_8",
            "tgt_ix": "3-169_v2_8@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_9",
            "tgt_ix": "3-169_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_10",
            "tgt_ix": "3-169_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_10",
            "tgt_ix": "3-169_v2_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_10",
            "tgt_ix": "3-169_v2_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_10",
            "tgt_ix": "3-169_v2_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_10",
            "tgt_ix": "3-169_v2_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_10",
            "tgt_ix": "3-169_v2_10@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_10",
            "tgt_ix": "3-169_v2_10@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_11",
            "tgt_ix": "3-169_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_12",
            "tgt_ix": "3-169_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_12",
            "tgt_ix": "3-169_v2_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_12",
            "tgt_ix": "3-169_v2_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_12",
            "tgt_ix": "3-169_v2_12@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_12",
            "tgt_ix": "3-169_v2_12@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_12",
            "tgt_ix": "3-169_v2_12@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_12",
            "tgt_ix": "3-169_v2_12@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_12",
            "tgt_ix": "3-169_v2_12@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_13",
            "tgt_ix": "3-169_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_14",
            "tgt_ix": "3-169_v2_14@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_15",
            "tgt_ix": "3-169_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_16",
            "tgt_ix": "3-169_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_16",
            "tgt_ix": "3-169_v2_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_16",
            "tgt_ix": "3-169_v2_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_16",
            "tgt_ix": "3-169_v2_16@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_16",
            "tgt_ix": "3-169_v2_16@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_17",
            "tgt_ix": "3-169_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_18@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_18@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_18@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_18@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_18",
            "tgt_ix": "3-169_v2_18@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_19",
            "tgt_ix": "3-169_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_20",
            "tgt_ix": "3-169_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_20",
            "tgt_ix": "3-169_v2_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_20",
            "tgt_ix": "3-169_v2_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_20",
            "tgt_ix": "3-169_v2_20@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_21",
            "tgt_ix": "3-169_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_23",
            "tgt_ix": "3-169_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_25",
            "tgt_ix": "3-169_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_27",
            "tgt_ix": "3-169_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_29",
            "tgt_ix": "3-169_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_30",
            "tgt_ix": "3-169_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_30",
            "tgt_ix": "3-169_v2_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_30",
            "tgt_ix": "3-169_v2_30@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_30",
            "tgt_ix": "3-169_v2_30@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_30",
            "tgt_ix": "3-169_v2_30@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_30",
            "tgt_ix": "3-169_v2_30@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_30",
            "tgt_ix": "3-169_v2_30@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_31",
            "tgt_ix": "3-169_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_32",
            "tgt_ix": "3-169_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_32",
            "tgt_ix": "3-169_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_32",
            "tgt_ix": "3-169_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_33",
            "tgt_ix": "3-169_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_33",
            "tgt_ix": "3-169_v2_33@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_33",
            "tgt_ix": "3-169_v2_33@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_33",
            "tgt_ix": "3-169_v2_33@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_33",
            "tgt_ix": "3-169_v2_33@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_33",
            "tgt_ix": "3-169_v2_33@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_34",
            "tgt_ix": "3-169_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_34",
            "tgt_ix": "3-169_v2_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_34",
            "tgt_ix": "3-169_v2_34@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_34",
            "tgt_ix": "3-169_v2_34@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_34",
            "tgt_ix": "3-169_v2_34@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_35",
            "tgt_ix": "3-169_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_36",
            "tgt_ix": "3-169_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_36",
            "tgt_ix": "3-169_v2_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_36",
            "tgt_ix": "3-169_v2_36@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_37",
            "tgt_ix": "3-169_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_37",
            "tgt_ix": "3-169_v2_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_37",
            "tgt_ix": "3-169_v2_37@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_37",
            "tgt_ix": "3-169_v2_37@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_37",
            "tgt_ix": "3-169_v2_37@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_38",
            "tgt_ix": "3-169_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_38",
            "tgt_ix": "3-169_v2_38@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_38",
            "tgt_ix": "3-169_v2_38@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_38",
            "tgt_ix": "3-169_v2_38@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_38",
            "tgt_ix": "3-169_v2_38@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_38",
            "tgt_ix": "3-169_v2_38@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_39",
            "tgt_ix": "3-169_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_40",
            "tgt_ix": "3-169_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_40",
            "tgt_ix": "3-169_v2_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_41@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_41@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_41",
            "tgt_ix": "3-169_v2_41@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_42",
            "tgt_ix": "3-169_v2_42@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_43",
            "tgt_ix": "3-169_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_43",
            "tgt_ix": "3-169_v2_43@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_44",
            "tgt_ix": "3-169_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_45",
            "tgt_ix": "3-169_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_46",
            "tgt_ix": "3-169_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_47",
            "tgt_ix": "3-169_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_48",
            "tgt_ix": "3-169_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_49",
            "tgt_ix": "3-169_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_50",
            "tgt_ix": "3-169_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_51",
            "tgt_ix": "3-169_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_52",
            "tgt_ix": "3-169_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_53",
            "tgt_ix": "3-169_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_54",
            "tgt_ix": "3-169_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_55",
            "tgt_ix": "3-169_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_56",
            "tgt_ix": "3-169_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_57",
            "tgt_ix": "3-169_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_58",
            "tgt_ix": "3-169_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_59",
            "tgt_ix": "3-169_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_60",
            "tgt_ix": "3-169_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_61",
            "tgt_ix": "3-169_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_62",
            "tgt_ix": "3-169_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_63",
            "tgt_ix": "3-169_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_64",
            "tgt_ix": "3-169_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_65",
            "tgt_ix": "3-169_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_66",
            "tgt_ix": "3-169_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_67",
            "tgt_ix": "3-169_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_68",
            "tgt_ix": "3-169_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_69",
            "tgt_ix": "3-169_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_70",
            "tgt_ix": "3-169_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_71",
            "tgt_ix": "3-169_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_72",
            "tgt_ix": "3-169_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_73",
            "tgt_ix": "3-169_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_74",
            "tgt_ix": "3-169_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_75",
            "tgt_ix": "3-169_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_76",
            "tgt_ix": "3-169_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_77",
            "tgt_ix": "3-169_v2_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_78",
            "tgt_ix": "3-169_v2_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_79",
            "tgt_ix": "3-169_v2_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_80",
            "tgt_ix": "3-169_v2_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_81",
            "tgt_ix": "3-169_v2_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_82",
            "tgt_ix": "3-169_v2_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_83",
            "tgt_ix": "3-169_v2_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_84",
            "tgt_ix": "3-169_v2_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_85",
            "tgt_ix": "3-169_v2_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_86",
            "tgt_ix": "3-169_v2_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_87",
            "tgt_ix": "3-169_v2_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_88",
            "tgt_ix": "3-169_v2_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_89",
            "tgt_ix": "3-169_v2_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_90",
            "tgt_ix": "3-169_v2_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_91",
            "tgt_ix": "3-169_v2_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_92",
            "tgt_ix": "3-169_v2_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_93",
            "tgt_ix": "3-169_v2_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-169_v2_94",
            "tgt_ix": "3-169_v2_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "3-169_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.4439.2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Myelin-specific T helper 17 cells promote adult hippocampal neurogenesis through indirect mechanisms",
        "abstract": "CD4 + T cells provide a neuro-immunological link in the regulation of adult hippocampal neurogenesis, but the exact mechanisms underlying enhanced neural precursor cell proliferation and the relative contribution of different T helper (Th) cell subsets have remained unclear. Here, we explored the pro-proliferative potential of interleukin 17-producing T helper (Th17) cells, a developmentally and functionally distinct Th cell subset that is a key mediator of autoimmune neurodegeneration. We found that base-line proliferation of hippocampal precursor cells in a T cell-deficient mouse model of impaired hippocampal neurogenesis can be restored upon adoptive transfer with homogeneous Th17 populations enriched for myelin-reactive T cell receptors (TCR). In these experiments, enhanced proliferation was independent of direct interactions of infiltrating Th17 cells with precursor cells or neighboring cells in the hippocampal neurogenic niche. Complementary studies in immunocompetent mice identified several receptors for Th17 cell-derived cytokines with mRNA expression in hippocampal precursor cells and dentate gyrus tissue, suggesting that Th17 cell activity in peripheral lymphoid tissues might promote hippocampal neurogenesis through secreted cytokines.",
        "contributors": [
            {
                "surname": "Niebling",
                "given-names": "Johannes"
            },
            {
                "surname": "E. Rünker",
                "given-names": "Annette"
            },
            {
                "surname": "Schallenberg",
                "given-names": "Sonja"
            },
            {
                "surname": "Kretschmer",
                "given-names": "Karsten"
            },
            {
                "surname": "Kempermann",
                "given-names": "Gerd"
            }
        ],
        "url": "https://f1000research.com/articles/3-169/v2/",
        "doc_id": "3-169",
        "version": 2,
        "ix_counter": 378,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}