{
    "nodes": [
        {
            "ix": "8-323_v2_0",
            "content": "Young people in HIV care in Ukraine: a national survey on characteristics and service provision",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_2",
            "content": "Background: Ukraine’s perinatally HIV-infected (PHIV) young people are ageing into adolescence/young adulthood and, alongside those with horizontally-acquired HIV infections, require transitional and other support services. We aimed to map this population and policies/service provision at specialist HIV centres, to inform future service development.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_3",
            "content": "Methods: A national survey was conducted of 28 HIV/AIDS centres on number, characteristics (age group, HIV acquisition mode) and care setting (paediatric/adult) of 10-24 year olds in HIV care in each of 24 regions in January 2016. Information was collected on policies/service provision at each centre.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_4",
            "content": "Results: Of 13,286 young people aged 10-24 years registered for HIV care nationally in Ukraine in January 2016, 1,675 were aged 10-18 years. Three-quarters of ≤19 year olds were PHIV, while 72% of 20-24-year-olds had sexually-acquired infection. Five regions accounted for two-thirds of 10-18 year olds in paediatric and 85% of 19-24 year olds in adult services.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_5",
            "content": "In 2015, 97 young people transitioned from paediatric to adult services nationally, typically at 18 years although with flexibility in timing at 17/28 centres. At 27/28 centres, horizontally HIV-infected young people aged <18 years began their HIV care in paediatric services sometimes (5) or always (22). Transition support most commonly consisted of a joint appointment with paediatrician and adult doctor, and support from a psychologist/social worker (both at 24/28 centres).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_6",
            "content": "Only 5/28 centres offered routine HIV care during the evening or weekend, and availability of integrated sexual/reproductive health and harm reduction services was uneven. Of 16/28 centres selectively following-up patients who did not attend for care, 15 targeted patients in paediatric services.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_7",
            "content": "Conclusions: Heterogeneity in the population and in service availability at the main regional/municipal HIV/AIDS centres has implications for potential structural barriers to HIV care, and development of services for this group.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_8",
            "content": "Abbreviations",
            "ntype": "title",
            "meta": {
                "section": "1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_9",
            "content": "ART, antiretroviral therapy; IDU, injecting drug use; PHIV, perinatally HIV-infected; PLHIV, people living with HIV; PWID, people who inject drugs",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_10",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_11",
            "content": "Ukraine, a middle income country, has the second largest population of people living with HIV (PLHIV) in Europe, estimated at 238,000 <REF-1> . Important successes in prevention of mother-to-child transmission and paediatric treatment programmes are reflected, as in other settings, in the demographic characteristics of perinatally HIV-infected (PHIV) patients, who are an ageing cohort. National data indicate that there were 3,014 HIV-infected children and young people aged <18 years in HIV care in Ukraine at the end of 2016 <REF-1> . Around half of the PHIV population were estimated to be aged ≥10 years at this time with numbers transferring to adult care expected to peak in 2019–2026, based on an age at transfer of around 18 years <REF-2> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_12",
            "content": "In terms of horizontally-acquired HIV injecting drug use (IDU) has been a key driver of the epidemic among young people in Ukraine <REF-3> , including among marginalised youth <REF-4> as average age of IDU initiation is in the late teens <REF-5> . In recent years, young people aged 15–24 years have accounted for a declining number and proportion of newly diagnosed HIV infections (12% in 2009 vs. 5.2% in 2016) <REF-1> . However, an estimated 42% of PLHIV in Ukraine are undiagnosed <REF-6> , and this proportion may be higher among young people, reflecting the specific barriers to services among young people who inject drugs (PWID) and their sexual partners <REF-7> . Women accounted for 43% of new infections in 2015, but with a younger age of infection/diagnosis than men; a third of 15–49 year old women living with HIV were <30 years in 2015 vs. only 19% of men <REF-8> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_13",
            "content": "HIV services in Ukraine are delivered through specialist regional and municipal HIV/AIDS centres, in conjunction with local or satellite clinics to which antiretroviral therapy (ART) provision has been decentralised in recent years. Decentralised services are available mainly to adults, while children usually remain under the follow-up of a paediatrician at a specialist centre (personal communication, Galyna Kyselyova). HIV treatment and care are officially provided free-of-charge, however a system of unofficial payments may also apply, and support services are often provided by non-governmental organisations. Around two-thirds of diagnosed individuals linked to care were on ART in 2016 <REF-1> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_14",
            "content": "Adolescence and young adulthood are periods of vulnerability regarding access to and retention in healthcare services for chronic conditions, including HIV, due to a range of factors including increased risk-taking behaviours, challenges around transferring to and navigating adult-oriented health systems, managing stigma and disclosure, and emergence of mental health problems <REF-9> , <REF-10> . Findings from high income settings have indicated that PHIV young people are at elevated risk of poor ART adherence, virological failure and deterioration of health and loss to follow-up during adolescence and transition to adult care <REF-11> – <REF-14> , although UK data show substantial improvements over calendar time and improved CD4 trajectory in some groups post-transition <REF-15> , <REF-16> . The few studies to date evaluating different service delivery models for HIV-positive young people indicate the importance of clinic accessibility, integrated care and peer support, as well as the potential impact of individual-level interventions such as financial incentives for clinic attendance and treatment adherence <REF-17> , <REF-18> . However, quality of evidence regarding models of care for young people is poor, and the success of different models is likely to be highly setting-specific, while most studies are from high income settings.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_15",
            "content": "Reforms of Ukraine’s healthcare system are ongoing and include development of more patient-centred, outcome-oriented models of care <REF-19> . However, currently there is little evidence to guide the development of policies, care and support programmes specific to young PLHIV, despite evolving needs for services. The objectives of this study were to describe the contemporary population of young people aged 10–24 years receiving HIV care in Ukraine by mode of HIV acquisition, type of care (paediatric vs. adult) and region, and to document current service provision and local policies at specialist HIV centres in order to inform future service development.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_16",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_17",
            "content": "In April and May 2016, a paper-based questionnaire was sent to 24 regional HIV/AIDS centres and four large municipal HIV/AIDS centres (Kryvy Rih and Dnipro city centres in Dnepropetrovsk region and Bila Tserkva and Kiev city centres in Kiev region) in collaboration with the Public Health Center of the Ministry of Health of Ukraine. These 28 centres were surveyed because they collate data on all people registered for HIV care nationally, within each of the 24 regions (oblasts), including those followed-up at local or satellite clinics.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_18",
            "content": "The questionnaire requested the number of 10–24 year olds (young people, according to WHO’s definition <REF-20> ) receiving HIV care within the region on 1 January 2016. Based on an age of transfer to adult care of 18 years, the questionnaire requested the number of young people in paediatric and adult services in two age groups: 10–18 years and 19–24 years. To explore service needs in more depth, the number of young people by mode of HIV acquisition was disaggregated according to three age groups: 10–14 years, 15–19 years and 20–24 years, to accommodate WHO definition of adolescence (10–19 years) <REF-20> and facilitate comparison with national figures. Additional questions were on policies around transition, provision of psychological support, sexual and reproductive health and harm reduction services and practices around loss to follow-up at each regional/municipal centre. Responses were provided by a paediatrician at each centre or another member of staff with knowledge of models of care provided to young people.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_19",
            "content": "To obtain an estimate of the total number of young people aged 10–24 years in HIV care nationally, we summed the regional totals. This national estimate was complete with the exception of the temporarily uncontrolled territories of the Donetsk and Lugansk regions (partial data available) and the Russian-occupied territories of The Crimea. To identify possible double-counting of young people registered simultaneously in paediatric and adult services within the same region, we compared the total across both services with the regional total by mode of HIV acquisition. Where the second total was smaller, we summed the 10–18 year olds registered in adult services and the 19–24 year olds registered in paediatric services, to reach an estimate of the maximum number double-counted across paediatric and adult services.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_20",
            "content": "Data were entered into a REDCap database. Descriptive analyses were conducted in STATA version 13 (Stata Corp LP, College Station USA).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_21",
            "content": "As a service evaluation, this survey did not require ethics approval, but was approved by the Ministry of Health. Individual patient data were not collected and consent was therefore not required.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_22",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_23",
            "content": "All 28 centres responded; questionnaires were completed by paediatric/adult infectious diseases doctors ( n =23), epidemiologists ( n =2), an HIV/AIDS centre head ( n =1), immunologist ( n =1), and nurse ( n =1).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_24",
            "content": "Number of young people in HIV care nationally",
            "ntype": "title",
            "meta": {
                "section": "4.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_25",
            "content": "Nationally, a total of 13,286 young people aged 10–24 years were registered for HIV care (paediatric and adult services) in January 2016, of whom 43 may have been registered simultaneously in both paediatric and adult services in the same region. Of the total 13,286, 13% (1,675) were aged 10–18 years, a group making up 94% (1418/1505) of those in paediatric services and 2% (257/11781) of those in adult services. The median number of 10–18 year olds registered in paediatric services in each region was 31 (IQR 17, 73; range 1, 212) while that for 19–24 year olds in adult care was 101 (IQR 59, 227; range 0, 3632). Dnepropetrovsk, Kiev, Mykolaiv and Odessa regions had amongst the largest numbers of patients in both age groups; along with Chernivtski, these regions accounted for almost two-thirds (65%, 917/1418) of 10–18 year olds in paediatric care ( Figure 1a ) and with Donetsk they accounted for 85% (9849/11,524) of 19–24 year olds in adult HIV services ( Figure 1b ). Overall, 839 10–24 year olds were newly registered for HIV care in 2015, 759 of whom were aged 19–24 years.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_26",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Maps showing ( a ) number of 10–18 year olds in paediatric HIV care and ( b ) number of 19–24 year olds in adult HIV care by region, on 1 January 2016. Area of circle is proportional to number of young people. Note different scales for maps ( a ) and ( b ). Name of region was included for centres with ( a ) n≥100 10–18 year olds in paediatric services and ( b ) n≥800 19–24 year olds in adult services. Maps were adapted from original versions created by Aleksandr Grigoryev, available at https://commons.wikimedia.org/w/index.php?curid=28880433 under a CC0 license .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/21074/e8581d72-70db-4040-b78a-ad37a59c7916_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_27",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <p>Maps showing ( <bold>a</bold>) number of 10&#8211;18 year olds in paediatric HIV care and ( <bold>b</bold>) number of 19&#8211;24 year olds in adult HIV care by region, on 1 January 2016. Area of circle is proportional to number of young people. Note different scales for maps ( <bold>a</bold>) and ( <bold>b</bold>). Name of region was included for centres with ( <bold>a</bold>) n&#8805;100 10&#8211;18 year olds in paediatric services and ( <bold>b</bold>) n&#8805;800 19&#8211;24 year olds in adult services. Maps were adapted from original versions created by Aleksandr Grigoryev, available at <ext-link ext-link-type=\"uri\" xlink:href=\"https://commons.wikimedia.org/w/index.php?curid=28880433\">https://commons.wikimedia.org/w/index.php?curid=28880433</ext-link> under a <ext-link ext-link-type=\"uri\" xlink:href=\"https://creativecommons.org/share-your-work/public-domain/cc0/\">CC0 license</ext-link>.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/21074/e8581d72-70db-4040-b78a-ad37a59c7916_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Maps showing ( a ) number of 10–18 year olds in paediatric HIV care and ( b ) number of 19–24 year olds in adult HIV care by region, on 1 January 2016. Area of circle is proportional to number of young people. Note different scales for maps ( a ) and ( b ). Name of region was included for centres with ( a ) n≥100 10–18 year olds in paediatric services and ( b ) n≥800 19–24 year olds in adult services. Maps were adapted from original versions created by Aleksandr Grigoryev, available at https://commons.wikimedia.org/w/index.php?curid=28880433 under a CC0 license .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/21074/e8581d72-70db-4040-b78a-ad37a59c7916_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_28",
            "content": "Table 1 shows mode of HIV acquisition of young people in HIV care by age group. Overall 13% (1663/13060) were adolescents (10–19 years), most of whom were perinatally-infected. There were 210 PHIV young people aged 20–24 years in HIV care at the beginning of 2016, accounting for 1.8% of this age group and 14% of the PHIV population overall. Among 15–19 year olds, 43% (294/691) had sexually-acquired HIV infection, increasing to 72% (8183/11397) in those aged 20–24 years. Young PWID accounted for a quarter of the 20–24 year old age group.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_29",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Number of young people in HIV care in Ukraine by age group and mode of HIV acquisition.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_30",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Number of young people in HIV care in Ukraine by age group and mode of HIV acquisition.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" valign=\"top\">Age group</th> <th align=\"left\" valign=\"top\">Perinatal</th> <th align=\"left\" valign=\"top\">Sexual</th> <th align=\"left\" valign=\"top\">Injecting drug use</th> <th align=\"left\" valign=\"top\">Other</th> <th align=\"left\" valign=\"top\">Total</th> </tr> </thead> <tbody> <tr> <td align=\"left\" valign=\"top\">10&#8211;14 years</td> <td align=\"left\" valign=\"top\">968 (99.5%)</td> <td align=\"left\" valign=\"top\">2 (0.2%)</td> <td align=\"left\" valign=\"top\">0</td> <td align=\"left\" valign=\"top\">2 (0.2%)</td> <td align=\"left\" valign=\"top\">972 (100%)</td> </tr> <tr> <td align=\"left\" valign=\"top\">15&#8211;19 years</td> <td align=\"left\" valign=\"top\">318 (46.0%)</td> <td align=\"left\" valign=\"top\">294 (42.5%)</td> <td align=\"left\" valign=\"top\">76 (10.9%)</td> <td align=\"left\" valign=\"top\">3 (0.4%)</td> <td align=\"left\" valign=\"top\">691 (100%)</td> </tr> <tr> <td align=\"left\" valign=\"top\">20&#8211;24 years</td> <td align=\"left\" valign=\"top\">210 (1.8%)</td> <td align=\"left\" valign=\"top\">8183 (71.8%)</td> <td align=\"left\" valign=\"top\">3001 (26.3%)</td> <td align=\"left\" valign=\"top\">3 (0.03%)</td> <td align=\"left\" valign=\"top\">11397 (100%)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Total</bold> </td> <td align=\"left\" valign=\"top\"> <bold>1496 (11%)</bold> </td> <td align=\"left\" valign=\"top\"> <bold>8479 (65%)</bold> </td> <td align=\"left\" valign=\"top\"> <bold>3077 (24%)</bold> </td> <td align=\"left\" valign=\"top\"> <bold>8 (0.1%)</bold> </td> <td align=\"left\" valign=\"top\"> <bold>13060 <sup> <xref ref-type=\"other\" rid=\"FN1\">&#8224;</xref> </sup> (100%)</bold> </td> </tr> </tbody> </table> <table-wrap-foot> <fn> <p id=\"FN1\">&#8224;This total is 226 fewer than the total 13286 given in text due to unknown /unreported mode of HIV acquisition for some young people, and potential double-counting of up to 43 patients registered with both paediatric and adult services simultaneously.</p> </fn> </table-wrap-foot> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Number of young people in HIV care in Ukraine by age group and mode of HIV acquisition.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_31",
            "content": "Policies regarding transition from paediatric to adult HIV care",
            "ntype": "title",
            "meta": {
                "section": "4.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_32",
            "content": "In total 97 patients transitioned from paediatric to adult care across 13 regions during 2015; 66 in two regions (Dnepropetrovsk and Odessa). In 11/28 centres, transition always took place at 18 years, in two centres it could sometimes be postponed depending on the paediatric caseload, while in 15 centres transition could always be postponed if necessary; of the latter group of 15 centres, there was no formal age limit for transfer in eight, while the maximum age limit ranged up to 24 years in the remainder. At the 17 centres with flexible policies, possible reasons for postponement of transfer included lack of maturity or independence of young person ( n =15), young person’s request ( n =11), poor support at home ( n =6), poor adherence ( n =3), cognitive problems ( n =3), poor health ( n =1), and financial concerns related to payment for tests or drugs in adult services ( n =1).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_33",
            "content": "Most (22/28) centres reported that young people with horizontally-acquired HIV aged <18 years began their HIV care in paediatric services while in five centres they sometimes initiated care in adult services depending on factors such as adequate maturity, pregnancy, wish to attend adult services, or availability of a paediatrician; one centre reported always registering young people with horizontally-acquired HIV in adult HIV services.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_34",
            "content": "Table 2 shows the number of centres offering each of four aspects of transition support. Most (24/28) centres offered young people a joint appointment with paediatrician and adult doctor as part of the transition process, with specific support from a psychologist or social worker also available at most centres surveyed. Only three centres reported that young people continued to see a paediatrician for a period after transfer to adult care.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_35",
            "content": "Table 2.",
            "ntype": "label",
            "meta": {
                "id": "T2",
                "caption": "Number and proportion of regional/municipal HIV/AIDS centres offering different types of transition support.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_36",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T2\" position=\"anchor\"> <caption> <title>Number and proportion of regional/municipal HIV/AIDS centres offering different types of transition support.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th/> <th align=\"left\" valign=\"top\">Overall <sup> <xref ref-type=\"other\" rid=\"FN2\">&#8224;</xref> </sup> </th> <th align=\"left\" valign=\"top\">10 centres with no <break/>transfers in 2015</th> <th align=\"left\" valign=\"top\">17 centres transferring &#8805;1 <break/>patient to adult care in 2015</th> </tr> <tr> <th/> <th align=\"left\" valign=\"top\">N (%) of <break/>centres</th> <th align=\"left\" valign=\"top\">N (%) of centres</th> <th align=\"left\" valign=\"top\">N (%) of centres</th> </tr> </thead> <tbody> <tr> <td align=\"left\" valign=\"top\"> <bold>Young person meets adult doctor before transfer</bold> </td> <td align=\"left\" valign=\"top\">14/27 (52%)</td> <td align=\"left\" valign=\"top\">4/9 (44%)</td> <td align=\"left\" valign=\"top\">9/17 (53%)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Young person has appointment(s) with</bold> <break/> <bold>paediatrician and adult doctor together</bold> </td> <td align=\"left\" valign=\"top\">24/28 (86%)</td> <td align=\"left\" valign=\"top\">9/10 (90%)</td> <td align=\"left\" valign=\"top\">14/17 (82%)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Young person has specific support with transfer</bold> <break/> <bold>from psychologist or social worker</bold> </td> <td align=\"left\" valign=\"top\">24/28 (86%)</td> <td align=\"left\" valign=\"top\">9/10 (90%)</td> <td align=\"left\" valign=\"top\">14/17 (82%)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Young person continues to see paediatrician for</bold> <break/> <bold>a period after transfer to adult care</bold> </td> <td align=\"left\" valign=\"top\">3/25 (12%)</td> <td align=\"left\" valign=\"top\">1/9 (11%)</td> <td align=\"left\" valign=\"top\">2/15 (13%)</td> </tr> </tbody> </table> <table-wrap-foot> <fn> <p id=\"FN2\">&#8224; One centre was missing data on transfers in 2015 and is included in the &#8220;overall&#8221; column only</p> </fn> </table-wrap-foot> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T2",
                "caption": "Number and proportion of regional/municipal HIV/AIDS centres offering different types of transition support.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_37",
            "content": "Support services and follow-up of young people",
            "ntype": "title",
            "meta": {
                "section": "4.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_38",
            "content": "Of the 28 centres, five centres offered a weekend or evening clinic (for four this was at least weekly) while two centres reported out-of-hours services for emergencies only (e.g. post-exposure prophylaxis). All centres provided a “walk-in” service without an appointment during opening hours, either for standard follow-up ( n =27) or only for urgent care ( n =1).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_39",
            "content": "Figure 2 shows the proportion of centres surveyed offering each of six types of service/support in HIV care. Condoms were freely available at half of the centres and other contraceptives at four centres. Testing and treatment for sexually transmitted infections was quite widely available. This was also the case for psychological support; however, the three centres without psychologist support were in regions with some of the highest numbers of young people in HIV care (collectively 7287 of the 13286 10–24 year olds in HIV care nationally). Out of 26 centres answering the question, 17 reported offering a support group, and at six of these 17 centres a group was provided specifically for young people. Eleven centres had harm reduction services available to PWID routinely ( n =8) or by referral ( n =3). Regarding contributions towards the cost of HIV care in adult services, all 28 centres indicated that ART and general HIV care were free-of-charge, but seven centres indicated patient contributions to costs associated with blood tests ( n =5), vaccinations ( n =4) and/or general equipment/supplies ( n =4). Only five centres offered financial support for travel costs to attend appointments.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_40",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Of 24 regional and 4 municipal centres in Ukraine, the number with each support service available. Bars differ in height due to missing data.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/21074/e8581d72-70db-4040-b78a-ad37a59c7916_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_41",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Of 24 regional and 4 municipal centres in Ukraine, the number with each support service available.</title> <p>Bars differ in height due to missing data.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/21074/e8581d72-70db-4040-b78a-ad37a59c7916_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Of 24 regional and 4 municipal centres in Ukraine, the number with each support service available. Bars differ in height due to missing data.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/21074/e8581d72-70db-4040-b78a-ad37a59c7916_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_42",
            "content": "Overall, 25/28 centres provided appointment reminders for patients, mainly by phone call (23/25); only one centre reported using SMS and none used email. Twelve centres reported making contact with all patients who missed one follow-up, while 16 centres indicated a selective policy, mostly targeting those on ART ( n =14), children or young people in paediatric services ( n =15), and/or patients of heightened clinical concern – e.g. those who were pregnant, with low CD4 count, a recently changed ART regimen or preparing to start ART. Patients missing follow-up were most commonly contacted by a doctor (21/28) or nurse (24/28) at the HIV/AIDS centre, a social worker (20/28), a local doctor (13/28) or in one case a psychologist.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_43",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "5",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_44",
            "content": "Results from this national survey show that of around 13,300 10–24 year olds in HIV care in Ukraine at the beginning of 2016, around 86% (11,400) were aged 20–24 years, with 72% of this age group having sexually-acquired HIV infection. Smaller sub-groups include over 3000 young PWID and increasing numbers of PHIV youth entering adult care. Our survey results indicated that 759 19–24 year olds were newly registered for HIV care in 2015. It is not possible to determine what proportion of all new diagnoses these young people represented (and therefore the proportion linked to care), because national figures are not disaggregated by age group. However, 26% of diagnosed individuals have never been linked to HIV care <REF-1> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_45",
            "content": "As expected, young people aged ≤18 years were predominantly cared for in paediatric services. The number of young people transitioning from paediatric to adult care was fairly small – 97 in 2015 – but set to increase year on year. Although transition typically occurs at around 18 years, a range of policies were in place nationally, with some flexibility regarding timing of transition at 17 of 28 centres. This allowed clinicians to be responsive to young people’s developmental maturity and need for continuity of care, which may be important to their feelings of preparedness for transfer and trust in their healthcare provider <REF-21> . Joint appointments with the paediatrician and adult doctor were part of transition processes alongside psychosocial support in most centres. The close involvement of paediatric and adult staff during transition is recommended in USA guidelines <REF-10> and may help young people to overcome barriers to transition which relate to fears of changing relationships with healthcare providers and new systems in adult services <REF-22> . However, the evidence base for different transition models in improving outcomes is currently lacking. The recent decentralisation of HIV services for adults in Ukraine means that transfer to adult care may be increasingly accompanied by a change in location of care as well as provider; the potential impact of this on retention needs to be examined, along with implications for models of transition support.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_46",
            "content": "Most young people with horizontally-acquired HIV <18 years nationwide start their HIV care in paediatric services. Paediatricians may be better equipped to support adolescents in HIV care and treatment programmes through a greater understanding of adolescent development and behaviour <REF-23> . However, given the usual age of transfer of 18 years, these young people are likely to lack continuity in their healthcare provider during their first years of HIV care and will navigate transition to adult care with less established relationships with paediatric healthcare providers than their PHIV counterparts. Young people with horizontally-acquired HIV may experience complex barriers to care related, for example, stigma and concerns around confidentiality, which are reflected in longer delays linking to HIV services than is average for older adults <REF-24> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_47",
            "content": "The WHO recommends co-location of HIV care with other health services relevant for key populations (e.g. sexual and reproductive health, drug dependence services) <REF-25> to improve accessibility of services, which is a key component of youth friendly healthcare. We found uneven availability of services integrated with HIV care at the regional and municipal HIV/AIDS centres included in our survey. Only around half of centres offered free condoms. Other sexually transmitted infections are prevalent <REF-26> and condoms are also a main method of family planning in this population <REF-27> , reflected in the low availability of other forms of contraception as part of HIV care. The 14 centres with free condoms available were in regions with larger caseloads (collectively accounting for 75% of 10–24 year olds in HIV care). Similarly, harm reduction services for PWID were available at 11 centres, located in regions with 86% of young PWID in HIV care nationally, indicating some targeting of services. However, services may not be available to all of the young PLHIV in these regions; for example, harm reduction services were available at only one of the three centres surveyed in each of Kiev and Dnepropetrovsk regions.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_48",
            "content": "Financial support towards transport costs was not available at most HIV centres surveyed. Transport costs are a key potential structural barrier to healthcare, sometimes addressed by clinicians on an informal basis in Ukraine (personal communication, Galyna Kyselyova), and may be compounded by informal costs for some aspects of healthcare (e.g. blood tests). Decentralisation of ART provision may minimise transport-related barriers for young people entering adult HIV care. Routine HIV care was available at almost all centres without an appointment, however only five centres offered services during the evenings or weekends. Availability of flexible care at times which minimise the need to miss school, college or work is an important aspect of age-appropriate care as defined by youth <REF-21> and evening clinics have been associated with better retention in care among HIV-positive young people across 12 sites in the USA <REF-28> . Over half of centres reported a selective policy with regards contact with patients who missed an appointment, with 15/16 of these centres indicating that they would target those in paediatric services. The time of transition to adult care may therefore coincide with diminishing support and follow-up, which is of concern given evidence from other settings of challenges retaining adolescents and young adults in care <REF-12> , <REF-29> . Use of mobile technologies was almost completely absent, but may be a useful means to improve ART adherence and support in HIV care for adolescents <REF-30> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_49",
            "content": "Survey results indicated that two-thirds of 10–18 year olds in paediatric HIV care were in just five of the 24 regions, with a similar pattern in 19–24 year olds, reflecting the concentration of the epidemic in the South and East of the country, including some regions also affected by conflict and disruption of HIV and related services in recent years <REF-31> . While services targeted to these regions will achieve the greatest coverage, different support may be needed in those regions with lower caseloads, tailored to the more limited experience in the clinical and psycho-social care of PHIV children and adolescents (for example, in disclosing to PHIV young people their HIV status) and fewer peer support opportunities.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_50",
            "content": "Peer support opportunities for PHIV young people will increase in coming years as this group reach adolescence and young adulthood in greater numbers, and youth-oriented initiatives (such as those led by community-based organisation Teenergizer ) are needed to shape support for the needs of this group alongside youth with horizontally-acquired HIV. The experiences of and barriers to HIV care for all young people need to be explored in the context of Ukraine’s healthcare reforms towards more patient-centred services, and we recently undertook a survey of these groups of young people at two HIV/AIDS centres which investigated these topics, with work ongoing in this area. Importantly, the first cohort of PHIV young people reaching adulthood have different clinical and social characteristics to younger groups – for example, are more likely to be in extended family (vs parental) care – with implications for the level and type of support they may need as they reach adulthood.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_51",
            "content": "There are a number of limitations to this work. We estimated that up to 43 young people may have been double-counted due to simultaneous registration with paediatric and adult services in one region, but could not estimate the number counted by ≥1 region (e.g. due to internal migration or living with extended family members). Figures from the Russian-occupied territories are incomplete. We did not disaggregate young people with sexually-acquired HIV infection into men who have sex with men (MSM) and those with heterosexually-acquired infection, due to the particular vulnerability of MSM in Ukraine which is linked with their under-reporting and misclassification in official figures <REF-32> , and mode of HIV acquisition may be misclassified in other ways (for example due to late diagnosis of a PHIV young person). Although the number of young people in HIV care in each region gives a complete national picture, we could not accurately estimate their coverage with the services provided at the 28 regional and municipal HIV/AIDS centres included in this survey, because ART and HIV care have been decentralised to smaller local clinics in recent years; services are likely to be less readily available at smaller clinics, particularly for key populations.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_52",
            "content": "Conclusions",
            "ntype": "title",
            "meta": {
                "section": "6",
                "sec-type": "conclusions",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_53",
            "content": "There is substantial heterogeneity in young PLHIV in Ukraine by geography, age and mode of HIV acquisition, and in services at regional HIV/AIDS centres. The number of PHIV young people requiring care during adolescence and young adulthood will continue to increase. Uneven availability of integrated services, financial barriers and lack of evening or weekend services may pose structural barriers to HIV care for young people regardless of mode of HIV acquisition and further work is needed to understand these. The results of this study underscore the importance of including services for adolescents in Ukraine’s comprehensive unified Clinical Protocol on HIV/AIDS, with care models focussed on sustainability, effectiveness and scale up of decentralization of services in the context of wider healthcare reforms in Ukraine.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_54",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_55",
            "content": "Underlying data",
            "ntype": "title",
            "meta": {
                "section": "7.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_56",
            "content": "Open Science Framework: Young people in HIV care in Ukraine: a national survey on characteristics and service provision. https://doi.org/10.17605/OSF.IO/XS7ZE <REF-33> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_57",
            "content": "This project contains the following underlying data:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_58",
            "content": "- - Ukraine HIV centre survey data.csv\n- - Ukraine HIV centre survey data dictionary.csv",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_59",
            "content": "Extended data",
            "ntype": "title",
            "meta": {
                "section": "7.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_60",
            "content": "Open Science Framework: Young people in HIV care in Ukraine: a national survey on characteristics and service provision. https://doi.org/10.17605/OSF.IO/XS7ZE <REF-33> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_61",
            "content": "This project contains the following extended data:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_62",
            "content": "- - Final policy survey_English.docx\n- - Final policy survey_Russian.docx",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_63",
            "content": "<REF-1> State Institution Public Health Center of the Ministry of Health of Ukraine: HIV Infection in Ukraine Information Bulletin, No. 47 . Accessed June 2017. 2017 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_64",
            "content": "<REF-2> Bailey H Kiseleva G Malyuta R : Forecasting future burden and need for transitional services for young people with perinatally-acquired HIV in Ukraine, TUPEC167 . In: International AIDS Conference: 2016 ; Durban; 2016 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_65",
            "content": "<REF-3> Jolley E Rhodes T Platt L : HIV among people who inject drugs in Central and Eastern Europe and Central Asia: a systematic review with implications for policy. BMJ Open. 2012 ; 2 ( 5 ): pii: e001465. 23087014 10.1136/bmjopen-2012-001465 3488708",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_66",
            "content": "<REF-4> Nerlander LM Zapata LB Yorick R : Behaviors Associated With a Risk of HIV Transmission From HIV-Positive Street Youth to Non-Street Youth in Ukraine. Sex Transm Dis. 2015 ; 42 ( 9 ): 513 – 520 . 26267878 10.1097/OLQ.0000000000000326 5681713",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_67",
            "content": "<REF-5> Makarenko I Ompad DC Sazonova Y : Trends in Injection Risk Behaviors among People Who Inject Drugs and the Impact of Harm Reduction Programs in Ukraine, 2007-2013. J Urban Health. 2017 ; 94 ( 1 ): 104 – 114 . 28097615 10.1007/s11524-016-0119-9 5359175",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_68",
            "content": "<REF-6> UNAIDS : Prevention Gap Report . Accessed August 2016. 2016 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_69",
            "content": "<REF-7> Delany-Moretlwe S Cowan FM Busza J : Providing comprehensive health services for young key populations: needs, barriers and gaps. J Int AIDS Soc. 2015 ; 18 ( 2 Suppl 1 ): 19833 . 25724511 10.7448/IAS.18.2.19833 4344539",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_70",
            "content": "<REF-8> State Institution \"Ukrainian Center for Socially Dangerous Disease Control of the Ministry of Health of Ukraine\": HIV Infection in Ukraine Information Bulletin, No. 45 . Accessed March 2017. 2016 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_71",
            "content": "<REF-9> Bernays S Jarrett P Kranzer K : Children growing up with HIV infection: the responsibility of success. Lancet. 2014 ; 383 ( 9925 ): 1355 – 1357 . 24529338 10.1016/S0140-6736(13)62328-4",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_72",
            "content": "<REF-10> Committee On Pediatric Aids: Transitioning HIV-infected youth into adult health care. Pediatrics. 2013 ; 132 ( 1 ): 192 – 197 . 23796739 10.1542/peds.2013-1073",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_73",
            "content": "<REF-11> Agwu AL Fairlie L : Antiretroviral treatment, management challenges and outcomes in perinatally HIV-infected adolescents. J Int AIDS Soc. 2013 ; 16 : 18579 . 23782477 10.7448/IAS.16.1.18579 3687074",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_74",
            "content": "<REF-12> Ryscavage P Macharia T Patel D : Linkage to and retention in care following healthcare transition from pediatric to adult HIV care. AIDS Care. 2016 ; 28 ( 5 ): 561 – 565 . 26766017 10.1080/09540121.2015.1131967",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_75",
            "content": "<REF-14> Neilan AM Karalius B Patel K : Association of Risk of Viremia, Immunosuppression, Serious Clinical Events, and Mortality With Increasing Age in Perinatally Human Immunodeficiency Virus-Infected Youth. JAMA Pediatr. 2017 ; 171 ( 5 ): 450 – 460 . 28346597 10.1001/jamapediatrics.2017.0141 5411314",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_76",
            "content": "<REF-15> Collins IJ Foster C Tostevin A : Clinical Status of Adolescents with Perinatal HIV at Transfer to Adult Care in the UK/Ireland. Clin Infect Dis. 2017 ; 64 ( 8 ): 1105 – 1112 . 28329212 10.1093/cid/cix063 5714266",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_77",
            "content": "<REF-16> Judd A Collins IJ Parrott F : Growing up with perinatal HIV: changes in clinical outcomes before and after transfer to adult care in the UK. J Int AIDS Soc. 2017 ; 20 ( Suppl 3 ): 21577 . 28530042 10.7448/IAS.20.4.21577 5577702",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_78",
            "content": "<REF-17> Judd A Sohn AH Collins IJ : Interventions to improve treatment, retention and survival outcomes for adolescents with perinatal HIV-1 transitioning to adult care: moving on up. Curr Opin HIV AIDS. 2016 ; 11 ( 5 ): 477 – 486 . 27272537 10.1097/COH.0000000000000302",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_79",
            "content": "<REF-18> MacPherson P Munthali C Ferguson J : Service delivery interventions to improve adolescents' linkage, retention and adherence to antiretroviral therapy and HIV care. Trop Med Int Health. 2015 ; 20 ( 8 ): 1015 – 1032 . 25877007 10.1111/tmi.12517 4579546",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_80",
            "content": "<REF-19> Health Strategic Advisory Group : National Health Reform Strategy for Ukraine, 2015-2020 . Accessed February 2017. 2015 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_81",
            "content": "<REF-20> WHO: recognising adolescence . Accessed November 2017. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_82",
            "content": "<REF-21> Ambresin AE Bennett K Patton GC : Assessment of youth-friendly health care: a systematic review of indicators drawn from young people's perspectives. J Adolesc Health. 2013 ; 52 ( 6 ): 670 – 681 . 23701887 10.1016/j.jadohealth.2012.12.014",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_83",
            "content": "<REF-22> Sharma N Willen E Garcia A : Attitudes toward transitioning in youth with perinatally acquired HIV and their family caregivers. J Assoc Nurses AIDS Care. 2014 ; 25 ( 2 ): 168 – 175 . 23809660 10.1016/j.jana.2013.01.007",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_84",
            "content": "<REF-23> Lee L Rand CS Ellen JM : Factors informing HIV providers' decisions to start antiretroviral therapy for young people living with behaviorally acquired HIV. J Adolesc Health. 2014 ; 55 ( 3 ): 358 – 365 . 24794054 10.1016/j.jadohealth.2014.03.006 4143531",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_85",
            "content": "<REF-24> Kiriazova TK Postnov OV Perehinets IB : Association of injecting drug use and late enrolment in HIV medical care in Odessa Region, Ukraine. HIV Med. 2013 ; 14 Suppl 3 : 38 – 41 . 24033902 10.1111/hiv.12059",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_86",
            "content": "<REF-25> World Health Organisation : Consolidated guidelines on HIV prevention, diagnosis, treatment and care for key populations . 2014 , revised 2016. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_87",
            "content": "<REF-26> Aebi-Popp K Bailey H Malyuta R : High prevalence of herpes simplex virus (HSV)- type 2 co-infection among HIV-positive women in Ukraine, but no increased HIV mother-to-child transmission risk. BMC Pregnancy Childbirth. 2016 ; 16 ( 1 ): 94 . 27121953 10.1186/s12884-016-0887-y 4848860",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_88",
            "content": "<REF-27> Bailey H Thorne C Semenenko I : Cervical screening within HIV care: findings from an HIV-positive cohort in Ukraine. PLoS One. 2012 ; 7 ( 4 ): e34706 . 22545087 10.1371/journal.pone.0034706 3335834",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_89",
            "content": "<REF-28> Lee L Yehia BR Gaur AH : The Impact of Youth-Friendly Structures of Care on Retention Among HIV-Infected Youth. AIDS Patient Care STDS. 2016 ; 30 ( 4 ): 170 – 177 . 26983056 10.1089/apc.2015.0263 4827281",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_90",
            "content": "<REF-29> Agwu AL Lee L Fleishman JA : Aging and loss to follow-up among youth living with human immunodeficiency virus in the HIV Research Network. J Adolesc Health. 2015 ; 56 ( 3 ): 345 – 351 . 25703322 10.1016/j.jadohealth.2014.11.009 4378241",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_91",
            "content": "<REF-30> World Health Organisation : HIV and adolescents: guidance for HIV testing and counselling and care for adolescents living with HIV. Recommendations for a public health approach and considerations for policy-makers and managers . Geneva, Switzerland; 2013 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_92",
            "content": "<REF-31> Kazatchkine M : Towards a new health diplomacy in eastern Ukraine. Lancet HIV. 2017 ; 4 ( 3 ): e99 – e101 . 28254150 10.1016/S2352-3018(17)30019-X",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_93",
            "content": "<REF-32> Čakalo JI Božičević I Vitek C : Misclassification of men with reported HIV infection in Ukraine. AIDS Behav. 2015 ; 19 ( 10 ): 1938 – 1940 . 26070886 10.1007/s10461-015-1112-0",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-323_v2_94",
            "content": "<REF-33> Bailey H : Young People in HIV Care in Ukraine: A National Survey on Characteristics and Service Provision, DOI 10.17605/OSF.IO/XS7ZE . OSF. 2019 . http://www.doi.org/10.17605/OSF.IO/XS7ZE",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "8-323_v2_0@0",
            "content": "Young people in HIV care in Ukraine: a national survey on characteristics and service provision",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_0",
            "start": 0,
            "end": 94,
            "label": {}
        },
        {
            "ix": "8-323_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "8-323_v2_2@0",
            "content": "Background: Ukraine’s perinatally HIV-infected (PHIV) young people are ageing into adolescence/young adulthood and, alongside those with horizontally-acquired HIV infections, require transitional and other support services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_2",
            "start": 0,
            "end": 222,
            "label": {}
        },
        {
            "ix": "8-323_v2_2@1",
            "content": "We aimed to map this population and policies/service provision at specialist HIV centres, to inform future service development.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_2",
            "start": 224,
            "end": 350,
            "label": {}
        },
        {
            "ix": "8-323_v2_3@0",
            "content": "Methods: A national survey was conducted of 28 HIV/AIDS centres on number, characteristics (age group, HIV acquisition mode) and care setting (paediatric/adult) of 10-24 year olds in HIV care in each of 24 regions in January 2016.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_3",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "8-323_v2_3@1",
            "content": "Information was collected on policies/service provision at each centre.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_3",
            "start": 231,
            "end": 301,
            "label": {}
        },
        {
            "ix": "8-323_v2_4@0",
            "content": "Results: Of 13,286 young people aged 10-24 years registered for HIV care nationally in Ukraine in January 2016, 1,675 were aged 10-18 years.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_4",
            "start": 0,
            "end": 139,
            "label": {}
        },
        {
            "ix": "8-323_v2_4@1",
            "content": "Three-quarters of ≤19 year olds were PHIV, while 72% of 20-24-year-olds had sexually-acquired infection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_4",
            "start": 141,
            "end": 244,
            "label": {}
        },
        {
            "ix": "8-323_v2_4@2",
            "content": "Five regions accounted for two-thirds of 10-18 year olds in paediatric and 85% of 19-24 year olds in adult services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_4",
            "start": 246,
            "end": 361,
            "label": {}
        },
        {
            "ix": "8-323_v2_5@0",
            "content": "In 2015, 97 young people transitioned from paediatric to adult services nationally, typically at 18 years although with flexibility in timing at 17/28 centres.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_5",
            "start": 0,
            "end": 158,
            "label": {}
        },
        {
            "ix": "8-323_v2_5@1",
            "content": "At 27/28 centres, horizontally HIV-infected young people aged <18 years began their HIV care in paediatric services sometimes (5) or always (22).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_5",
            "start": 160,
            "end": 304,
            "label": {}
        },
        {
            "ix": "8-323_v2_5@2",
            "content": "Transition support most commonly consisted of a joint appointment with paediatrician and adult doctor, and support from a psychologist/social worker (both at 24/28 centres).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_5",
            "start": 306,
            "end": 478,
            "label": {}
        },
        {
            "ix": "8-323_v2_6@0",
            "content": "Only 5/28 centres offered routine HIV care during the evening or weekend, and availability of integrated sexual/reproductive health and harm reduction services was uneven.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_6",
            "start": 0,
            "end": 170,
            "label": {}
        },
        {
            "ix": "8-323_v2_6@1",
            "content": "Of 16/28 centres selectively following-up patients who did not attend for care, 15 targeted patients in paediatric services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_6",
            "start": 172,
            "end": 295,
            "label": {}
        },
        {
            "ix": "8-323_v2_7@0",
            "content": "Conclusions: Heterogeneity in the population and in service availability at the main regional/municipal HIV/AIDS centres has implications for potential structural barriers to HIV care, and development of services for this group.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_7",
            "start": 0,
            "end": 227,
            "label": {}
        },
        {
            "ix": "8-323_v2_8@0",
            "content": "Abbreviations",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_8",
            "start": 0,
            "end": 12,
            "label": {}
        },
        {
            "ix": "8-323_v2_9@0",
            "content": "ART, antiretroviral therapy; IDU, injecting drug use; PHIV, perinatally HIV-infected; PLHIV, people living with HIV; PWID, people who inject drugs",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_9",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "8-323_v2_10@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_10",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "8-323_v2_11@0",
            "content": "Ukraine, a middle income country, has the second largest population of people living with HIV (PLHIV) in Europe, estimated at 238,000 <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_11",
            "start": 0,
            "end": 142,
            "label": {}
        },
        {
            "ix": "8-323_v2_11@1",
            "content": "Important successes in prevention of mother-to-child transmission and paediatric treatment programmes are reflected, as in other settings, in the demographic characteristics of perinatally HIV-infected (PHIV) patients, who are an ageing cohort.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_11",
            "start": 144,
            "end": 387,
            "label": {}
        },
        {
            "ix": "8-323_v2_11@2",
            "content": "National data indicate that there were 3,014 HIV-infected children and young people aged <18 years in HIV care in Ukraine at the end of 2016 <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_11",
            "start": 389,
            "end": 538,
            "label": {}
        },
        {
            "ix": "8-323_v2_11@3",
            "content": "Around half of the PHIV population were estimated to be aged ≥10 years at this time with numbers transferring to adult care expected to peak in 2019–2026, based on an age at transfer of around 18 years <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_11",
            "start": 540,
            "end": 750,
            "label": {}
        },
        {
            "ix": "8-323_v2_12@0",
            "content": "In terms of horizontally-acquired HIV injecting drug use (IDU) has been a key driver of the epidemic among young people in Ukraine <REF-3> , including among marginalised youth <REF-4> as average age of IDU initiation is in the late teens <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_12",
            "start": 0,
            "end": 246,
            "label": {}
        },
        {
            "ix": "8-323_v2_12@1",
            "content": "In recent years, young people aged 15–24 years have accounted for a declining number and proportion of newly diagnosed HIV infections (12% in 2009 vs. 5.2% in 2016) <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_12",
            "start": 248,
            "end": 421,
            "label": {}
        },
        {
            "ix": "8-323_v2_12@2",
            "content": "However, an estimated 42% of PLHIV in Ukraine are undiagnosed <REF-6> , and this proportion may be higher among young people, reflecting the specific barriers to services among young people who inject drugs (PWID) and their sexual partners <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_12",
            "start": 423,
            "end": 671,
            "label": {}
        },
        {
            "ix": "8-323_v2_12@3",
            "content": "Women accounted for 43% of new infections in 2015, but with a younger age of infection/diagnosis than men; a third of 15–49 year old women living with HIV were <30 years in 2015 vs. only 19% of men <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_12",
            "start": 673,
            "end": 879,
            "label": {}
        },
        {
            "ix": "8-323_v2_13@0",
            "content": "HIV services in Ukraine are delivered through specialist regional and municipal HIV/AIDS centres, in conjunction with local or satellite clinics to which antiretroviral therapy (ART) provision has been decentralised in recent years.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_13",
            "start": 0,
            "end": 231,
            "label": {}
        },
        {
            "ix": "8-323_v2_13@1",
            "content": "Decentralised services are available mainly to adults, while children usually remain under the follow-up of a paediatrician at a specialist centre (personal communication, Galyna Kyselyova).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_13",
            "start": 233,
            "end": 422,
            "label": {}
        },
        {
            "ix": "8-323_v2_13@2",
            "content": "HIV treatment and care are officially provided free-of-charge, however a system of unofficial payments may also apply, and support services are often provided by non-governmental organisations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_13",
            "start": 424,
            "end": 616,
            "label": {}
        },
        {
            "ix": "8-323_v2_13@3",
            "content": "Around two-thirds of diagnosed individuals linked to care were on ART in 2016 <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_13",
            "start": 618,
            "end": 704,
            "label": {}
        },
        {
            "ix": "8-323_v2_14@0",
            "content": "Adolescence and young adulthood are periods of vulnerability regarding access to and retention in healthcare services for chronic conditions, including HIV, due to a range of factors including increased risk-taking behaviours, challenges around transferring to and navigating adult-oriented health systems, managing stigma and disclosure, and emergence of mental health problems <REF-9> , <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_14",
            "start": 0,
            "end": 398,
            "label": {}
        },
        {
            "ix": "8-323_v2_14@1",
            "content": "Findings from high income settings have indicated that PHIV young people are at elevated risk of poor ART adherence, virological failure and deterioration of health and loss to follow-up during adolescence and transition to adult care <REF-11> – <REF-14> , although UK data show substantial improvements over calendar time and improved CD4 trajectory in some groups post-transition <REF-15> , <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_14",
            "start": 400,
            "end": 802,
            "label": {}
        },
        {
            "ix": "8-323_v2_14@2",
            "content": "The few studies to date evaluating different service delivery models for HIV-positive young people indicate the importance of clinic accessibility, integrated care and peer support, as well as the potential impact of individual-level interventions such as financial incentives for clinic attendance and treatment adherence <REF-17> , <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_14",
            "start": 804,
            "end": 1147,
            "label": {}
        },
        {
            "ix": "8-323_v2_14@3",
            "content": "However, quality of evidence regarding models of care for young people is poor, and the success of different models is likely to be highly setting-specific, while most studies are from high income settings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_14",
            "start": 1149,
            "end": 1354,
            "label": {}
        },
        {
            "ix": "8-323_v2_15@0",
            "content": "Reforms of Ukraine’s healthcare system are ongoing and include development of more patient-centred, outcome-oriented models of care <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_15",
            "start": 0,
            "end": 141,
            "label": {}
        },
        {
            "ix": "8-323_v2_15@1",
            "content": "However, currently there is little evidence to guide the development of policies, care and support programmes specific to young PLHIV, despite evolving needs for services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_15",
            "start": 143,
            "end": 313,
            "label": {}
        },
        {
            "ix": "8-323_v2_15@2",
            "content": "The objectives of this study were to describe the contemporary population of young people aged 10–24 years receiving HIV care in Ukraine by mode of HIV acquisition, type of care (paediatric vs. adult) and region, and to document current service provision and local policies at specialist HIV centres in order to inform future service development.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_15",
            "start": 315,
            "end": 660,
            "label": {}
        },
        {
            "ix": "8-323_v2_16@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_16",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "8-323_v2_17@0",
            "content": "In April and May 2016, a paper-based questionnaire was sent to 24 regional HIV/AIDS centres and four large municipal HIV/AIDS centres (Kryvy Rih and Dnipro city centres in Dnepropetrovsk region and Bila Tserkva and Kiev city centres in Kiev region) in collaboration with the Public Health Center of the Ministry of Health of Ukraine.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_17",
            "start": 0,
            "end": 332,
            "label": {}
        },
        {
            "ix": "8-323_v2_17@1",
            "content": "These 28 centres were surveyed because they collate data on all people registered for HIV care nationally, within each of the 24 regions (oblasts), including those followed-up at local or satellite clinics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_17",
            "start": 334,
            "end": 539,
            "label": {}
        },
        {
            "ix": "8-323_v2_18@0",
            "content": "The questionnaire requested the number of 10–24 year olds (young people, according to WHO’s definition <REF-20> ) receiving HIV care within the region on 1 January 2016.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_18",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "8-323_v2_18@1",
            "content": "Based on an age of transfer to adult care of 18 years, the questionnaire requested the number of young people in paediatric and adult services in two age groups: 10–18 years and 19–24 years.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_18",
            "start": 170,
            "end": 359,
            "label": {}
        },
        {
            "ix": "8-323_v2_18@2",
            "content": "To explore service needs in more depth, the number of young people by mode of HIV acquisition was disaggregated according to three age groups: 10–14 years, 15–19 years and 20–24 years, to accommodate WHO definition of adolescence (10–19 years) <REF-20> and facilitate comparison with national figures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_18",
            "start": 361,
            "end": 661,
            "label": {}
        },
        {
            "ix": "8-323_v2_18@3",
            "content": "Additional questions were on policies around transition, provision of psychological support, sexual and reproductive health and harm reduction services and practices around loss to follow-up at each regional/municipal centre.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_18",
            "start": 663,
            "end": 887,
            "label": {}
        },
        {
            "ix": "8-323_v2_18@4",
            "content": "Responses were provided by a paediatrician at each centre or another member of staff with knowledge of models of care provided to young people.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_18",
            "start": 889,
            "end": 1031,
            "label": {}
        },
        {
            "ix": "8-323_v2_19@0",
            "content": "To obtain an estimate of the total number of young people aged 10–24 years in HIV care nationally, we summed the regional totals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_19",
            "start": 0,
            "end": 128,
            "label": {}
        },
        {
            "ix": "8-323_v2_19@1",
            "content": "This national estimate was complete with the exception of the temporarily uncontrolled territories of the Donetsk and Lugansk regions (partial data available) and the Russian-occupied territories of The Crimea.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_19",
            "start": 130,
            "end": 339,
            "label": {}
        },
        {
            "ix": "8-323_v2_19@2",
            "content": "To identify possible double-counting of young people registered simultaneously in paediatric and adult services within the same region, we compared the total across both services with the regional total by mode of HIV acquisition.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_19",
            "start": 341,
            "end": 570,
            "label": {}
        },
        {
            "ix": "8-323_v2_19@3",
            "content": "Where the second total was smaller, we summed the 10–18 year olds registered in adult services and the 19–24 year olds registered in paediatric services, to reach an estimate of the maximum number double-counted across paediatric and adult services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_19",
            "start": 572,
            "end": 820,
            "label": {}
        },
        {
            "ix": "8-323_v2_20@0",
            "content": "Data were entered into a REDCap database.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_20",
            "start": 0,
            "end": 40,
            "label": {}
        },
        {
            "ix": "8-323_v2_20@1",
            "content": "Descriptive analyses were conducted in STATA version 13 (Stata Corp LP, College Station USA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_20",
            "start": 42,
            "end": 134,
            "label": {}
        },
        {
            "ix": "8-323_v2_21@0",
            "content": "As a service evaluation, this survey did not require ethics approval, but was approved by the Ministry of Health.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_21",
            "start": 0,
            "end": 112,
            "label": {}
        },
        {
            "ix": "8-323_v2_21@1",
            "content": "Individual patient data were not collected and consent was therefore not required.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_21",
            "start": 114,
            "end": 195,
            "label": {}
        },
        {
            "ix": "8-323_v2_22@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_22",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "8-323_v2_23@0",
            "content": "All 28 centres responded; questionnaires were completed by paediatric/adult infectious diseases doctors ( n =23), epidemiologists ( n =2), an HIV/AIDS centre head ( n =1), immunologist ( n =1), and nurse ( n =1).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_23",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "8-323_v2_24@0",
            "content": "Number of young people in HIV care nationally",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_24",
            "start": 0,
            "end": 44,
            "label": {}
        },
        {
            "ix": "8-323_v2_25@0",
            "content": "Nationally, a total of 13,286 young people aged 10–24 years were registered for HIV care (paediatric and adult services) in January 2016, of whom 43 may have been registered simultaneously in both paediatric and adult services in the same region.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_25",
            "start": 0,
            "end": 245,
            "label": {}
        },
        {
            "ix": "8-323_v2_25@1",
            "content": "Of the total 13,286, 13% (1,675) were aged 10–18 years, a group making up 94% (1418/1505) of those in paediatric services and 2% (257/11781) of those in adult services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_25",
            "start": 247,
            "end": 414,
            "label": {}
        },
        {
            "ix": "8-323_v2_25@2",
            "content": "The median number of 10–18 year olds registered in paediatric services in each region was 31 (IQR 17, 73; range 1, 212) while that for 19–24 year olds in adult care was 101 (IQR 59, 227; range 0, 3632).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_25",
            "start": 416,
            "end": 617,
            "label": {}
        },
        {
            "ix": "8-323_v2_25@3",
            "content": "Dnepropetrovsk, Kiev, Mykolaiv and Odessa regions had amongst the largest numbers of patients in both age groups; along with Chernivtski, these regions accounted for almost two-thirds (65%, 917/1418) of 10–18 year olds in paediatric care ( Figure 1a ) and with Donetsk they accounted for 85% (9849/11,524) of 19–24 year olds in adult HIV services ( Figure 1b ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_25",
            "start": 619,
            "end": 979,
            "label": {}
        },
        {
            "ix": "8-323_v2_25@4",
            "content": "Overall, 839 10–24 year olds were newly registered for HIV care in 2015, 759 of whom were aged 19–24 years.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_25",
            "start": 981,
            "end": 1087,
            "label": {}
        },
        {
            "ix": "8-323_v2_26@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_26",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "8-323_v2_28@0",
            "content": "Table 1 shows mode of HIV acquisition of young people in HIV care by age group.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_28",
            "start": 0,
            "end": 78,
            "label": {}
        },
        {
            "ix": "8-323_v2_28@1",
            "content": "Overall 13% (1663/13060) were adolescents (10–19 years), most of whom were perinatally-infected.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_28",
            "start": 80,
            "end": 175,
            "label": {}
        },
        {
            "ix": "8-323_v2_28@2",
            "content": "There were 210 PHIV young people aged 20–24 years in HIV care at the beginning of 2016, accounting for 1.8% of this age group and 14% of the PHIV population overall.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_28",
            "start": 177,
            "end": 341,
            "label": {}
        },
        {
            "ix": "8-323_v2_28@3",
            "content": "Among 15–19 year olds, 43% (294/691) had sexually-acquired HIV infection, increasing to 72% (8183/11397) in those aged 20–24 years.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_28",
            "start": 343,
            "end": 473,
            "label": {}
        },
        {
            "ix": "8-323_v2_28@4",
            "content": "Young PWID accounted for a quarter of the 20–24 year old age group.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_28",
            "start": 475,
            "end": 541,
            "label": {}
        },
        {
            "ix": "8-323_v2_29@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_29",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "8-323_v2_31@0",
            "content": "Policies regarding transition from paediatric to adult HIV care",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_31",
            "start": 0,
            "end": 62,
            "label": {}
        },
        {
            "ix": "8-323_v2_32@0",
            "content": "In total 97 patients transitioned from paediatric to adult care across 13 regions during 2015; 66 in two regions (Dnepropetrovsk and Odessa).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_32",
            "start": 0,
            "end": 140,
            "label": {}
        },
        {
            "ix": "8-323_v2_32@1",
            "content": "In 11/28 centres, transition always took place at 18 years, in two centres it could sometimes be postponed depending on the paediatric caseload, while in 15 centres transition could always be postponed if necessary; of the latter group of 15 centres, there was no formal age limit for transfer in eight, while the maximum age limit ranged up to 24 years in the remainder.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_32",
            "start": 142,
            "end": 512,
            "label": {}
        },
        {
            "ix": "8-323_v2_32@2",
            "content": "At the 17 centres with flexible policies, possible reasons for postponement of transfer included lack of maturity or independence of young person ( n =15), young person’s request ( n =11), poor support at home ( n =6), poor adherence ( n =3), cognitive problems ( n =3), poor health ( n =1), and financial concerns related to payment for tests or drugs in adult services ( n =1).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_32",
            "start": 514,
            "end": 892,
            "label": {}
        },
        {
            "ix": "8-323_v2_33@0",
            "content": "Most (22/28) centres reported that young people with horizontally-acquired HIV aged <18 years began their HIV care in paediatric services while in five centres they sometimes initiated care in adult services depending on factors such as adequate maturity, pregnancy, wish to attend adult services, or availability of a paediatrician; one centre reported always registering young people with horizontally-acquired HIV in adult HIV services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_33",
            "start": 0,
            "end": 438,
            "label": {}
        },
        {
            "ix": "8-323_v2_34@0",
            "content": "Table 2 shows the number of centres offering each of four aspects of transition support.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_34",
            "start": 0,
            "end": 87,
            "label": {}
        },
        {
            "ix": "8-323_v2_34@1",
            "content": "Most (24/28) centres offered young people a joint appointment with paediatrician and adult doctor as part of the transition process, with specific support from a psychologist or social worker also available at most centres surveyed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_34",
            "start": 89,
            "end": 320,
            "label": {}
        },
        {
            "ix": "8-323_v2_34@2",
            "content": "Only three centres reported that young people continued to see a paediatrician for a period after transfer to adult care.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_34",
            "start": 322,
            "end": 442,
            "label": {}
        },
        {
            "ix": "8-323_v2_35@0",
            "content": "Table 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_35",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "8-323_v2_37@0",
            "content": "Support services and follow-up of young people",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_37",
            "start": 0,
            "end": 45,
            "label": {}
        },
        {
            "ix": "8-323_v2_38@0",
            "content": "Of the 28 centres, five centres offered a weekend or evening clinic (for four this was at least weekly) while two centres reported out-of-hours services for emergencies only (e.g. post-exposure prophylaxis).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_38",
            "start": 0,
            "end": 206,
            "label": {}
        },
        {
            "ix": "8-323_v2_38@1",
            "content": "All centres provided a “walk-in” service without an appointment during opening hours, either for standard follow-up ( n =27) or only for urgent care ( n =1).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_38",
            "start": 208,
            "end": 364,
            "label": {}
        },
        {
            "ix": "8-323_v2_39@0",
            "content": "Figure 2 shows the proportion of centres surveyed offering each of six types of service/support in HIV care.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_39",
            "start": 0,
            "end": 107,
            "label": {}
        },
        {
            "ix": "8-323_v2_39@1",
            "content": "Condoms were freely available at half of the centres and other contraceptives at four centres.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_39",
            "start": 109,
            "end": 202,
            "label": {}
        },
        {
            "ix": "8-323_v2_39@2",
            "content": "Testing and treatment for sexually transmitted infections was quite widely available.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_39",
            "start": 204,
            "end": 288,
            "label": {}
        },
        {
            "ix": "8-323_v2_39@3",
            "content": "This was also the case for psychological support; however, the three centres without psychologist support were in regions with some of the highest numbers of young people in HIV care (collectively 7287 of the 13286 10–24 year olds in HIV care nationally).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_39",
            "start": 290,
            "end": 544,
            "label": {}
        },
        {
            "ix": "8-323_v2_39@4",
            "content": "Out of 26 centres answering the question, 17 reported offering a support group, and at six of these 17 centres a group was provided specifically for young people.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_39",
            "start": 546,
            "end": 707,
            "label": {}
        },
        {
            "ix": "8-323_v2_39@5",
            "content": "Eleven centres had harm reduction services available to PWID routinely ( n =8) or by referral ( n =3).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_39",
            "start": 709,
            "end": 810,
            "label": {}
        },
        {
            "ix": "8-323_v2_39@6",
            "content": "Regarding contributions towards the cost of HIV care in adult services, all 28 centres indicated that ART and general HIV care were free-of-charge, but seven centres indicated patient contributions to costs associated with blood tests ( n =5), vaccinations ( n =4) and/or general equipment/supplies ( n =4).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_39",
            "start": 812,
            "end": 1118,
            "label": {}
        },
        {
            "ix": "8-323_v2_39@7",
            "content": "Only five centres offered financial support for travel costs to attend appointments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_39",
            "start": 1120,
            "end": 1203,
            "label": {}
        },
        {
            "ix": "8-323_v2_40@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_40",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "8-323_v2_42@0",
            "content": "Overall, 25/28 centres provided appointment reminders for patients, mainly by phone call (23/25); only one centre reported using SMS and none used email.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_42",
            "start": 0,
            "end": 152,
            "label": {}
        },
        {
            "ix": "8-323_v2_42@1",
            "content": "Twelve centres reported making contact with all patients who missed one follow-up, while 16 centres indicated a selective policy, mostly targeting those on ART ( n =14), children or young people in paediatric services ( n =15), and/or patients of heightened clinical concern – e.g. those who were pregnant, with low CD4 count, a recently changed ART regimen or preparing to start ART.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_42",
            "start": 154,
            "end": 537,
            "label": {}
        },
        {
            "ix": "8-323_v2_42@2",
            "content": "Patients missing follow-up were most commonly contacted by a doctor (21/28) or nurse (24/28) at the HIV/AIDS centre, a social worker (20/28), a local doctor (13/28) or in one case a psychologist.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_42",
            "start": 539,
            "end": 733,
            "label": {}
        },
        {
            "ix": "8-323_v2_43@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_43",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "8-323_v2_44@0",
            "content": "Results from this national survey show that of around 13,300 10–24 year olds in HIV care in Ukraine at the beginning of 2016, around 86% (11,400) were aged 20–24 years, with 72% of this age group having sexually-acquired HIV infection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_44",
            "start": 0,
            "end": 234,
            "label": {}
        },
        {
            "ix": "8-323_v2_44@1",
            "content": "Smaller sub-groups include over 3000 young PWID and increasing numbers of PHIV youth entering adult care.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_44",
            "start": 236,
            "end": 340,
            "label": {}
        },
        {
            "ix": "8-323_v2_44@2",
            "content": "Our survey results indicated that 759 19–24 year olds were newly registered for HIV care in 2015.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_44",
            "start": 342,
            "end": 438,
            "label": {}
        },
        {
            "ix": "8-323_v2_44@3",
            "content": "It is not possible to determine what proportion of all new diagnoses these young people represented (and therefore the proportion linked to care), because national figures are not disaggregated by age group.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_44",
            "start": 440,
            "end": 646,
            "label": {}
        },
        {
            "ix": "8-323_v2_44@4",
            "content": "However, 26% of diagnosed individuals have never been linked to HIV care <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_44",
            "start": 648,
            "end": 729,
            "label": {}
        },
        {
            "ix": "8-323_v2_45@0",
            "content": "As expected, young people aged ≤18 years were predominantly cared for in paediatric services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_45",
            "start": 0,
            "end": 92,
            "label": {}
        },
        {
            "ix": "8-323_v2_45@1",
            "content": "The number of young people transitioning from paediatric to adult care was fairly small – 97 in 2015 – but set to increase year on year.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_45",
            "start": 94,
            "end": 229,
            "label": {}
        },
        {
            "ix": "8-323_v2_45@2",
            "content": "Although transition typically occurs at around 18 years, a range of policies were in place nationally, with some flexibility regarding timing of transition at 17 of 28 centres.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_45",
            "start": 231,
            "end": 406,
            "label": {}
        },
        {
            "ix": "8-323_v2_45@3",
            "content": "This allowed clinicians to be responsive to young people’s developmental maturity and need for continuity of care, which may be important to their feelings of preparedness for transfer and trust in their healthcare provider <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_45",
            "start": 408,
            "end": 641,
            "label": {}
        },
        {
            "ix": "8-323_v2_45@4",
            "content": "Joint appointments with the paediatrician and adult doctor were part of transition processes alongside psychosocial support in most centres.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_45",
            "start": 643,
            "end": 782,
            "label": {}
        },
        {
            "ix": "8-323_v2_45@5",
            "content": "The close involvement of paediatric and adult staff during transition is recommended in USA guidelines <REF-10> and may help young people to overcome barriers to transition which relate to fears of changing relationships with healthcare providers and new systems in adult services <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_45",
            "start": 784,
            "end": 1074,
            "label": {}
        },
        {
            "ix": "8-323_v2_45@6",
            "content": "However, the evidence base for different transition models in improving outcomes is currently lacking.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_45",
            "start": 1076,
            "end": 1177,
            "label": {}
        },
        {
            "ix": "8-323_v2_45@7",
            "content": "The recent decentralisation of HIV services for adults in Ukraine means that transfer to adult care may be increasingly accompanied by a change in location of care as well as provider; the potential impact of this on retention needs to be examined, along with implications for models of transition support.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_45",
            "start": 1179,
            "end": 1484,
            "label": {}
        },
        {
            "ix": "8-323_v2_46@0",
            "content": "Most young people with horizontally-acquired HIV <18 years nationwide start their HIV care in paediatric services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_46",
            "start": 0,
            "end": 113,
            "label": {}
        },
        {
            "ix": "8-323_v2_46@1",
            "content": "Paediatricians may be better equipped to support adolescents in HIV care and treatment programmes through a greater understanding of adolescent development and behaviour <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_46",
            "start": 115,
            "end": 294,
            "label": {}
        },
        {
            "ix": "8-323_v2_46@2",
            "content": "However, given the usual age of transfer of 18 years, these young people are likely to lack continuity in their healthcare provider during their first years of HIV care and will navigate transition to adult care with less established relationships with paediatric healthcare providers than their PHIV counterparts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_46",
            "start": 296,
            "end": 609,
            "label": {}
        },
        {
            "ix": "8-323_v2_46@3",
            "content": "Young people with horizontally-acquired HIV may experience complex barriers to care related, for example, stigma and concerns around confidentiality, which are reflected in longer delays linking to HIV services than is average for older adults <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_46",
            "start": 611,
            "end": 864,
            "label": {}
        },
        {
            "ix": "8-323_v2_47@0",
            "content": "The WHO recommends co-location of HIV care with other health services relevant for key populations (e.g. sexual and reproductive health, drug dependence services) <REF-25> to improve accessibility of services, which is a key component of youth friendly healthcare.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_47",
            "start": 0,
            "end": 263,
            "label": {}
        },
        {
            "ix": "8-323_v2_47@1",
            "content": "We found uneven availability of services integrated with HIV care at the regional and municipal HIV/AIDS centres included in our survey.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_47",
            "start": 265,
            "end": 400,
            "label": {}
        },
        {
            "ix": "8-323_v2_47@2",
            "content": "Only around half of centres offered free condoms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_47",
            "start": 402,
            "end": 450,
            "label": {}
        },
        {
            "ix": "8-323_v2_47@3",
            "content": "Other sexually transmitted infections are prevalent <REF-26> and condoms are also a main method of family planning in this population <REF-27> , reflected in the low availability of other forms of contraception as part of HIV care.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_47",
            "start": 452,
            "end": 682,
            "label": {}
        },
        {
            "ix": "8-323_v2_47@4",
            "content": "The 14 centres with free condoms available were in regions with larger caseloads (collectively accounting for 75% of 10–24 year olds in HIV care).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_47",
            "start": 684,
            "end": 829,
            "label": {}
        },
        {
            "ix": "8-323_v2_47@5",
            "content": "Similarly, harm reduction services for PWID were available at 11 centres, located in regions with 86% of young PWID in HIV care nationally, indicating some targeting of services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_47",
            "start": 831,
            "end": 1008,
            "label": {}
        },
        {
            "ix": "8-323_v2_47@6",
            "content": "However, services may not be available to all of the young PLHIV in these regions; for example, harm reduction services were available at only one of the three centres surveyed in each of Kiev and Dnepropetrovsk regions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_47",
            "start": 1010,
            "end": 1229,
            "label": {}
        },
        {
            "ix": "8-323_v2_48@0",
            "content": "Financial support towards transport costs was not available at most HIV centres surveyed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_48",
            "start": 0,
            "end": 88,
            "label": {}
        },
        {
            "ix": "8-323_v2_48@1",
            "content": "Transport costs are a key potential structural barrier to healthcare, sometimes addressed by clinicians on an informal basis in Ukraine (personal communication, Galyna Kyselyova), and may be compounded by informal costs for some aspects of healthcare (e.g. blood tests).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_48",
            "start": 90,
            "end": 359,
            "label": {}
        },
        {
            "ix": "8-323_v2_48@2",
            "content": "Decentralisation of ART provision may minimise transport-related barriers for young people entering adult HIV care.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_48",
            "start": 361,
            "end": 475,
            "label": {}
        },
        {
            "ix": "8-323_v2_48@3",
            "content": "Routine HIV care was available at almost all centres without an appointment, however only five centres offered services during the evenings or weekends.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_48",
            "start": 477,
            "end": 628,
            "label": {}
        },
        {
            "ix": "8-323_v2_48@4",
            "content": "Availability of flexible care at times which minimise the need to miss school, college or work is an important aspect of age-appropriate care as defined by youth <REF-21> and evening clinics have been associated with better retention in care among HIV-positive young people across 12 sites in the USA <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_48",
            "start": 630,
            "end": 940,
            "label": {}
        },
        {
            "ix": "8-323_v2_48@5",
            "content": "Over half of centres reported a selective policy with regards contact with patients who missed an appointment, with 15/16 of these centres indicating that they would target those in paediatric services.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_48",
            "start": 942,
            "end": 1143,
            "label": {}
        },
        {
            "ix": "8-323_v2_48@6",
            "content": "The time of transition to adult care may therefore coincide with diminishing support and follow-up, which is of concern given evidence from other settings of challenges retaining adolescents and young adults in care <REF-12> , <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_48",
            "start": 1145,
            "end": 1381,
            "label": {}
        },
        {
            "ix": "8-323_v2_48@7",
            "content": "Use of mobile technologies was almost completely absent, but may be a useful means to improve ART adherence and support in HIV care for adolescents <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_48",
            "start": 1383,
            "end": 1540,
            "label": {}
        },
        {
            "ix": "8-323_v2_49@0",
            "content": "Survey results indicated that two-thirds of 10–18 year olds in paediatric HIV care were in just five of the 24 regions, with a similar pattern in 19–24 year olds, reflecting the concentration of the epidemic in the South and East of the country, including some regions also affected by conflict and disruption of HIV and related services in recent years <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_49",
            "start": 0,
            "end": 363,
            "label": {}
        },
        {
            "ix": "8-323_v2_49@1",
            "content": "While services targeted to these regions will achieve the greatest coverage, different support may be needed in those regions with lower caseloads, tailored to the more limited experience in the clinical and psycho-social care of PHIV children and adolescents (for example, in disclosing to PHIV young people their HIV status) and fewer peer support opportunities.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_49",
            "start": 365,
            "end": 728,
            "label": {}
        },
        {
            "ix": "8-323_v2_50@0",
            "content": "Peer support opportunities for PHIV young people will increase in coming years as this group reach adolescence and young adulthood in greater numbers, and youth-oriented initiatives (such as those led by community-based organisation Teenergizer ) are needed to shape support for the needs of this group alongside youth with horizontally-acquired HIV.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_50",
            "start": 0,
            "end": 349,
            "label": {}
        },
        {
            "ix": "8-323_v2_50@1",
            "content": "The experiences of and barriers to HIV care for all young people need to be explored in the context of Ukraine’s healthcare reforms towards more patient-centred services, and we recently undertook a survey of these groups of young people at two HIV/AIDS centres which investigated these topics, with work ongoing in this area.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_50",
            "start": 351,
            "end": 676,
            "label": {}
        },
        {
            "ix": "8-323_v2_50@2",
            "content": "Importantly, the first cohort of PHIV young people reaching adulthood have different clinical and social characteristics to younger groups – for example, are more likely to be in extended family (vs parental) care – with implications for the level and type of support they may need as they reach adulthood.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_50",
            "start": 678,
            "end": 983,
            "label": {}
        },
        {
            "ix": "8-323_v2_51@0",
            "content": "There are a number of limitations to this work.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_51",
            "start": 0,
            "end": 46,
            "label": {}
        },
        {
            "ix": "8-323_v2_51@1",
            "content": "We estimated that up to 43 young people may have been double-counted due to simultaneous registration with paediatric and adult services in one region, but could not estimate the number counted by ≥1 region (e.g. due to internal migration or living with extended family members).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_51",
            "start": 48,
            "end": 326,
            "label": {}
        },
        {
            "ix": "8-323_v2_51@2",
            "content": "Figures from the Russian-occupied territories are incomplete.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_51",
            "start": 328,
            "end": 388,
            "label": {}
        },
        {
            "ix": "8-323_v2_51@3",
            "content": "We did not disaggregate young people with sexually-acquired HIV infection into men who have sex with men (MSM) and those with heterosexually-acquired infection, due to the particular vulnerability of MSM in Ukraine which is linked with their under-reporting and misclassification in official figures <REF-32> , and mode of HIV acquisition may be misclassified in other ways (for example due to late diagnosis of a PHIV young person).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_51",
            "start": 390,
            "end": 822,
            "label": {}
        },
        {
            "ix": "8-323_v2_51@4",
            "content": "Although the number of young people in HIV care in each region gives a complete national picture, we could not accurately estimate their coverage with the services provided at the 28 regional and municipal HIV/AIDS centres included in this survey, because ART and HIV care have been decentralised to smaller local clinics in recent years; services are likely to be less readily available at smaller clinics, particularly for key populations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_51",
            "start": 824,
            "end": 1264,
            "label": {}
        },
        {
            "ix": "8-323_v2_52@0",
            "content": "Conclusions",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_52",
            "start": 0,
            "end": 10,
            "label": {}
        },
        {
            "ix": "8-323_v2_53@0",
            "content": "There is substantial heterogeneity in young PLHIV in Ukraine by geography, age and mode of HIV acquisition, and in services at regional HIV/AIDS centres.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_53",
            "start": 0,
            "end": 152,
            "label": {}
        },
        {
            "ix": "8-323_v2_53@1",
            "content": "The number of PHIV young people requiring care during adolescence and young adulthood will continue to increase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_53",
            "start": 154,
            "end": 265,
            "label": {}
        },
        {
            "ix": "8-323_v2_53@2",
            "content": "Uneven availability of integrated services, financial barriers and lack of evening or weekend services may pose structural barriers to HIV care for young people regardless of mode of HIV acquisition and further work is needed to understand these.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_53",
            "start": 267,
            "end": 512,
            "label": {}
        },
        {
            "ix": "8-323_v2_53@3",
            "content": "The results of this study underscore the importance of including services for adolescents in Ukraine’s comprehensive unified Clinical Protocol on HIV/AIDS, with care models focussed on sustainability, effectiveness and scale up of decentralization of services in the context of wider healthcare reforms in Ukraine.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_53",
            "start": 514,
            "end": 827,
            "label": {}
        },
        {
            "ix": "8-323_v2_54@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_54",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "8-323_v2_55@0",
            "content": "Underlying data",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_55",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "8-323_v2_56@0",
            "content": "Open Science Framework: Young people in HIV care in Ukraine: a national survey on characteristics and service provision.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_56",
            "start": 0,
            "end": 119,
            "label": {}
        },
        {
            "ix": "8-323_v2_56@1",
            "content": "https://doi.org/10.17605/OSF.IO/XS7ZE <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_56",
            "start": 121,
            "end": 168,
            "label": {}
        },
        {
            "ix": "8-323_v2_57@0",
            "content": "This project contains the following underlying data:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_57",
            "start": 0,
            "end": 51,
            "label": {}
        },
        {
            "ix": "8-323_v2_58@0",
            "content": "- - Ukraine HIV centre survey data.csv",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_58",
            "start": 0,
            "end": 37,
            "label": {}
        },
        {
            "ix": "8-323_v2_58@1",
            "content": "- - Ukraine HIV centre survey data dictionary.csv",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_58",
            "start": 39,
            "end": 87,
            "label": {}
        },
        {
            "ix": "8-323_v2_59@0",
            "content": "Extended data",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_59",
            "start": 0,
            "end": 12,
            "label": {}
        },
        {
            "ix": "8-323_v2_60@0",
            "content": "Open Science Framework: Young people in HIV care in Ukraine: a national survey on characteristics and service provision.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_60",
            "start": 0,
            "end": 119,
            "label": {}
        },
        {
            "ix": "8-323_v2_60@1",
            "content": "https://doi.org/10.17605/OSF.IO/XS7ZE <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_60",
            "start": 121,
            "end": 168,
            "label": {}
        },
        {
            "ix": "8-323_v2_61@0",
            "content": "This project contains the following extended data:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_61",
            "start": 0,
            "end": 49,
            "label": {}
        },
        {
            "ix": "8-323_v2_62@0",
            "content": "- - Final policy survey_English.docx",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_62",
            "start": 0,
            "end": 35,
            "label": {}
        },
        {
            "ix": "8-323_v2_62@1",
            "content": "- - Final policy survey_Russian.docx",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_62",
            "start": 37,
            "end": 72,
            "label": {}
        },
        {
            "ix": "8-323_v2_63@0",
            "content": "<REF-1> State Institution Public Health Center of the Ministry of Health of Ukraine: HIV Infection in Ukraine Information Bulletin, No. 47 . Accessed June 2017. 2017 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_63",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "8-323_v2_64@0",
            "content": "<REF-2> Bailey H Kiseleva G Malyuta R : Forecasting future burden and need for transitional services for young people with perinatally-acquired HIV in Ukraine, TUPEC167 . In: International AIDS Conference: 2016 ; Durban; 2016 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_64",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "8-323_v2_65@0",
            "content": "<REF-3> Jolley E Rhodes T Platt L : HIV among people who inject drugs in Central and Eastern Europe and Central Asia: a systematic review with implications for policy. BMJ Open. 2012 ; 2 ( 5 ): pii: e001465. 23087014 10.1136/bmjopen-2012-001465 3488708",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_65",
            "start": 0,
            "end": 251,
            "label": {}
        },
        {
            "ix": "8-323_v2_66@0",
            "content": "<REF-4> Nerlander LM Zapata LB Yorick R : Behaviors Associated With a Risk of HIV Transmission From HIV-Positive Street Youth to Non-Street Youth in Ukraine. Sex Transm Dis. 2015 ; 42 ( 9 ): 513 – 520 . 26267878 10.1097/OLQ.0000000000000326 5681713",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_66",
            "start": 0,
            "end": 247,
            "label": {}
        },
        {
            "ix": "8-323_v2_67@0",
            "content": "<REF-5> Makarenko I Ompad DC Sazonova Y : Trends in Injection Risk Behaviors among People Who Inject Drugs and the Impact of Harm Reduction Programs in Ukraine, 2007-2013. J Urban Health. 2017 ; 94 ( 1 ): 104 – 114 . 28097615 10.1007/s11524-016-0119-9 5359175",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_67",
            "start": 0,
            "end": 258,
            "label": {}
        },
        {
            "ix": "8-323_v2_68@0",
            "content": "<REF-6> UNAIDS : Prevention Gap Report . Accessed August 2016. 2016 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_68",
            "start": 0,
            "end": 85,
            "label": {}
        },
        {
            "ix": "8-323_v2_69@0",
            "content": "<REF-7> Delany-Moretlwe S Cowan FM Busza J : Providing comprehensive health services for young key populations: needs, barriers and gaps. J Int AIDS Soc. 2015 ; 18 ( 2 Suppl 1 ): 19833 . 25724511 10.7448/IAS.18.2.19833 4344539",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_69",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "8-323_v2_70@0",
            "content": "<REF-8> State Institution \"Ukrainian Center for Socially Dangerous Disease Control of the Ministry of Health of Ukraine\": HIV Infection in Ukraine Information Bulletin, No. 45 . Accessed March 2017. 2016 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_70",
            "start": 0,
            "end": 221,
            "label": {}
        },
        {
            "ix": "8-323_v2_71@0",
            "content": "<REF-9> Bernays S Jarrett P Kranzer K : Children growing up with HIV infection: the responsibility of success. Lancet. 2014 ; 383 ( 9925 ): 1355 – 1357 . 24529338 10.1016/S0140-6736(13)62328-4",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_71",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "8-323_v2_72@0",
            "content": "<REF-10> Committee On Pediatric Aids: Transitioning HIV-infected youth into adult health care. Pediatrics. 2013 ; 132 ( 1 ): 192 – 197 . 23796739 10.1542/peds.2013-1073",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_72",
            "start": 0,
            "end": 167,
            "label": {}
        },
        {
            "ix": "8-323_v2_73@0",
            "content": "<REF-11> Agwu AL Fairlie L : Antiretroviral treatment, management challenges and outcomes in perinatally HIV-infected adolescents. J Int AIDS Soc. 2013 ; 16 : 18579 . 23782477 10.7448/IAS.16.1.18579 3687074",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_73",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "8-323_v2_74@0",
            "content": "<REF-12> Ryscavage P Macharia T Patel D : Linkage to and retention in care following healthcare transition from pediatric to adult HIV care. AIDS Care. 2016 ; 28 ( 5 ): 561 – 565 . 26766017 10.1080/09540121.2015.1131967",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_74",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "8-323_v2_75@0",
            "content": "<REF-14> Neilan AM Karalius B Patel K : Association of Risk of Viremia, Immunosuppression, Serious Clinical Events, and Mortality With Increasing Age in Perinatally Human Immunodeficiency Virus-Infected Youth. JAMA Pediatr. 2017 ; 171 ( 5 ): 450 – 460 . 28346597 10.1001/jamapediatrics.2017.0141 5411314",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_75",
            "start": 0,
            "end": 302,
            "label": {}
        },
        {
            "ix": "8-323_v2_76@0",
            "content": "<REF-15> Collins IJ Foster C Tostevin A : Clinical Status of Adolescents with Perinatal HIV at Transfer to Adult Care in the UK/Ireland. Clin Infect Dis. 2017 ; 64 ( 8 ): 1105 – 1112 . 28329212 10.1093/cid/cix063 5714266",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_76",
            "start": 0,
            "end": 219,
            "label": {}
        },
        {
            "ix": "8-323_v2_77@0",
            "content": "<REF-16> Judd A Collins IJ Parrott F : Growing up with perinatal HIV: changes in clinical outcomes before and after transfer to adult care in the UK. J Int AIDS Soc. 2017 ; 20 ( Suppl 3 ): 21577 . 28530042 10.7448/IAS.20.4.21577 5577702",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_77",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "8-323_v2_78@0",
            "content": "<REF-17> Judd A Sohn AH Collins IJ : Interventions to improve treatment, retention and survival outcomes for adolescents with perinatal HIV-1 transitioning to adult care: moving on up. Curr Opin HIV AIDS. 2016 ; 11 ( 5 ): 477 – 486 . 27272537 10.1097/COH.0000000000000302",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_78",
            "start": 0,
            "end": 270,
            "label": {}
        },
        {
            "ix": "8-323_v2_79@0",
            "content": "<REF-18> MacPherson P Munthali C Ferguson J : Service delivery interventions to improve adolescents' linkage, retention and adherence to antiretroviral therapy and HIV care. Trop Med Int Health. 2015 ; 20 ( 8 ): 1015 – 1032 . 25877007 10.1111/tmi.12517 4579546",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_79",
            "start": 0,
            "end": 259,
            "label": {}
        },
        {
            "ix": "8-323_v2_80@0",
            "content": "<REF-19> Health Strategic Advisory Group : National Health Reform Strategy for Ukraine, 2015-2020 . Accessed February 2017. 2015 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_80",
            "start": 0,
            "end": 146,
            "label": {}
        },
        {
            "ix": "8-323_v2_81@0",
            "content": "<REF-20> WHO: recognising adolescence . Accessed November 2017. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_81",
            "start": 0,
            "end": 79,
            "label": {}
        },
        {
            "ix": "8-323_v2_82@0",
            "content": "<REF-21> Ambresin AE Bennett K Patton GC : Assessment of youth-friendly health care: a systematic review of indicators drawn from young people's perspectives. J Adolesc Health. 2013 ; 52 ( 6 ): 670 – 681 . 23701887 10.1016/j.jadohealth.2012.12.014",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_82",
            "start": 0,
            "end": 246,
            "label": {}
        },
        {
            "ix": "8-323_v2_83@0",
            "content": "<REF-22> Sharma N Willen E Garcia A : Attitudes toward transitioning in youth with perinatally acquired HIV and their family caregivers. J Assoc Nurses AIDS Care. 2014 ; 25 ( 2 ): 168 – 175 . 23809660 10.1016/j.jana.2013.01.007",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_83",
            "start": 0,
            "end": 226,
            "label": {}
        },
        {
            "ix": "8-323_v2_84@0",
            "content": "<REF-23> Lee L Rand CS Ellen JM : Factors informing HIV providers' decisions to start antiretroviral therapy for young people living with behaviorally acquired HIV. J Adolesc Health. 2014 ; 55 ( 3 ): 358 – 365 . 24794054 10.1016/j.jadohealth.2014.03.006 4143531",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_84",
            "start": 0,
            "end": 260,
            "label": {}
        },
        {
            "ix": "8-323_v2_85@0",
            "content": "<REF-24> Kiriazova TK Postnov OV Perehinets IB : Association of injecting drug use and late enrolment in HIV medical care in Odessa Region, Ukraine. HIV Med. 2013 ; 14 Suppl 3 : 38 – 41 . 24033902 10.1111/hiv.12059",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_85",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "8-323_v2_86@0",
            "content": "<REF-25> World Health Organisation : Consolidated guidelines on HIV prevention, diagnosis, treatment and care for key populations . 2014 , revised 2016. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_86",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "8-323_v2_87@0",
            "content": "<REF-26> Aebi-Popp K Bailey H Malyuta R : High prevalence of herpes simplex virus (HSV)- type 2 co-infection among HIV-positive women in Ukraine, but no increased HIV mother-to-child transmission risk. BMC Pregnancy Childbirth. 2016 ; 16 ( 1 ): 94 . 27121953 10.1186/s12884-016-0887-y 4848860",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_87",
            "start": 0,
            "end": 291,
            "label": {}
        },
        {
            "ix": "8-323_v2_88@0",
            "content": "<REF-27> Bailey H Thorne C Semenenko I : Cervical screening within HIV care: findings from an HIV-positive cohort in Ukraine. PLoS One. 2012 ; 7 ( 4 ): e34706 . 22545087 10.1371/journal.pone.0034706 3335834",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_88",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "8-323_v2_89@0",
            "content": "<REF-28> Lee L Yehia BR Gaur AH : The Impact of Youth-Friendly Structures of Care on Retention Among HIV-Infected Youth. AIDS Patient Care STDS. 2016 ; 30 ( 4 ): 170 – 177 . 26983056 10.1089/apc.2015.0263 4827281",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_89",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "8-323_v2_90@0",
            "content": "<REF-29> Agwu AL Lee L Fleishman JA : Aging and loss to follow-up among youth living with human immunodeficiency virus in the HIV Research Network. J Adolesc Health. 2015 ; 56 ( 3 ): 345 – 351 . 25703322 10.1016/j.jadohealth.2014.11.009 4378241",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_90",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "8-323_v2_91@0",
            "content": "<REF-30> World Health Organisation : HIV and adolescents: guidance for HIV testing and counselling and care for adolescents living with HIV. Recommendations for a public health approach and considerations for policy-makers and managers . Geneva, Switzerland; 2013 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_91",
            "start": 0,
            "end": 281,
            "label": {}
        },
        {
            "ix": "8-323_v2_92@0",
            "content": "<REF-31> Kazatchkine M : Towards a new health diplomacy in eastern Ukraine. Lancet HIV. 2017 ; 4 ( 3 ): e99 – e101 . 28254150 10.1016/S2352-3018(17)30019-X",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_92",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "8-323_v2_93@0",
            "content": "<REF-32> Čakalo JI Božičević I Vitek C : Misclassification of men with reported HIV infection in Ukraine. AIDS Behav. 2015 ; 19 ( 10 ): 1938 – 1940 . 26070886 10.1007/s10461-015-1112-0",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_93",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "8-323_v2_94@0",
            "content": "<REF-33> Bailey H : Young People in HIV Care in Ukraine: A National Survey on Characteristics and Service Provision, DOI 10.17605/OSF.IO/XS7ZE . OSF. 2019 . http://www.doi.org/10.17605/OSF.IO/XS7ZE",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-323_v2_94",
            "start": 0,
            "end": 196,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "8-323_v2_0",
            "tgt_ix": "8-323_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_1",
            "tgt_ix": "8-323_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_1",
            "tgt_ix": "8-323_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_1",
            "tgt_ix": "8-323_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_1",
            "tgt_ix": "8-323_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_1",
            "tgt_ix": "8-323_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_1",
            "tgt_ix": "8-323_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_0",
            "tgt_ix": "8-323_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_8",
            "tgt_ix": "8-323_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_0",
            "tgt_ix": "8-323_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_10",
            "tgt_ix": "8-323_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_10",
            "tgt_ix": "8-323_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_10",
            "tgt_ix": "8-323_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_10",
            "tgt_ix": "8-323_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_10",
            "tgt_ix": "8-323_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_0",
            "tgt_ix": "8-323_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_16",
            "tgt_ix": "8-323_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_16",
            "tgt_ix": "8-323_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_16",
            "tgt_ix": "8-323_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_16",
            "tgt_ix": "8-323_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_16",
            "tgt_ix": "8-323_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_0",
            "tgt_ix": "8-323_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_22",
            "tgt_ix": "8-323_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_22",
            "tgt_ix": "8-323_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_24",
            "tgt_ix": "8-323_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_24",
            "tgt_ix": "8-323_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_26",
            "tgt_ix": "8-323_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_24",
            "tgt_ix": "8-323_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_24",
            "tgt_ix": "8-323_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_29",
            "tgt_ix": "8-323_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_22",
            "tgt_ix": "8-323_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_31",
            "tgt_ix": "8-323_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_31",
            "tgt_ix": "8-323_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_31",
            "tgt_ix": "8-323_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_31",
            "tgt_ix": "8-323_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_35",
            "tgt_ix": "8-323_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_22",
            "tgt_ix": "8-323_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_37",
            "tgt_ix": "8-323_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_37",
            "tgt_ix": "8-323_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_37",
            "tgt_ix": "8-323_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_40",
            "tgt_ix": "8-323_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_37",
            "tgt_ix": "8-323_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_0",
            "tgt_ix": "8-323_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_43",
            "tgt_ix": "8-323_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_43",
            "tgt_ix": "8-323_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_43",
            "tgt_ix": "8-323_v2_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_43",
            "tgt_ix": "8-323_v2_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_43",
            "tgt_ix": "8-323_v2_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_43",
            "tgt_ix": "8-323_v2_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_43",
            "tgt_ix": "8-323_v2_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_43",
            "tgt_ix": "8-323_v2_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_0",
            "tgt_ix": "8-323_v2_52",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_52",
            "tgt_ix": "8-323_v2_53",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_0",
            "tgt_ix": "8-323_v2_54",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_54",
            "tgt_ix": "8-323_v2_55",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_55",
            "tgt_ix": "8-323_v2_56",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_55",
            "tgt_ix": "8-323_v2_57",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_55",
            "tgt_ix": "8-323_v2_58",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_54",
            "tgt_ix": "8-323_v2_59",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_59",
            "tgt_ix": "8-323_v2_60",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_59",
            "tgt_ix": "8-323_v2_61",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_59",
            "tgt_ix": "8-323_v2_62",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_0",
            "tgt_ix": "8-323_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_1",
            "tgt_ix": "8-323_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_2",
            "tgt_ix": "8-323_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_3",
            "tgt_ix": "8-323_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_4",
            "tgt_ix": "8-323_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_5",
            "tgt_ix": "8-323_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_6",
            "tgt_ix": "8-323_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_7",
            "tgt_ix": "8-323_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_8",
            "tgt_ix": "8-323_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_9",
            "tgt_ix": "8-323_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_10",
            "tgt_ix": "8-323_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_11",
            "tgt_ix": "8-323_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_13",
            "tgt_ix": "8-323_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_15",
            "tgt_ix": "8-323_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_16",
            "tgt_ix": "8-323_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_17",
            "tgt_ix": "8-323_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_18",
            "tgt_ix": "8-323_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_19",
            "tgt_ix": "8-323_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_20",
            "tgt_ix": "8-323_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_21",
            "tgt_ix": "8-323_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_22",
            "tgt_ix": "8-323_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_23",
            "tgt_ix": "8-323_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_24",
            "tgt_ix": "8-323_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_25",
            "tgt_ix": "8-323_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_26",
            "tgt_ix": "8-323_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_27",
            "tgt_ix": "8-323_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_28",
            "tgt_ix": "8-323_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_29",
            "tgt_ix": "8-323_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_30",
            "tgt_ix": "8-323_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_31",
            "tgt_ix": "8-323_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_32",
            "tgt_ix": "8-323_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_33",
            "tgt_ix": "8-323_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_34",
            "tgt_ix": "8-323_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_35",
            "tgt_ix": "8-323_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_36",
            "tgt_ix": "8-323_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_37",
            "tgt_ix": "8-323_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_38",
            "tgt_ix": "8-323_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_39",
            "tgt_ix": "8-323_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_40",
            "tgt_ix": "8-323_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_41",
            "tgt_ix": "8-323_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_42",
            "tgt_ix": "8-323_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_43",
            "tgt_ix": "8-323_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_44",
            "tgt_ix": "8-323_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_46",
            "tgt_ix": "8-323_v2_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_49",
            "tgt_ix": "8-323_v2_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_50",
            "tgt_ix": "8-323_v2_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_51",
            "tgt_ix": "8-323_v2_52",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_52",
            "tgt_ix": "8-323_v2_53",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_53",
            "tgt_ix": "8-323_v2_54",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_54",
            "tgt_ix": "8-323_v2_55",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_55",
            "tgt_ix": "8-323_v2_56",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_56",
            "tgt_ix": "8-323_v2_57",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_57",
            "tgt_ix": "8-323_v2_58",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_58",
            "tgt_ix": "8-323_v2_59",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_59",
            "tgt_ix": "8-323_v2_60",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_60",
            "tgt_ix": "8-323_v2_61",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_61",
            "tgt_ix": "8-323_v2_62",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_11",
            "tgt_ix": "8-323_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_11",
            "tgt_ix": "8-323_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_15",
            "tgt_ix": "8-323_v2_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_18",
            "tgt_ix": "8-323_v2_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_46",
            "tgt_ix": "8-323_v2_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_46",
            "tgt_ix": "8-323_v2_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_90",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_91",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_49",
            "tgt_ix": "8-323_v2_92",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_51",
            "tgt_ix": "8-323_v2_93",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_56",
            "tgt_ix": "8-323_v2_94",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_25",
            "tgt_ix": "8-323_v2_27",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_28",
            "tgt_ix": "8-323_v2_30",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_34",
            "tgt_ix": "8-323_v2_36",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_39",
            "tgt_ix": "8-323_v2_41",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-323_v2_0",
            "tgt_ix": "8-323_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_1",
            "tgt_ix": "8-323_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_2",
            "tgt_ix": "8-323_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_2",
            "tgt_ix": "8-323_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_3",
            "tgt_ix": "8-323_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_3",
            "tgt_ix": "8-323_v2_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_4",
            "tgt_ix": "8-323_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_4",
            "tgt_ix": "8-323_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_4",
            "tgt_ix": "8-323_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_5",
            "tgt_ix": "8-323_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_5",
            "tgt_ix": "8-323_v2_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_5",
            "tgt_ix": "8-323_v2_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_6",
            "tgt_ix": "8-323_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_6",
            "tgt_ix": "8-323_v2_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_7",
            "tgt_ix": "8-323_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_8",
            "tgt_ix": "8-323_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_9",
            "tgt_ix": "8-323_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_10",
            "tgt_ix": "8-323_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_11",
            "tgt_ix": "8-323_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_11",
            "tgt_ix": "8-323_v2_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_11",
            "tgt_ix": "8-323_v2_11@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_11",
            "tgt_ix": "8-323_v2_11@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_12",
            "tgt_ix": "8-323_v2_12@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_13",
            "tgt_ix": "8-323_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_13",
            "tgt_ix": "8-323_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_13",
            "tgt_ix": "8-323_v2_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_13",
            "tgt_ix": "8-323_v2_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_14",
            "tgt_ix": "8-323_v2_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_15",
            "tgt_ix": "8-323_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_15",
            "tgt_ix": "8-323_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_15",
            "tgt_ix": "8-323_v2_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_16",
            "tgt_ix": "8-323_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_17",
            "tgt_ix": "8-323_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_17",
            "tgt_ix": "8-323_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_18",
            "tgt_ix": "8-323_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_18",
            "tgt_ix": "8-323_v2_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_18",
            "tgt_ix": "8-323_v2_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_18",
            "tgt_ix": "8-323_v2_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_18",
            "tgt_ix": "8-323_v2_18@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_19",
            "tgt_ix": "8-323_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_19",
            "tgt_ix": "8-323_v2_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_19",
            "tgt_ix": "8-323_v2_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_19",
            "tgt_ix": "8-323_v2_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_20",
            "tgt_ix": "8-323_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_20",
            "tgt_ix": "8-323_v2_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_21",
            "tgt_ix": "8-323_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_21",
            "tgt_ix": "8-323_v2_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_22",
            "tgt_ix": "8-323_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_23",
            "tgt_ix": "8-323_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_24",
            "tgt_ix": "8-323_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_25",
            "tgt_ix": "8-323_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_25",
            "tgt_ix": "8-323_v2_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_25",
            "tgt_ix": "8-323_v2_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_25",
            "tgt_ix": "8-323_v2_25@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_25",
            "tgt_ix": "8-323_v2_25@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_26",
            "tgt_ix": "8-323_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_28",
            "tgt_ix": "8-323_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_28",
            "tgt_ix": "8-323_v2_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_28",
            "tgt_ix": "8-323_v2_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_28",
            "tgt_ix": "8-323_v2_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_28",
            "tgt_ix": "8-323_v2_28@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_29",
            "tgt_ix": "8-323_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_31",
            "tgt_ix": "8-323_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_32",
            "tgt_ix": "8-323_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_32",
            "tgt_ix": "8-323_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_32",
            "tgt_ix": "8-323_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_33",
            "tgt_ix": "8-323_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_34",
            "tgt_ix": "8-323_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_34",
            "tgt_ix": "8-323_v2_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_34",
            "tgt_ix": "8-323_v2_34@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_35",
            "tgt_ix": "8-323_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_37",
            "tgt_ix": "8-323_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_38",
            "tgt_ix": "8-323_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_38",
            "tgt_ix": "8-323_v2_38@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_39",
            "tgt_ix": "8-323_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_39",
            "tgt_ix": "8-323_v2_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_39",
            "tgt_ix": "8-323_v2_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_39",
            "tgt_ix": "8-323_v2_39@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_39",
            "tgt_ix": "8-323_v2_39@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_39",
            "tgt_ix": "8-323_v2_39@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_39",
            "tgt_ix": "8-323_v2_39@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_39",
            "tgt_ix": "8-323_v2_39@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_40",
            "tgt_ix": "8-323_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_42",
            "tgt_ix": "8-323_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_42",
            "tgt_ix": "8-323_v2_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_42",
            "tgt_ix": "8-323_v2_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_43",
            "tgt_ix": "8-323_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_44",
            "tgt_ix": "8-323_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_44",
            "tgt_ix": "8-323_v2_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_44",
            "tgt_ix": "8-323_v2_44@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_44",
            "tgt_ix": "8-323_v2_44@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_44",
            "tgt_ix": "8-323_v2_44@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_45@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_45@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_45@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_45@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_45@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_45@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_45",
            "tgt_ix": "8-323_v2_45@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_46",
            "tgt_ix": "8-323_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_46",
            "tgt_ix": "8-323_v2_46@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_46",
            "tgt_ix": "8-323_v2_46@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_46",
            "tgt_ix": "8-323_v2_46@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_47@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_47@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_47@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_47@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_47@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_47",
            "tgt_ix": "8-323_v2_47@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_48@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_48@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_48@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_48@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_48@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_48@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_48",
            "tgt_ix": "8-323_v2_48@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_49",
            "tgt_ix": "8-323_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_49",
            "tgt_ix": "8-323_v2_49@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_50",
            "tgt_ix": "8-323_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_50",
            "tgt_ix": "8-323_v2_50@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_50",
            "tgt_ix": "8-323_v2_50@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_51",
            "tgt_ix": "8-323_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_51",
            "tgt_ix": "8-323_v2_51@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_51",
            "tgt_ix": "8-323_v2_51@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_51",
            "tgt_ix": "8-323_v2_51@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_51",
            "tgt_ix": "8-323_v2_51@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_52",
            "tgt_ix": "8-323_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_53",
            "tgt_ix": "8-323_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_53",
            "tgt_ix": "8-323_v2_53@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_53",
            "tgt_ix": "8-323_v2_53@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_53",
            "tgt_ix": "8-323_v2_53@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_54",
            "tgt_ix": "8-323_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_55",
            "tgt_ix": "8-323_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_56",
            "tgt_ix": "8-323_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_56",
            "tgt_ix": "8-323_v2_56@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_57",
            "tgt_ix": "8-323_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_58",
            "tgt_ix": "8-323_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_58",
            "tgt_ix": "8-323_v2_58@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_59",
            "tgt_ix": "8-323_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_60",
            "tgt_ix": "8-323_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_60",
            "tgt_ix": "8-323_v2_60@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_61",
            "tgt_ix": "8-323_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_62",
            "tgt_ix": "8-323_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_62",
            "tgt_ix": "8-323_v2_62@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_63",
            "tgt_ix": "8-323_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_64",
            "tgt_ix": "8-323_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_65",
            "tgt_ix": "8-323_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_66",
            "tgt_ix": "8-323_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_67",
            "tgt_ix": "8-323_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_68",
            "tgt_ix": "8-323_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_69",
            "tgt_ix": "8-323_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_70",
            "tgt_ix": "8-323_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_71",
            "tgt_ix": "8-323_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_72",
            "tgt_ix": "8-323_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_73",
            "tgt_ix": "8-323_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_74",
            "tgt_ix": "8-323_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_75",
            "tgt_ix": "8-323_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_76",
            "tgt_ix": "8-323_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_77",
            "tgt_ix": "8-323_v2_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_78",
            "tgt_ix": "8-323_v2_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_79",
            "tgt_ix": "8-323_v2_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_80",
            "tgt_ix": "8-323_v2_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_81",
            "tgt_ix": "8-323_v2_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_82",
            "tgt_ix": "8-323_v2_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_83",
            "tgt_ix": "8-323_v2_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_84",
            "tgt_ix": "8-323_v2_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_85",
            "tgt_ix": "8-323_v2_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_86",
            "tgt_ix": "8-323_v2_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_87",
            "tgt_ix": "8-323_v2_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_88",
            "tgt_ix": "8-323_v2_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_89",
            "tgt_ix": "8-323_v2_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_90",
            "tgt_ix": "8-323_v2_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_91",
            "tgt_ix": "8-323_v2_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_92",
            "tgt_ix": "8-323_v2_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_93",
            "tgt_ix": "8-323_v2_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-323_v2_94",
            "tgt_ix": "8-323_v2_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "8-323_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.18573.2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Young people in HIV care in Ukraine: a national survey on characteristics and service provision",
        "abstract": "Background: Ukraine’s perinatally HIV-infected (PHIV) young people are ageing into adolescence/young adulthood and, alongside those with horizontally-acquired HIV infections, require transitional and other support services. We aimed to map this population and policies/service provision at specialist HIV centres, to inform future service development. Methods: A national survey was conducted of 28 HIV/AIDS centres on number, characteristics (age group, HIV acquisition mode) and care setting (paediatric/adult) of 10-24 year olds in HIV care in each of 24 regions in January 2016. Information was collected on policies/service provision at each centre. Results: Of 13,286 young people aged 10-24 years registered for HIV care nationally in Ukraine in January 2016, 1,675 were aged 10-18 years. Three-quarters of ≤19 year olds were PHIV, while 72% of 20-24-year-olds had sexually-acquired infection. Five regions accounted for two-thirds of 10-18 year olds in paediatric and 85% of 19-24 year olds in adult services. In 2015, 97 young people transitioned from paediatric to adult services nationally, typically at 18 years although with flexibility in timing at 17/28 centres. At 27/28 centres, horizontally HIV-infected young people aged <18 years began their HIV care in paediatric services sometimes (5) or always (22). Transition support most commonly consisted of a joint appointment with paediatrician and adult doctor, and support from a psychologist/social worker (both at 24/28 centres). Only 5/28 centres offered routine HIV care during the evening or weekend, and availability of integrated sexual/reproductive health and harm reduction services was uneven. Of 16/28 centres selectively following-up patients who did not attend for care, 15 targeted patients in paediatric services. Conclusions: Heterogeneity in the population and in service availability at the main regional/municipal HIV/AIDS centres has implications for potential structural barriers to HIV care, and development of services for this group.",
        "contributors": [
            {
                "surname": "Kyselyova",
                "given-names": "Galyna"
            },
            {
                "surname": "Martsynovska",
                "given-names": "Violeta"
            },
            {
                "surname": "Volokha",
                "given-names": "Alla"
            },
            {
                "surname": "Nizova",
                "given-names": "Nataliya"
            },
            {
                "surname": "Malyuta",
                "given-names": "Ruslan"
            },
            {
                "surname": "Judd",
                "given-names": "Ali"
            },
            {
                "surname": "Thorne",
                "given-names": "Claire"
            },
            {
                "surname": "Bailey",
                "given-names": "Heather"
            }
        ],
        "url": "https://f1000research.com/articles/8-323/v2/",
        "doc_id": "8-323",
        "version": 2,
        "ix_counter": 374,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}