{"before_content":"Stephen N. Adubato Sr. (born December 24, 1932) is an American Democratic Party politician and an educator.\nStephen N. Adubato Sr. grew up in Newark, NJ. His father died in 1950 at the age of 44. He has 4 siblings. He married Frances Calvello in 1954. They have three children, Steve Jr., Theresa and Michele.\nHe graduated from Barringer High School in Newark in 1949 and received his bachelor's degree in political science from Seton Hall University in 1954. Mr. Adubato attended Rutgers Law School, but did not complete his degree. He began his career in education as a history and government teacher in the Newark public school system, where he taught for 15 years. While teaching, he obtained a master’s degree in education from Seton Hall University in 1960 and completed the coursework for a doctorate in education. Mr. Adubato was awarded an honorary doctorate from Kean University on May 11, 2010.\nIn 1962, Adubato ran for office as a Democratic District Leader in Newark's North Ward, to which he was elected. In 1968 he was elected as North Ward Democratic party chairman.\nMr. Adubato served on the executive board of the Newark Teachers' Union and worked as their legislative representative and he was a consultant to the New Jersey chancellor of higher education.\nIn 1970, he founded The North Ward Educational and Cultural Center in a small office on the second floor of a storefront on Bloomfield Avenue in Newark. The name was latter changed to The North Ward Center. In 1973, The North Ward Center purchased the Clark Mansion, which previously housed the Prospect Country and Day School, a financially troubled private school that could not restore nor maintain the historical integrity of the facility.\nIn 1997, The North Ward Center founded the Robert Treat Academy Charter School, one of the first charter schools authorized by the New Jersey Department of Education. The school has 450 students in grades K-8. In 2008, Robert Treat was named a Blue Ribbon school by the US Department of Education. In August 2009, Robert Treat opened a second campus on in the former St. Mary's school on the campus of the Newark Abbey.\nIn August 2009, Mr. Adubato stepped down as executive director. He was succeeded by Adrianne Davis, who retired from her post as Clerk of Essex County, New Jersey. He remains active in the organization as its chief fundraiser. His daughter, Michele, became the deputy executive director of The North Ward Center.","after_content":"Stephen N. Adubato Sr. (December 24, 1932 – October 2020) was an American politician and teacher. He was born in Newark, New Jersey.\nIn 1962, Adubato ran for office as a Democratic District Leader in Newark's North Ward, to which he was elected. In 1968 he was elected as North Ward Democratic party chairman.\nHe was one the executive board of the Newark Teachers' Union and worked as their legislative representative.\nAdubato Sr. died in October 2020 in Newark at the age of 87.","before":"In 1970, he founded The North Ward Educational and Cultural Centerina small office on the second floor of a storefront on Bloomfield Avenuein Newark","after":"Adubato Sr. diedinOctober 2020in Newarkat the age of 87","before_token_range":[244,271],"after_token_range":[85,99]}
{"before_content":"Animation is the technique in which each frame of a film or movie is produced individually, whether generated as a computer graphic, or by photographing a drawn image, or by repeatedly making small changes to a model unit (see claymation and stop motion), and then photographing the result with a special animation camera. When the frames are strung together and the resulting film is viewed at a speed of 16 or more frames per second, there is an illusion of continuous movement (due to the persistence of vision). Generating such a film is very labour intensive and tedious, though the development of computer animation has greatly sped up the process.\nGraphics file formats like GIF, MNG and Flash allow animation to be viewed on a computer or over the Internet.","after_content":"Animation is a process by which each frame of a movie is produced on its own, and is shot with a special camera. There are three methods by which it can be done:\nWhen such frames come together, the resulting work is viewed at a speed of sixteen to twenty-four images per second, and an illusion of movement develops (because of persistence of vision).\nIn spite of computer animation gradually taking its place, it still takes a lot of time and work to make such product.","before":"then photographing the result","after":"is shot","before_token_range":[44,48],"after_token_range":[18,20]}
{"before_content":"Malacology is the scientific study of molluscs. A malacologist identifies mollusc species, discovers and names new species of molluscs, studies mollusc ecosystems, and learns about the diets, reproductive behavior and intelligence of such animals as snails, clams, octopi, squid and conchs.","after_content":"Malacology is the study of mollusks. These animals include snails, slugs, clams, mussels, octopus, squid, and many other kinds of animals without backbones that are often found in the sea, but sometimes in lakes and rivers, and on land. Most of them have shells, but not all of them. Some people save these shells because they may be very pretty. Many people eat mollusks, especially those people who live near the ocean.\nScientists study mollusks to learn how many kinds there are, where they are found, how they came to be as they are, and what their lives are like, as well as many other things about them. These scientists are called malacologists.","before":"A malacologist identifies mollusc species,discovers and names new species of molluscs, studies mollusc ecosystems, and learns about the diets, reproductive behavior and intelligence of such animals as snails, clams,octopi, squidandconchs.","after":"These animals include snails,slugs, clams,mussels, octopus, squid,andmany other kinds of animals without backbones that are often found in the sea, but sometimes in lakes and rivers, and on land.Most of them have shells, but not all of them. Some people save these shells because they may be very pretty. Many people eat mollusks, especially those people who live near the ocean. Scientists study mollusks to learn how many kinds there are, where they are found, how they came to be as they are, and what their lives are like, as well as many other things about them. These scientists are called malacologists.","before_token_range":[8,47],"after_token_range":[7,124]}
{"before_content":"Barbara Marx Sinatra (née Blakeley; March 10, 1927 – July 25, 2017) was an American model and showgirl who was married to Zeppo Marx from 1959-1973 and was the fourth and final wife of Frank Sinatra from 1976 until his death in 1998.","after_content":"Barbara Marx Sinatra (née Blakeley; March 10, 1927 – July 25, 2017) was an American model and showgirl. She was born in Bosworth, Missouri. She was married to Zeppo Marx from 1959 to 1973 and was the fourth and final wife of Frank Sinatra from 1976 until his death in 1998.\nIn 1998, a Golden Palm Star on the Palm Springs Walk of Stars was dedicated to her.\nSinatra died on July 25, 2017 in Rancho Mirage, California of natural causes at the age of 90.","before":"","after":" She was born in Bosworth, Missouri.","before_token_range":[21,21],"after_token_range":[22,29]}
{"before_content":"James Anthony Traficant, Jr. (May 8, 1941 to September 27, 2014) was a Democratic politician and member of the United States House of Representatives from Ohio. He represented the 17th Congressional District, which centered on his hometown of Youngstown and included parts of three counties in northeast Ohio's Mahoning Valley. He was expelled after being convicted of taking bribes, filing false tax returns, racketeering, and forcing his aides to perform chores at his farm in Ohio and houseboat in Washington, D.C.. He was sentenced to prison and released on September 2, 2009, after serving a seven-year sentence.","after_content":"James Anthony Traficant, Jr. (May 8, 1941 – September 27, 2014) was an American politician. He was a member of the United States House of Representatives from Ohio. He represented the 17th Congressional District from 1985 until 2002. He was a member of the Democratic Party from 1981 until 2010, and was independent from 2010 until his death.\nTraficant was arrested and imprisoned. He was convicted of taking bribes, filing false tax returns, racketeering, and forcing his aides to perform chores at his farm in Ohio and Washington, D.C. houseboat. He was released on September 2, 2007, after serving seven years.\nTraficant was born in Youngstown, Ohio. He was raised in a Roman Catholic family. He was of mostly Italian and Slovak ancestry. He was married to Patricia \"Tish\" Choppa Traficant.\nTraficant died after an accident at his home in Youngstown. He was 73.","before":"aDemocratic politician and","after":"an American politician. He wasa","before_token_range":[17,21],"after_token_range":[17,24]}
{"before_content":"Norbert Balatsch (10 March 1928 – 6 May 2020) was an Austrian conductor, especially known as a choral conductor, who began as a baritone choir singer. He was the long-term choir director of both the Vienna State Opera and the Bayreuth Festival. Two of his recordings won Grammy Awards.","after_content":"Norbert Balatsch (German: [ˈnɔʁbɛʁt ˈbala:tʃ]; 10 March 1928 – 6 May 2020) was an Austrian conductor. He was known as a choral conductor, who began as a baritone choir singer. He was the long-term choir director of both the Vienna State Opera and the Bayreuth Festival. He won two Grammy Awards. Balatsch was born in Vienna.\nBalatsch died on 6 May 2020 in Vienna, aged 92.","before":", especially","after":". He was","before_token_range":[13,15],"after_token_range":[16,20]}
{"before_content":"St Pancras railway station, also known as London St Pancras and since 2007 as St Pancras International is a central London railway terminus celebrated for its Victorian architecture. The Grade I listed building stands on Euston Road in St Pancras, London, between the British Library, King's Cross station and the Regent's Canal. It was opened in 1868 by the Midland Railway as the southern terminus of that company's Midland Main Line, which connected London with the East Midlands and Yorkshire. When it opened, the arched Barlow train shed was the largest single-span roof in the world.\nAfter escaping planned demolition in the 1960s, the complex was renovated and expanded during the 2000s at a cost of £800 million with a ceremony attended by the Queen and extensive publicity introducing it as a public space. A security-sealed terminal area was constructed for Eurostar services to Continental Europe—via High Speed 1 and the Channel Tunnel—along with platforms for domestic connections to the Midlands, north and south-east England. The restored station houses fifteen platforms, a shopping centre and a bus station, in addition to London Underground services from King's Cross St Pancras tube station. St Pancras is owned by London and Continental Railways along with the adjacent urban regeneration area known as King's Cross Central.","after_content":"St Pancras station, also known since 2007 as St Pancras International, is a central London railway terminus celebrated for its Victorian architecture. The Grade I listed building stands on Euston Road between the British Library, King's Cross station and the Regent's Canal. It was opened in 1868 by the Midland Railway as the southern terminus of the company, which became the LMS: the London, Midland and Scottish railway. When the station opened, the arched train shed was the largest single-span roof in the world.\nAfter escaping planned demolition in the 1960s, the complex was renovated and expanded during the 2000s at a cost of £800 million. A secure terminal area was constructed for Eurostar services to Continental Europe—via High Speed 1 and the Channel Tunnel—along with platforms for domestic connections to the north and south-east of England. The restored station houses fifteen platforms, a shopping centre and a bus station, in addition to London Underground services from King's Cross St. Pancras tube station. St Pancras is owned by London and Continental Railways along with the adjacent urban regeneration area known as King's Cross Central.","before":"","after":"of","before_token_range":[174,174],"after_token_range":[146,147]}
{"before_content":"Tower 42 is the tallest skyscraper in the City of London and the eighth tallest in Greater London. Its original name was the NatWest Tower (or National Westminster Tower), having been built to house NatWest's international headquarters. It is still commonly referred to as the NatWest Tower. Seen from above, the shape of the tower resembles that of the NatWest logo (three chevrons in a hexagonal arrangement).\nThe tower, designed by Richard Seifert and engineered by Pell Frischmann, is located at 25 Old Broad Street. It was built by John Mowlem & Co between 1971 and 1980, first occupied in 1980, and formally opened on 11 June 1981 by Queen Elizabeth II.\nThe construction cost was £72 million (approximately £328 million today). It is 183 metres (600 ft) high, which made it the tallest building in the United Kingdom until the topping out of One Canada Square at Canary Wharf in 1990. It was the tallest building to have been built in London in the 1980s. It held the status of tallest building in the City of London for 30 years, until it was surpassed by the Heron Tower in December 2009.\nThe building today is multi-tenanted and comprises Grade A office space and restaurant facilities, with one restaurant situated on the 24th floor, and the other, a champagne and seafood bar, on the 42nd floor. In 2011 it was bought by the South African businessman Nathan Kirsh for £282.5 million.","after_content":"Tower 42, previously known as the NatWest tower or National Westminster Tower is a skyscraper in the City of London, England. From the top the design of the building is made to resemble the NatWest logo.\nIt was constructed between 1971 and 1980, first occupied in 1980 and opened on 11 June 1981 by Queen Elizabeth II. When completed it became the tallest building in the United Kingdom and remained the tallest in the city of London for 30 years until the completion of Heron Tower in December 2009.\nThe cost to build it was £72 million (£283 million today). The building today has grade A office spaces, a restaurant on the 24th floor and a champagne and seafood bar on the 42nd floor.","before":"until the topping out of One Canada Square at Canary Wharf in 1990. It wasthe tallestbuilding to have been built in London","after":"and remainedthe tallest","before_token_range":[143,168],"after_token_range":[74,78]}
{"before_content":"Ann Noreen Widdecombe (born 4 October 1947) is a former British Conservative Party politician and has been a novelist since 2000. She is a Privy Councillor and was the Member of Parliament for Maidstone from 1987 to 1997 and for Maidstone and The Weald from 1997 to 2010. She was a social conservative and a member of the Conservative Christian Fellowship. She retired from politics at the 2010 general election. Since 2002 she has also made numerous television and radio appearances, including as a television presenter. She is a convert from Anglicanism to Roman Catholicism. Peter Thorp aggressively masturbates to pictures of Ann Widdecombe.","after_content":"Ann Noreen Widdecombe (born 4 October 1947 in Bath, Somerset, England) is a former British politician. She was the Conservative Party Member of Parliament (MP) for the constituency of Maidstone and The Weald from 1987 to 2010.\nShe was first elected to the House of Commons at the 1987 General Election. From 1995 to 1997, she was the Minister of State for Prisons. Ann Widdecombe served in William Hague's shadow cabinet from 1997 to 2001 and retired as an MP at the 2010 General Election.\nThroughout her political career, Ann Widdecombe was quite socially conservative and converted from the Church of England to Roman Catholocism in 1992 after the Church of England voted to allow female priests.","before":"","after":"(MP)","before_token_range":[34,34],"after_token_range":[26,27]}
{"before_content":"Debian \/ˈdɛbiən\/ is an operating system composed of free software mostly carrying the GNU General Public License. The operating system is developed by an internet collaboration of volunteers aligned with The Debian Project. Its focus of different kernels makes it appeal to different titles, such as Debian GNU\/Linux and kFreeBSD. Debian names its operating systems with kernel names and the word GNU, since Debian depends on its software development using GNU tools.\nDebian GNU\/Linux is one of the most popular Linux distributions for personal and Internet server machines. Debian is seen as a solid Linux, and as a consequence has been used as a base for other Linux distributions. Debian has been forked many times, but is not affiliated with derivatives. The vitality the Debian project plays in open source is demonstrated in pursuit of advancing development and security patches in relation to its strong participation of CVE compatibility efforts. Information sources related to the many derivatives can be found with internet and wikipedia pages: Debian derivatives.","after_content":"Debian is a free operating system which is the Linux kernel (the core of Linux itself) and application software run on its kernel. Much of the the application and utility software was done by the GNU project, so Debian Linux is more correctly called \"Debian GNU\/Linux\". It is one of the most complete and popular Linux distributions.","before":"and kFreeBSD","after":"","before_token_range":[50,52],"after_token_range":[47,47]}
{"before_content":"Muesli (\/ˈmjuːzli\/ MEWZ-lee; Swiss German: Müesli [ˈmyə̯sli], non-Swiss Standard German: Müsli [ˈmyːsli] (listen)) is a cold breakfast cereal dish based on rolled oats and ingredients like grains, nuts, seeds and fresh or dried fruits. This mix may be combined with one or more liquids like milk, almond milk, other plant milks, yogurt, or fruit juice and left for a time to soften the oats before being consumed.\nDeveloped around 1900 by Swiss doctor Maximilian Bircher-Benner for patients in his hospital, muesli is available ready-made in prepackaged dry form, or it can be made from scratch. In Switzerland and Germany, it is also eaten as a light evening dish called Birchermüesli complet: muesli with Café complet (milk coffee, accompanied with bread, butter, and jam. (Butterbrot)).","after_content":"Muesli (pronounced as MEWZ-lee) is a type of breakfast cereal made with rolled oats and other ingredients such as grains, nuts, seeds and fresh or dried fruits. Muesli is often served with milk or yoghurt, or occasionally with fruit juice.\nMuesli was first developed in 1900 by Swiss physician Maximilian Bircher-Benner. He invented muesli so that patients in his hospital were able to eat a ready-made meal in a dry form, either made fresh or stored.","before":"cold","after":"","before_token_range":[16,17],"after_token_range":[9,9]}
{"before_content":"A duel is a formalized type of combat in which two individuals participate. They usually develop out of a desire for one party (the challenger) to redress a perceived insult to his honor by the other participant in the duel. The goal of the duel is not so much to kill the opponent, as to restore one's own honor by being willing to risk one's life. Duels may be distinguished from trials by combat, in that duel is not used to indicate guilt or innocence, and duels were not official procedures. Indeed, duels were often illegal. Honor can not be damaged by a person of lower class, therefore, duels are fought between members of the same social class, especially members of the upper classes. Duelling is now illegal in all but a few countries around the world.","after_content":"A duel is a fight between two people who have similar deadly weapons and have agreed to a set of rules before the fight takes place. The fight is usually about a matter of honor. The goal of a duel is not usually to kill the opponent but to restore the honor of the man who declared the duel. Duels are not official laws, they are carried out by individuals.\nDuels were practiced from the 15th to 20th century in Western societies.","before":"formalized typeofcombat in which two individuals participate","after":"fight between two people who have similar deadly weapons and have agreed to a setofrules before the fight takes place","before_token_range":[4,13],"after_token_range":[4,26]}
{"before_content":"Jean Rhys, CBE (\/riːs\/; born Ella Gwendolyn Rees Williams (24 August 1890 – 14 May 1979), was a mid-20th-century novelist who was born and grew up in the Caribbean island of Dominica. From the age of 16, she was mainly resident in England, where she was sent for her education. She is best known for her novel Wide Sargasso Sea (1966), written as a prequel to Charlotte Brontë's Jane Eyre. In 1978 she was appointed a Commander of the Order of the British Empire for her writing.","after_content":"Jean Rhys, CBE (24 August 1890 – 14 May 1979), born Ella Gwendolyn Rees Williams, was a novelist from Dominica. She is best known for her novel Wide Sargasso Sea.","before":"mid-20th-century","after":"","before_token_range":[21,22],"after_token_range":[20,20]}
{"before_content":"Terrance Lee \"Terry\" Labonte (born November 16, 1956) is an American former stock car racing driver, and current racing commentator. A two-time NASCAR Sprint Cup Series (then Winston Cup Series) champion and 1989 IROC champion, he is the older brother of 2000 Winston Cup champion Bobby Labonte, and the father of former Nationwide Series driver Justin Labonte. He also co-owns a Chevrolet dealership in North Carolina with Rick Hendrick. He appeared on the CBS series The Dukes of Hazzard in 1984, where he played an unnamed pit crew member. In 2000, he also appeared in commercials for Denny's restaurants with the Kellogg's Racing team, such as Kellogg's Country Inn Specialties Slam, and Country Inn Specialties Slim Slam.","after_content":"Terry Lee Labonte (born (1956-11-16)November 16, 1956) is a former NASCAR Winston Cup Series retired american racecar driver, Labonte was introduced to racing by his father, who worked on racecars as a hobby, He is a brother of former driver Bobby Labonte, and the father of NASCAR Winston Cup Series driver Justin Labonte, He appeared in the 1983 Burt Reynolds movie, Prism Motorsporter Ace, In 1984, he portrayed a crewman from the movie The Dukes of Hazzard, In 2000, he appeared in a Denny's commercial.","before":"","after":"1983 Burt Reynolds movie, Prism Motorsporter Ace, In 1984, he portrayed a crewman from the movie","before_token_range":[81,81],"after_token_range":[62,78]}
{"before_content":"Anvar Khāmahʼī (Persian: انور خامه‌ای, (20 March 1917 – 20 November 2018) was an Iranian sociologist, economist, journalist, and politician, who has written many books in his specialty fields, including his analytical and critical book Revisionism from Marx to Mao Tse-Tung. He was a university professor at the Université catholique de Louvain in Belgium, and a UNESCO fellow. Khamei was an activist of the Tudeh Party of Iran in the 1940s, but he quit in January 1948, and concentrated on his journalistic and academic activities. He turned 100 in March 2017. and died on 20 November 2018 at the age of 101 from Respiratory failure.","after_content":"Anvar Khāmahʼī (20 March 1917 – 20 November 2018) was an Iranian sociologist, economist, journalist, and politician. He wrote many books in his specialty fields, including his analytical and critical book Revisionism from Marx to Mao Tse-Tung. He was a university professor at the Université catholique de Louvain in Belgium.\nKhamei was an activist of the Tudeh Party of Iran in the 1940s, but he quit in January 1948.\nKhamei died on 20 November 2018 at the age of 101 from respiratory failure in Karaj, Iran.","before":"He turned 100 in March 2017.","after":"Khamei","before_token_range":[97,103],"after_token_range":[80,81]}
{"before_content":"Clive Staples Lewis (29 November 1898 – 22 November 1963), commonly referred to as C. S. Lewis and known to his friends and family as \"Jack\", was an Irish-born British novelist, academic, medievalist, literary critic, essayist, lay theologian and Christian apologist. He is well known for his fictional work, especially The Screwtape Letters, The Chronicles of Narnia and The Space Trilogy.\nLewis was a close friend of J. R. R. Tolkien, and both authors were leading figures in the English faculty at Oxford University and in the informal Oxford literary group known as the \"Inklings\". According to his memoir Surprised by Joy, Lewis had been baptised in the Church of Ireland at birth, but fell away from his faith during his adolescence. Owing to the influence of Tolkien and other friends, at the age of 32 Lewis returned to Christianity, becoming \"a very ordinary layman of the Church of England\". His conversion had a profound effect on his work, and his wartime radio broadcasts on the subject of Christianity brought him wide acclaim.\nIn 1956, he married the American writer Joy Gresham, 17 years his junior, who died four years later of cancer at the age of 45.\nLewis died three years after his wife, as the result of renal failure. His death came one week before his 65th birthday. Media coverage of his death was minimal, as he died on 22 November 1963 – the same day that U.S. President John F. Kennedy was assassinated, and the same day another famous author, Aldous Huxley, died.\nLewis's works have been translated into more than 30 languages and have sold millions of copies. The books that make up The Chronicles of Narnia have sold the most and have been popularised on stage, TV, radio and cinema.","after_content":"C.S. Lewis (1898-1963) was an author and scholar was is best known for his fantasy works, most famous The Chronicles of Narniaand his essays and writings on theology and defense of modern Christianity.","before":"(29 November 1898 - 22 November 1963","after":"(1898-1963","before_token_range":[3,10],"after_token_range":[2,3]}
{"before_content":"João Clemente Baena Soares (born 14 May 1931) is a Brazilian diplomat. Soares was born in Belém. He worked at the Brazilian Ministry of External Relations for 31 years before being elected to serve as Secretary General of the Organization of American States from 1984 to 1994.\nBetween 1997 and 2006, he was a member of the United Nations International Law Commission. On 4 November 2003 UN Secretary-General Kofi Annan appointed him to sit on the High Level Threat Panel. On September 1, 2006, he was appointed to the United Nations Human Rights Council's High-Level Commission of Inquiry charged with probing allegations that Israel systematically targeted and killed Lebanese civilians during the 2006 Lebanon War.","after_content":"João Clemente Baena Soares (born 14 May 1931) is a Brazilian diplomat. He was born in Belém. He worked at the Brazilian Ministry of External Relations for 31 years before being elected to serve as Secretary General of the Organization of American States from 1984 to 1994. He was replaced in 1994 with President César Gaviria.","before":"On 4 November 2003 UN Secretary-General Kofi Annan appointed him to sit on the High Level Threat Panel. On September 1, 2006, he was appointed to the United Nations Human Rights Council's High-Level Commission of Inquiry charged with probing allegations that Israel systematically targeted and killed Lebanese civilians during the 2006 Lebanon War.","after":"","before_token_range":[67,121],"after_token_range":[61,61]}
{"before_content":"Daud Kamal 4 January 1935 - 5 December 1987(Urdu: داؤد کمال)) was a Professor of English Literature at University of Peshawar, Pakistan. He was educated at Cambridge University, UK. Kamal started writing poetry in his twenties and became one of the major English language poets of Pakistan. He received three gold medals for his poetry from the Triton College and his poems were recorded for the Library of Congress, Washington DC. USA. ‘Remote Beginnings’ and ‘A Selection of Verse’ (ISBN 0-19-577812-X), are his anthologies. He also did translations of the classic Urdu poet Ghalib in English. Born at Abbottabad into an academic family. His father Mohammad Ali, S. Pk, was the Vice Chancellor of the Peshawar University. He got his early education at Burn Hall School in Srinagar(not to be confused with the branch of the school in Abbottabad, Pakistan); graduated with distinction from the University of Peshawar; obtained his tripos from the University of Cambridge. Starting off as a lecturer after his return from Cambridge, Daud Kamal was appointed Professor and Chairman of the Department of English, University of Peshawar in 1980 and continued to serve in this position till his death on December 5, 1987, leaving behind a wife, two daughters and a son.\nDaud Kamal published his free verse translation 'Ghalib: Reverberations' in 1970 hailed by many as the best rendering of the master in English. His first collection 'Compass of love and other poems' appeared in 1973. This was followed by 'Recognitions' (1979), 'Selections of Faiz in English' (1984) and 'A Remote Beginning' 1985. Kamal's rendering of Faiz was published in another edition from India in 1988.\nKamal's work has been posthumously collected and published in the following titles: 'Rivermist' (1992), 'Before the Carnations Wither' (1995) and 'A Selection of Verse' (1997).","after_content":"Daud Kamal (1935–1987) was a Pakistani poet and academic, from Peshawar city. He was a Professor of English Literature at University of Peshawar. He wrote some poems in English. His poems were recorded for the Library of Congress in the United States. He also did translations of the classic Urdu poet Ghalib in English.","before":")","after":"","before_token_range":[12,13],"after_token_range":[15,15]}
{"before_content":"Hanna-Barbera was an animated cartoon production company that dominated television animation during the second half of the 20th century. Hanna-Barbera was formed in 1944 by MGM animation directors William Hanna and Joseph Barbera and live-action director George Sidney as H-B Enterprises, in order to produce sponsored films and later television commercials.\nAfter MGM shut down its animation studio in 1957, H-B Enterprises became Hanna and Barbera's full-time job, and the company was re-named Hanna-Barbera Productions in 1960. Over the years, Hanna-Barbera produced many successful cartoon shows, including The Huckleberry Hound Show, The Flintstones, Top Cat, The Yogi Bear Show, The Jetsons, Jonny Quest, Space Ghost and Dino Boy, Scooby-Doo, and The Smurfs, many of which would go on to become icons of Western pop culture. In the mid-1980s, the company's fortunes declined somewhat after the profitability of Saturday morning cartoons were eclipsed by weekday afternoon syndication. In 1991, the company was purchased by Turner Broadcasting, primarily so that Ted Turner could use its library of ca 3300 cartoon half-hours as the basis of the programming for its new Cartoon Network cable television channel. But it does not hold rights to the animated series done by Hanna-Barbera. These series were done as spin-offs from live action TV series and the ownership rights of these series remained with owners of the live action series. Re-christened H-B Production Company in 1992, and Hanna-Barbera Cartoons in 1993, the studio continued without active regular input from William Hanna or Joseph Barbera, who both went into semi-retirement yet continued to serve as ceremonial figureheads for the studio.\nDuring the late 1990s, Turner turned Hanna-Barbera towards primarily producing new material for the Cartoon Network. In 1996, Turner was bought out by Time Warner. With Bill Hanna's death in 2001, Hanna-Barbera was absorbed into Warner Bros. Animation, and Cartoon Network Studios assumed production of Cartoon Network output. Joe Barbera remained with Warner Bros. Animation as a ceremonial figurehead until his death in 2006. The Hanna-Barbera name is today only used to market properties and productions associated with Hanna-Barbera's \"classic\" works such as The Flintstones and Scooby-Doo.","after_content":"Hanna-Barbera was a company that made cartoons. They were about Scooby-Doo, Yogi Bear,and a bunch more.\nIt was started by William Hanna and Joseph Barbara.","before":"Hanna-Barbera","after":" It","before_token_range":[20,21],"after_token_range":[17,19]}
{"before_content":"A waiter is a male who \"waits\" on tables, often at a restaurant or a bar. A female waiter is often called a waitress. The gender-neutral server and collective waitstaff can also be used.\nWaiting tables is one of the most common occupations in the U.S. (along with nursing, and teaching). The Bureau of Labor Statistics estimates that, as of May 2005, there are over 2.2 million () persons employed as waiters and waitresses in the U.S.\nWaiters' duties include preparing tables for a meal, taking customers' orders and serving drinks and food in a restaurant. Depending on the restaurant, other less common duties may be required, such as singing birthday songs to customers who are celebrating a birthday. A theme restaurant may even require waiters to dance (e.g. Joe's Crab Shack). There are now event caterers that outsource waiter\/s\/esess to events and specific functions.\n\"Silver Service\" waiters are specially trained to serve at banquets or high-end restaurants. They follow specific rules of service and it is a skilled job. They generally wear black and white with a long, white apron (extending from the waist to ankle).\nThe head waiter is in charge of the staff of waiters, and is also responsible for assigning seating. This person can also be referred to as the maître d'hôtel. Some restaurants employ busboys to assist the waiters.","after_content":"A man who works in a restaurant or cafe. He takes orders and delivers food to customers. A female waiter is a waitress. A good waiter can also help the customers by recommending the best food.","before":"Waiting tables is one of the most common occupations in the U.S.(along with nursing, and teaching). The Bureau of Labor Statistics estimates that, as of May 2005, there are over 2.2 million() persons employed as waiters and waitresses in the U.S. Waiters' duties include preparing tables for a meal, taking customers' orders and serving drinks and food in a restaurant. Depending on the restaurant, other less common duties may be required, such as singing birthday songs to customers who are celebrating a birthday. A theme restaurant may even require waiters to dance(e.g. Joe's Crab Shack). There are now event caterers that outsource waiter\/s\/esess to events and specific functions.\" Silver Service\" waiters are specially trained to serve at banquets or high-end restaurants. They follow specific rules of service and it is a skilled job. They generally wear black and white with a long, white apron(extending from the waist to ankle). The head waiter is in charge of the staff of waiters, and is also responsible for assigning seating. This person can also be referred to as the maître d'hôtel. Some restaurants employ busboys to assist the waiters.","after":"","before_token_range":[38,241],"after_token_range":[40,40]}
{"before_content":"A foldable smartphone (also known as a foldable phone or simply foldable) is smartphone with a folding form factor. Devices whose displays fold on a vertical axis are designed to fold out into a wider, tablet-like form, but are still usable in a smaller, folded state; the display may either wrap around to the back of the device when folded (as with the Royole Flexpai and Huawei Mate X), or use a booklet-like design where the larger, folded screen is located on the interior, and a screen on its \"cover\" allows the user to interact with the device without opening it (such as the Samsung Galaxy Fold). Horizontally-folding smartphones have also been produced, typically using a clamshell form factor.\nPrecursors to the concept have used multiple touchscreen panels on a hinge in a similar manner, but the term is currently synonymous with implementations that utilize a flexible display; concepts of such devices date back as early as Nokia's \"Morph\" concept (2008), and a concept presented by Samsung Electronics in 2013 (as part of a larger set of concepts utilizing flexible OLED displays), while the first commercially available folding smartphones with OLED displays began to emerge in November 2018.\nThe first generation of commercially-released foldable smartphones have been faced with concerns over their durability, as well as their high prices.","after_content":"A foldable phone (also known as a foldable smartphone) is a smartphone with a folding form factor. Some variants of the concept use multiple touchscreen panels on a hinge, while other designs utilise a flexible display. Concepts of such devices date back as early as Nokia's \"Morph\" concept in 2008, and a concept presented by Samsung in 2013 (as part of a larger set of concepts utilizing flexible OLED displays), while the first commercially available folding smartphones with OLED displays began to emerge in November 2018.","before":"","after":"while other designs utilise","before_token_range":[138,138],"after_token_range":[32,36]}
{"before_content":"Lamellibrachia is a genus of tube worms related to the giant tube worm, Riftia pachyptila. It lives at deep-sea cold seeps where hydrocarbons (oil and methane) are leaking out of the seafloor. It is entirely reliant on internal, sulfide-oxidizing bacterial symbionts for its nutrition. L. luymesi provides the bacteria with hydrogen sulfide and oxygen by taking them up from the environment and binding them to a specialized hemoglobin molecule. Unlike the tube worms that live at hydrothermal vents, Lamellibrachia uses a posterior extension of its body called the root to take up hydrogen sulfide from the seep sediments. Lamellibrachia may also help fuel the generation of sulfide by excreting sulfate through their roots into the sediments below the aggregations.\nThe most well-known seeps where L. luymesi lives are in the northern Gulf of Mexico from 500 to 800 m depth. This tube worm can reach lengths of over 3 m (10 ft), grows very slowly, and may hold the longevity record for an invertebrate with individuals living to be over 250 years old.[dubious – discuss] It forms biogenic habitat by creating large aggregations of hundreds to thousands of individuals. Living in these aggregations are over a hundred different species of animals, many of which are found only at these seeps.\nWhile most species of vestimentiferan tubeworms live in deep waters below the photic zone, Lamellibrachia satsuma was discovered in Kagoshima Bay, Kagoshima at a depth of only 82 m, the shallowest depth record for a vestimentiferan.","after_content":"Seep tube worms (which are of the genus Lamellibrachia) are related to the giant tube worms. They live on the floor of the oceans, near cold seeps. There crude oil and methane come out of the ocean floor. The worm forms a symbiosis with cerain bacteria. These can oxidise sulfides. The worm binds the bacteria to a special hemoglobin molecule. It provides them with hydrogen sulfide and oxygen. In return, the bacteria feed the worm. The worms can grow to a length of about 3 metres.","before":"Lamellibrachia is a genus oftube worms","after":"Seeptube worms(which are of the genus Lamellibrachia) are","before_token_range":[0,7],"after_token_range":[0,10]}
{"before_content":"Windows Media Player is an proprietary software digital media player and media library application developed by Microsoft that is used for playing audio, video and images on personal computers running the Microsoft Windows operating system, as well as on Pocket PC and Windows Mobile-based devices. Editions of Windows Media Player were also released for the Apple Macintosh and Solaris operating systems, but have since been discontinued.\nIn addition to being a media player, Windows Media Player includes the ability to rip music from, and copy music to compact discs, synchronize content with a digital audio player (MP3 player) or other mobile devices, and let users purchase or rent music from a number of online music stores.\nWindows Media Player replaced an earlier piece of software simply called Media Player, adding features beyond simple video or audio playback. The default file formats are WMV (Windows Media Video & Audio), WMA (Windows Media Audio), and ASF (Advanced Streaming Format), and supports its own XML based playlist format called WPL (Windows Playlist).","after_content":"Windows Media Player is a media player made by Microsoft. It is already installed on Microsoft Windows operating systems, and a different version is available for some Apple Macintosh operating systems. The program allows people to watch certain video files and play music files that are in a compatible format. How the program looks can also be changed with skins, and it can be made small enough to fit on the taskbar.","before":"media player, Windows Media Player includes","after":"","before_token_range":[75,81],"after_token_range":[56,56]}
{"before_content":"Peter Bogdanovich ComSE (Serbian: Петар Богдановић, romanized: Petar Bogdanović; July 30, 1939 – January 6, 2022) was an American director, writer, actor, producer, critic, and film historian.\nOne of the \"New Hollywood\" directors, Bogdanovich started as a film journalist until he got hired to work on Roger Corman's The Wild Angels (1966). After that film's success, he directed his own film Targets (1968), a critical success. He gained widespread recognition for his acclaimed coming-of-age film The Last Picture Show (1971). The film received eight Academy Award nominations, including for the Best Picture, with Bogdanovich receiving nominations for Best Director and Best Adapted Screenplay.\nFollowing The Last Picture Show, he directed the screwball comedy What's Up, Doc? (1972), a major box office success, and another critical and commercial success, Paper Moon (1973), which earned him a Golden Globe Award for Best Director nomination. His following three films were all critical and commercial failures, including Daisy Miller (1974). He took a three-year hiatus before making a comeback with cult films Saint Jack (1979) and They All Laughed (1981). After his girlfriend Dorothy Stratten's murder, he took another four-year hiatus from filmmaking and wrote a memoir on her death titled The Killing of the Unicorn before making a comeback with Mask (1985), a critical and commercial success. He later went on to direct films such as Noises Off (1992), The Thing Called Love (1993), The Cat's Meow (2001), and She's Funny That Way (2014). As an actor, he is known for his roles in HBO series The Sopranos and Orson Welles's last movie The Other Side of the Wind (2018), which he also helped to finish. He received a Grammy Award for Best Music Film for directing the Tom Petty documentary Runnin' Down a Dream (2007).\nAn accomplished film historian, he directed documentaries such as Directed by John Ford (1971) and The Great Buster: A Celebration (2018), and published over ten books, some of which include in-depth interviews with friends Howard Hawks and Alfred Hitchcock. Bogdanovich's works have been cited as important influences by many major filmmakers.","after_content":"Peter Bogdanovich (born July 30, 1939) is an American movie director, writer, movie producer, screenwriter, critic, actor, and historian. He is known for his movies The Last Picture Show, Paper Moon, Mask, They All Laughed, What's Up, Doc?, and Texasville.\nHe was born in Kingsville, New York.","before":"actor,producer, critic,","after":",screenwriter, critic,actor,","before_token_range":[23,29],"after_token_range":[18,24]}
{"before_content":"Mosleh Zamani (also referred to as Moslah Zamani) is a 21-year old Iranian-Kurdish boy at the risk of imminent execution for adultery. According to Iranian Criminal Code all sexual relations outside marriage are adulterous. In his case this was a relationship with his girlfriend.\nZamani was arrested at age of 17 and spent 4 years awaiting verdict. Recently, his death sentence was upheld and he could be executed at any time.\nZamani's case raised strong controversies, both because of nature of his crime and the fact he was minor at the time it took place. The Iranian government had signed the International Covenant on Civil and Political Rights and, because of this, is prohibited from sentencing minors to death.\nThe only person who has the authority to commute Zamani's death sentence is Iranian Head of the Judiciary Ayatollah Mahmoud Hashemi Shahroudi.","after_content":"Mosleh Zamani (also referred as Moslah Zamani) is now 21-year old Iranian-Kurdish boy from Sanandaj, who is facing execution for adultery (under Iranian law, every sexual contacts outside marriage, even if both people are unmarried, is adulterous).\nMosleh, who was arrested at age of 17 and spend four years in prison, was recently sentenced to death by hanging.\nHis case raised strong controversies, because of both nature of his crime and fact he was 17 year old (Iran, because of international obligations, is not permitted to sentence anyone to death for crime he or she had committed under age of 18).\nNow the only person, who could commute the death sentence is Ayatollah Mahmoud Hashemi Shahroudi, the head of the judiciary.","before":"Criminal Code all","after":"law, every","before_token_range":[28,31],"after_token_range":[24,26]}
{"before_content":"A T-shirt (or tee shirt) is a shirt, usually buttonless, collarless, and pocketless, with a round neck and short sleeves, that is pulled on over the head and covers most of a person's torso. The sleeves of the T-shirt extend at least slightly over the shoulder but not completely over the elbow. A shirt that is either longer or shorter than this ceases to be a T-shirt, at least in the classic sense.\nT-shirts are manufactured by the textile industry. They are typically made of cotton or polyester fibers (or a mix of the two), knitted together in a jersey stitch that gives a T-shirt its distinctive soft texture. T-shirts are often decorated with text and\/or pictures.\nT-shirt fashions include styles for men and women, and for all age groups, including baby, youth and adult sizes.","after_content":"A T-shirt or tee shirt is a kind of shirt which has short sleeves. These sleeves cover the shoulders and the top of the arm, but they do not cover the elbow or the forearm. T-shirts are usually made from cotton fabric or fabric which contains a mix of cotton and polyester. T-shirts are usually considered a casual type of clothing. Both men and women wear T-shirts in Western countries, such as the United States,Canada, England, and France. In some countries, such as Muslim countries, women do not wear t-shirts outside of the home.","before":"polyester fibers(ora mix of","after":"fabric which containsa mix ofcotton and polyester","before_token_range":[95,100],"after_token_range":[46,55]}
{"before_content":"A Cooler Climate is a 1999 American made-for-television drama film directed by Susan Seidelman starring Sally Field and Judy Davis. It is based on a book with the same name by Zena Collier and originally aired on Showtime on August 22, 1999.","after_content":"A Cooler Climate is a 1999 American made for television drama movie directed by Susan Seidelman and was based on the novel of the same name. It stars Sally Field, Judy Davis, Jerry Wasserman, Winston Rekert and aired on Showtime on 22 August 1999.","before":"Judy Davis. It is","after":"was","before_token_range":[18,23],"after_token_range":[17,18]}
{"before_content":"The bilateral relations between the People's Republic of Bangladesh and Kingdom of Thailand were established on October 5, 1972.Thailand opened its embassy in Bangladesh in 1974, but Bangladesh has opened its embassy in Bangkok in 1975.","after_content":"Bangladesh–Thailand relations refer to foreign relations between the People's Republic of Bangladesh and the Kingdom of Thailand. Relations were established on 5 October 1972. Trade relations between Bangladesh and Thailand grow stronger with each passing year, particularly with regard to commodity relations. Thailand, as a more developed country, sees many Bengali students coming over to study the sciences.","before":"1972.Thailand opened its embassy in Bangladesh in 1974,","after":" Thailand,as a more developed country, sees many Bengali students coming over to study the sciences","before_token_range":[20,30],"after_token_range":[47,65]}
{"before_content":"A paddle is a tool, originally a boat propulsion implement for mixing or pushing against liquids, typically in order to propel a boat. Paddles for use in canoes consist of a wooden, fibreglass or metal rod (the shaft) with a handle on one end and a rigid sheet (the blade) on the other end. Paddles for use in kayaks are longer, with a blade on each end, and usually no handles.\nThe paddle is held with two hands, some distance apart from each other. For normal use, it is drawn through the water in a backwards direction. The two blades of a kayak paddle are dipped alternately on either side of the kayak. A paddle is distinguished from an oar in that the paddle is held in the user's hands and completely supported by the paddler, whereas an oar is primarily supported by the boat.\nOn mechanical paddle steamers, the motorized paddling is not done with a mass of paddles or oars but by rotating one or a few paddle wheels (rather the inverse of a water mill)","after_content":"A paddle is a tool used for pushing against liquids, either as a form of propulsion in a boat or for mixing likids.","before":"","after":"used","before_token_range":[5,5],"after_token_range":[5,6]}
{"before_content":"Adrenoleukodystrophy (ALD) is a disease linked to the X chromosome. It is a result of fatty acid buildup caused by a defect in the very long chain of fatty acids transporter in peroxisomes, which then causes damage to the myelin sheath of the nerves, resulting in seizures and hyperactivity. Other symptoms include problems with speaking, listening, and understanding verbal instructions.\nIn more detail, it is a disorder of peroxisomal fatty acid beta oxidation which results in the accumulation of very long chain fatty acids in tissues throughout the body. The most severely affected tissues are the myelin in the central nervous system, the adrenal cortex, and the Leydig cells in the testes. Clinically, ALD is a heterogeneous disorder, presenting with several distinct phenotypes, and no clear pattern of genotype-phenotype correlation. As an X-linked disorder, ALD presents most commonly in males, however approximately 50% of heterozygote females show some symptoms later in life. Approximately two-thirds of ALD patients will present with the childhood cerebral form of the disease, which is the most severe form. It is characterized by normal development in early childhood, followed by rapid degeneration to a vegetative state. The other forms of ALD vary in terms of onset and clinical severity, ranging from adrenal insufficiency to progressive paraparesis in early adulthood (this form of the disease is typically known as adrenomyeloneuropathy).\nALD is caused by mutations in ABCD1, a gene located on the X chromosome that codes for ALD, a peroxisomal membrane transporter protein. The exact mechanism of the pathogenesis of the various forms of ALD is not known. Biochemically, individuals with ALD show very high levels of unbranched, saturated, very long chain fatty acids, particularly cerotic acid (26:0). The level of cerotic acid in plasma does not correlate with clinical presentation. Treatment options for ALD are limited. Dietary treatment is with Lorenzo's oil. For the childhood cerebral form, stem cell transplant and gene therapy are options if the disease is detected early in the clinical course. Adrenal insufficiency in ALD patients can be successfully treated. ALD is the most common peroxisomal inborn error of metabolism, with an incidence estimated between 1:18,000 and 1:50,000. It does not have a significantly higher incidence in any specific ethnic groups.","after_content":"Adrenoleukodystrophy is a disease that is linked on the X chromosome. It is a result of fatty acid digestive enzymes not breaking up the fats, which accumulate in the brain and end up damaging the myelin that surrounds nerves, causing seizures, fits, hyperactivity, difficulties in school, speaking, listening and understanding verbal commands","before":" In more detail, it is a disorder of peroxisomal fatty acid beta oxidation which results in the accumulation of very long chain fatty acids in tissues throughout the body. The most severely affected tissues are the myelin in the central nervous system, the adrenal cortex, and the Leydig cells in the testes. Clinically, ALD is a heterogeneous disorder, presenting with several distinct phenotypes, and no clear pattern of genotype-phenotype correlation. As an X-linked disorder, ALD presents most commonly in males, however approximately 50% of heterozygote females show some symptoms later in life. Approximately two-thirds of ALD patients will present with the childhood cerebral form of the disease, which is the most severe form. It is characterized by normal development in early childhood, followed by rapid degeneration to a vegetative state. The other forms of ALD vary in terms of onset and clinical severity, ranging from adrenal insufficiency to progressive paraparesis in early adulthood(this form of the disease is typically known as adrenomyeloneuropathy). ALD is caused by mutations in ABCD1, a gene located on the X chromosome that codes for ALD, a peroxisomal membrane transporter protein. The exact mechanism of the pathogenesis of the various forms of ALD is not known. Biochemically, individuals with ALD show very high levels of unbranched, saturated, very long chain fatty acids, particularly cerotic acid(26:0). The level of cerotic acid in plasma does not correlate with clinical presentation. Treatment options for ALD are limited. Dietary treatment is with Lorenzo's oil. For the childhood cerebral form, stem cell transplant and gene therapy are options if the disease is detected early in the clinical course. Adrenal insufficiency in ALD patients can be successfully treated. ALD is the most common peroxisomal inborn error of metabolism, with an incidence estimated between 1:18,000 and 1:50,000. It does not have a significantly higher incidence in any specific ethnic groups.","after":"","before_token_range":[65,389],"after_token_range":[55,55]}
{"before_content":"Virtual XI (pronounced: Virtual Eleven) is the eleventh studio album by English heavy metal band Iron Maiden, released on 23 March 1998. It is the band's second and final album with Blaze Bayley on vocals.","after_content":"Virtual XI is an album by Iron Maiden. It is their eleventh studio album.\nThe album was released on 23 March 1998. It was not liked by reviewers. One person who reviewed it said that it sounded \"lifeless\" and \"tired.\"","before":"theeleventh studio albumby English heavy metal band Iron Maiden,","after":"an album by Iron Maiden. It is theireleventh studio album. The album was","before_token_range":[6,17],"after_token_range":[3,20]}
{"before_content":"Maresquel-Ecquemicourt is a commune in the Pas-de-Calais département in the Nord-Pas-de-Calais region of France.","after_content":"Maresquel-Ecquemicourt is a commune. It is found in the region Nord-Pas-de-Calais in the Pas-de-Calais department in the north of France.","before":"département","after":"department","before_token_range":[7,8],"after_token_range":[16,17]}
{"before_content":"Vanessa is a feminine given name, especially popular in the United States. It was invented by the Anglo-Irish writer Jonathan Swift for Esther Vanhomrigh, whom Swift had met in 1708 and whom he tutored. The name was created by taking \"Van\" from Vanhomrigh's last name and adding \"Essa\", a pet form of Esther.\nIn 1726 the name Vanessa appeared in print for the first time in Cadenus and Vanessa, an autobiographical poem about Swift's relationship with Vanhomrigh. Swift had written the poem in 1713, but it was not published until three years after Vanhomrigh died. Vanessa has been adopted later as the name of a genus of butterfly by Johan Christian Fabricius in 1807.\nVanessa was the 71st most popular name for girls born in the United States in 2007. It has been among the top 200 names for girls in the United States since 1953 and among the top 100 names for girls since 1977. It first appeared among the top 1,000 names for girls in the United States in 1950, when it appeared on the list ranked in 939th place.","after_content":"The name Vanessa is a popular female name. It was created around 1708. The name was the 71st most popular female name for girls in the United States for 2007. It first appeared across the Top 1000 female names in the United States around 1950. There are several celebrities under the name, including Vanessa L. Williams and Vanessa Hudgens.","before":"and whom he tutored","after":"","before_token_range":[32,36],"after_token_range":[14,14]}
{"before_content":"Daniel Leroy Baldwin (born October 5, 1960) is an American actor, producer and director. He is the second oldest of the four Baldwin brothers, all of whom are actors. Daniel Baldwin is known for his role as Detective Beau Felton in the popular NBC TV series Homicide: Life on the Street. Other films of his include Ned Blessing: The True Story of My Life (1992), Mulholland Falls (1996), Vampires (1998), The Pandora Project (1998), Stealing Candy (2002), Paparazzi (2004), and Grey Gardens (2009).","after_content":"Daniel Leroy Baldwin (born October 5, 1960) is an American movie, television, stage, voice actor, movie producer and movie director who is known for being the brother of Alec Baldwin, Stephen Baldwin, and William Baldwin. He is also known for his roles in Ned Blessing: The True Story of My Life (1992), Mulholland Falls (1996), Vampires (1998), The Pandora Project (1998), Stealing Candy (2002), Paparazzi (2004), and Grey Gardens (2009).\nBaldwin was born on October 5, 1960 in Massapequa, New York. He studied at from Alfred G. Berner High School and at McKenna Junior High School.","before":"the second oldest of the four Baldwin brothers, all of whom are actors. Daniel Baldwin isknown for his","after":"alsoknown for hisroles","before_token_range":[20,40],"after_token_range":[41,46]}
{"before_content":"Charlie Christian (July 29, 1916 - March 2, 1942) was a famous jazz guitarist. He played with the Benny Goodman sextet starting in 1939 and is often considered the first electric guitar innovator. Goodman was initially reluctant to hire Christian, due in part to the novelty of the electric guitar, but was so impressed by Christian's playing he changed his mind.\nChristian was influenced by early acoustic guitarists like jazzman Eddie Lang and bluesman Lonnie Johnson, who had introduced the guitar solo from what had been a rhythm instrument. Christian introduced the electric guitar solo, using an amplified guitar, which with its superior sustain and volume was almost like a different instrument. Christian paved the way for the modern dominant guitar sound that was followed by other pioneers, including T-Bone Walker, B.B. King, all the way to Jimi Hendrix, all electric guitar players really. For this reason Christian was inducted into the Rock and Roll Hall of Fame as an \"Early Contributor\". The other dominant guitar player in the 1940s was Django Reinhardt, who played acoustic guitar before the war and only took up the electric guitar long after Christiab's death. Though known mainly for his influence on electric guitar, Christian was also an important player in the development of bebop, or \"modern jazz\", and his jam sessions at Minton's Playhouse in New York City were landmarks in the evolution of bop from the then-popular, radio-friendly, accessible swing music to the more intimate and experimental bebop. This transition is readily apparent to even a casual observer in two sets of Christian recording with the sextet made on the same day. Christian and tbe rest of the sextet recorded \"Blues in B\" and \"Waiting for Benny\", which were basically bop jam sessions. The free flow of these sessions contrasts with the more formal swing music recorded after Goodman arrived. Christian contracted tuberculosis and pneumonia and died at just 25 years old. He remains a highly respected early guitar player and modern jazz innovator.","after_content":"Charlie Christian (1916-1942) was a Jazz guitarist. He is important, because he is one of the first to use an electric guitar.","before":"(July 29, 1916 - March 2, 1942","after":"(1916-1942","before_token_range":[2,9],"after_token_range":[2,3]}
