{"before_context":"Al-Nusra Front or Jabhat al-Nusra (Arabic: جبهة النصرة), known as the Jabhat Fateh al-Sham (Arabic: جبهة فتح الشام, transliteration: Jabhat Fataḥ al-Šām) after July 2016, and also described as al-Qaeda in Syria or al-Qaeda in the Levant, is a Salafist jihadist organization fighting against Syrian government forces in the Syrian Civil War, with the aim of establishing an Islamic state in the country. The group announced its formation on 23 January 2012.\nThe United States designated Jabhat al-Nusra as a foreign terrorist organization, followed by the United Nations Security Council and many other countries. It was the official Syrian branch of al-Qaeda until July 2016, when it ostensibly split.\nIn early 2015, the group became one of the major components of the powerful jihadist joint operations room named the Army of Conquest, which took over large territories in Northwestern Syria. It also operates in neighbouring Lebanon. In November 2012, The Washington Post described al-Nusra as the most successful arm of the rebel forces.\nIn July 2016, al-Nusra formally separated from al-Qaeda and re-branded as Jabhat Fateh al-Sham (\"Front for the Conquest of the Levant\").\nOn 28 January 2017, following violent clashes with Ahrar al-Sham and other rebel groups, al-Nusra Front merged with four other groups to become Tahrir al-Sham.\nAs of February 2018 they're called Olive Branch Operations Room.","after_context":"Al-Nusra Front or Jabhat al-Nusra (Arabic: جبهة النصرة), known as the Jabhat Fateh al-Sham (Arabic: جبهة فتح الشام, transliteration: Jabhat Fataḥ al-Šām) after July 2016, and also described as al-Qaeda in Syria or al-Qaeda in the Levant, is a Salafist jihadist organization fighting against Syrian government forces in the Syrian Civil War, with the aim of establishing an Islamic state in the country. The group announced its formation on 23 January 2012.The United States designated Jabhat al-Nusra as a foreign terrorist organization, followed by the United Nations Security Council and many other countries. It was the official Syrian branch of al-Qaeda until July 2016, when it ostensibly split.In early 2015, the group became one of the major components of the powerful jihadist joint operations room named the Army of Conquest, which took over large territories in Northwestern Syria. It also operates in neighbouring Lebanon. In November 2012, The Washington Post described al-Nusra as the most successful arm of the rebel forces.In July 2016, al-Nusra formally separated from al-Qaeda and re-branded as Jabhat Fateh al-Sham (\"Front for the Conquest of the Levant\").On 28 January 2017, following violent clashes with Ahrar al-Sham and other rebel groups, Jabhat Fateh al-Sham merged with four other groups to become Tahrir al-Sham.","before_sentence":"On 28 January 2017, following violent clashes with Ahrar al-Sham and other rebel groups, al-Nusra Front merged with four other groups to become Tahrir al-Sham.","after_sentence":"In November 2012, The Washington Post described al-Nusra as the most successful arm of the rebel forces.In July 2016, al-Nusra formally separated from al-Qaeda and re-branded as Jabhat Fateh al-Sham(\" Front for the Conquest of the Levant\").On 28 January 2017, following violent clashes with Ahrar al-Sham and other rebel groups, Jabhat Fateh al-Sham merged with four other groups to become Tahrir al-Sham.","before":"al-Nusra Front","after":"Jabhat Fateh al-Sham","before_sentence_token_range":[212,240],"label":"nonsim_fact_correction"}
{"before_context":"Gudrun Pausewang (born 3 March 1928 in Mladkov) is a German writer for children and teens. She is also noted in science fiction for Young-Adult novels such as The Last Children of Schewenborn.\nGudrun Pausewang was born in Eastern Bohemia of German ancestry. After World War II her family settled in the former West Germany. She later became a teacher and taught in Germany's foreign school services in South America. She has won several awards including the Bundesverdienstkreuz \"Federal Cross of Merit\"). She has written 86 novels; many of them touch on the Third World and environmental concerns.\nIn 1988, her novel Die Wolke (The Cloud) won the Deutscher Jugendliteraturpreis (\"German Youth Literature Prize\"), the Kurd-Laßwitz-Preis (\"Kurd Lasswitz Prize\"), and the Deutscher Science Fiction Preis (\"German Science Fiction Prize\") for Best Novel.\nHer novel Dark Hours was included in the New York Public Library’s 2007 list of Books for the Teen Age Reader, and the\nTexas Library Association's 2007-2008 Tayshas High School Reading List, and received the Silver Medal in Juvenile\/Young Adult Fiction from the Independent Publisher Book Awards.","after_context":"Gudrun Pausewang (born 3 March 1928) is a German writer for children and teens. She is also known in science fiction for Young-Adult novels such as The Last Children of Schewenborn. She was born in Mladkov, Germany. In 1988, her novel Die Wolke (The Cloud) won the Deutscher Jugendliteraturpreis (\"German Youth Literature Prize\"), the Kurd-Laßwitz-Preis (\"Kurd Lasswitz Prize\"), and the Deutscher Science Fiction Preis (\"German Science Fiction Prize\") for Best Novel.","before_sentence":"Gudrun Pausewang was born in Eastern Bohemia of German ancestry.","after_sentence":"She was born in Mladkov, Germany.","before":"Eastern Bohemia of German ancestry.","after":"Mladkov,","before_sentence_token_range":[36,47],"label":"nonsim_fact_correction"}
{"before_context":"The International Statistical Classification of Diseases and Related Health Problems (most commonly known by the abbreviation ICD) is a medical classification that provides codes to classify diseases and a wide variety of signs, symptoms, abnormal findings, complaints, social circumstances, and external causes of injury or disease. Under this system, every health condition can be assigned to a unique category and given a code, up to six characters long. Such categories can include a set of similar diseases.\nThe International Classification of Diseases is published by the World Health Organization (WHO) and used worldwide for morbidity and mortality statistics, reimbursement systems, and automated decision support in medicine. This system is designed to promote international comparability in the collection, processing, classification, and presentation of these statistics. The ICD is a core classification of the WHO Family of International Classifications (WHO-FIC).\nThe ICD is revised periodically and is currently in its tenth edition. The ICD-10, as it is therefore known, was developed in 1992 to track mortality statistics. ICD-11 is planned for 2015 and will be revised using Web 2.0 principles. Annual minor updates and triennial major updates are published by the WHO. The ICD is part of a \"family\" of guides that can be used to complement each other, including also the International Classification of Functioning, Disability and Health which focuses on the domains of functioning (disability) associated with health conditions, from both medical and social perspectives.","after_context":"The International Statistical Classification of Diseases and Related Health Problems (also known as ICD) is a list of codes that classify diseases and medical problems. A special, unique code is given to:\nICD is published by the World Health Organization. One of the ICD's goals is to make sure that different doctors - and different countries - are using the same diagnoses. This makes it easier to compare how diseases affect different countries. The ICD has been changed and updated many times. The most recent edition is the ICD-11. ICD-11 has been adopted by the World Health Assembly of WHO for use starting 1 January 2022 It has been revised using Web 2.0.","before_sentence":"The ICD-10, as it is therefore known, was developed in 1992 to track mortality statistics.","after_sentence":"ICD-11 has been adopted by the World Health Assembly of WHO for use starting 1 January 2022 It has been revised using Web 2.0.","before":"is planned for 2015 and will be revised using Web 2.0 principles","after":"has been adopted by the World Health Assembly of WHO for use starting 1 January 2022 It has been revised using Web 2.0","before_sentence_token_range":[172,190],"label":"nonsim_fact_correction"}
{"before_context":"Malcolm Elmore Beard (born February 21, 1919) is an American former politician in the state of Florida.\nBeard was born in 1919 in Moultrie, Georgia. He moved to Florida with his family in 1924 and later attended the University of Tampa. Beard then worked for the Tampa Police Department until he was elected sheriff of Hillsborough County in 1964. He served as sheriff until 1978. Beard served in the Florida House of Representatives from 1978 to 1980.\nIn 1979, he was elected to the State Senate for the 22nd district, and he served until 1996. In 1985, he changed districts and parties, sitting for the 23rd district as a Republican. The Hillsborough County Sheriff’s Office's Malcolm E. Beard Sheriff’s Operations Center was named after him in 2013.","after_context":"Malcolm Elmore Beard (February 21, 1919 – January 2, 2019) was an American politician. He was born in Moultrie, Georgia. A Republican from 1985 until his death. Before he was a Democrat. From 1978 to 1980, he was a member of the Florida House of Representatives. From 1980 to 1996, he was a member of the Florida Senate.\nBeard died on January 2, 2019 in Tampa, Florida at the age of 99.","before_sentence":"Beard served in the Florida House of Representatives from 1978 to 1980. In 1979, he was elected to the State Senate for the 22nd district, and he served until 1996.","after_sentence":"From 1980 to 1996, he was a member of the Florida Senate.","before":" In 1979","after":"","before_sentence_token_range":[73,107],"label":"nonsim_fact_correction"}
{"before_context":"William Leonard Roberts II (born January 28, 1976), better known by his stage name Rick Ross, is an American rapper. Rick Ross founded the record label Maybach Music Group, on which he released his studio albums Deeper Than Rap (2009), Teflon Don (2010), and God Forgives, I Don't (2012). Ross was also the first artist signed to Diddy's management company Ciroc Entertainment. In early 2012, MTV named Ross as the Hottest MC In The Game.","after_context":"William Roberts Leonard II, better known by the stage name Rick Ross, is an American rapper. He is the founder of Maybach Music Group. This group has helped release three of Ross' albums, including Deeper Than Rap (2009), Teflon Don (2010), and God Forgives, I Don't (2013). MTV named him the \"Hottest MC in the Game\" in 2012.","before_sentence":"Rick Ross founded the record label Maybach Music Group, on which he released his studio albums Deeper Than Rap(2009), Teflon Don(2010), and God Forgives, I Don't(2012).","after_sentence":"This group has helped release three of Ross' albums, including Deeper Than Rap(2009), Teflon Don(2010), and God Forgives, I Don't(2013).","before":"(2012","after":"(2013","before_sentence_token_range":[25,63],"label":"nonsim_fact_correction"}
{"before_context":"Lake Laberge is a widening of the Yukon River north of Whitehorse, Yukon in Canada. It is fifty kilometres long and ranges from two to five kilometres wide. Its water is always very cold, and its weather often harsh and suddenly variable.\nThe Tagish knew it as Kluk-tas-si, and the Tlingit as Tahini-wud. Its English name comes from 1870 commemorating Michel LaBerge (1836–1909) - born in Chateauguay, Quebec, the first French-Canadian to explore the Yukon in 1866. It was well-known to prospectors during the Klondike Gold Rush of the 1890s, as they would pass Lake Laberge on their way down the Yukon River to Dawson City. Jack London's Grit of Women (1900) and The Call of the Wild (1903), and Robert W. Service's poem \"The Cremation of Sam McGee\" (1907) mention the lake.\nDuring the late 19th and early 20th centuries, after-winter steamers carrying goods on Lake Laberge early on in the shipping season regarded the lake as trouble, since it was one of the last such passages to thaw its ice. At least two methods were employed to break the ice up:\nA sign posted in 1999 at Lake Laberge's camping area issued strong cautions against eating the livers of burbot, and counseled against the consumption of lake trout more than twice a month per individual. Both warnings are owed to toxaphene contamination, resulting from global pesticide use and overfishing in Lake Laberge which resulted in changes to its typical food chain.\nIn Spring 2009, researchers found the A. J. Goddard, a Gold Rush sternwheeler that sunk in 1901, killing three of its crew. Underwater archaeologists are examining the ship. National Geographic has named it the top archeological find of 2009. The Yukon government has designated the shipwreck a historic site. A phonograph with three records was discovered, giving insight into songs being listened to during the Gold Rush.","after_context":"Lake Laberge is located in Yukon, Canada. It is where the Yukon River widens north of Whitehorse. It is fifty kilometers long and between two and five kilometers wide. It is named after Michel LaBerge, a French-Canadian who explored the area in 1866.","before_sentence":"It is fifty kilometres long and ranges from two to five kilometres wide.","after_sentence":"It is fifty kilometers long and between two and five kilometers wide.","before":"kilometres","after":"kilometers","before_sentence_token_range":[17,31],"label":"nonsim_format"}
{"before_context":"Malcolm Elmore Beard (born February 21, 1919) is an American former politician in the state of Florida.\nBeard was born in 1919 in Moultrie, Georgia. He moved to Florida with his family in 1924 and later attended the University of Tampa. Beard then worked for the Tampa Police Department until he was elected sheriff of Hillsborough County in 1964. He served as sheriff until 1978. Beard served in the Florida House of Representatives from 1978 to 1980.\nIn 1979, he was elected to the State Senate for the 22nd district, and he served until 1996. In 1985, he changed districts and parties, sitting for the 23rd district as a Republican. The Hillsborough County Sheriff’s Office's Malcolm E. Beard Sheriff’s Operations Center was named after him in 2013.","after_context":"Malcolm Elmore Beard (February 21, 1919 – January 2, 2019) was an American politician. He was born in Moultrie, Georgia. A Republican from 1985 until his death. Before he was a Democrat. From 1978 to 1980, he was a member of the Florida House of Representatives. From 1980 to 1996, he was a member of the Florida Senate.\nBeard died on January 2, 2019 in Tampa, Florida at the age of 99.","before_sentence":"Malcolm Elmore Beard(born February 21, 1919) is an American former politician in the state of Florida.","after_sentence":"Malcolm Elmore Beard(February 21, 1919 - January 2, 2019) was an American politician.","before":"(born February","after":"(February","before_sentence_token_range":[0,20],"label":"nonsim_format"}
{"before_context":"Mount Sanqing (Chinese: 三清山; pinyin: Sānqīng Shān) is a renowned Taoist sacred mountain located 40 kilometres (25 mi) north of Yushan County in Jiangxi Province, China with outstanding scenery. Sanqing means the \"Three Pure Ones\" in Chinese as Mount Sanqing is made up of three main summits: Yujing, Yushui, and Yuhua, representing the Taoist trinity.\nA Chinese phrase “三峰峻拔、如三清列坐其巅” (“Three steep peaks, like the Three Pure Ones sit the summits”) explains why it was named San Qing. Amongst the three hills, the Yujing hill (1817 meters above sea level) is the highest.\nMount Sanqing has been classified as a national park of China. It is a famous honeypot as well as a shelter for animals and plants. It contains more than 2300 species of plants and 400 species of vertebrates. The total area of Mount Sanqing is 229 km². It became a National Geopark in 2005 and a UNESCO World Heritage Site in 2008.","after_context":"Sanqingshan is a UNESCO World Heritage Site in China. It is based on Mount Sanqing, which is a renowned Taoist sacred mountain.\nThe mountain is 40 kilometres (25 mi) north of Yushan County in Jiangxi Province, China. It has outstanding scenery. There are three main summits: Yujing, Yushui, and Yuhua, symbolising the Taoist trinity.\nMount Sanqing is a national park of China. It is a famous \"honeypot\" (place for tourists) and a home of over 2300 species of plants and 400 species of vertebrates. The total area of Mount Sanqing is 229 km². It became a National Geopark in 2005 and a World Heritage Site in 2008.\nThese granite mountains hold the evidence of a billion years of geological evolution. This includes the evidence of important geological events, such as the amalgamation of the supercontinent Rodinia.","before_sentence":"Mount Sanqing has been classified as a national park of China.","after_sentence":"It is a famous\" honeypot\"(place for tourists) and a home of over 2300 species of plants and 400 species of vertebrates.","before":"honeypot","after":"\" honeypot\"(place for tourists) and","before_sentence_token_range":[111,123],"label":"nonsim_format"}
{"before_context":"Return to Castle Wolfenstein is a first-person shooter video game published by Activision and originally released on November 19, 2001 for Microsoft Windows, PlayStation 2, Xbox, Linux and Macintosh. The single player game was developed by Gray Matter Interactive and Nerve Software developed its multiplayer mode. id Software, the creators of Wolfenstein 3D, oversaw the development and were credited as executive producers. The multiplayer side eventually became the most popular part of the game, and was influential in the genre. Splash Damage, an independently owned game developer in London, created some of the maps for the Game of the Year edition. Splash Damage also developed a downloadable multi-player only sequel called Wolfenstein: Enemy Territory, which is one of the most popular free downloadable games on the internet. A further sequel, titled Wolfenstein, was released on August 18, 2009.\nAugust 5, 2012 was released on HD Texture Pack for version Alpha v0.23, containing about 60 textures. You can download it from the official site addon «Project-X» .\nOctober 26, 2012 was issued a modification which adds support for subtitles. You can download it from the site addon «Project-X». The archive also has a sample file of subtitles for map cutscene1.","after_context":"Return to Castle Wolfenstein is a first person shooter computer game made by id Software and published by Activision for computers as well as PlayStation 2 and Xbox game consoles.","before_sentence":"Return to Castle Wolfenstein is a first-person shooter video game published by Activision and originally released on November 19, 2001 for Microsoft Windows, PlayStation 2, Xbox, Linux and Macintosh.","after_sentence":"Return to Castle Wolfenstein is a first person shooter computer game made by id Software and published by Activision for computers as well as PlayStation 2 and Xbox game consoles.","before":"first-person","after":"first person","before_sentence_token_range":[0,34],"label":"nonsim_format"}
{"before_context":"Pablo Mastroeni (born August 29, 1976 in Mendoza, Argentina) is an Argentine-born American soccer player of Italian Argentine heritage who currently plays for Colorado Rapids in Major League Soccer, and for the United States national soccer team.","after_context":"Pablo Mastroeni (born 29 August 1976) is a American soccer player. He plays for Colorado Rapids and United States national team.","before_sentence":"Pablo Mastroeni(born August 29, 1976 in Mendoza, Argentina) is an Argentine-born American soccer player of Italian Argentine heritage who currently plays for Colorado Rapids in Major League Soccer, and for the United States national soccer team.","after_sentence":"Pablo Mastroeni(born 29 August 1976) is a American soccer player.","before":"August 29,","after":"29 August","before_sentence_token_range":[0,42],"label":"nonsim_format"}
{"before_context":"Mineral County is one of the 64 counties in the U.S. state of Colorado. As of the 2010 census, the population was 712, making it the second-least populous county in Colorado. The county seat and only incorporated municipality in the county is Creede. The county was named for the many valuable minerals found in the mountains and streams of the area.","after_context":"Mineral County is a county in the state of Colorado in the United States. As of the 2010 census, the population was 712 people lived there. The county seat is Creede.","before_sentence":"As of the 2010 census, the population was 712, making it the second-least populous county in Colorado.","after_sentence":"As of the 2010 census, the population was 712 people lived there.","before":"","after":"people lived there","before_sentence_token_range":[17,37],"label":"nonsim_general"}
{"before_context":"The Lord of the Rings is an epic high fantasy novel written by philologist and Oxford University professor J. R. R. Tolkien. The story began as a sequel to Tolkien's earlier, less complex children's fantasy novel The Hobbit (1937), but eventually developed into a much larger work. It was written in stages between 1937 and 1949, much of it during World War II. Although known to many readers as a trilogy, the work was initially intended by Tolkien to be one volume of a two-volume set along with The Silmarillion; however, the publisher decided to omit the second volume and instead published The Lord of the Rings in 1954–55 as three volumes containing a total of six books, rather than one, for economic reasons. It has since been reprinted numerous times and translated into many languages, becoming one of the most popular and influential works in 20th-century literature.\nThe title of the book refers to the story's main antagonist, the Dark Lord Sauron, who had in an earlier age created the One Ring to rule the other Rings of Power, as the ultimate weapon in his campaign to conquer and rule all of Middle-earth. From quiet beginnings in the Shire, a hobbit land not unlike the English countryside, the story ranges across Middle-earth following the course of the War of the Ring through the eyes of its characters, most notably the hobbits, Frodo Baggins, Samwise Gamgee (Sam), Meriadoc Brandybuck (Merry) and Peregrin Took (Pippin), but also the hobbits' chief helpers: Aragorn, a ranger, and Gandalf, a wizard.\nAlong with some of Tolkien's other works, The Lord of the Rings has been subjected to extensive analysis of its themes and origins. Although a major work in itself, the story was only the last movement of a larger work Tolkien had worked on since 1917, in a process he described as mythopoeia. Influences on this earlier work, and on the story of The Lord of the Rings, include philology, mythology, religion and the author's distaste for the effects of industrialization, as well as earlier fantasy works and Tolkien's experiences in World War I. The Lord of the Rings in its turn is considered to have had a great effect on modern fantasy; the impact of Tolkien's works is such that the use of the words \"Tolkienian\" and \"Tolkienesque\" has been recorded in the Oxford English Dictionary.\nThe enduring popularity of The Lord of the Rings has led to numerous references in popular culture, the founding of many societies by fans of Tolkien's works, and the publication of many books about Tolkien and his works. The Lord of the Rings has inspired, and continues to inspire, artwork, music, films and television, video games, and subsequent literature. Award-winning adaptations of The Lord of the Rings have been made for radio, theatre, and film.","after_context":"THe Lord of the Rings is a trilogy written by J.R.R Tolkien. It is fiction (make believe).","before_sentence":"","after_sentence":"It is fiction(make believe).","before":"","after":"It is fiction(make believe","before_sentence_token_range":[26,26],"label":"nonsim_general"}
{"before_context":"Byron Raymond White (June 8, 1917 – April 15, 2002) won fame both as a football halfback and as an associate justice of the Supreme Court of the United States. Appointed to the court by President John F. Kennedy in 1962, he retired in 1993, being the twelfth longest-serving justice in Supreme Court history. He was married to Marion Lloyd Stearns in 1946 and the father of two children, Charles (Barney) Byron White and Nancy Pitkin White.\nWhite was born in Fort Collins, Colorado. He was raised in the nearby town of Wellington, Colorado, where he obtained his high school diploma in 1930. He made a point of returning to Wellington on an annual basis for his high school reunions up until 1999 when his physical health worsened significantly. He died in Denver at the age of 84 from complications of pneumonia. He was the first and only Supreme Court Justice from the state of Colorado.","after_context":"Byron Raymond White (June 8, 1917 – April 15, 2002) was an American judge and former football player. he served as an associate justice of the Supreme Court of the United States. He was appointed to the court by President John F. Kennedy in 1962. He retired in 1993.\nBefore becoming an associate justice, White played for the Pittsburgh Pirates in 1938 and for the Detroit Lions from 1940 to 1941. He played as a halfback.\nWhite died in Denver, Colorado from pneumonia, aged 84.","before_sentence":"Kennedy in 1962, he retired in 1993, being the twelfth longest-serving justice in Supreme Court history.","after_sentence":"Before becoming an associate justice, White played for the Pittsburgh Pirates in 1938 and for the Detroit Lions from 1940 to 1941. He played as a halfback.","before":"twelfth longest-serving justice in","after":"Pittsburgh Pirates in 1938 and for the Detroit Lions from 1940 to 1941","before_sentence_token_range":[42,61],"label":"nonsim_general"}
{"before_context":"HI there how r u edit the page at the top and wb","after_context":"Drama is something that defines more powerful the reality, it over exaggerates reality.\nThis short article can be made longer. You can help Wikipedia by adding to it.","before_sentence":"","after_sentence":"Drama is something that defines more powerful the reality, it over exaggerates reality. This short article can be made longer. You can help Wikipedia by adding to it.","before":"","after":" This short article can be made longer.  You can help Wikipedia by adding to it.","before_sentence_token_range":[0,0],"label":"nonsim_general"}
{"before_context":"Elizabeth Eliza McCardle Johnson, born Elizabeth McCardle (October 4, 1810 in Greeneville, Tennessee – January 15, 1876 in Greeneville, Tennessee) was the 22nd First Lady of the United States and the wife of Andrew Johnson, the 17th President of the United States. He credits her in teaching him how to read and write, having never gone to school himself. She supported her husband in his political career, but had tried to avoid public appearances. Though she lived in the White House, she was not able to serve as First Lady due to her poor health, so her daughters Martha Johnson Patterson, and Mary Johnson Stover stepped in.","after_context":"Eliza McCardle Johnson (October 4, 1810 - January 15, 1876) was the wife of Andrew Johnson, the 17th President of the United States of the USA. Due to her poor health, she could not function well as the [[First lady of the United States]. She stayed away from the public and did not participate in social functions. She had two daughters, named Martha Johnson Patterson and Mary Johnson Stover. They took the role of the First lady.","before_sentence":"Elizabeth Eliza McCardle Johnson, born Elizabeth McCardle(October 4, 1810 in Greeneville, Tennessee - January 15, 1876 in Greeneville, Tennessee) was the 22nd First Lady of the United States and the wife of Andrew Johnson, the 17th President of the United States.","after_sentence":"Eliza McCardle Johnson(October 4, 1810 - January 15, 1876) was the wife of Andrew Johnson, the 17th President of the United States of the USA.","before":"","after":"of the USA","before_sentence_token_range":[0,50],"label":"nonsim_general"}
{"before_context":"Please use a more specific IMDb template. See the documentation for available templates.\n9\/11 is a 2002 French-American documentary film about the September 11 attacks in New York City, in which two planes crashed into the buildings of the World Trade Center. The film is from the point of view of the New York City Fire Department. The film was directed by Jules and Gedeon Naudet, and FDNY firefighter James Hanlon.","after_context":"9\/11 is a 2002 documentary about the September 11 attacks in New York, where two planes crashed into the buildings of the World Trade Center.","before_sentence":"Please use a more specific IMDb template. See the documentation for available templates.","after_sentence":"","before":"Please use a more specific IMDb template.  See the documentation for available templates.","after":"","before_sentence_token_range":[0,15],"label":"nonsim_noise_deletion"}
{"before_context":"French people says: 'Un jour tu seras égorger, saleté de bougnoule pour...' Dimitri Payet (French pronunciation: ​[dimitʁi pajɛt]; born 29 March 1987) is a French professional footballer who plays for Ligue 1 club Olympique de Marseille and the France national team. A set-piece specialist, known for his accurate, bending free kicks, he primarily plays as an attacking midfielder, and is described as a player who is \"blessed with terrific technique and dribbling skills\".\nPayet was born on the French island of Réunion in the Indian Ocean, where he began his career playing for local clubs Saint-Philippe and Saint-Pierroise. In 1999, he moved to metropolitan France, joining Le Havre. Payet spent four years at the club before returning home to spend two years playing for AS Excelsior in the Réunion Premier League. In 2005, he joined FC Nantes and, after a successful 2006–07 season, joined AS Saint-Étienne on a four-year contract. With Saint-Étienne, Payet played in European competition for the first time after featuring in the 2008–09 edition of the UEFA Europa League. In the 2010–11 season, he won the UNFP Player of the Month award for September after scoring three goals and helping Saint-Étienne reach first place in the league table. Following the season, in June 2011, Payet joined the defending champions Lille signing a four-year contract. He had two years there and a further two at Olympique de Marseille before moving abroad to join West Ham United. In 2017 he moved back to France to join his old team, Marseille.\nPayet is a French international. From 2007 to 2008, he represented his country at under-21 level, making eleven appearances and scoring four goals. In 2010, he was called up to the senior team by manager Laurent Blanc for the first time. Payet made his international debut on 9 October 2010 in a UEFA Euro 2012 qualifying match against Romania, appearing as a substitute. He was a member of the French squad that reached the final of UEFA Euro 2016.","after_context":"Dimitri Payet(born March 29, 1987) is a Réunion born French footbaler. He plays as a midfielder for Ligue 1 club Olympique Marsaille and the France national team.","before_sentence":"French people says:'Un jour tu seras égorger, saleté de bougnoule pour.","after_sentence":"","before":"..'","after":"","before_sentence_token_range":[0,15],"label":"nonsim_noise_deletion"}
{"before_context":"Body painting, or sometimes bodypainting, is a form of body art, considered by some as the most ancient form of art. Unlike tattoo and other forms of body art, body painting is temporary, painted onto the human skin, and lasts for only several hours, or at most (in the case of Mehndi or \"henna tattoo\") a couple of weeks. Body painting that is limited to the face is known as face painting. Body painting is also referred to as (a form of) temporary tattoos; large scale or full-body painting is more commonly referred to as body painting, while smaller or more detailed work is generally referred to as temporary tattoos.\nTemporary body paints, such as liquid latex, are ideal for pre-tattoo designs. Liquid latex body paint is 'peelable' when dry so in effect you produce a 'to scale' design that can be removed from the skin intact. Liquidflesh.com are a safe, reliable source for liquid latex body paint in the U.K., they also ship worldwide.","after_context":"Body-painting (also body painting and bodypainting) is a form of art. It is a kind of body art, of using the human body to make a form of art. Special colors are applied to the skin to make a work of art. Body-painting is temporary. Unlike a tattoo, the colors last for a few hours only.","before_sentence":"Liquid latex body paint is'peelable' when dry so in effect you produce a'to scale' design that can be removed from the skin intact. Liquidflesh.com are a safe, reliable source for liquid latex body paint in the U.K.","after_sentence":"","before":" Liquidflesh. com are a safe, reliable source for liquid latex body paint in the U. K., they also ship worldwide.","after":"","before_sentence_token_range":[142,188],"label":"nonsim_noise_deletion"}
{"before_context":"Andre Tyler Iguodala (Also Known as king Slaw)(ig-wə-DAH-lə; born January 28, 1984) is an American professional basketball player who currently plays for the Golden State Warriors of the National Basketball Association (NBA). The swingman was an NBA All-Star in 2012 and has been named to the NBA All-Defensive Team twice. Iguodala won an NBA championship with the Warriors in 2015, when he was named the NBA Finals Most Valuable Player (MVP). He was also a member of the United States national team at the 2010 FIBA World Championship and 2012 Summer Olympics, winning the gold medal both times.\nIguodala went to Lanphier High School in Springfield, Illinois before attending the University of Arizona. After completing two years, he declared for the 2004 NBA draft where he was drafted with the ninth overall pick by the Philadelphia 76ers. Iguodala played in Philadelphia until the summer of 2012, when he was traded to the Denver Nuggets in a four team trade. He was acquired by Golden State in 2013. In 2014–15, he became a reserve for the first time in his career, but captured the Finals MVP after he returned to the starting lineup in the middle of series.","after_context":"Andre Tyler Iguodala (ig-wə-DAH-lə; born January 28, 1984) is an American professional basketball player. He currently plays for the Golden State Warriors of the National Basketball Association (NBA). In 2015 he was named most valuable player of the NBA Finals.\nIguodala went to Lanphier High School in Springfield, Illinois. He then played for the Arizona Wildcats basketball team at the University of Arizona. While playing for Arizona, the Wildcats made it to the NCAA Men's Division I Basketball Championship both seasons. After completing two years, he put his name in for the 2004 NBA Draft and was chosen by the Philadelphia 76ers. Iguodala played in Philadelphia until the summer of 2012. He was then traded to the Denver Nuggets. He was picked up by Golden State in 2013. In 2014–15, he was chosen as the Finals MVP.","before_sentence":"The swingman was an NBA All-Star in 2012 and has been named to the NBA All-Defensive Team twice. Iguodala won an NBA championship with the Warriors in 2015, when he was named the NBA Finals Most Valuable Player(MVP).","after_sentence":"In 2015 he was named most valuable player of the NBA Finals.","before":" Iguodala won an NBA championship with the Warriors in","after":"","before_sentence_token_range":[39,82],"label":"nonsim_noise_deletion"}
{"before_context":"Violence against women (VAW), also known as gender-based violence and sexual and gender-based violence (SGBV) is, collectively, violent acts that are primarily or exclusively committed against women and girls. Sometimes considered a hate crime, this type of violence is gender-based, meaning that the acts of violence are committed against women and girls expressly because they are female. The UN Declaration on the Elimination of Violence Against Women states, \"violence against women is a manifestation of historically unequal power relations between men and women\" and \"violence against women is one of the crucial social mechanisms by which women are forced into a subordinate position compared with men.\"\nKofi Annan, Secretary-General of the United Nations, declared in a 2006 report posted on the United Nations Development Fund for Women (UNIFEM) website:\nViolence against women can fit into several broad categories. These include violence carried out by \"individuals\" as well as \"states\". Some of the forms of violence perpetrated by individuals are: rape, domestic violence, sexual harassment, reproductive coercion, female infanticide, prenatal sex selection, obstetric violence, and mob violence; as well as harmful customary or traditional practices such as honor killings, dowry violence, female genital mutilation, marriage by abduction and forced marriage. Some forms of violence are perpetrated or condoned by the state such as war rape; sexual violence and sexual slavery during conflict; forced sterilization; forced abortion; violence by the police and authoritative personnel; stoning and flogging. Many forms of VAW, such as trafficking in women and forced prostitution are often perpetrated by organized criminal networks.\nThe World Health Organization (WHO), in its research on VAW, has analyzed and categorized the different forms of VAW occurring through all stages of life from before birth to old age.\nIn recent years, there has been a trend of approaching VAW at an international level, through instruments such as conventions; or, in the European Union, through directives, such as the directive against sexual harassment, and the directive against human trafficking.","after_context":"Violence against women (VAW in short), also called gender-based violence, is violent acts mostly against women and girls. It is sometimes considered a hate crime. The reason for that is such acts of violence is done against women and girls mainly because they're female.\nThe United Nations' Declaration on the Elimination of Violence against Women says: \"violence against women is a manifestation of historically unequal power of relations between men and women.\"\nViolence against women has several broad categories: rape, sexual harassment, domestic violence, sexual violence and forced marriage are among those categories.","before_sentence":"\" Kofi Annan, Secretary-General of the United Nations, declared in a 2006 report posted on the United Nations Development Fund for Women(UNIFEM) website: Violence against women can fit into several broad categories. These include violence carried out by\" individuals\" as well as\" states\".","after_sentence":"\" Violence against women has several broad categories: rape, sexual harassment, domestic violence, sexual violence and forced marriage are among those categories.","before":".  These include violence carried out by\" individuals\" as well as\" states\".  Some of the forms of violence perpetrated by individuals are","after":"","before_sentence_token_range":[120,174],"label":"nonsim_noise_deletion"}
{"before_context":"Palo Pinto County is a county located in the U.S. state of Texas. As of the 2010 census, its population was 28,111. The county seat is Palo Pinto. The county was created in 1856 and organized the following year.\nPalo Pinto County comprises the Mineral Wells, TX Micropolitan Statistical Area, which is part of the Dallas–Fort Worth, TX Combined Statistical Area. It is located in the Western Cross Timbers Ecoregion.","after_context":"Palo Pinto County is a county in the U.S. state of Texas. In 2010, 28,111 people lived there. The county seat is Palo Pinto.","before_sentence":"The county was created in 1856 and organized the following year. Palo Pinto County comprises the Mineral Wells, TX Micropolitan Statistical Area, which is part of the Dallas-Fort Worth, TX Combined Statistical Area. It is located in the Western Cross Timbers Ecoregion.","after_sentence":"","before":"The county was created in 1856 and organized the following year.  Palo Pinto County comprises the Mineral Wells, TX Micropolitan Statistical Area, which is part of the Dallas-Fort Worth, TX Combined Statistical Area.  It is located in the Western Cross Timbers Ecoregion.","after":"","before_sentence_token_range":[35,83],"label":"semantic_deletion"}
{"before_context":"Natalie \"Nattie\" Katherine Neidhart (born May 27, 1982) is a Canadian professional wrestler. She is currently working for World Wrestling Entertainment on its Raw brand under the ring name Natalya. She is the cousin of David Hart Smith and is the real-life girlfriend of Tyson Kidd, her teammates in The Hart Dynasty.","after_context":"Natalie \"Nattie\" Katherine Neidhart (born May 27, 1982 in Calgary, Alberta) is a Canadian female professional wrestler currently signed to World Wrestling Entertainment wrestling on their Raw brand under the ring name Natalya. She is a third generation superstar, her parents are former professional wrestler Jim \"The Anvil\" Neidhart and Ellie Hart, the daughter of Stu Hart.\nShe is currently dating Tyson Kidd who is part of the WWE stable, The Hart Dynasty and is the cousin of David Hart Smith who is the other member of The Hart Dynasty.","before_sentence":"She is the cousin of David Hart Smith and is the real-life girlfriend of Tyson Kidd, her teammates in The Hart Dynasty.","after_sentence":"She is currently dating Tyson Kidd who is part of the WWE stable, The Hart Dynasty and is the cousin of David Hart Smith who is the other member of The Hart Dynasty.","before":"Tyson Kidd, her teammates in","after":"","before_sentence_token_range":[36,60],"label":"semantic_deletion"}
{"before_context":"Bristol Airport (IATA: BRS, ICAO: EGGD), located at Lulsgate Bottom in North Somerset, is the commercial airport serving the city of Bristol, England, and the surrounding area. Originally named Bristol (Lulsgate) Airport in 1955, from March 1997 to March 2010 it became known as Bristol International Airport. In 2003, the airport drew 45% of its passengers from the former county of Avon area, 13% from Devon, 10% from Somerset. In 2011 it was the ninth busiest airport in the United Kingdom, handling 5,780,746 passengers, a 0.6% increase compared with 2010.\nThe airport has a CAA Public Use Aerodrome Licence (number P432) that allows flights for the public transport of passengers and for flying instruction.","after_context":"Bristol Airport (IATA: BRS, ICAO: EGGD), is in Lulsgate Bottom in North Somerset. It is the commercial airport for the city of Bristol, England, and the area around it. It opened as Bristol (Lulsgate) Airport in 1955, from March 1997 to March 2010 it became known as Bristol International Airport. In 2003, the airport drew 45% of its passengers from the former county of Avon area, 13% from Devon, 10% from Somerset. It also has bases for Easyjet and Ryanair. In 2011, it was the ninth busiest airport in the United Kingdom, with 5,780,746 passengers, a 0.6 percent rise compared with 2010.\nIn March 2010, the airport was given the name Bristol Airport.","before_sentence":"The airport has a CAA Public Use Aerodrome Licence(number P432) that allows flights for the public transport of passengers and for flying instruction.","after_sentence":"In March 2010, the airport was given the name Bristol Airport.","before":"has a CAA Public Use Aerodrome Licence(number P432) that allows flights for","after":"","before_sentence_token_range":[112,138],"label":"semantic_deletion"}
{"before_context":"Lambda is General Motors' full-size crossover SUV automobile platform. It is largely derived from the GM Epsilon platform, which underlies the Chevrolet Malibu sedan and similar models.\nThe Buick Enclave concept car was previewed at the 2006 North American International Auto Show, and the Saturn Outlook was shown at the 2006 New York Auto Show. The 2007 Outlook and GMC Acadia went into production in late 2006, followed by the 2008 Enclave in mid-2007, and the 2009 Chevrolet Traverse in mid-2008.\nLambda vehicles feature easily accessible three-row seating. They were supplied with the LY7 3.6-liter V6. Starting with the 2009 model year all Lambda vehicles have GM LLT 3.6-liter gasoline direct injection engine for improved fuel efficiency, horsepower and torque. With the cancellation of GM's next-generation DOHC V8, it appears unlikely that GM will offer a V8 engine for Lambda. The platform has been designed for front and all-wheel drive applications. Lambda vehicles are produced in the new Lansing Delta Township Assembly plant near Lansing, Michigan. The Traverse began production in September 2008 at a retooled Spring Hill Assembly Plant in Tennessee, but production was later moved to Lansing. GM discontinued the Outlook after the 2010 model year along with the entire Saturn brand.\nIt has been reported that Cadillac will receive a Lambda vehicle in 2012, which could possibly replace the current GMT900-based Escalade.\nMeanwhile, GM announced a second generation of its GMC Acadia for the 2013 model year, taking the bodyshell of the defunct Saturn Outlook, while at the same time, GM would refresh its Buick Enclave & Chevrolet Traverse vehicles.","after_context":"GM Lambda platform is a car platform designed and used by General Motors. It is a full-size crossover platform. Lambda is based on the earlier GM Epsilon platform. This is used for the Chevrolet Malibu sedan and other similar models. The Lambda architecture is used by the Chevrolet Traverse, Buick Enclave, Saturn Outlook and GMC Acadia.\nThe Buick Enclave concept car was previewed at the 2006 North American International Auto Show. The Saturn Outlook was shown at the 2006 New York Auto Show. The 2007 Outlook and GMC Acadia went into production in late 2006. This was followed by the 2008 Enclave in mid-2007, and the 2009 Chevrolet Traverse in mid-2008.\nLambda vehicles feature easily accessible three-row seating. They were supplied with the LY7 3.6-liter V6. Starting with the 2009 model year all Lambda vehicles have GM LLT 3.6-liter gasoline direct injection engine for improved fuel efficiency, horsepower and torque. With the cancellation of GM's next-generation DOHC V8, it appears unlikely that GM will offer a V8 engine for Lambda. The platform has been designed for front and all-wheel drive applications. Lambda is expected to be replaced by the new GM C1XX platform.\nThe lambda-based GM vehicles are now considered America's most American vehicle. Frank DuBois, of the Washington, DC-based American University created a new model for finding out which cars have the highest percentage of American parts and labor. His index shows the GM Lambda platform CUVs are the most \"American made.\"","before_sentence":"Lambda vehicles are produced in the new Lansing Delta Township Assembly plant near Lansing, Michigan. The Traverse began production in September 2008 at a retooled Spring Hill Assembly Plant in Tennessee, but production was later moved to Lansing. GM discontinued the Outlook after the 2010 model year along with the entire Saturn brand.","after_sentence":"Frank DuBois, of the Washington, DC-based American University created a new model for finding out which cars have the highest percentage of American parts and labor.","before":"Lansing Delta Township Assembly plant near Lansing, Michigan.  The Traverse began production in September 2008 at a retooled Spring Hill Assembly Plant in Tennessee, but production was later moved to Lansing.  GM discontinued the Outlook after the 2010","after":"","before_sentence_token_range":[170,228],"label":"semantic_deletion"}
{"before_context":"People watching or crowd watching is the act of observing people and their interactions, usually without their knowledge. It involves picking up on idiosyncrasies to try to guess at another person's story. This includes speech in action, relationship interactions, body language, expressions, clothing and activities. Eavesdropping may accompany the activity, though is not required.\nFor some people, it is considered a hobby, but for many others, it is a subconscious activity they partake in every day without even realizing it. People-watching is not to be confused with naturalistic observation. Naturalistic observation is used for scientific purposes, whereas people-watching is a casual activity, used for relaxation or inspiration for characters or characters' mannerisms in their own creative works. It should also not be confused with street photography; while the street photographer necessarily does people-watching, they do so for the purpose of taking photographs of the people for art and documentary purposes.","after_context":"People watching or crowd watching is the act of observing people and their interactions. Usually, the person being watched is not aware of the watcher. For some people it is considered a hobby. Other people think it is a subconscious activity, meaning it is something others do everyday without knowing it.","before_sentence":"For some people, it is considered a hobby, but for many others, it is a subconscious activity they partake in every day without even realizing it. People-watching is not to be confused with naturalistic observation. Naturalistic observation is used for scientific purposes, whereas people-watching is a casual activity, used for relaxation or inspiration for characters or characters' mannerisms in their own creative works. It should also not be confused with street photography; while the street photographer necessarily does people-watching, they do so for the purpose of taking photographs of the people for art and documentary purposes.","after_sentence":"","before":"People-watching is not to be confused with naturalistic observation.  Naturalistic observation is used for scientific purposes, whereas people-watching is a casual activity, used for relaxation or inspiration for characters or characters' mannerisms in their own creative works.  It should also not be confused with street photography; while the street photographer necessarily does people-watching, they do so for the purpose of taking photographs of the people for art and documentary purposes.","after":"","before_sentence_token_range":[65,173],"label":"semantic_deletion"}
{"before_context":"The Sui Dynasty (Chinese: 隋朝; pinyin: Suí cháo; 581-618 AD) followed the Southern and Northern Dynasties and preceded the Tang Dynasty in China. It ended nearly four centuries of division between rival regimes.\nThe Sui Dynasty, founded by Emperor Wen, or Yang Jian, held its capital at Chang'an (present-day Xi'an). It was marked by the reunification of Southern and Northern China and the construction of the Grand Canal, though it was a relatively short Chinese dynasty. It saw various reforms by Emperors Wen and Yang: the land equalization system, initiated to reduce the rich-poor social gap, resulted in enhanced agricultural productivity; governmental power was centralized, coinage was standardized and re-unified; defense was improved, and the Great Wall was expanded. Buddhism was also spread and encouraged throughout the empire, uniting the varied people and cultures of China.\nThis dynasty has often been compared to the earlier Qin Dynasty in tenure and the ruthlessness of its accomplishments. The Sui dynasty's early demise was attributed to the government's tyrannical demands on the people, who bore the crushing burden of taxes and compulsory labor. These resources were overstrained in the completion of the Grand Canal--a monumental engineering feat-- and in the undertaking of other construction projects, including the reconstruction of the Great Wall. Weakened by costly and disastrous military campaigns against Goguryeo which ended with defeat of Sui in the early seventh century, the dynasty disintegrated through a combination of popular revolts, disloyalty, and assassination.","after_context":"The Sui Dynasty (隋朝 Suí cháo; 581-618 AD) was an imperial dynasty of China. It followed the Jin Period and was followed by the Tang Dynasty. It ended nearly four centuries of division between rival regimes.\nThe Sui Dynasty was founded by Emperor Wen, or Yang Jian. Its capital was Chang'an (present-day Xi'an). The dynasty is important because it reunited Southern and Northern China and the Grand Canal was build in that time.","before_sentence":"The Sui Dynasty(Chinese: 隋朝; pinyin: Suí cháo; 581-618 AD) followed the Southern and Northern Dynasties and preceded the Tang Dynasty in China.","after_sentence":"The Sui Dynasty(隋朝 Suí cháo; 581-618 AD) was an imperial dynasty of China.","before":"","after":"was an imperial dynasty of China.","before_sentence_token_range":[0,29],"label":"semantic_elaboration_background"}
{"before_context":"The South Atlantic Peace and Cooperation Zone (Abbreviation: ZPCAS; Portuguese: Zona de Paz e Cooperação do Atlântico Sul; also called the Zone of Peace and Cooperation of the South Atlantic) was created in 1986 through a UN resolution on Brazil's initiative, with the aim of promoting regional cooperation and the maintenance of peace and security in the region. Particular attention was dedicated to the question of preventing the geographical proliferation of nuclear weapons and of reducing and eventually eliminating the military presence of countries from other regions. A Declaration on the Denuclearization of the South Atlantic was adopted at a meeting of States members of the zone held at Brasilia in September 1994.","after_context":"The South Atlantic Peace and Cooperation Zone was formed in 1986 by the United Nations. There goal is to promote cooperation and peace and security in the South Atlantic region. It especially wanted to limit nuclear weapons in these countries.","before_sentence":"The South Atlantic Peace and Cooperation Zone(Abbreviation: ZPCAS; Portuguese: Zona de Paz e Cooperação do Atlântico Sul; also called the Zone of Peace and Cooperation of the South Atlantic) was created in 1986 through a UN resolution on Brazil's initiative, with the aim of promoting regional cooperation and the maintenance of peace and security in the region.","after_sentence":"The South Atlantic Peace and Cooperation Zone was formed in 1986 by the United Nations.","before":"through a UN resolution on Brazil's initiative, with the","after":"the United Nations.","before_sentence_token_range":[0,66],"label":"semantic_elaboration_background"}
{"before_context":"Rhizopus stolonifer (black bread mold) is a widely distributed Mucoralean mold. Asexual spores are formed within sporangia, which break to release the spores when mature. Germination of these spores forms the haploid hyphae of a new mycelium. R. stolonifer grows rapidly at temperatures between 15 and 30 degrees C. Rhizopus stolonifer is a heterotrophic species (Schipper 1984), in that sexual reproduction occurs only when opposite mating types (designated + and -) come in contact. Successful mating results in the formation of durable zygospores at the point of contact. Subsequently, the zygospore germinates and forms a sporangiophore whose sporangium contains both + and - haploid spores.\nThere are three varieties: R. stolonifer var. stolonifer produces straight, erect sporangiophores, whereas those of R. stolonifer var. lyococcos are curved . A closely related species, Rhizopus sexualis, differs primarily in being homothallic (self-compatible).","after_context":"Rhizopus stolonifer (black bread mold) is a very common type of mold. It grows and reproduces like most molds. Spores are made inside a part of the mold called a sporangia. When the spores are ready to grow the sporangia breaks open and lets the spores float out. The spores land on a place where they can turn into a new mold, and begin to grow. They very quickly start making hyphae, small tendrils that look like roots. Hyphae are not roots, but part of the mycelium, which is the main part of the mold. Black bread mold grows very fast Asexual spores are formed within sporangia, which break to release the spores when mature. Germination of these spores forms the haploid hyphae of a new mycelium. R. stolonifer grows rapidly at temperatures between 15 and 30 degrees C. Rhizopus stolonifer is a heterotrophic species (Schipper 1984), in that sexual reproduction occurs only when opposite mating types (designated + and -) come in contact. Successful mating results in the formation of durable zygospores at the point of contact. Subsequently, the zygospore germinates and forms a sporangiophore whose sporangium contains both + and - haploid spores.\nThere are three varieties: R. stolonifer var. stolonifer produces straight, erect sporangiophores, whereas those of R. stolonifer var. lyococcos are curved . A closely related species, Rhizopus sexualis, differs primarily in being homothallic (self-compatible).","before_sentence":"Rhizopus stolonifer(black bread mold) is a widely distributed Mucoralean mold.","after_sentence":"Spores are made inside a part of the mold called a sporangia. When the spores are ready to grow the sporangia breaks open and lets the spores float out.","before":"","after":" When the spores are ready to grow the sporangia breaks open and lets the spores float out.","before_sentence_token_range":[0,13],"label":"semantic_elaboration_background"}
{"before_context":"Nagato Province (長門国, Nagato no kuni), often called Chōshū (長州), was a province of Japan. It was at the extreme western end of Honshū, in the area that is today Yamaguchi Prefecture. Nagato bordered on Iwami and Suō Provinces.\nAlthough the ancient capital of the province was Shimonoseki, Hagi was the seat of the Chōshū han (fief or domain) during the Edo period. Nagato was ruled by the Mōri clan before and after the Battle of Sekigahara. In 1871 with the abolition of feudal domains and the establishment of prefectures (Haihan Chiken) after the Meiji Restoration, the provinces of Nagato and Suō were combined to eventually establish Yamaguchi Prefecture. Historically, the oligarchy that came into power after the Meiji Restoration of 1868 had a strong representation from the Chōshū province, as Itō Hirobumi, Yamagata Aritomo, and Kido Kōin were from there. Other natives famous for their role in the restoration include Yoshida Shōin, Takasugi Shinsaku, and Kusaka Genzui among others.\nThe Japanese battleship Nagato was named after this province.","after_context":"Nagato Province (長門国, Nagato no kuni), often called Chōshū (長州), was an old province of Japan in the area that is today Yamaguchi Prefecture. Nagato bordered on Iwami and Suō Provinces.\nThe ancient capital city of the province was Shimonoseki.\nThe Japanese battleship Nagato was named after this province.","before_sentence":"Nagato Province(長門国, Nagato no kuni), often called Chōshū(長州), was a province of Japan.","after_sentence":"Nagato Province(長門国, Nagato no kuni), often called Chōshū(長州), was an old province of Japan in the area that is today Yamaguchi Prefecture.","before":"","after":"an old","before_sentence_token_range":[0,21],"label":"semantic_elaboration_background"}
{"before_context":"The Leyden jar, or Leiden jar, is a device that \"stores\" static electricity between two electrodes on the inside and outside of a jar. It was invented independently by German cleric Ewald Georg von Kleist on 11th October 1744 and by Dutch scientist Pieter van Musschenbroek of Leiden (Leyden) in 1745—1746. The invention was named for this city. It was the original form of the capacitor. The Leyden jar was used to conduct many early experiments in electricity, and its discovery was of fundamental importance in the study of electricity. Previously, researchers had to resort to insulated conductors of large dimensions to store charge. The Leyden jar provided a much more compact alternative.","after_context":"The Leyden jar or Leiden jar is a kind of a battery. This means it stores electrical energy between two electrodes. One of them is inside of a jar and the other one is outside. Ewald Georg von Kleist developed this system in Germany in 1744. The Dutch scientist Pieter van Musschenbroek in Leiden (Leyden) about two years later.","before_sentence":"It was invented independently by German cleric Ewald Georg von Kleist on 11th October 1744 and by Dutch scientist Pieter van Musschenbroek of Leiden(Leyden) in 1745-1746.","after_sentence":"Ewald Georg von Kleist developed this system in Germany in 1744.","before":"","after":"developed this system in Germany in","before_sentence_token_range":[29,58],"label":"semantic_elaboration_background"}
{"before_context":"Vincent Walker Foster Jr. (January 15, 1945 – July 20, 1993) was a Deputy White House Counsel during the first six months of President Bill Clinton's administration. He had been a partner at Rose Law Firm in Little Rock, Arkansas, where he was a colleague and friend of Hillary Rodham Clinton's and where, as The Washington Post later wrote, he rose to \"the pinnacle of the Arkansas legal establishment.\" At the White House he was unhappy with work in politics and spiraled into depression. Five official governmental investigations ruled Foster's death by gunshot a suicide, but several conspiracy theories emerged.","after_context":"Vincent Walker Foster Jr. (January 15, 1945 – July 20, 1993) was an American attorney. He served as Deputy White House Counsel for the first six months of President Bill Clinton's presidency until his death in July 1993. He was found dead by gunshot at a federal park in McLean, Virginia, at the age of 45. His death was ruled a suicide by five official governmental investigations. However, there are many conspiracy theories about Foster's death.\nFoster was born in Hope, Arkansas. He married Elizabeth Braden in 1968. The couple had three children.","before_sentence":"(January 15, 1945 - July 20, 1993) was a Deputy White House Counsel during the first six months of President Bill Clinton's administration.","after_sentence":"(January 15, 1945 - July 20, 1993) was an American attorney.","before":"","after":"an American attorney.","before_sentence_token_range":[5,32],"label":"semantic_elaboration_example"}
{"before_context":"Box (plural boxes) describes a variety of containers and receptacles for permanent use as storage, or for temporary use often for transporting contents.\nBoxes may be made of durable material such as wood or metal, or of cardboard or other non-durable materials. The size may vary from very small (e.g., a matchbox) to the size of a large appliance; while technically a large shipping container could be a called a box, it is not so desrcibed. When no specific shape is described, a box of rectangular cross-section with all sides flat may be expected, but a box may have a horizontal cross section that is square, elongated, round or oval; sloped or domed top surfaces, or non-vertical sides. A decorative box normally may be opened by raising, pulling, sliding or removing the lid, which may be hinged and\/or fastened by a catch, clasp, lock, or adhesive tape. Whatever its shape or purpose or the material of which it is fashioned, it is the direct descendant of the chest, one of the most ancient articles of domestic furniture. The name, preceded by a qualifying adjective, has been given to many objects of artistic or antiquarian interest.\nA common storage box usually has the shape of a cuboid or right rectangular prism, although boxes of almost any shape may be used.","after_context":"A box is used to put something in.\nBoxes are usually made out of cardboard, wood, plastic etc.","before_sentence":"Boxes may be made of durable material such as wood or metal, or of cardboard or other non-durable materials.","after_sentence":"Boxes are usually made out of cardboard, wood, plastic etc.","before":"","after":", wood, plastic etc","before_sentence_token_range":[26,47],"label":"semantic_elaboration_example"}
{"before_context":"Rheology \/riːˈɒlədʒi\/ is the study of the flow of matter, primarily in the liquid state, but also as 'soft solids' or solids under conditions in which they respond with plastic flow rather than deforming elastically in response to an applied force. It applies to substances which have a complex microstructure, such as muds, sludges, suspensions, polymers and other glass formers (e.g., silicates), as well as many foods and additives, bodily fluids (e.g., blood) and other biological materials or other materials which belong to the class of soft matter. Newtonian fluids can be characterized by a single coefficient of viscosity for a specific temperature. Although this viscosity will change with temperature, it does not change with the strain rate. Only a small group of fluids exhibit such constant viscosity, and they are known as Newtonian fluids. But for a large class of fluids, the viscosity changes with the strain rate (or relative velocity of flow) are called non-Newtonian fluids. Rheology generally accounts for the behaviour of non-Newtonian fluids, by characterizing the minimum number of functions that are needed to relate stresses with rate of change of strains or strain rates. For example, ketchup can have its viscosity reduced by shaking (or other forms of mechanical agitation, where the relative movement of different layers in the material actually causes the reduction in viscosity) but water cannot. Ketchup is a shear thinning material, as an increase in relative velocity caused a reduction in viscosity, while some other non-Newtonian materials show the opposite behaviour: viscosity going up with relative deformation, which are called shear thickening or dilatant materials. Since Sir Isaac Newton originated the concept of viscosity, the study of liquids with strain rate dependent viscosity is also often called Non-Newtonian fluid mechanics.\nThe term rheology was coined by Eugene C. Bingham, a professor at Lafayette College, in 1920, from a suggestion by a colleague, Markus Reiner. The term was inspired by the aphorism of Simplicius (often misattributed to Heraclitus), panta rhei, \"everything flows\"\nThe experimental characterization of a material's rheological behaviour is known as rheometry, although the term rheology is frequently used synonymously with rheometry, particularly by experimentalists. Theoretical aspects of rheology are the relation of the flow\/deformation behaviour of material and its internal structure (e.g., the orientation and elongation of polymer molecules), and the flow\/deformation behaviour of materials that cannot be described by classical fluid mechanics or elasticity.","after_context":"Rheology is the study of the flow of liquids and soft solids like mud or blood.","before_sentence":"Rheology \/riːˈɒlədʒi\/ is the study of the flow of matter, primarily in the liquid state, but also as'soft solids' or solids under conditions in which they respond with plastic flow rather than deforming elastically in response to an applied force.","after_sentence":"Rheology is the study of the flow of liquids and soft solids like mud or blood.","before":"' or","after":"like mud or blood","before_sentence_token_range":[0,45],"label":"semantic_elaboration_example"}
{"before_context":"Naomichi Ueda (植田 直通, Ueda Naomichi, born 24 October 1994) is a Japanese footballer who plays as a defender for Ligue 1 side Nîmes Olympique on loan from Belgian side Cercle Brugge.","after_context":"Naomichi Ueda (植田 直通, Ueda Naomichi, born October 24, 1994) is a Japanese football player. He plays for the Japan national team.","before_sentence":"Naomichi Ueda(植田 直通, Ueda Naomichi, born 24 October 1994) is a Japanese footballer who plays as a defender for Ligue 1 side Nîmes Olympique on loan from Belgian side Cercle Brugge.","after_sentence":"He plays for the Japan national team.","before":"","after":"the Japan national team","before_sentence_token_range":[0,36],"label":"semantic_elaboration_example"}
{"before_context":"Ferdinand Alexander Araneta Marcos III (English: \/ˈmɑːrkɔːs\/ MAR-kawss, Tagalog: [ˈmaɾkɔs]; born March 7, 1994), commonly referred to as Sandro Marcos and his initial FAM, is a Filipino politician who is the congressman-elect of the 1st District of Ilocos Norte, and the eldest of three sons of President-elect Bongbong Marcos and Incoming first lady Liza Araneta Marcos.","after_context":"Ferdinand Alexander Araneta Marcos III (Tagalog: [ˈmaɾkɔs], English: \/ˈmɑːrkɔːs\/ MAR-kawss; born March 7, 1994), mainly known as Sandro Marcos, is a Filipino politician. He is the member-elect of the Philippine House of Representatives from 1st district of Ilocos Norte since 2022. He is the oldest of three sons of President-elect Bongbong Marcos and first lady Liza Araneta Marcos.","before_sentence":"Ferdinand Alexander Araneta Marcos III(English: \/ˈmɑːrkɔːs\/ MAR-kawss, Tagalog: [ˈmaɾkɔs]; born March 7, 1994), commonly referred to as Sandro Marcos and his initial FAM, is a Filipino politician who is the congressman-elect of the 1st District of Ilocos Norte, and the eldest of three sons of President-elect Bongbong Marcos and Incoming first lady Liza Araneta Marcos.","after_sentence":"He is the member-elect of the Philippine House of Representatives from 1st district of Ilocos Norte since 2022.","before":"","after":"since 2022.","before_sentence_token_range":[0,65],"label":"semantic_elaboration_example"}
{"before_context":"The Sarthe is a 313.9 km (195.0 mi) long river in western France. Together with the river Mayenne it forms the river Maine, which is a tributary to the river Loire.\nIts source is in the Orne department, near Moulins-la-Marche. It flows generally southwest, through the following departments and towns:\nIts two main tributaries are the Loir and the Huisne.","after_context":"The Sarthe is a river in western France. It is 313.9 km long. It flows through the departments Orne, Sarthe and Maine-et-Loire.","before_sentence":"It flows generally southwest, through the following departments and towns: Its two main tributaries are the Loir and the Huisne.","after_sentence":"It flows through the departments Orne, Sarthe and Maine-et-Loire.","before":"and","after":"Orne, Sarthe and Maine-et-Loire","before_sentence_token_range":[46,69],"label":"semantic_elaboration_generic"}
{"before_context":"Gretchen Michaela Young (January 6, 1913 – August 12, 2000), known professionally as Loretta Young, was an American film and television actress. Starting as a child actress, she had a long and varied career in film from 1917 to 1953. She won the 1948 best actress Academy Award for her role in the 1947 film The Farmer's Daughter, and received an Oscar nomination for her role in Come to the Stable, in 1949. Young moved to the relatively new medium of television, where she had a dramatic anthology series, The Loretta Young Show, from 1953 to 1961. The series earned three Emmy Awards, and reran successfully on daytime TV and later in syndication. In the 1980s Young returned to the small screen and won a Golden Globe in Christmas Eve in 1986. Young, a devout Roman Catholic, worked with various Catholic charities after her acting career.","after_context":"Loretta Young (born Gretchen Michael Young, January 06, 1913 - August 12, 2000) was an American actress. Young was born in Provo City, Utah, and Her sisters were actresses Polly Ann Young (1908-1997) and Sally Blane (1910-1997). Gretchen \"Loretta\" Young was an American actress and singer. Starting as a child actress, she had a long and varied career in film from 1917 to 1953. Young won an Academy Award for Best Actress for her role in The Farmer's Daughter. She won three Emmy Awards in the 1950s and a Golden Globe Award in 1986. She was a devout Roman Catholic. She died of ovarian cancer in Los Angeles. Loretta young was a child actor who became one of Hollywood's leading ladies in the ... Young died of ovarian cancer on August 12, 2000.","before_sentence":"Gretchen Michaela Young(January 6, 1913 - August 12, 2000), known professionally as Loretta Young, was an American film and television actress.","after_sentence":"Young was born in Provo City, Utah, and Her sisters were actresses Polly Ann Young(1908-1997) and Sally Blane(1910-1997). Gretchen\" Loretta\" Young was an American actress and singer.","before":"television actress","after":" Gretchen\" Loretta\" Young was an American actress and singer","before_sentence_token_range":[0,28],"label":"semantic_elaboration_generic"}
{"before_context":"The 2010 Brooklyn\/Queens tornadoes were a severe weather event that occurred in the boroughs of Brooklyn and Queens in New York City. These tornadoes were the second to touch down in New York City that year, the first having occurred in the Bronx on July 25. The storms struck New York City just as the evening rush hour was beginning. Damaging winds, heavy downpours, and hail up to 1 inch (2.5 cm) wreaked havoc with the evening commute. Hundreds of downed trees led to a temporary suspension of service on the Long Island Rail Road, Amtrak, and several subway lines including the L train, 7 train, and M train, leaving tens of thousands of commuters stranded. Passage on local roadways was nearly impossible due to fallen branches and downed power lines. Major highways including the Long Island Expressway and the Grand Central Parkway were at a standstill. A woman was killed when a tree fell and crushed the vehicle she was driving. Extensive and widespread wind damage led to over 30,000 downed trees, and power lines. Scattered power outages were reported across parts of the city.\nTwo separate tornadoes were later confirmed in Park Slope and Flushing, two areas that suffered the worst damage from the storms. The stronger of the two tornadoes touched down over Flushing and was rated an EF1 with maximum winds of 100 mph. In addition to the tornadoes, the National Weather Service confirmed the occurrence of a macroburst bringing winds up to 125 mph to a wide swath of Middle Village and Forest Hills.","after_context":"The 2010 Brooklyn\/Queens tornadoes were a severe weather event that happened in the boroughs of Brooklyn and Queens in New York City. Two tornadoes touched down in Park Slope, Brooklyn and Flushing, Queens. It happened between 5:37 PM to 5:57 PM EDT on September 16, 2010. The tornadoes were the second to hit New York City that year, after a tornado that hit Queens on July 25. The stronger of the two tornadoes hit Flushing and was rated an EF1 with winds of up to 100 mph.\nThe thunderstorm hit New York City during the evening rush hour. It brought strong winds, heavy rain, and hail. The strong winds brought down over 30,000 trees and power lines. In addition to the tornadoes, a macroburst hit Middle Village and Forest Hills in Queens. The macroburst had heavy rain and strong winds of up to 125 mph.","before_sentence":"In addition to the tornadoes, the National Weather Service confirmed the occurrence of a macroburst bringing winds up to 125 mph to a wide swath of Middle Village and Forest Hills.","after_sentence":"In addition to the tornadoes, a macroburst hit Middle Village and Forest Hills in Queens.","before":"","after":"in Queens","before_sentence_token_range":[251,283],"label":"semantic_elaboration_generic"}
{"before_context":"George Crin Laurențiu Antonescu (Romanian pronunciation: [ˈd͡ʒe̯ord͡ʒe ˈkrin la.uˈrent͡siw antoˈnesku]; born 21 September 1959) is a Romanian politician, serving as President of the National Liberal Party (PNL). He is a member of the Senate, his election having taken place during the 2008 legislative election. Between 1996 and 2008 he was a member of the Chamber of Deputies, acting as leader of the party delegates between 2007 and 2008. On 3 July 2012 he was elected President of the Senate after the latter dismissed the former leader Vasile Blaga from office. He became Acting President of Romania on 10 July 2012 after the Parliament suspended Traian Băsescu for the second time on 6 July 2012.","after_context":"Crin Antonescu (b. 21 septembrie 1959, Tulcea) is a Romanian politician.He is now the interim President of Romania. Crin Antonescu is also the President of PNL and USL.\nIn 3 July 2012 he was elected,President of the Romanian Senate.","before_sentence":"George Crin Laurențiu Antonescu(Romanian pronunciation: [ˈd͡ʒe̯ord͡ʒe ˈkrin la.uˈrent͡siw antoˈnesku]; born 21 September 1959) is a Romanian politician, serving as President of the National Liberal Party(PNL).","after_sentence":"21 septembrie 1959, Tulcea) is a Romanian politician.He is now the interim President of Romania.","before":"","after":", Tulcea","before_sentence_token_range":[0,33],"label":"semantic_elaboration_generic"}
{"before_context":"Virtual Console (バーチャルコンソール, Bācharu Konsōru), sometimes abbreviated as VC, is a specialized section of the Nintendo Wii Shop Channel, an online service that allows players to purchase and download games and other software for Nintendo's Wii gaming console. The Virtual Console lineup consists of titles originally released on past consoles. These titles are run in their original forms through software emulation, and can be purchased for between 500 and 1300 Wii Points depending on system, rarity, and\/or demand. The library of past games currently consists of titles originating from the Nintendo Entertainment System, Super Nintendo Entertainment System, and Nintendo 64, as well as Sega's Master System and Mega Drive\/Genesis, NEC's TurboGrafx-16 and TurboGrafx-CD, SNK's Neo Geo AES, Commodore 64 (Europe and North America only) and MSX (Japan only). Virtual Console Arcade allows players to download video arcade games. Nintendo has no plans to add Nintendo GameCube games to Virtual Console due to their 1.4 GB capacity (and even higher for certain games), and because the Wii is already backward compatible with the GameCube's original Game Discs. Virtual Console titles have been downloaded over ten million times as of December 2007, relatively early in the console life cycle. The distribution of past games through the Virtual Console is one of Nintendo's attempts at preventing software piracy. Nintendo had recently confirmed at the Nintendo Conference 2010 of another Virtual Console service for the portable Nintendo 3DS system, which will feature the return of portable Nintendo games originally released for the Game Boy and Game Boy Color portable consoles, in addition to \"3D\" versions of other classic Nintendo titles. It was later announced at GDC 2011 that support for Sega Game Gear, Turbografx-16 and Neo Geo Pocket Color titles will also be included.","after_context":"Virtual Console (VC) is a Wii service that lets users download old video games for Wii Points. The games are from the Nintendo Entertainment System, Super NES, Nintendo 64, Sega Master System, Sega Mega Drive, TurboGrafx-16, TurboGrafx-CD, Neo Geo AES, Commodore 64, and MSX (Japan only). The service is available in Europe, North America, Australia, New Zealand, Japan, and South Korea.","before_sentence":"The library of past games currently consists of titles originating from the Nintendo Entertainment System, Super Nintendo Entertainment System, and Nintendo 64, as well as Sega's Master System and Mega Drive\/Genesis, NEC's TurboGrafx-16 and TurboGrafx-CD, SNK's Neo Geo AES, Commodore 64(Europe and North America only) and MSX(Japan only).","after_sentence":"The games are from the Nintendo Entertainment System, Super NES, Nintendo 64, Sega Master System, Sega Mega Drive, TurboGrafx-16, TurboGrafx-CD, Neo Geo AES, Commodore 64, and MSX(Japan only).","before":"","after":", Sega","before_sentence_token_range":[90,152],"label":"semantic_elaboration_generic"}
{"before_context":"Melody Club is a Swedish pop\/synth rock band from Växjö formed in January 2000. Their break-through came in 2002 with the song Palace Station, which was also a big success in Germany. The band has frequent radio airplay in Sweden, Germany, Japan, Norway and Denmark. Melody Club's style can be described as a blend of Synthpop and Glam rock. The single \"Fever Fever\" is included on the soundtrack of the football video game FIFA 08. On 22 April 2009, they released their fifth and first self-produced album \"Goodbye to Romance\". The first single from the album was called \"Girls Don't Always Wanna Have Fun\" --a possible reference to Cyndi Lauper's \"Girls Just Wanna Have Fun\". In 2010 Andy A left the group in protest against the group's participation in Eurovision and was replaced with the original drummer Richard Ankers.","after_context":"Melody Club is a pop band from the town of Växjä in Sweden. The band was established in 2000.","before_sentence":"Melody Club is a Swedish pop\/synth rock band from Växjö formed in January 2000.","after_sentence":"Melody Club is a pop band from the town of Växjä in Sweden.","before":"Swedish pop\/synth rock","after":"pop","before_sentence_token_range":[0,15],"label":"semantic_hypernymy"}
{"before_context":"The Vancouver Grizzlies were a Canadian professional basketball team based in Vancouver, British Columbia. They were part of the Midwest Division of the Western Conference of the National Basketball Association (NBA). The team was established in 1995, along with the Toronto Raptors, as part of the NBA's expansion into Canada. Following the 2000–01 season, the team relocated to Memphis, Tennessee, United States and was renamed the Memphis Grizzlies. The Grizzlies played their home games at General Motors Place (now Rogers Arena) for all of their six seasons in Vancouver.\nLike most expansion teams, the Grizzlies struggled in their early years. The team finished last in the division in five of its seasons, and never won more than 30% of its games in any of the team's seasons in Vancouver. In total, the team won 101 games, lost 359, and never qualified for the NBA playoffs. The two expansion teams were denied early draft picks in the first season, but the Grizzlies secured Shareef Abdur-Rahim in 1996 and Mike Bibby with the 2nd pick of the 1998 draft. The team continued to lose games despite high draft picks. After they selected Steve Francis as second pick in 1999, he refused to play in Vancouver and was traded away. After the 1998–99 lockout, lower attendance and a weak Canadian dollar caused the owner Orca Bay Sports and Entertainment to start losing money on the franchise. After a failed attempt to sell the team to Bill Laurie, it was instead sold to Michael Heisley and subsequently moved to Memphis, Tennessee, for the 2001–02 season.","after_context":"The Vancouver Grizzlies were a team in the National Basketball Association (NBA) in Vancouver, British Columbia, Canada. The team started playing in 1995 and became defunct after moving to Memphis, Tennessee in 2001 becoming the Memphis Grizzlies.","before_sentence":"The team was established in 1995, along with the Toronto Raptors, as part of the NBA's expansion into Canada. Following the 2000-01 season, the team relocated to Memphis, Tennessee, United States and was renamed the Memphis Grizzlies. The Grizzlies played their home games at General Motors Place(now Rogers Arena) for all of their six seasons in Vancouver. Like most expansion teams, the Grizzlies struggled in their early years. The team finished last in the division in five of its seasons, and never won more than 30% of its games in any of the team's seasons in Vancouver. In total, the team won 101 games, lost 359, and never qualified for the NBA playoffs.","after_sentence":"The team started playing in 1995 and became defunct after moving to Memphis, Tennessee in 2001 becoming the Memphis Grizzlies.","before":", along with the Toronto Raptors, as part of the NBA's expansion into Canada.  Following the 2000-01 season, the team relocated to Memphis, Tennessee, United States and was renamed the Memphis Grizzlies. The Grizzlies played their home games at General Motors Place(now Rogers Arena) for all of their six seasons in Vancouver.  Like most expansion teams, the Grizzlies struggled in their early years.  The team finished last in the division in five of its seasons, and never won more than 30% of its games in any of the team's seasons in Vancouver.  In total, the team won 101 games, lost 359, and never qualified for the NBA playoffs.","after":"and became defunct after moving to Memphis, Tennessee in 2001 becoming the Memphis Grizzlies.","before_sentence_token_range":[35,168],"label":"semantic_hypernymy"}
{"before_context":"Charlotte Harbor Estuary, the second largest bay in Florida, is located on the Gulf of Mexico coast of west Florida, mostly (2\/3) in Charlotte County, Florida with the remaining 1\/3 in Lee County. The harbor's mouth is located behind Gasparilla Island, one of the many coastal barrier islands on the southwest coast of Florida, with access from the Gulf of Mexico through the Boca Grande Pass between Gasparilla Island on the north and Lacosta Island on the south. Charlotte Harbor covers about 270 sq mi (700 km2)\nCharlotte Harbor Estuary is a natural estuary spanning the west coast of Florida from Venice to Bonita Springs on the Gulf of Mexico and is one of the most productive wetlands in Florida. The estuary has a large watershed, and includes Charlotte Harbor itself as well as the Peace River, Caloosahatchee River (via Pine Island Sound) and Myakka River basins. It covers 12,653 square kilometers (4,885 sq mi), the second largest open water estuary in the state.\nIt is classified as a bar-built estuary, formed when sandbars build up along the coastline. The sand bars block the waters behind them from the sea. Such estuaries tend to be shallow with minimal tidal action.\nThis is a threatened ecosystem because of the rapid increase of growth and development, poor land-use policies, and the overuse of natural resources. The Charlotte Harbor Aquatic Preserves, established by the state of Florida in 1975, are five contiguous aquatic preserves within the greater Charlotte Harbor estuary. It includes salt marshes, mangroves, seagrass, oyster and tidal flats. It is the preserve of many species, including the American alligator, West Indian manatee, bald eagle, wood stork, piping plover, green and loggerhead sea turtles, royal false pawpaw (Deeringothamnus pulchellus), Florida perforate cladonia (Cladonia perforata) and many more.\nThe harbor is fed with fresh water from the Myakka River on its northwest corner and the Peace River on its northeastern corner. Charlotte Harbor is bordered by the communities of Boca Grande, Port Charlotte, Charlotte Harbor, Punta Gorda and Bokeelia. Charlotte Harbor connects to San Carlos Bay to the south by way of Pine Island Sound and Matlacha Pass.","after_context":"Charlotte Harbor Estuary, is the second largest bay in Florida, it is on the Gulf of Mexico coast of west Florida, it is in Charlotte County, Florida","before_sentence":"Charlotte Harbor Estuary, the second largest bay in Florida, is located on the Gulf of Mexico coast of west Florida, mostly(2\/3) in Charlotte County, Florida with the remaining 1\/3 in Lee County.","after_sentence":"","before":"mostly(2\/3)","after":"it is","before_sentence_token_range":[0,39],"label":"semantic_hypernymy"}
{"before_context":"Fall of a Kingdom is the first novel in the Farsala Trilogy by American author Hilari Bell. It was previously published under the name Flame! The Series it was in was also referred to as the \"Book of Sorahb\".","after_context":"Fall of a Kingdom is the first book in the Farsala Trilogy by American author Hilari Bell. It was previously called Flame! It is also called \"The Book of Sorahb\" in the series.","before_sentence":"Fall of a Kingdom is the first novel in the Farsala Trilogy by American author Hilari Bell.","after_sentence":"Fall of a Kingdom is the first book in the Farsala Trilogy by American author Hilari Bell.","before":"novel","after":"book","before_sentence_token_range":[0,18],"label":"semantic_hypernymy"}
{"before_context":"The M1 motorway connects London to Leeds, where it joins the A1(M) near Aberford, to connect to Newcastle. It was the first inter-urban motorway to be completed in the UK; the first road to be built to motorway standard in the country was the Preston By-pass, which later became part of the M6.\nThe motorway is 193 miles (311 km) long and was constructed in four phases. Most of the motorway was opened between 1959 and 1968 but the southern end was extended in 1977 and the northern end was extended in 1999. It forms part of the unsigned European route E13.","after_context":"The M1 motorway is a large motorway in the United Kingdom. It joins London and Yorkshire. It was the second motorway to be built in the United Kingdom, after the M6. It was the first urban motorway to be built in the United Kingdom.\nThe motorway is 193 miles (310 km) long. It was built in four phases. Some of the motorway was opened in 1959. Other sections opened between 1965 and 1968. Two extensions were opened in 1977 and 1999.\nThe motorway is part of the unsigned European route E13.","before_sentence":"The M1 motorway connects London to Leeds, where it joins the A1(M) near Aberford, to connect to Newcastle.","after_sentence":"It joins London and Yorkshire. It was the second motorway to be built in the United Kingdom, after the M6.","before":"to Leeds","after":"and Yorkshire.  It was the second motorway to be built in the United Kingdom","before_sentence_token_range":[0,23],"label":"semantic_hypernymy"}
{"before_context":"2008 (MMVIII) was a leap year starting on Tuesday of the Gregorian calendar, the 2008th year of the Common Era (CE) and Anno Domini (AD) designations, the 8th year of the 3rd millennium and the 21st century, and the 9th year of the 2000s decade. 2008 was designated as:\nThe Great Recession, a worldwide recession which began in the preceding year 2007, continued through the entirety of 2008.","after_context":"2008 (MMVIII) was a leap year starting on Tuesday of the Christian or Common Era, in the Gregorian calendar. It was the 2008th year of the Common Era, or of Anno Domini; the 8th year of the 3rd millennium and of the 21st century; and the 9th of the 2000s.","before_sentence":"2008(MMVIII) was a leap year starting on Tuesday of the Gregorian calendar, the 2008th year of the Common Era(CE) and Anno Domini(AD) designations, the 8th year of the 3rd millennium and the 21st century, and the 9th year of the 2000s decade.","after_sentence":"It was the 2008th year of the Common Era, or of Anno Domini; the 8th year of the 3rd millennium and of the 21st century; and the 9th of the 2000s.","before":"year","after":"","before_sentence_token_range":[0,50],"label":"syntactic_deletion"}
{"before_context":"Coordinates: 34°12′30″N 73°29′0″E﻿ \/ ﻿34.20833°N 73.48333°E﻿ \/ 34.20833; 73.48333\nMojohan is one of the 51 union councils of Abbottabad District in Khyber-Pakhtunkhwa province of Pakistan.\nDistrict Government Abbottabad<\/ref>. It is located in the west of the district.","after_context":"Mojohan is one of the 51 Union Councils of Abbottabad District in the Khyber Pakhtunkhwa province of Pakistan. It is in the west of the district.","before_sentence":"District Government Abbottabad<\/ref>.","after_sentence":"It is in the west of the district.","before":"located","after":"","before_sentence_token_range":[32,36],"label":"syntactic_deletion"}
{"before_context":"Freedom of the press is the guarantee by a government of free public press for its citizens and their associations, extended to members of news-gathering organizations (journalists), and their published reporting. In many countries there are constitutional or statutory protections pertaining to freedom of the press. With respect to governmental information, any government distinguishes which materials are public or protected from disclosure to the public based on classification of information as sensitive, classified or secret and being otherwise protected from disclosure due to relevance of the information to protecting the national interest. Many governments are also subject to sunshine laws or freedom of information legislation that are used to define the ambit of national interest.\nIn developed countries, freedom of the press implies that all people should have the right to express themselves in writing or in any other way of expression of personal opinion or creativity. The Universal Declaration of Human Rights states: \"Everyone has the right to freedom of opinion and expression; this right includes freedom to hold opinions without interference, and impart information and ideas through any media regardless of frontiers\"\nThis philosophy is usually accompanied by legislation ensuring various degrees of freedom of scientific research (known as scientific freedom), publishing, press and printing the depth to which these laws are entrenched in a country's legal system can go as far down as its constitution. The concept of freedom of speech is often covered by the same laws as freedom of the press, thereby giving equal treatment to media and individuals.\nBesides legal definitions, some non-governmental organizations use other criteria to judge the level of press freedom around the world:\nEvery year, Reporters Without Borders establishes a ranking of countries in terms of their freedom of the press. The Worldwide press freedom index list is based on responses to surveys sent to journalists that are members of partner organisations of the RWB, as well as related specialists such as researchers, jurists and human rights activists. The survey asks questions about direct attacks on journalists and the media as well as other indirect sources of pressure against the free press, such as pressure on journalists by non-governmental groups. RWB is careful to note that the index only deals with press freedom, and does not measure the quality of journalism.\nIn 2003, the countries where press was the most free were Finland, Iceland, the Netherlands and Norway. In 2004, apart from the above countries, Denmark, Ireland, Slovakia, and Switzerland were tied at the top of the list, followed by New Zealand and Latvia. The country with the least degree of press freedom was North Korea, followed by Burma, Turkmenistan, People's Republic of China (mainland only), Vietnam, Nepal,and Iran.\nAccording to Reporters Without Borders, more than a third of the world's people live in countries where there is no press freedom. Overwhelmingly, these people live in countries where there is no system of democracy or where there are serious deficiencies in the democratic process.\nFreedom of the press is an extremely problematic concept for most non-democratic systems of government since, in the modern age, strict control of access to information is critical to the existence of most non-democratic governments and their associated control systems and security apparatus. To this end, most non-democratic societies employ state-run news organizations to promote the propaganda critical to maintaining an existing political power base and suppress (often very brutally, through the use of police, military, or intelligence agencies) any significant attempts by the media or individual journalists to challenge the approved \"government line\" on contentious issues. In such countries, journalists operating on the fringes of what is deemed to be acceptable will very often find themselves the subject of considerable intimidation by agents of the state. This can range from simple threats to their professional careers (firing, professional blacklisting) to death threats, kidnapping, torture, and assassination.\nReporters Without Borders reports that, in 2003, 42 journalists lost their lives pursuing their profession and that, in the same year, at least 130 journalists were in prison as a result of their occupational activities. In 2005, 63 journalists and 5 media assistants were killed worldwide.","after_context":"Freedom of the press is a promise by a government not to punish journalists and other people who report the news for doing their job. It is an idea that is like freedom of speech, because it protects people from expressing their opinions or beliefs. Many countries have passed laws or constitutional amendments protecting freedom of the press.","before_sentence":"Freedom of the press is the guarantee by a government of free public press for its citizens and their associations, extended to members of news-gathering organizations(journalists), and their published reporting. In many countries there are constitutional or statutory protections pertaining to freedom of the press.","after_sentence":"Many countries have passed laws or constitutional amendments protecting freedom of the press.","before":"there are","after":"","before_sentence_token_range":[0,51],"label":"syntactic_deletion"}
{"before_context":"Ned Eisenberg (January 13, 1957 – February 27, 2022) was an American actor known for his recurring role on Law & Order: Special Victims Unit as Roger Kressler.","after_context":"Ned Eisenberg (January 13, 1957 – February 27, 2022) was an American actor. He was known for his role on Law & Order: Special Victims Unit as Roger Kressler. He also appeared in World Trade Center and Million Dollar Baby. Eisenberg was born in New York City. His career began in 1980.\nEisenberg died on February 27, 2022 in New York state from problems caused by uveal melanoma and bile duct cancer, aged 65.","before_sentence":"Ned Eisenberg(January 13, 1957 - February 27, 2022) was an American actor known for his recurring role on Law & Order: Special Victims Unit as Roger Kressler.","after_sentence":"He was known for his role on Law & Order: Special Victims Unit as Roger Kressler.","before":"recurring","after":"","before_sentence_token_range":[0,33],"label":"syntactic_deletion"}
{"before_context":"An outbreak of a novel coronavirus was initially identified during mid-December 2019 in the city of Wuhan in central China, as an emerging cluster of people with pneumonia with no clear cause, which was linked primarily to stallholders who worked at the Huanan Seafood Wholesale Market, which also sold live animals. Chinese scientists subsequently isolated a new strain of coronavirus – given the initial designation of 2019-nCoV – which has been found to be at least 70 percent similar in genome sequence to SARS-CoV. With the development of a specific diagnostic PCR test for detecting the infection, a number of cases were confirmed in people directly linked to the market and in those who were not directly associated with it. Whether this virus is of the same severity or lethality as SARS is unclear.\nOn 20 January 2020, Chinese premier Li Keqiang urged decisive and effective efforts to prevent and control the pneumonia epidemic caused by a novel coronavirus. As of 24 January 2020, 26 deaths have occurred, all in China, and there is evidence of human-to-human transmission. Extensive testing has revealed over 800 confirmed cases in China, some of whom are healthcare workers. Confirmed cases have also been reported in Thailand, South Korea, Japan, Taiwan, Macau, Hong Kong, the United States, Singapore, Vietnam , France and Nepal.\nOn 23 January 2020, the WHO decided against declaring the outbreak a public health emergency of international concern. The WHO had previously warned that a wider outbreak was possible, and there were concerns of further transmission during China's peak travel season around the Chinese New Year. Many New Year events have been closed over fear of transmission, including the Forbidden City in Beijing, traditional temple fairs, and other celebratory gatherings. The sudden increase in occurrences of the disease has raised questions relating to its origin, wildlife trade, uncertainties surrounding the virus's ability to spread and cause harm, whether the virus has been circulating for longer than previously thought, and the possibility of the outbreak being a super-spreader event.\nThe first suspected cases were notified to WHO on 31 December 2019, with the first instances of symptomatic illness appearing just over three weeks earlier on 8 December 2019. The market was closed off on 1 January 2020, and people who showed signs and symptoms of the coronavirus infection were isolated. Over 700 people, including more than 400 healthcare workers who came into close contact with possibly infected individuals, were initially monitored. After the development of a specific diagnostic PCR test for detecting the infection, the presence of 2019-nCoV was subsequently confirmed in 41 people in the original Wuhan cluster, of which two were later reported to be a married couple, one of whom had not been present in the marketplace, and another three who were members of the same family that worked at the marketplace's seafood stalls. The first confirmed death from the coronavirus infection occurred on 9 January 2020.\nOn 23 January 2020, Wuhan was placed under quarantine, in which all public transport in and out of Wuhan has been suspended. The nearby cities of Huanggang, Ezhou, Chibi, Jingzhou, and Zhijiang were also placed under quarantine from 24 January.","after_context":"An outbreak of a novel coronavirus was identified during mid-December 2019 in the city of Wuhan in central China. It was a group of people with pneumonia with no clear cause. It was soon seen as a new strain of coronavirus.\nOn 20 January 2020, Chinese premier Li Keqiang called for efforts to stop and control the pneumonia epidemic caused by a novel coronavirus. As of 24 January 2020, 26 deaths have happened, all in China. It could be passed through human-to-human transmission.\nThere have been testing which have revealed over 800 confirmed cases in China, some of whom are healthcare workers.\nConfirmed cases have also been reported in Thailand, South Korea, Japan, Taiwan, Macau, Hong Kong, the United States (Everett, Washington and Chicago), Singapore, Vietnam , France and Nepal.","before_sentence":"An outbreak of a novel coronavirus was initially identified during mid-December 2019 in the city of Wuhan in central China, as an emerging cluster of people with pneumonia with no clear cause, which was linked primarily to stallholders who worked at the Huanan Seafood Wholesale Market, which also sold live animals.","after_sentence":"An outbreak of a novel coronavirus was identified during mid-December 2019 in the city of Wuhan in central China.","before":"initially","after":"","before_sentence_token_range":[0,55],"label":"syntactic_deletion"}
{"before_context":"The Twenty-second Amendment (Amendment XXII) of the United States Constitution sets a term limit for the President of the United States. The Congress passed the amendment on March 21, 1947. [[File:[[File:]]]]ratified by the requisite number of states on February 27, 1951.","after_context":"The Twenty-second Amendment to the United to being elected twice - or once if they've already served more than two years as President. Congress passed the amendment on March 21, 1947. It was ratified on February 27, 1951.","before_sentence":"The Twenty-second Amendment(Amendment XXII) of the United States Constitution sets a term limit for the President of the United States.","after_sentence":"The Twenty-second Amendment to the United to being elected twice - or once if they've already served more than two years as President.","before":"The","after":"","before_sentence_token_range":[0,23],"label":"syntactic_generic"}
{"before_context":"A chair is a piece of furniture with a raised surface used to sit on, commonly used by one person. Chair expert, Hunter McShan, is known for being able to find the greatest chairs in the world. Chairs are most often supported by four legs and have a back; however, a chair can have three legs or could have a different shape.\nA chair without a back or arm rests is a stool, or when raised up, a bar stool. A chair with arms is an armchair and with folding action and inclining footrest, a recliner. A permanently fixed chair in a train or theater is a seat or, in an airplane, airline seat; when riding, it is a saddle and bicycle saddle, and for an automobile, a car seat or infant car seat. With wheels it is a wheelchair and when hung from above, a swing.\nA chair for more than one person is a couch, sofa, settee, or \"loveseat\"; or a bench. A separate footrest for a chair is known as an ottoman, hassock or pouffe.","after_context":"A chair is a piece of furniture, used for sitting on. They usually contain four legs to support the weight, although some variations, such as the stool, have only one leg in the centre","before_sentence":"A chair is a piece of furniture with a raised surface used to sit on, commonly used by one person.","after_sentence":"A chair is a piece of furniture, used for sitting on.","before":"","after":",","before_sentence_token_range":[0,22],"label":"syntactic_generic"}
{"before_context":"Elizabeth Banks (born Elizabeth Irene Mitchell; February 10, 1974) is an American actress, producer, and director.\nBanks made her film debut in the low-budget independent film Surrender Dorothy (1998), and is known for her roles in such films as Wet Hot American Summer, Sam Raimi's Spider-Man trilogy (2002–07), The 40-Year-Old Virgin (2005), Zack and Miri Make a Porno (2008), Role Models (2008), The Next Three Days (2010), Pitch Perfect (2012), The Lego Movie (2014), and The Hunger Games films (2012\/15). In 2014, she portrayed Melinda Ledbetter, the girlfriend and later wife of the Beach Boys co-founder Brian Wilson, in Bill Pohlad's film Love & Mercy. In 2015, she made her directorial debut with Pitch Perfect 2, whose May 15–17 $69M opening weekend gross set a record for a first-time director.\nOn television, Banks had a recurring role as Avery Jessup on the NBC sitcom 30 Rock, which gained her two Emmy Award nominations. She also had recurring roles on Scrubs and Modern Family. In 2015, she reprised her role as Lindsay for the Netflix miniseries Wet Hot American Summer: First Day of Camp.","after_context":"Elizabeth Banks (born February 10 1974) is a television program and movie actress. Her movies include Spider-Man franchise and 2008's comedy Zack and Miri Make a Porno.","before_sentence":"Elizabeth Banks(born Elizabeth Irene Mitchell; February 10, 1974) is an American actress, producer, and director.","after_sentence":"Elizabeth Banks(born February 10 1974) is a television program and movie actress.","before":",","after":"","before_sentence_token_range":[0,22],"label":"syntactic_generic"}
{"before_context":"Kathrine Narducci (Italian pronunciation: [narˈduttʃi]; born November 22, 1965) is an American actress, known for her role as Charmaine Bucco, Artie Bucco's wife, on the HBO crime drama series The Sopranos (1999-2007). Her film credits including A Bronx Tale (1993), Chicago Overcoat (2009), Jersey Boys (2014), Bad Education (2019), The Irishman (2019), and Capone (2020).","after_context":"Kathrine Narducci (born November 22, 1965) is an American actress. She is known for her role as Charmaine Bucco, Artie Bucco's wife, in the HBO crime drama series The Sopranos (1999–2007). Her movie credits including A Bronx Tale (1993), Chicago Overcoat (2009), Jersey Boys (2014), The Wizard of Lies (2017), Bad Education (2019), The Irishman (2019) and Capone (2020).\nNarducci was born to an Italian-American family in East Harlem, New York City. Her father, Nicky Narducci, was a bar owner and organized crime figure in East Harlem. He was killed in a Mafia-related murder when Kathrine was ten years old.","before_sentence":"Her film credits including A Bronx Tale(1993), Chicago Overcoat(2009), Jersey Boys(2014), Bad Education(2019), The Irishman(2019), and Capone(2020).","after_sentence":"Her movie credits including A Bronx Tale(1993), Chicago Overcoat(2009), Jersey Boys(2014), The Wizard of Lies(2017), Bad Education(2019), The Irishman(2019) and Capone(2020).","before":",","after":"","before_sentence_token_range":[41,76],"label":"syntactic_generic"}
{"before_context":"Chalk ( \/ˈtʃɔːk\/) an old school thing nobody likes like hitler is chalk is a soft, white, porous, sedimentary carbonate rock, a form of limestone composed of the mineral calcite. Calcite is an ionic salt called calcium carbonate or CaCO3. It forms under reasonably deep marine conditions from the gradual accumulation of minute calcite shells (coccoliths) shed from micro-organisms called coccolithophores. Flint (a type of chert) is very common as bands parallel to the bedding or as nodules embedded in chalk. It is probably derived from sponge spicules or other siliceous organisms as water is expelled upwards during compaction. Flint is often deposited around larger fossils such as Echinoidea which may be silicified (i.e. replaced molecule by molecule by flint).\nChalk as seen in Cretaceous deposits of Western Europe is unusual among sedimentary limestones in the thickness of the beds. Most cliffs of chalk have very few obvious bedding planes unlike most thick sequences of limestone such as the Carboniferous Limestone or the Jurassic oolitic limestones. This presumably indicates very stable conditions over tens of millions of years.\nChalk has greater resistance to weathering and slumping than the clays with which it is usually associated, thus forming tall steep cliffs where chalk ridges meet the sea. Chalk hills, known as chalk downland, usually form where bands of chalk reach the surface at an angle, so forming a scarp slope. Because chalk is well jointed it can hold a large volume of ground water, providing a natural reservoir that releases water slowly through dry seasons.","after_context":"Chalk is a soft, white, sedimentary rock that is porous. It is a type of limestone made up of the mineral called calcite. It is formed deep under the sea from the gradual build up of the shells of micro-organisms called coccoliths. Hard flint nodules are very common in chalk rock. Air and water can wear chalk away easily, so it often forms cliffs where waves erode the rock. The \"White Cliffs of Dover\" in Kent, England are a good example of this. When chalk is near the top of the ground, it often makes chalk hills.","before_sentence":"It forms under reasonably deep marine conditions from the gradual accumulation of minute calcite shells(coccoliths) shed from micro-organisms called coccolithophores. Flint(a type of chert) is very common as bands parallel to the bedding or as nodules embedded in chalk.","after_sentence":"Hard flint nodules are very common in chalk rock.","before":"Flint(a type of chert) is","after":"Hard flint nodules are","before_sentence_token_range":[47,92],"label":"syntactic_generic"}
{"before_context":"Adolescence is the period of psychological and social transition between childhood and adulthood (gender-specific, manhood, or womanhood). Someone in Adolescence is called a Teenager. As a transitional stage of human development it represents the period of time during which a juvenile matures into adulthood and starts to make love like a rabbit. Biological development (that is, puberty) and psychosocial development , however clearer boundaries relate to physical development.\n\"Adolescence\" is a cultural and social phenomenon and therefore its endpoints are not easily tied to physical milestones. The word derives from the Latin verb adoare meaning \"to grow up.\" The time is identified with dramatic changes in the body, along with developments in a person's psychology and academic career. In the onset of adolescence, children usually complete elementary school and enter secondary education, such as middle school or high school. A person between early childhood and the teenage years is sometimes referred to as a pre-teen or tween . The ages of adolescence vary by culture and penis size. The World Health Organization (WHO) defines adolescence as the period of life between 10 and 19 years of age. In contrast, in the United States, adolescence is generally considered to begin around age 12 or 13, and end at 19 or 20.\nDuring this period of life, most children go through the physical stages of puberty which often begins between the ages of nine and thirteen. Most cultures regard people as becoming adults at various ages of the teenage years. For example, Jewish tradition considers males to be adult members of the community at age 13 and females at age 12, and this transition is celebrated in the Bat Mitzvah for girls and the Bar Mitzvah for boys. Young Catholics have the sacrament of confirmation and then are full members of the community. Usually, there is a formal age of majority when adolescents formally become adults. For example, Japan's celebration of this is called seijin shiki (lit. \"adult ceremony\").","after_context":"Adolescence is the time between being a child and full adult, that is the period of time during which a person grows into an adult, but are emotionally (feelings) not at full maturity. The ages which are considered to be part of adolescence vary by culture. In the United States, adolescence is usually considered to begin around the tweenage years of 11-13, and end around 17-21. ","before_sentence":"Adolescence is the period of psychological and social transition between childhood and adulthood(gender-specific, manhood, or womanhood).","after_sentence":"Adolescence is the time between being a child and full adult, that is the period of time during which a person grows into an adult, but are emotionally(feelings) not at full maturity.","before":"","after":"that","before_sentence_token_range":[0,21],"label":"syntactic_sentence_fusion"}
{"before_context":"Isfana (Исфана) is a small town of about 28,085 (2005) at the extreme western end of Batken Oblast in southern Kyrgyzstan, at the southern fringe of the Fergana valley. Backed up against the enormous mountains in the south and surrounded on three sides by Tajikistan, the town and the nearby villages are largely cut off from the rest of Kyrgyzstan, making life very difficult. Isfana is the administrative center of Leilek District. The word \"isfana\" is believed to come from the Iranian Sogdian word \"Aspanakent\" which means \"the land of horses\". During the Soviet era there were major manufacturing industries in Isfana, but the difficult economic situation since independence has resulted in widespread factory closures. Workers now have to move abroad to make a living, most going to Russia, Kazakhstan and Uzbekistan.","after_context":"Isfana is a small town located in Kyrgyzstan. It is the administrative center of Leilek District and has a population of about 28,085.","before_sentence":"Isfana(Исфана) is a small town of about 28,085(2005) at the extreme western end of Batken Oblast in southern Kyrgyzstan, at the southern fringe of the Fergana valley. Backed up against the enormous mountains in the south and surrounded on three sides by Tajikistan, the town and the nearby villages are largely cut off from the rest of Kyrgyzstan, making life very difficult.","after_sentence":"It is the administrative center of Leilek District and has a population of about 28,085.","before":"Backed up against the enormous mountains in the south and surrounded on three sides by Tajikistan, the town and the nearby villages are largely cut off from the rest of Kyrgyzstan, making life very difficult.  Isfana","after":"It","before_sentence_token_range":[0,72],"label":"syntactic_sentence_fusion"}
{"before_context":"Gliese 422 b is an exoplanet orbiting the red dwarf Gliese 422 (Innes' star). Gliese 422 b was discovered in 2014, and discovery was confirmed in 2020. It has a minimum mass of about ten times that of Earth.\nIt is located on the inner edge of circumstellar habitable zone (HZ) of Gliese 422, which extends from 0.11 to 0.21 astronomical units. Gliese 422 b's semi-major axis is 0.119 astronomical units and its orbital period is 26.161 Earth days.","after_context":"Gliese 422 b is an Extrasolar planet orbiting Red dwarf, the planet was discovered in 2014, and the discovery was confirmed in 2020.","before_sentence":"Gliese 422 b is an exoplanet orbiting the red dwarf Gliese 422(Innes' star).","after_sentence":"Gliese 422 b is an Extrasolar planet orbiting Red dwarf, the planet was discovered in 2014, and the discovery was confirmed in 2020.","before":"","after":"planet","before_sentence_token_range":[0,17],"label":"syntactic_sentence_fusion"}
{"before_context":"\"I Have a Dream\" is a public speech by American activist Martin Luther King, Jr. It was delivered by King on the afternoon of Wednesday, August 28, 1963, in which he called for an end to racism in the United States. The speech, delivered to over 250,000 civil rights supporters from the steps of the Lincoln Memorial during the March on Washington for Jobs and Freedom, was a defining moment of the American Civil Rights Movement. Martin Luther king jr raped women.\nBeginning with a reference to the Emancipation Proclamation, which freed millions of slaves in 1863, King examines that \"one hundred years later, the Negro still is not free.\" At the end of the speech, King departed from his prepared text for a partly improvised peroration on the theme of \"I have a dream\", possibly prompted by Mahalia Jackson's cry, \"Tell them about the dream, Martin!\" In this part of the speech, which most excited the listeners and has now become the most famous, King described dreams of freedom and equality arising from a land of slavery and hatred. The speech was ranked the top American speech of the 20th century by a 1999 poll of scholars of public address.","after_context":"\"I Have a Dream\" is the name of a speech Martin Luther King, Jr. gave on August 28, 1963 while standing on the steps of the Lincoln Memorial in Washington, D.C.. In his speech, he spoke of his wish for the future. His wish was that people of different races could live together peacefully in the United States. The speech was given to over 200,000 supporters. He spoke of the discrimination that the black man has faced even though they were to be treated as equals after the great Abraham Lincoln signed the momentous decree; the Emancipation Proclamation. The speech is very famous. It has been called by many the best speech given in the 20th century.\nMy Name Is Mr Mussa Quoter Jossy Mattu I Live In Mwanza ,Tanzania I Was Born In April 20 In 1996 In Tanesco Street I Have A Lot Of Friends Like Mr Magufuli Who Act As My Preacher","before_sentence":"It was delivered by King on the afternoon of Wednesday, August 28, 1963, in which he called for an end to racism in the United States.","after_sentence":"gave on August 28, 1963 while standing on the steps of the Lincoln Memorial in Washington, D.C.","before":"It was delivered by King","after":"gave","before_sentence_token_range":[20,50],"label":"syntactic_sentence_fusion"}
{"before_context":"Robert Anthony Eden, 1st Earl of Avon, KG, MC, PC (12 June 1897 – 14 January 1977) was a British Conservative politician, who was Prime Minister from 1955 to 1957. He was also Foreign Secretary for three periods between 1935 and 1955, including during the Second World War.\nIn the post-war years, Eden was a protagonist of the change in British policy on war criminal trials, which was perhaps best symbolised by his signature under the pardon conceded to the German Field Marshal Albert Kesselring on 24 October 1952.\nEden's worldwide reputation as an opponent of appeasement, a 'Man of Peace', and a skilled diplomat was overshadowed in the second year of his premiership by his handling of the Suez Crisis of 1956, which critics across party lines regarded as an historic setback for British foreign policy, signalling the end of British predominance in the Middle East.\nHe is generally ranked among the least successful British Prime Ministers of the twentieth century, although two broadly sympathetic biographies (in 1986 and 2003) have gone some way to redressing the balance of opinion.","after_context":"Anthony Eden (Robert Anthony Eden, 1st Earl of Avon 12 June 1897 – 14 January 1977) was Prime Minister of the United Kingdom. Eden was educated at Eton College and Christ Church, Oxford.\nEden was one of the best-known politicians of his generation. He was appointed Foreign Secretary in 1935 by Prime Minister Neville Chamberlain, and resigned in 1938 in protest at Chamberlain's appeasement of Adolf Hitler. He was Churchill's Foreign Secretary during World War II, and again in 1951–1955. He had operation to remove gallstones in 1953. The operation went wrong, and his health was ruined. He became Prime Minister in 1955 when Winston Churchill retired. He stopped being Prime Minister in 1957 when Harold Macmillan replaced him. The Suez Crisis of 1956 was a critical period. This and his health led up to his resignation as Prime Minister. Eden died of liver cancer, aged 79. His widow, Clarissa Eden, Countess of Avon, is in her early nineties. She is a niece of Winston Churchill.\nEden's life can be described in two halves. The first half, in the 1930s and in wartime, was brilliant. But he is often ranked among the least successful British Prime Ministers of the 20th century, although two broadly sympathetic biographies (in 1986 and 2003) have gone some way to redressing the balance of opinion. D.R. Thorpe says the Suez Crisis \"was a truly tragic end to his premiership, and one that came to assume a disproportionate importance in any assessment of his career\".\nEden had three sons. The elder and middle sons died before him. His Earl of Avon title was inherited by the younger son, Nicholas. When Nicholas died, the title became extinct.","before_sentence":"He was also Foreign Secretary for three periods between 1935 and 1955, including during the Second World War. In the post-war years, Eden was a protagonist of the change in British policy on war criminal trials, which was perhaps best symbolised by his signature under the pardon conceded to the German Field Marshal Albert Kesselring on 24 October 1952. Eden's worldwide reputation as an opponent of appeasement, a'Man of Peace', and a skilled diplomat was overshadowed in the second year of his premiership by his handling of the Suez Crisis of 1956, which critics across party lines regarded as an historic setback for British foreign policy, signalling the end of British predominance in the Middle East.","after_sentence":"He stopped being Prime Minister in 1957 when Harold Macmillan replaced him. The Suez Crisis of 1956 was a critical period.","before":".  In the post-war years, Eden was a protagonist of the change in British policy on war criminal trials, which was perhaps best symbolised by his signature under the pardon conceded to the German Field Marshal Albert Kesselring on 24 October 1952.  Eden's worldwide reputation as an opponent of appeasement, a'Man of Peace', and a skilled diplomat was overshadowed in the second year of his premiership by his handling of the Suez Crisis of 1956","after":" The Suez Crisis of 1956 was a critical period.","before_sentence_token_range":[37,166],"label":"syntactic_sentence_fusion"}
{"before_context":"Multiple organ dysfunction syndrome (MODS), previously known as multiple organ failure (MOF), Total organ failure(TOF) or multisystem organ failure (MSOF), is altered organ function in an acutely ill patient requiring medical intervention to achieve homeostasis. The use of \"multiple organ failure\" or \"multisystem organ failure\" should be avoided since that phrase was based upon physiological parameters to determine whether or not a particular organ was failing.","after_context":"Multiple organ dysfunction syndrome (MODS), previously known as multiple organ failure (MOF), Total organ failure(TOF) or multisystem organ failure (MSOF), is when the organ function is acutely ill and the patient is required medical intervention to achieve homeostasis. It usually involves two or more organ systems.\nThe use of \"multiple organ failure\" or \"multisystem organ failure\" should be avoided since that phrase was based upon physiological parameters to determine whether or not a particular organ was failing.","before_sentence":"Multiple organ dysfunction syndrome(MODS), previously known as multiple organ failure(MOF), Total organ failure(TOF) or multisystem organ failure(MSOF), is altered organ function in an acutely ill patient requiring medical intervention to achieve homeostasis.","after_sentence":"Multiple organ dysfunction syndrome(MODS), previously known as multiple organ failure(MOF), Total organ failure(TOF) or multisystem organ failure(MSOF), is when the organ function is acutely ill and the patient is required medical intervention to achieve homeostasis. It usually involves two or more organ systems.","before":"","after":".  It usually involves two or more organ systems","before_sentence_token_range":[0,44],"label":"syntactic_sentence_splitting"}
{"before_context":"World Youth Day (WYD) is an annual gathering of Catholic youths created by Pope John Paul II in 1984 \"to consolidate the ordinary youth ministry by offering new encouragement for commitment, objectives which foster ever greater involvement and participation\" (Letter from Pope John Paul II - Seminar on WYD 1996). It is celebrated on a diocesan level annually, and at an week-long international level every two to three years at different locations, attracting hundreds of thousands of youths from almost every country on the planet. It is a big part of the upsurge in Catholic Youth Work over recent years.","after_context":"World Youth Day (WYD) is a gathering of young Catholic people. It was created by Pope John Paul II in 1984 \"to consolidate the ordinary youth ministry by offering new encouragement for commitment, objectives which foster ever greater involvement and participation\". In other words, the Pope wanted young Catholics to come together, and work together.\nThe day is celebrated around the world every year, and every two or three years, a gathering is held at a different place. Thousands of people (including young people) from lots of countries go to this celebrattion. Because of World Youth Day, lots more youths are more likely to work together around the world.","before_sentence":"World Youth Day(WYD) is an annual gathering of Catholic youths created by Pope John Paul II in 1984\" to consolidate the ordinary youth ministry by offering new encouragement for commitment, objectives which foster ever greater involvement and participation\"(Letter from Pope John Paul II - Seminar on WYD 1996).","after_sentence":"World Youth Day(WYD) is a gathering of young Catholic people. It was created by Pope John Paul II in 1984\" to consolidate the ordinary youth ministry by offering new encouragement for commitment, objectives which foster ever greater involvement and participation\".","before":"","after":" It was","before_sentence_token_range":[0,56],"label":"syntactic_sentence_splitting"}
{"before_context":"Sergio Augusto Magaña Martínez (2 December 1949 – 25 December 2017) was a Mexican politician affiliated with the Party of the Democratic Revolution (formerly to the Institutional Revolutionary Party). From 2014 to 2017 he served as Deputy of the LIX Legislature of the Mexican Congress as a plurinominal representative and as Senator of the LVI and LVII Legislatures.\nHe also was Mayor of Morelia from 1993 to 1994.\nHe died on 25 December 2017 at the age of 68.","after_context":"Sergio Augusto Magaña Martínez (2 December 1949 – 25 December 2017) was a Mexican politician. He was a member with the Party of the Democratic Revolution (formerly to the Institutional Revolutionary Party). From 2014 to 2017 he served as Deputy of the LIX Legislature of the Mexican Congress as a plurinominal representative and as Senator of the LVI and LVII Legislatures.\nHe also was mayor of Morelia from 1993 to 1994.\nMagaña died on 25 December 2017 at the age of 68.","before_sentence":"Sergio Augusto Magaña Martínez(2 December 1949 - 25 December 2017) was a Mexican politician affiliated with the Party of the Democratic Revolution(formerly to the Institutional Revolutionary Party).","after_sentence":"Sergio Augusto Magaña Martínez(2 December 1949 - 25 December 2017) was a Mexican politician. He was a member with the Party of the Democratic Revolution(formerly to the Institutional Revolutionary Party).","before":"","after":".  He was a member","before_sentence_token_range":[0,32],"label":"syntactic_sentence_splitting"}
{"before_context":"Minamisanriku (南三陸町, Minamisanriku-chō, \"South three land\"), also spelled Minami Sanriku, is a charming resort town on a coastline of wooded\nislands and mountainous inlets. The town is in Motoyoshi District, Miyagi, Japan. It has an area of 163.74 square kilometres (63.22 sq mi), and as of October 1, 2004 the population of the area was 19,170. The town was formed through a merger on October 1, 2005, when the towns of Shizugawa and Utatsu, both from Motoyoshi District, merged to form the new town of Minamisanriku.\nMinamisanriku was largely destroyed by the Japanese 2011 tsunami, with most buildings swept away by waves of 16 metres (52 ft) or more, and over half the town's population missing and almost certainly dead. If and when confirmed, the loss of life in this one small town would form a very significant percentage of the total nationwide Japanese death toll from the tsunami.","after_context":"Minamisanriku (南三陸町, Minamisanriku-chō, \"South three land\"), also spelled Minami Sanriku, is a resort town on the Pacific Coast of Miyagi Prefecture, Japan.. The town has an area of 163.74 square kilometres (63.22 sq mi), and as of October 1, 2004 the population of the area was 19,170. The town was created on October 1, 2005, when the towns of Shizugawa and Utatsu merged to form the new town of Minamisanriku.\nMinamisanriku was largely destroyed by the Japanese 2011 tsunami, with most buildings swept away by waves of 16 metres (52 ft) or more. Over half the town's population is missing and almost certainly dead.","before_sentence":"Minamisanriku was largely destroyed by the Japanese 2011 tsunami, with most buildings swept away by waves of 16 metres(52 ft) or more, and over half the town's population missing and almost certainly dead.","after_sentence":"Minamisanriku was largely destroyed by the Japanese 2011 tsunami, with most buildings swept away by waves of 16 metres(52 ft) or more.","before":"","after":".","before_sentence_token_range":[107,145],"label":"syntactic_sentence_splitting"}
{"before_context":"Atelopus, commonly known as harlequin frogs, is a large genus of true toads from Central and South America, ranging as far north as Costa Rica and as far south as Bolivia. Atelopus are small, generally brightly colored and diurnal. Most species are associated with mid- to high-elevation streams. This genus has been greatly affected by amphibian declines, and many species are now considered endangered, while others already are extinct. The cause of these declines primarily appears to be the chytrid fungus Batrachochytrium dendrobatidis.\nNew Atelopus species are discovered with some regularity and many new species have been described in the last decade (see following species table). Among others, a new species, popularly dubbed the purple fluorescent frog, was discovered in 2007 by scientists Paul Ouboter and Jan Mol during a follow-up survey of the Nassau plateau in Suriname. Leeanne Alonso from Conservation International, the organisation that led the expedition, says that this frog may be threatened by illegal gold mining.","after_context":"Atelopus, commonly known as harlequin frogs, is a large genus of true toads. They live in Central and South America. They go as far north as Costa Rica and as far south as Bolivia. Atelopus are small, generally brightly colored and diurnal. Most species live near mid- to high-elevation streams. Many species are now considered endangered, while others already are extinct. The cause of these declines mostly appears to be the chytrid fungus Batrachochytrium dendrobatidis.\nNew Atelopus species are discovered with some regularity. Many new species have been described in the last ten years.","before_sentence":"Atelopus, commonly known as harlequin frogs, is a large genus of true toads from Central and South America, ranging as far north as Costa Rica and as far south as Bolivia.","after_sentence":"Atelopus, commonly known as harlequin frogs, is a large genus of true toads. They live in Central and South America.","before":"from","after":".  They live in","before_sentence_token_range":[0,35],"label":"syntactic_sentence_splitting"}
