{"before_context":"Lambda is General Motors' full-size crossover SUV automobile platform. It is largely derived from the GM Epsilon platform, which underlies the Chevrolet Malibu sedan and similar models.\nThe Buick Enclave concept car was previewed at the 2006 North American International Auto Show, and the Saturn Outlook was shown at the 2006 New York Auto Show. The 2007 Outlook and GMC Acadia went into production in late 2006, followed by the 2008 Enclave in mid-2007, and the 2009 Chevrolet Traverse in mid-2008.\nLambda vehicles feature easily accessible three-row seating. They were supplied with the LY7 3.6-liter V6. Starting with the 2009 model year all Lambda vehicles have GM LLT 3.6-liter gasoline direct injection engine for improved fuel efficiency, horsepower and torque. With the cancellation of GM's next-generation DOHC V8, it appears unlikely that GM will offer a V8 engine for Lambda. The platform has been designed for front and all-wheel drive applications. Lambda vehicles are produced in the new Lansing Delta Township Assembly plant near Lansing, Michigan. The Traverse began production in September 2008 at a retooled Spring Hill Assembly Plant in Tennessee, but production was later moved to Lansing. GM discontinued the Outlook after the 2010 model year along with the entire Saturn brand.\nIt has been reported that Cadillac will receive a Lambda vehicle in 2012, which could possibly replace the current GMT900-based Escalade.\nMeanwhile, GM announced a second generation of its GMC Acadia for the 2013 model year, taking the bodyshell of the defunct Saturn Outlook, while at the same time, GM would refresh its Buick Enclave & Chevrolet Traverse vehicles.","after_context":"GM Lambda platform is a car platform designed and used by General Motors. It is a full-size crossover platform. Lambda is based on the earlier GM Epsilon platform. This is used for the Chevrolet Malibu sedan and other similar models. The Lambda architecture is used by the Chevrolet Traverse, Buick Enclave, Saturn Outlook and GMC Acadia.\nThe Buick Enclave concept car was previewed at the 2006 North American International Auto Show. The Saturn Outlook was shown at the 2006 New York Auto Show. The 2007 Outlook and GMC Acadia went into production in late 2006. This was followed by the 2008 Enclave in mid-2007, and the 2009 Chevrolet Traverse in mid-2008.\nLambda vehicles feature easily accessible three-row seating. They were supplied with the LY7 3.6-liter V6. Starting with the 2009 model year all Lambda vehicles have GM LLT 3.6-liter gasoline direct injection engine for improved fuel efficiency, horsepower and torque. With the cancellation of GM's next-generation DOHC V8, it appears unlikely that GM will offer a V8 engine for Lambda. The platform has been designed for front and all-wheel drive applications. Lambda is expected to be replaced by the new GM C1XX platform.\nThe lambda-based GM vehicles are now considered America's most American vehicle. Frank DuBois, of the Washington, DC-based American University created a new model for finding out which cars have the highest percentage of American parts and labor. His index shows the GM Lambda platform CUVs are the most \"American made.\"","before_sentence":"","after_sentence":"GM Lambda platform is a car platform designed and used by General Motors.","before":"","after":"GM Lambda platform is a car platform designed and used by","before_diff_span_range":[0,0],"after_diff_span_range":[0,11],"before_sentence_token_range":[0,0],"after_sentence_token_range":[0,14],"label":"semantic_elaboration_background"}
{"before_context":"The Leyden jar, or Leiden jar, is a device that \"stores\" static electricity between two electrodes on the inside and outside of a jar. It was invented independently by German cleric Ewald Georg von Kleist on 11th October 1744 and by Dutch scientist Pieter van Musschenbroek of Leiden (Leyden) in 1745—1746. The invention was named for this city. It was the original form of the capacitor. The Leyden jar was used to conduct many early experiments in electricity, and its discovery was of fundamental importance in the study of electricity. Previously, researchers had to resort to insulated conductors of large dimensions to store charge. The Leyden jar provided a much more compact alternative.","after_context":"The Leyden jar or Leiden jar is a kind of a battery. This means it stores electrical energy between two electrodes. One of them is inside of a jar and the other one is outside. Ewald Georg von Kleist developed this system in Germany in 1744. The Dutch scientist Pieter van Musschenbroek in Leiden (Leyden) about two years later.","before_sentence":"It was invented independently by German cleric Ewald Georg von Kleist on 11th October 1744 and by Dutch scientist Pieter van Musschenbroek of Leiden(Leyden) in 1745-1746.","after_sentence":"Ewald Georg von Kleist developed this system in Germany in 1744.","before":"","after":"developed this system in Germany in","before_diff_span_range":[39,39],"after_diff_span_range":[43,49],"before_sentence_token_range":[29,58],"after_sentence_token_range":[38,50],"label":"semantic_elaboration_background"}
{"before_context":"A sphere (from Greek σφαῖρα — sphaira, \"globe, ball\") is a perfectly round geometrical object in three-dimensional space that is the surface of a completely round ball, (viz., analogous to a circular object in two dimensions) Like a circle, which geometrically is a two-dimensional object, a sphere is defined mathematically as the set of points that are all at the same distance r from a given point, but in three-dimensional space. This distance r is the radius of the ball, and the given point is the center of the mathematical ball. The longest straight line through the ball, connecting two points of the sphere, passes through the center and its length is thus twice the radius; it is a diameter of the ball.\nWhile outside mathematics the terms \"sphere\" and \"ball\" are sometimes used interchangeably, in mathematics a distinction is made between the sphere (a two-dimensional closed surface embedded in three-dimensional Euclidean space) and the ball (a three-dimensional shape that includes the sphere as well as everything inside the sphere). The ball and the sphere share the same radius, diameter, and center.","after_context":"A sphere is a shape in space that is like the surface of a ball. Usually, the words ball and sphere mean the same thing. But in mathematics, a sphere is the surface of a ball, which is given by all the points in three dimensional space that are located at a fixed distance from the center. The distance from the center is called radius of the sphere. When the sphere is filled in with all the points inside, it called a ball.\nCommon things that have the shape of a sphere are are basketballs, superballs, and playground balls. The Earth and the Sun are nearly spherical, meaning sphere-shaped. A sphere is the three-dimensional analog of a circle.","before_sentence":"This distance r is the radius of the ball, and the given point is the center of the mathematical ball.","after_sentence":"Common things that have the shape of a sphere are are basketballs, superballs, and playground balls. The Earth and the Sun are nearly spherical, meaning sphere-shaped.","before":"the","after":" The Earth and the Sun are nearly spherical, meaning sphere-shaped.","before_diff_span_range":[85,86],"after_diff_span_range":[107,118],"before_sentence_token_range":[84,106],"after_sentence_token_range":[92,123],"label":"semantic_elaboration_example"}
{"before_context":"A vinculum is a horizontal line placed over a mathematical expression, used to indicate that it is to be considered a group.\nExamples of its use include the case of a group of infinitely repeating digits, for example,\nIt is also used in the notation of a radical to indicate the radicand whose root is being indicated. In the case of\nthe quantity a\nb\n+\n2\n{\\displaystyle ab+2} is the radicand, and thus has a vinculum over it.\nThe vinculum is also sometimes used in Boolean_algebra, where it serves to indicate a group of expressions whose logical result is to be NOTed, as in","after_context":"A vinculum is a horizontal line placed over a mathematical expression. It shows that this expression belongs together as a group. (Vinculum is Latin for \"chain\".)\nExamples of its use include the case of a group of infinitely repeating digits, for example,\nIt is also used in common arithmetic to show that the numerator is being divided by the denominator as a whole group.\nIt is also used in the notation of a radical to indicate the radicand whose root is being indicated. In the next case, the quantity a\nb\n+\n2\n{\\displaystyle ab+2} is the radicand, and thus has a vinculum over it.\nIt is also used to show the repeating terms in a periodic continued fraction. Quadratic irrational numbers are the only numbers that have these.","before_sentence":"Examples of its use include the case of a group of infinitely repeating digits, for example, It is also used in the notation of a radical to indicate the radicand whose root is being indicated.","after_sentence":") Examples of its use include the case of a group of infinitely repeating digits, for example, It is also used in common arithmetic to show that the numerator is being divided by the denominator as a whole group.","before":"","after":"common arithmetic to show that the numerator is being divided by the denominator as a whole group.","before_diff_span_range":[47,47],"after_diff_span_range":[53,70],"before_sentence_token_range":[24,62],"after_sentence_token_range":[31,73],"label":"semantic_elaboration_example"}
{"before_context":"Mexico\nMexican athletes have won a total of 62 medals - with athletics, boxing and diving as the top medal-producing sports.\nThe National Olympic Committee for Mexico is the Comité Olímpico Mexicano and was created in 1923.","after_context":"Mexico first was at the Olympic Games in 1900. They have been in every Summer Olympic Games since 1924. Mexico has also been in several Winter Olympic Games since 1928.\nMexico was the host nation of the 1968 Summer Olympics in Mexico City.\nThe National Olympic Committee for Mexico is the Comité Olímpico Mexicano and was formed in 1923.","before_sentence":"Mexico Mexican athletes have won a total of 62 medals - with athletics, boxing and diving as the top medal-producing sports.","after_sentence":"Mexico first was at the Olympic Games in 1900.","before":"","after":"first was at the Olympic Games in 1900.","before_diff_span_range":[1,1],"after_diff_span_range":[1,9],"before_sentence_token_range":[0,23],"after_sentence_token_range":[0,10],"label":"semantic_elaboration_generic"}
{"before_context":"Estelle Harris (née Nussbaum; April 4, 1928) is an American stand-up comedienne, actress, and voice artist, often recognized for her shrill, grating voice. She is best known for her role as Estelle Costanza on Seinfeld from 1992 to 1998, as the voice of Mrs. Potato Head in the Toy Story franchise, and Muriel on The Suite Life of Zack & Cody.","after_context":"Estelle Harris (born Estelle Nussbaum April 4, 1928 in New York City, New York) is a comedian, actress, voice actress, and television actress. She is best known for her role as Estelle Costanza in Seinfield. To younger audiences she is known for her role as Mrs. Potato Head in Toy Story 2, and in Toy Story 3. She is also known as Muriel on The Suite Life of Zach and Cody.","before_sentence":"Estelle Harris(née Nussbaum; April 4, 1928) is an American stand-up comedienne, actress, and voice artist, often recognized for her shrill, grating voice.","after_sentence":"Estelle Harris(born Estelle Nussbaum April 4, 1928 in New York City, New York) is a comedian, actress, voice actress, and television actress.","before":"","after":"television actress","before_diff_span_range":[19,19],"after_diff_span_range":[25,27],"before_sentence_token_range":[0,31],"after_sentence_token_range":[0,30],"label":"semantic_elaboration_generic"}
{"before_context":"James Henry Scullin (18 September 1876 – 28 January 1953) was an Australian Labor Party politician and the ninth Prime Minister of Australia. Two days after he was sworn in as Prime Minister the Wall Street Crash of 1929 occurred, marking the beginning of the Great Depression and subsequent Great Depression in Australia. Already in a weak political position, the economic crisis would prove overwhelming for Scullin, with interpersonal and policy disagreements causing a three-way split of his party in 1931. These defections would bring down his government by the end of the year, and the Scullin's government was routed as the resulting early election of 1931. Despite his chaotic term of office, Scullin was personally popular and was a leading figure in the Labor movement throughout his lifetime. He would remain a trusted éminence grise within the party until his retirement in 1949.","after_context":"James Henry Scullin (18 September 1876 – 28 January 1953) was the ninth Prime Minister of Australia from October 1929 until January 1932. He became Prime Minister two days before the Great Depression began. His government could not stop the effects of the Depression. His government suffered a big defeat at the December 1931 election. Scullin stayed as leader of the Labor Party but lost the 1934 election.","before_sentence":"Two days after he was sworn in as Prime Minister the Wall Street Crash of 1929 occurred, marking the beginning of the Great Depression and subsequent Great Depression in Australia.","after_sentence":"He became Prime Minister two days before the Great Depression began.","before":"the Wall Street Crash of 1929 occurred, marking the beginning of the Great Depression","after":"the Great Depression began","before_diff_span_range":[35,49],"after_diff_span_range":[32,36],"before_sentence_token_range":[25,57],"after_sentence_token_range":[25,37],"label":"semantic_hypernymy"}
{"before_context":"The Max Headroom broadcast signal intrusion was a television signal hijacking occurring in Chicago, Illinois, United States, on the evening of November 22, 1987, involving at least two individuals known as Dan Rather and John R. MacDougall. It is an example of what is known in the television business as broadcast signal intrusion. Two Chicago television stations had their broadcast signals hijacked by Dan Rather wearing a Max Headroom mask and sunglasses. A homemade Max Headroom background rocked back and forth in the background.\nDan was successful in interrupting two broadcast television stations within the course of three hours. The first incident took place for 25 seconds during the sportscast on the 9:00 PM news on WGN-TV Channel 9, and the second, two hours later, after 11:00 PM on PBS affiliate WTTW Channel 11 for about 90 seconds during a broadcast of an episode of the Doctor Who serial Horror of Fang Rock.\nThe second pirate broadcast, which lasted 90 seconds and was pre-recorded on videotape, featured the individual parodying WGN and television in general. The hacker rambled on making reference to Headroom's endorsement of Coke, the series Clutch Cargo, and WGN anchor Chuck Swirsky, then pretended to defecate as a \"masterpiece for all the greatest world newspaper nerds\", a reference to WGN's call letters (\"World's Greatest Newspaper\"). The video ended with the hacker’s exposed buttocks being spanked with a flyswatter by an accomplice before normal programming resumed.\nThe incident made national headlines and the people responsible have been identified as Dan Rather and John R. MacDougall. Dan and MacDougall then got arrested in 1995 for hijacking, they served 1 year in prison.","after_context":"The Max Headroom broadcast signal intrusion was a television signal hijacking that happened in Chicago, Illinois, United States, on the evening of November 22, 1987. It involved at least three unknown people. It is an example of what is known in the television business as broadcast signal intrusion. Two Chicago television stations, WGN-TV and WTTW, had their broadcast signals hijacked by an unknown person wearing a Max Headroom mask and sunglasses. A homemade Max Headroom background rocked back and forth in the background. The incident happened two times within a course of three hours. The first incident took place for 25 seconds during the sportscast on the 9:00 PM news on WGN-TV Channel 9, and the second, two hours later, after 11:00 PM on PBS related WTTW Channel 11 for about 90 seconds during a broadcast of an episode of the Doctor Who serial Horror of Fang Rock.\nThe incident made national headlines and the people responsible have never been identified.","before_sentence":"Dan was successful in interrupting two broadcast television stations within the course of three hours.","after_sentence":"The incident happened two times within a course of three hours.","before":"Dan was successful in interrupting two broadcast television stations","after":"The incident happened two times","before_diff_span_range":[94,103],"after_diff_span_range":[94,99],"before_sentence_token_range":[94,110],"after_sentence_token_range":[94,106],"label":"semantic_hypernymy"}
{"before_context":"Keith Carter (1970 – February 3, 2016), also known as Big Kap and The Wardin, was an American hip-hop DJ who was born in New York City. In 1995, he was a member of hip hop supergroup The Flip Squad. He was well known for the 1999 album The Tunnel with Funkmaster Flex, named after the New York nightclub where he was a regular DJ. He died in New York late on February 3, 2016 due to a heart attack. He was aged 45 at the time of his death. According to his road manager Ab Traxx, Keith dealt with diabetes, but he did not believe it was what caused his fatal heart attack. Keith was previously slated to work on a showcase in Atlanta on the day of his death, shortly after his passing, the event became a memorial for Keith.\nBig Kap is also well known for a video that went viral in 2011 consisting of Notorious B.I.G. throwing a water bottle at Big Kap during a Summer Jam concert before storming off the stage in 1995.","after_context":"Big Kap was a DJ who was born at New York in 1970. He is well known for his album The Tunnel with DJ Funkmaster Flex, which was released in 1999. He died due to a heart attack on February 3, 2016 in New York. He was aged 45 at the time of his death.","before_sentence":"Keith Carter(1970 - February 3, 2016), also known as Big Kap and The Wardin, was an American hip-hop DJ who was born in New York City.","after_sentence":"Big Kap was a DJ who was born at New York in 1970.","before":"City.","after":"","before_diff_span_range":[25,26],"after_diff_span_range":[13,13],"before_sentence_token_range":[0,32],"after_sentence_token_range":[0,14],"label":"syntactic_deletion"}
{"before_context":"Polksville is an unincorporated community in Bath County, Kentucky, United States. Polksville is located on U.S. Route 60 2.5 miles (4.0 km) northwest of Salt Lick.","after_context":"Polksville is an unincorporated community in Bath County, Kentucky, United States. Polksville is on U.S. Route 60. It is 2.5 miles (4.0 km) northwest of Salt Lick.","before_sentence":"Polksville is located on U.S.","after_sentence":"Polksville is on U.S.","before":"located","after":"","before_diff_span_range":[16,17],"after_diff_span_range":[16,16],"before_sentence_token_range":[14,21],"after_sentence_token_range":[14,20],"label":"syntactic_deletion"}
{"before_context":"Elba (Latin: Ilva) is an island in Tuscany, Italy, 20 km from the coastal town of Piombino (42°44′N 10°22′E﻿ \/ ﻿42.733°N 10.367°E﻿ \/ 42.733; 10.367) . It is the largest island of the Tuscan Archipelago, and the third largest island in Italy after Sicily and Sardinia. Elba and the other islands (Gorgona, Capraia, Pianosa, Montecristo, Giglio and Giannutri) of the Tuscan Archipelago are protected in the National Park of the Tuscan Archipelago. The French island of Corsica lies about 35 Km to the west.\nThe island is divided into eight comunes: Portoferraio, Campo nell'Elba, Capoliveri, Marciana, Marciana Marina, Porto Azzurro, Rio Marina and Rio nell'Elba. The land area of the island is about 224 km2 (86 square miles) and the coastline is about 147 km (91 miles). The highest mountain is Monte Capanne at 1018 metres (3340 feet).","after_context":"Elba is third largest island off the coast of Italy.\nThe land area of the island is about 224 square kms and the coastline is about 147 km. The highest mountain is Monte Capanne at 1018 metres (3340 feet).","before_sentence":"It is the largest island of the Tuscan Archipelago, and the third largest island in Italy after Sicily and Sardinia.","after_sentence":"Elba is third largest island off the coast of Italy.","before":"in","after":"","before_diff_span_range":[43,44],"after_diff_span_range":[9,9],"before_sentence_token_range":[36,58],"after_sentence_token_range":[0,11],"label":"syntactic_generic"}
{"before_context":"Married... with Children is an American sitcom that aired for 11 seasons that featured a dysfunctional family living in a fictional Chicago, Illinois suburb. The show, notable for being the first prime time television series to air on Fox, ran from April 5, 1987, to June 9, 1997. The series was created by Michael G. Moye and Ron Leavitt. The show was known for handling non-standard topics for the time period, which garnered the then-fledgling Fox network a standing among the Big Three television networks.\nThe series' 11-season, 259-episode run makes it the longest-lasting live-action sitcom on the Fox network. The show's famous theme song is \"Love and Marriage\" by Sammy Cahn and Jimmy Van Heusen, performed by Frank Sinatra from the 1955 television production Our Town.\nThe first season of the series was videotaped at ABC Television Center in Hollywood. From season two to season eight, the show was taped at Sunset Gower Studios in Hollywood and the remaining three seasons were taped at Sony Pictures Studios in Culver City. The series was produced by Embassy Communications on its first season and the remaining seasons by ELP Communications under the studio Columbia Pictures Television (and eventually Columbia TriStar Television).\nIn 2007, it placed as #46 of Time Magazine's \"100 Best TV Shows of All-Time.\" In 2008, The show placed #94 on Entertainment Weekly's \"New TV Classics\" list.\nOn April 22, 2012, Fox re-aired the series premiere in honor of its 25th anniversary.","after_context":"Married... with Children is an American] sitcom that aired for 11 seasons. It was about a family living in a fictional Chicago, Illinois, suburb. It stars Ed O'Neill, Katey Segal, Christina Applegate, Ted McGinley, and David Garrison. On April 22, 2012, Fox re-aired the series premiere in honor of its 25th anniversary.","before_sentence":"with Children is an American sitcom that aired for 11 seasons that featured a dysfunctional family living in a fictional Chicago, Illinois suburb.","after_sentence":"It was about a family living in a fictional Chicago, Illinois, suburb.","before":"","after":",","before_diff_span_range":[27,27],"after_diff_span_range":[29,30],"before_sentence_token_range":[4,29],"after_sentence_token_range":[16,31],"label":"syntactic_generic"}
{"before_context":"Rutherford Birchard Hayes (October 4, 1822– January 17, 1893) was the 19th President of the United States from March 4 1877 to March 4 1881 and was twice the Governor of Ohio 1868-1872 and 1876-1877.\nHayes was born in Delaware, Ohio and graduated from Harvard Law School in 1845. He practiced law in Lower Sandusky (now Fremont) and was a city solicitor for Cincinatti 1858-1861. He served in the American Civil War and rose to the rank of major-general in 1864 and also served in the US congress 1864-1867 as a Republican before being elected the Governor of Ohio. In 1876, he won the Republican party presidential nomination but believed he had lost the Election to Democrat Samuel J. Tilden.\nHayes was elected President by one electoral vote after the highly disputed election of 1876. Losing the popular vote to his opponent, Samuel Tilden, Hayes was the only president whose election was decided by a congressional commission. During his otherwise uneventful presidency, he ordered federal troops to suppress The Great Railroad Strike of 1877 and he kept his promise to southerners by extracting troops from the South, effectively ending the era of Reconstruction. He reformed the civil service by alienating political spoils seekers and advocated the repeal of the Tenure of Office Act . He chose not to run for a second term.","after_context":"Rutherford B. Hayes (1822 - 1893 was the 19th President of the United States. He served only one term, from 1877 to 1881. Hayes was a Republican and was elected governor of Ohio three times prior to becoming president. Hayes narrowly won the contested election of 1876, only defeating Democratic opponent Samuel Tilden after a Congressional committee awarded Hayes some disputed electoral votes.","before_sentence":"Rutherford Birchard Hayes(October 4, 1822- January 17, 1893) was the 19th President of the United States from March 4 1877 to March 4 1881 and was twice the Governor of Ohio 1868-1872 and 1876-1877.","after_sentence":"Hayes(1822 - 1893 was the 19th President of the United States.","before":"","after":".","before_diff_span_range":[18,18],"after_diff_span_range":[14,15],"before_sentence_token_range":[0,39],"after_sentence_token_range":[3,16],"label":"syntactic_sentence_fusion"}
{"before_context":"The history of Latin poetry can be understood as the adaptation of Greek models. The verse comedies of Plautus are considered the earliest surviving examples of Latin literature and are estimated to have been composed around 205-184 BC. The start of Latin literature is conventionally dated to the first performance of a play in verse by a Greek slave, Livius Andronicus, at Rome in 240 BC. Livius translated Greek New Comedy for Roman audiences, using meters that were basically those of Greek drama, modified to the needs of Latin. His successors Plautus and Terence further refined the borrowings from the Greek stage and the prosody of their verse is substantially the same as for classical Latin verse. The traditional meter of Greek epic, the dactylic hexameter, was introduced into Latin literature by Ennius (239-169 BC), virtually a contemporary of Livius, who substituted it for the jerky Saturnian meter in which Livius had been composing epic verses. Ennius moulded a poetic diction and style suited to the imported hexameter, providing a model for 'classical' poets such as Virgil and Ovid. The late republic saw the emergence of Neoteric Poets, notably Catullus—rich young men from the Italian provinces, conscious of metropolitan sophistication, and looking to the scholarly Alexandrian poet Callimachus for inspiration. Catullus shared the Alexandrian's preference for short poems and wrote within a variety of meters borrowed from Greece, including Aeolian forms such as hendecasyllabic verse, the Sapphic stanza and Greater Asclepiad, as well as iambic verses such as the choliamb and the iambic tetrameter catalectic (a dialogue meter borrowed from Old Comedy). Horace, whose career crossed the divide between republic and empire, followed Catullus' lead in employing Greek lyrical forms, identifying with Alcaeus of Mytilene, composing Alcaic stanzas, and also with Archilochus, composing poetic invectives in the Iambus tradition (in which he adopted the metrical form of the Epode or 'Iambic Distich'). Horace was a contemporary of Virgil and, like the epic poet, he wrote verses in dactylic hexameter, but in a conversational and epistolary style. Virgil's hexameters are generally regarded as \"the supreme metrical system of Latin literature.\"","after_context":"Latin poetry is the poetry of Ancient Rome. They started by adapting Greek models. The verse comedies of Plautus are the earliest surviving examples of Latin literature. They were probably composed around 205–184 BC. There was a play written by a Greek slave, Livius Andronicus, at Rome in 240 BC. Livius translated Greek comedy for Roman audiences. He used metres that were those of Greek drama, but modified to the needs of Latin. His successors, Plautus and Terence, continued this process. The traditional metre of Greek epic poetry, the dactylic hexameter, was introduced into Latin literature by Ennius (239–169 BC). Ennius provided a model for the later 'classical' poets such as Virgil and Ovid. Horace (who was a contemporary of Virgil) wrote verses in dactylic hexameter. They were in a conversational style, as if writing a letter. Virgil's hexameters are regarded as \"the supreme metrical system of Latin literature\".","before_sentence":"Catullus shared the Alexandrian's preference for short poems and wrote within a variety of meters borrowed from Greece, including Aeolian forms such as hendecasyllabic verse, the Sapphic stanza and Greater Asclepiad, as well as iambic verses such as the choliamb and the iambic tetrameter catalectic(a dialogue meter borrowed from Old Comedy). Horace, whose career crossed the divide between republic and empire, followed Catullus' lead in employing Greek lyrical forms, identifying with Alcaeus of Mytilene, composing Alcaic stanzas, and also with Archilochus, composing poetic invectives in the Iambus tradition(in which he adopted the metrical form of the Epode or'Iambic Distich').","after_sentence":"Horace(who was a contemporary of Virgil) wrote verses in dactylic hexameter.","before":", whose career crossed the divide between republic and empire, followed Catullus' lead in employing Greek lyrical forms, identifying with Alcaeus of Mytilene, composing Alcaic stanzas, and also with Archilochus, composing poetic invectives in the Iambus tradition(in which he adopted the metrical form of the Epode or'Iambic Distich').  Horace","after":"(who","before_diff_span_range":[279,329],"after_diff_span_range":[136,137],"before_sentence_token_range":[232,350],"after_sentence_token_range":[133,147],"label":"syntactic_sentence_fusion"}
{"before_context":"Dalarö is a locality situated in Haninge Municipality, Stockholm County, Sweden with 1,199 inhabitants in 2010.\nIt is situated south-east of Stockholm and is part of Metropolitan Stockholm and serves as a recreational summer spot for Stockholmers. At the beginning of the year 2004, the automobile company Volvo used the town for the unconventional The Mystery of Dalarö advertising campaign.\nDalarö is Haninge Municipality's oldest locality, originally an old pilot- and customscommunity. Today Dalarö is largely characterized by the development which were added in the late 1800s, when society developed into a popular summer resort for Stockholmers. Dalarö has long been home to Swedish high society's seaside houses. Since the 19th century, the town of Dalarö has been a fashionable holiday resort for the international upper class. Dalarö is also a desirable family resort for the wealthy. The historical valuable buildings are of national interest. Dalarö society as well as the surrounding built-up area has a diverse year-round and summer cottages. During the summer months Dalarö frequented by a large number of tourists.","after_context":"Dalarö is a locality in Haninge Municipality in Stockholm County in Sweden. In 2010, 1,199 people lied there. It is situated southeast of Stockholm and is part of Metropolitan Stockholm. It serves as a recreational summer resort for people from Stockholm.","before_sentence":"It is situated south-east of Stockholm and is part of Metropolitan Stockholm and serves as a recreational summer spot for Stockholmers.","after_sentence":"It is situated southeast of Stockholm and is part of Metropolitan Stockholm. It serves as a recreational summer resort for people from Stockholm.","before":"and","after":".  It","before_diff_span_range":[32,33],"after_diff_span_range":[34,37],"before_sentence_token_range":[20,42],"after_sentence_token_range":[22,47],"label":"syntactic_sentence_splitting"}
{"before_context":"In physical geography, a steppe (Russian: степь - [sʲtʲepʲ], Ukrainian: степ - \/stʲɛp\/, Kazakh: дала - \/dɑlɑ\/), pronounced in English as \/stɛp\/, is a plain without trees (apart from those near rivers and lakes); it is similar to a prairie, although a prairie is generally considered as being dominated by tall grasses, while short grasses are said to be the norm in the steppe. It may be semi-desert, or covered with grass or shrubs or both, depending on the season and latitude. The term is also used to denote the climate encountered in regions too dry to support a forest, but not dry enough to be a desert.\nThe climate of mid-latitude steppes can be summarized by hot summers and cold winters, averaging 250-500 mm (10-20 inches) of rain or equivalent in snowfall per year. In tropical locations, necessary rainfall to separate steppes from true deserts may be half as much again due to greater evapotranspiration. ==Biology==(i hate biology I FAILED IT)\nPlant life is usually greater than one foot tall, including the blue grama and buffalo grass, cacti, sagebrush, spear grass, and other small relatives of the sunflower. Animal life includes the Corsac Fox, Mongolian Gerbil, Saiga Antelope, Eurasian Lynx, and the Saker Falcon.\n==Locations==(PUEDO IR AL BANO)\nThe world's largest zone of steppes, often referred to as \"the Great Steppe\", is found in central Russia and neighbouring countries in Central Asia. The Pontic steppe stretches from Ukraine in the west to the Ural Mountains and the Caspian Sea. To the east of the Caspian Sea, the steppes extend through Turkmenistan, Uzbekistan and Kazakhstan to the Altai, Koppet Dag and Tian Shan ranges. The vast Eurasian Steppe, as it is called, incorporates all of these steppes. The area is bordered in the north, on the eastern side of the Urals, by the forested West Siberian Plain taiga, extending nearly as far as the Arctic Ocean. Other regions of steppes include transition zones between savanna and severe desert such as the Sahel that fringes the true Sahara or similar semi-arid lands that fringe the Thar desert of the Indian subcontinent or the more severe deserts of Australia. Another large steppe area is located in the central United States and western Canada. The High Plains steppe is the westernmost part of the Great Plains region. A significant steppe, noteworthy for not grading into desert, is the Sertão of northeastern Brazil.\nSome steppes are to be found in transition zones between zones of Mediterranean climate and desert, such as Tijuana, Baja California, and in places cut off from adequate moisture due to rain shadow effects such as Zaragoza, Spain.","after_context":"In physical geography, a steppe is a plain without trees (apart from those near rivers and lakes). It is similar to a short-grass prairie, although a prairie is generally considered as North America, and the steppe is in eastern Europe and central Asia. Sometimes the short-grass prairie in North America is also called a steppe. Similar places in Africa are called savanna. The world's largest steppe, sometimes called The Great Steppe, is in Russia. ","before_sentence":"In physical geography, a steppe(Russian: степь - [sʲtʲepʲ], Ukrainian: степ - \/stʲɛp\/, Kazakh: дала - \/dɑlɑ\/), pronounced in English as \/stɛp\/, is a plain without trees(apart from those near rivers and lakes); it is similar to a prairie, although a prairie is generally considered as being dominated by tall grasses, while short grasses are said to be the norm in the steppe.","after_sentence":"In physical geography, a steppe is a plain without trees(apart from those near rivers and lakes). It is similar to a short-grass prairie, although a prairie is generally considered as North America, and the steppe is in eastern Europe and central Asia.","before":"; it","after":".  It","before_diff_span_range":[36,38],"after_diff_span_range":[19,22],"before_sentence_token_range":[0,78],"after_sentence_token_range":[0,49],"label":"syntactic_sentence_splitting"}
