{"before_content":"Saint-Cierges is a former municipality in the district of Gros-de-Vaud in the canton of Vaud in Switzerland. Its name refers to Saint Cyriacus, who is the town's patron saint. The municipalities of Chapelle-sur-Moudon, Correvon, Denezy, Martherenges, Neyruz-sur-Moudon, Peyres-Possens, Saint-Cierges, Thierrens and Chanéaz merged on 1 January 2013 into the new municipality of Montanaire.","after_content":"Saint-Cierges is a former municipality of the district of Gros-de-Vaud in the canton of Vaud in Switzerland. On 1 January 2013 the former municipalities of Chanéaz, Chapelle-sur-Moudon, Correvon, Denezy, Martherenges, Neyruz-sur-Moudon, Peyres-Possens, Saint-Cierges and Thierrens joined together to become the new municipality of Montanaire.","before":",","after":"and","before_token_range":[47,48],"after_token_range":[40,41]}
{"before_content":"Edward Paul Beck (June 28, 1936-October 16, 2019) is a former American college basketball player. He is best known as the starting center and team captain of the \"Fiddlin' Five,\" the University of Kentucky's 1958 NCAA championship team.\nBeck was recruited to play at Kentucky after scoring 1,549 points leading winning two state titles at Fort Valley High School. Beck was named team captain by head coach Adolph Rupp going into his senior season after scoring 259 points and grabbing 380 rebounds as a junior. As a senior, Beck scored 163 points and had 337 rebounds in 29 games and was named Southeastern Conference (SEC) Defensive Player of the Year. Beck finished his college career with 459 points scored (5.6 per game) and 783 rebounds (10.0 per game) in 78 total games.\nAfter his collegiate career ended Beck opted not to play professionally, turning down a contract from the New York Knicks. He decided to pursue a career in ministry and became an ordained Methodist minister after graduating from the Candler School of Theology at Emory University.","after_content":"Edward Paul Beck (June 28, 1936 – October 16, 2019) was an American college basketball player. He was best known as the starting center and team captain of the \"Fiddlin' Five,\" the University of Kentucky's 1958 NCAA championship team.\nBeck finished his college career with 459 points scored (5.6 per game) and 783 rebounds (10.0 per game) in 78 total games.\nBeck died on October 16, 2019 in Phoenix, Arizona at the age of 83.","before":"is","after":"was","before_token_range":[20,21],"after_token_range":[21,22]}
{"before_content":"The Enemy is a post-apocalyptic young adult horror novel written by Charlie Higson. The book takes place in London after a worldwide sickness has infected adults turning them into something akin to zombies. It was published by Puffin Books in the UK on 3 September 2009 and by Disney-Hyperion in the U.S. on 11 May 2010. The Enemy is the first in a planned series of six. The second novel, titled 'The Dead', was published on 16 September 2010.\nThe third novel in the series is to be published in 2011.","after_content":"The Enemy is a young adult horror novel. It was written by English author Charlie Higson. The novel takes place in London. It is about the life of children after a worldwide sickness has turned adults into zombies. It was published by Puffin Books in the UK on 3 September, 2009.","before":"infectedadultsturning them","after":"turnedadults","before_token_range":[25,29],"after_token_range":[39,41]}
{"before_content":"Coordinates: 51°23′1″N 0°31′32″E﻿ \/ ﻿51.38361°N 0.52556°E﻿ \/ 51.38361; 0.52556\nThe Pentagon Shopping Centre (known locally as 'The Pentagon') is a shopping centre in Chatham in Kent. The shopping centre is located next to the Waterfront bus station which replaces the Pentagon bus station, which 80% of services use. The shopping centre contains over 70 shops, many high street names in fashion, homeware and food stores. There are also cafes, restaurants and a bowling alley. As is common with some other 1970's era town centre shopping centres, The Penatagon does not feature a food court or any dedicated dining area. Instead, there are various food outlets scattered throughout the centre. Built as part of the redevelopment of Chatham town centre in the 1970s, the Pentagon also features the high rise Mountbatten House office block, which has controversially stood empty or part-used for most of its history. The Pentagon, Mountbatten House and the multi-storey carparks are built in distinctive orange-red brick with grey concrete.","after_content":"The Pentagon Shopping Centre (known locally as 'The Pentagon') is a shopping centre in Chatham, Kent. The shopping centre is next to the Waterfront bus station which replaced the Pentagon bus station.","before":"replaces","after":"replaced","before_token_range":[45,46],"after_token_range":[31,32]}
{"before_content":"Igor Mikhailovich Diakonov (Russian: И́горь Миха́йлович Дья́конов) (December 30, 1914 (January 12, 1915), Petrograd – May 2, 1999, St Petersburg) was a Russian\/Soviet historian, linguist, and translator who should be ranked among the greatest authorities on Ancient Near East and its languages. Diakonov, both of whose brothers were distinguished historians, was brought up in Norway and graduated from the Leningrad University in 1938, joining the staff of the Hermitage Museum the same year. In 1949, he published a comprehensive study of Assyria, followed by the monograph on Media in 1956. Later, he teamed with the linguist Sergei Starostin to produce authoritative studies of the Caucasian, Afro-Asiatic and Hurro-Urartian languages.","after_content":"Igor Mikhailovich Diakonov (December 30, 1914 (January 12, 1915), Petrograd – May 2, 1999, St Petersburg) was a Russian\/Soviet historian, linguist, and translator who should be ranked among the greatest authorities on Ancient Near East and its languages.","before":"(January 12","after":"","before_token_range":[11,12],"after_token_range":[9,9]}
{"before_content":"Seed of Chucky is a 2004 American comedy slasher film, the fifth installment of the Child's Play series, and sequel to 1998's Bride of Chucky as well as the first film to be distributed by an another company since Child's Play. The film was written and directed by Don Mancini, who created the series and has written all of the films. With this entry, Mancini made his directorial debut. The film is set six years after Child's Play 3 and Bride of Chucky and follows a young doll named Glen, the son of Chucky and Tiffany, resurrecting his parents, causing terrible chaos.\nThe film, shot in Romania, continues the series' evolution from the pure horror genre of the first movie to a hybrid horror-comedy. It was the last Child's Play film to be released in theaters, with all future installments to be released direct to DVD. The film was followed by another sequel, Curse of Chucky, released on home video and Netflix in 2013.","after_content":"Seed of Chucky is a 2004 American comedy slasher movie. It is the fifth installment of the Child's Play series, and sequel to 1998's Bride of Chucky. The movie was written and directed by Don Mancini, who created the series .\nThe film, shot in Romania, continues the series' evolution from horror to a horror-comedy. It was the last Child's Play movie to be released in theaters, with all future installments to be released direct to DVD.","before":"hybrid","after":"","before_token_range":[133,134],"after_token_range":[63,63]}
{"before_content":"The Minié ball, or Minni ball, is a type of muzzle-loading spin-stabilized bullet for rifled muskets named after its co-developer, Claude-Étienne Minié, inventor of the French Minié rifle. It came to prominence in the Crimean and American Civil War.\nRifling – the addition of spiral grooves inside a gun barrel, which imparts a spin to a bullet – greatly increases the range and accuracy of a gun. Prior to the Minié ball, balls had to be jammed down the rifle barrel, sometimes with a mallet, and after a relatively small number of shots, gunpowder residue built up in the spiral grooves, which then had to be cleaned out. The development of the Minié ball was significant because it was the first projectile which was small enough to be easily put down the barrel of a rifled long gun. Both the American Springfield Model 1861 and the British Pattern 1853 Enfield rifled muskets – the most common weapons used during the American Civil War – used the Minié ball.","after_content":"The Minié ball, or Minni ball, is a type of muzzle-loading spin-stabilized bullet for rifled muskets named after its developer, Claude-Étienne Minié, inventor of the French Minié rifle. It came to prominence in the Crimean War and American Civil War.\nRifling, the addition of spiral grooves inside a gun barrel, givesa spin to a bullet, greatly increasing the range and accuracy of a gun. Before the Minié ball, balls had to be jammed down the rifle barrel, sometimes with a mallet, and after a relatively small number of shots, gunpowder leftovers built up in the spiral grooves, which then had to be cleaned out. The development of the Minié ball was significant, because it was the first projectile that was small enough to be easily put down the barrel of a rifled long gun. Both the American Springfield Model 1861 and the British Pattern 1853 Enfield rifled muskets, the most common weapons used during the American Civil War, used the Minié ball.\nThe Minié ball did a lot if damage in the American Civil War. It made it really hard for surgeons to treat wounded soldiers because Minié balls shattered bones often.","before":"Prior to","after":"Before","before_token_range":[75,77],"after_token_range":[74,75]}
{"before_content":"Libramont-Chevigny is a Walloon municipality of Belgium in Luxembourg Province. On 1 January 2007 the municipality, which covers 177.86 km², had 9,981 inhabitants, giving a population density of 56.1 inhabitants per km².","after_content":"Libramont-Chevigny is a municipality located in the Belgian province of Luxembourg.\nIn 2007 its population was 9981.\nIt is located at 49° 55 North, 05° 22 East.","before":"On 1 January","after":"","before_token_range":[11,14],"after_token_range":[13,13]}
{"before_content":"John Randolph Thune (born January 7, 1961) is the junior United States Senator from South Dakota and a member of the Republican Party. He previously served as a United States Representative for South Dakota's at-large congressional district. He will become South Dakota's Senior senator with the retirement of Tim Johnson.","after_content":"John Randolph Thune (born January 7, 1961) is an American politician. Thune is the junior United States Senator from South Dakota and a member of the Republican Party. He previously served as a United States Representative for South Dakota's at-large congressional district.\nThune was born on January 7, 1961 in Murdo, South Dakota. He is of a Norwegian descent. Thune studied at Biola University and at the University of South Dakota. He has been married to Kimberley Weems since 1984. They have two children.","before":"","after":"Thune was born on January 7, 1961 in Murdo,","before_token_range":[42,42],"after_token_range":[48,57]}
{"before_content":"Butanone, also known as methyl ethyl ketone (MEK),[a] is an organic compound with the formula CH3C(O)CH2CH3. This colorless liquid ketone has a sharp, sweet odor reminiscent of butterscotch and acetone. It is produced industrially on a large scale, and also occurs in trace amounts in nature. It is soluble in water and is commonly used as an industrial solvent.","after_content":"Butanone, also called methyl ethyl ketone (MEK), is an organic compound with the chemical formula CH3C(O)CH2CH3. It is a simple ketone with four carbon atoms. It smells sharp and sweet, like butterscotch and acetone mixed. It is soluble in water and is used as a solvent.","before":"This colorless liquid","after":"","before_token_range":[22,25],"after_token_range":[26,26]}
{"before_content":"Jerry Lewis (born Joseph Levitch; March 16, 1926) is an American comedian, actor, film producer, screenwriter, film director and singer. He is best-known for his slapstick humor in screen, television, stage and radio. He was originally paired up with Dean Martin in 1946, forming the famed comedy team of Martin and Lewis. In addition to the duo's popular nightclub work, they starred in a successful series of comedy films for Paramount Pictures. As an innovative filmmaker, Lewis is credited with inventing the video assist system in cinematography. Lewis is also known for his charity fund-raising telethons and position as national chairman for the Muscular Dystrophy Association (MDA). Lewis has won several awards for lifetime achievements from The American Comedy Awards, The Golden Camera, Los Angeles Film Critics Association, and The Venice Film Festival, and he has two stars on the Hollywood Walk of Fame. In 2005, he received the Governors Award of the Academy of Television Arts & Sciences Board of Governors, which is the highest Emmy Award presented. On February 22, 2009, the Academy of Motion Picture Arts and Sciences awarded Lewis the Jean Hersholt Humanitarian Award.","after_content":"Jerry Lewis (born 16 March 1926) is a comedian and actor from the United States. He is best known for acting in many comedy movies from the 1950s and 1960s. He also helps to raise money for people with disabilities and illnesses.","before":"","after":"1960s","before_token_range":[36,36],"after_token_range":[31,32]}
{"before_content":"Elio Sgreccia (6 June 1928 – 5 June 2019) was an Italian bioethicist and a cardinal of the Roman Catholic Church. He was president emeritus of the Pontifical Academy for Life, director of the international medical ethics journal Medicina e Morale, president of the Ut Vitam Habeant Foundation and the Donum Vitae Association of the Diocese of Rome, and honorary president of the International Federation of Bioethics Centers and Institutes of Personalist Inspiration (FIBIP).","after_content":"Elio Sgreccia (6 June 1928 – 5 June 2019) was an Italian bioethicist and a cardinal of the Roman Catholic Church. He was born in Arcevia. He became a priest in 1952, and was created cardinal by Pope Benedict XVI in 2010. Sgreccia was president of the Pontifical Academy for Life from 2005 to 2008. He was also director of the international medical ethics journal Medicina e Morale, president of the Ut Vitam Habeant Foundation and the Donum Vitae Association of the Diocese of Rome, and honorary president of the International Federation of Bioethics Centers and Institutes of Personalist Inspiration (FIBIP).\nSgreccia died on 5 June 2019, a day before his 91st birthday.","before":"","after":"Sgreccia died on 5 June 2019, a day before his 91st birthday.","before_token_range":[81,81],"after_token_range":[110,122]}
{"before_content":"Osmosis is the movement of water molecules across a semi-permeable membrane from a region of low concentration to a region of high concentration until a state of dynamic equilibrium is reached. This movement of water has the effect of equalising the concentration on both sides of the membrane.\nOsmosis is the movement of water molecules across a partially-permeable membrane down a water potential gradient. More specifically, it is the movement of water across a partially permeable membrane from an area of high water potential (low solute concentration) to an area of low water potential (high solute concentration). It is a physical process in which a solvent moves, without input of energy, across a semipermeable membrane (permeable to the solvent, but not the solute) separating two solutions of different concentrations. Osmosis releases energy, and can be made to do work. Osmosis is a passive process, like diffusion.\nNet movement of solvent is from the less-concentrated (hypotonic) to the more-concentrated (hypertonic) solution, which tends to reduce the difference in concentrations. This effect can be countered by increasing the pressure of the hypertonic solution, with respect to the hypotonic. The osmotic pressure is defined to be the pressure required to maintain an equilibrium, with no net movement of solvent. Osmotic pressure is a colligative property, meaning that the osmotic pressure depends on the molar concentration of the solute but not on its identity.\nOsmosis is important in biological systems, as many biological membranes are semipermeable. In general, these membranes are impermeable to organic solutes with large molecules, such as polysaccharides, while permeable to water and small, uncharged solutes. Permeability may depend on solubility properties, charge, or chemistry, as well as solute size. Water molecules travel through the plasma cell wall, tonoplast (vacuole) or protoplast in two ways, either by diffusing across the phospholipid bilayer directly, or via aquaporins (small transmembrane proteins similar to those in facilitated diffusion and in creating ion channels). Osmosis provides the primary means by which water is transported into and out of cells. The turgor pressure of a cell is largely maintained by osmosis, across the cell membrane, between the cell interior and its relatively hypotonic environment.","after_content":"Osmosis is the movement of water through a plasma membrane from a region of low salt concentration to a region of high concentration. Osmosis is passive transport, meaning it does not require energy to be applied. What causes osmotic pressure is different concentrations of salt ions on the two sides of the membrane. When osmosis happens, water moves from the side of the membrane with a lower amount of osmotic pressure to the side of the membrane with the higher amount. An important example of osmosis is the movement of liquid (solvent) molecules across a cell membrane into a cell with a higher solute concentration. Osmosis is a fundamental part of cell biochemistry, but also has mechanical applications and usages.","before":"water potential gradient. More specifically, it is the movement of water acrossa","after":"cell withahigher","before_token_range":[63,77],"after_token_range":[103,107]}
{"before_content":"Daniel Hamhuis (born December 13, 1982) is a Canadian professional ice hockey defenceman who currently plays with and is an alternate captain for the Vancouver Canucks of the National Hockey League.\nHamhuis played major junior hockey with the Prince George Cougars of the Western Hockey League (WHL) and was selected 12th overall by the Nashville Predators in the 2001 NHL Entry Draft. The following year, he was awarded the Bill Hunter Memorial Trophy and Four Broncos Memorial Trophy as the league's best defenceman and player of the year, respectively; he would also be named the top defenceman in the Canadian Hockey League (CHL), the governing body of major junior hockey in Canada. After a final season in the WHL, Hamhuis made his professional debut with the Milwaukee Admirals of the American Hockey League (AHL), a minor league affiliate of the Predators. He made his NHL debut the next year for Nashville. After five seasons with the club, Hamhuis became an unrestricted free agent and signed a six-year contract with the Canucks. In his first year with the club, he helped Vancouver to the 2011 Stanley Cup Finals, where they lost to the Boston Bruins.\nHamhuis has played in several international tournaments at both the junior and senior levels for Canada. At the 2001 and 2002 World Junior Championships, he won a bronze and silver medal, respectively. He also appeared in four straight World Championships, winning a gold at the 2007 tournament and silver at both the 2008 and 2009 tournaments. On January 7th, 2014, he was named to the 2014 Canadian Olympic Hockey Team, winning a gold medal at the 2014 Winter Olympics.","after_content":"Daniel Hamhuis (born December 13, 1982 in Smithers, British Columbia, Canada) is a professional Canadian ice hockey defencemen that currently plays for the Vancouver Canucks of the National Hockey League (NHL).\nHamhuis formerly played for the Nashville Predators for 6 seasons.\nHamhuis played in the WHL for the Prince George Cougars for 4 seasons and played for the Milwaukee Admirals in the AHL.","before":"Canadianprofessional","after":"professionalCanadian","before_token_range":[10,12],"after_token_range":[15,17]}
{"before_content":"The International Statistical Classification of Diseases and Related Health Problems (most commonly known by the abbreviation ICD) is a medical classification that provides codes to classify diseases and a wide variety of signs, symptoms, abnormal findings, complaints, social circumstances, and external causes of injury or disease. Under this system, every health condition can be assigned to a unique category and given a code, up to six characters long. Such categories can include a set of similar diseases.\nThe International Classification of Diseases is published by the World Health Organization (WHO) and used worldwide for morbidity and mortality statistics, reimbursement systems, and automated decision support in medicine. This system is designed to promote international comparability in the collection, processing, classification, and presentation of these statistics. The ICD is a core classification of the WHO Family of International Classifications (WHO-FIC).\nThe ICD is revised periodically and is currently in its tenth edition. The ICD-10, as it is therefore known, was developed in 1992 to track mortality statistics. ICD-11 is planned for 2015 and will be revised using Web 2.0 principles. Annual minor updates and triennial major updates are published by the WHO. The ICD is part of a \"family\" of guides that can be used to complement each other, including also the International Classification of Functioning, Disability and Health which focuses on the domains of functioning (disability) associated with health conditions, from both medical and social perspectives.","after_content":"The International Statistical Classification of Diseases and Related Health Problems (also known as ICD) is a list of codes that classify diseases and medical problems. A special, unique code is given to:\nICD is published by the World Health Organization. One of the ICD's goals is to make sure that different doctors - and different countries - are using the same diagnoses. This makes it easier to compare how diseases affect different countries. The ICD has been changed and updated many times. The most recent edition is the ICD-11. ICD-11 has been adopted by the World Health Assembly of WHO for use starting 1 January 2022 It has been revised using Web 2.0.","before":"symptoms, abnormal findings, complaints, social circumstances, and external causes of injury or disease. Under this system, every health condition can be assigned","after":"","before_token_range":[35,58],"after_token_range":[34,34]}
{"before_content":"Suhoor (Arabic:سحور lit. of the dawn), also called Sehri, Sahari and Sahur in other languages, is an Islamic term referring to the meal consumed early in the morning by Muslims before fasting, sawm, in daylight hours during the Islamic month of Ramadan. The meal is eaten before the sun rises, and before the fajr or dawn prayer. Suhoor as the morning meal is matched by iftar as the evening meal, during Ramadan. lalalala","after_content":"Suhoor (Arabic: سحور lit. of the dawn) is also called Sehri, Sahari and Sahur in other languages. It is an Islamic term referring to the meal had early in the morning by Muslims before fasting.","before":"consumed","after":"had","before_token_range":[29,30],"after_token_range":[32,33]}
{"before_content":"Pierremont is a commune in the Pas-de-Calais département in the Nord-Pas-de-Calais region of France.","after_content":"Pierremont is a commune. It is found in the region Nord-Pas-de-Calais in the Pas-de-Calais department in the north of France.","before":"","after":"north","before_token_range":[10,10],"after_token_range":[19,20]}
{"before_content":"In humans and animals, fear is modulated by the process of cognition and learning. Thus fear is judged as rational or appropriate and irrational or inappropriate. An irrational fear is called a phobia.\nPsychologists such as John B. Watson, Robert Plutchik, and Paul Ekman have suggested that there is only a small set of basic or innate emotions and that fear is one of them. This hypothesized set includes such emotions as acute stress reaction, anger, angst, anxiety, fright, horror, joy, panic, and sadness. Fear is closely related to, but should be distinguished from, the emotion anxiety, which occurs as the result of threats that are perceived to be uncontrollable or unavoidable. The fear response serves survival by generating appropriate behavioral responses, so it has been preserved throughout evolution.","after_content":"Fear is a feeling or an emotion. A person who fears something does not want it to happen. The fear response comes from sensing danger. It leads to the fight-or-flight response. In extreme cases of fear (horror and terror) there may be a freeze response or paralysis.\nIn humans and animals, fear is adjusted by cognition and learning. Thus fear is rational or appropriate, or it is irrational or inappropriate. An irrational fear is called a phobia.\nFear is the body's way of protecting itself from doing things that may be dangerous. For example, if one has a fear of jumping off a cliff, he\/she will not do it. This saves one from death. In this case, fear is a good thing but in others, it can be bad. An example of fear being bad is if it stops one from doing something important, like going to see a doctor.\nThere is only a small set of basic or innate emotions and fear is one of them. Without fear we would not be so careful and responsible like we are now if we didn't have any fear then people would stop working and they would not have the fear of being poor and they would also not care if they actually doing something that might be the cause of their death so at the end every one has fear it might be the fear of snakes,dogs, heights anything else but fear is some thing that we all have and we all try to overtake The fear response helps survival by triggering appropriate behavioral responses. It has been preserved throughout evolution.","before":"are perceived to be uncontrollable or unavoidable.","after":"","before_token_range":[112,119],"after_token_range":[268,268]}
{"before_content":"Takashi Takabayashi (高林 隆, Takabayashi Takashi, August 2, 1931 – December 27, 2009) was a Japanese football player. He played for Japan national team.","after_content":"Takashi Takabayashi (born 2 August 1931 - died 27 December 2009) is a former Japanese football player. He has played for Japan national team.","before":"(高林 隆, Takabayashi Takashi,","after":"","before_token_range":[2,6],"after_token_range":[4,4]}
{"before_content":"In the biblical Books of Kings (2 Kings 18:4; written c. 550 BCE), the Nehushtan (Hebrew: נחשתן‎ Nəḥuštān [nə.ħuʃ.taːn]) is the derogatory name given to the bronze serpent on a pole first described in the Book of Numbers which God told Moses to erect so that the Israelites who saw it would be protected from dying from the bites of the \"fiery serpents\", which God had sent to punish them for speaking against Him and Moses (Numbers 21:4–9). In Kings, King Hezekiah institutes an iconoclastic reform that requires the destruction of \"the brazen serpent that Moses had made; for unto those days the children of Israel did burn incense to it; and it was called Nehushtan\". The term means \"a brazen thing, a mere piece of brass\".","after_content":"The Nehushtan (Hebrew: נחשתן Nəḥuštān [nə.ħuʃ.taːn]) is the bronze serpent on a pole first described in the Book of Numbers. God told Moses to make it. This was to cure the Israelites. Those who saw the nehushtan would be cured from the deathly bites of the \"fiery serpents\". God initially sent the fiery serpents to to punish them for speaking against Him and Moses (Numbers 21:4-9 KJV). In the biblical Books of Kings (2 Kings 18:4; written c. 550 BCE), King Hezekiah leads an iconoclastic reform. This requires the destruction of \"the brazen serpent that Moses had made; for unto those days the children of Israel did burn incense to it; and it was called Nehushtan\". The term means \"a brazen thing, a mere piece of brass\".","before":"(Numbers 21","after":"(Numbers 21","before_token_range":[83,85],"after_token_range":[75,76]}
{"before_content":"Nargis Rabadi (24 April 1929 – 6 March 2018), better known by her stage name Shammi, was an Indian film actress who appeared in over two hundred Hindi films. Shammi remained a sought-after with filmmakers when it came to goofy and comic roles, especially in the period 1949–1969 and later from 1980–2002. Her famous films as supporting actress included Dil Apna Aur Preet Parai, Half Ticket, Halaku, Samaj Ko Badal Dalo,Khuda Gawah, Coolie No. 1, Gopi Kishan and Hum Saath Saath Hain and films with Rajesh Khanna like The Train, Aanchal, Kudrat, Red Rose (film), Awara Baap and Swarg. She had been a leading actress playing main female lead or second female lead in Hindi films between 1949–1955 as well. Later, from 1986 till 1998, she appeared in many popular television serials such as Dekh Bhai Dekh, Zabaan Sambhal Ke, Shriman Shrimati, Kabhi Yeh Kabhi Woh and Filmi Chakkar. Shammi was married to film producer director Sultan Ahmed for seven years, before they were divorced. Shammi is the younger sister of fashion designer Mani Rabadi.","after_content":"Shammi (24 April 1929 – 6 March 2018), born Nargis Rabadi, was an Indian movie actress. She appeared in over two hundred Hindi movies. Shammi was born in Bombay, India.\nHer famous movies as supporting actress included Dil Apna Aur Preet Parai, Half Ticket, Halaku, Samaj Ko Badal Dalo,Khuda Gawah, Coolie No. 1, Gopi Kishan and Hum Saath Saath Hain and movies with Rajesh Khanna like The Train, Aanchal, Kudrat, Red Rose (movie), Awara Baap and Swarg.\nShammi died in her sleep on the March 6, 2018, from natural causes at the age of 88.","before":"She had been a leading actress playing main female lead or second female lead","after":"","before_token_range":[118,132],"after_token_range":[100,100]}
{"before_content":"Michael Brandner (born 13 February 1995) is an Austrian professional association football player who plays for FC Liefering.","after_content":"Michael Brandner ( born 13 February 1995) is a football player from Austria. He plays for F. C. Liefering, the second team of F.C. Red Bull Salzburg, in the SKY GO Erste Liga (2nd level in Austrian football) as midfielder.","before":"(born","after":"( born","before_token_range":[2,3],"after_token_range":[2,4]}
{"before_content":"Learning music by ear is done by repeatedly listening to other musicians and then attempting to recreate what one hears. This is how people learn music in any musical tradition in which there is no complete musical notation. Many people in cultures which do have notation still learn by ear, and ear training is common practice among those who use notation extensively.\nIn the West learning by ear is associated with traditional and folk music, but many classical music forms throughout the world lack notation, and have therefore been passed from generation to generation by ear.\nThe Suzuki method of teaching music focuses on playing by ear from a very young age. In his book \"Teaching from the Balance Point,\" Edward Kreitman, a US based Suzuki Teacher, clearly distinguishes \"learning by ear\" as a separate, completely different process from \"learning by rote\". See also: Music lesson","after_content":"Learning music by ear is learning to play a piece of music by listening to other people playing it and then trying to play it oneself. In some musical traditions there is no written music and everybody plays by ear all the time. Folk music is traditionally learned by listening to other musicians and copying them. This is how music is passed from one generation to another.\nMost people in the Western musical tradition learn pieces and songs by reading music, but it is good to try to play music by ear sometimes. It can be a very useful skill.\nThe Suzuki method of learning instruments started in Japan but is now used in many countries. It teaches young children to play an instrument (usually the violin) by ear.","before":"","after":" It can be a very useful skill","before_token_range":[100,100],"after_token_range":[98,106]}
{"before_content":"Marietta Giannakou (Greek: Μαριέττα Γιαννάκου, 6 June 1951 – 27 February 2022) was a Greek politician, member of New Democracy. She served as Minister for National Education and Religious Affairs of Greece.","after_content":"Marietta Giannakou (Greek: Μαριέττα Γιαννάκου, 6 June 1951 – 27 February 2022) was a Greek politician. She was a member of the New Democracy Party. Giannakou was born in Geraki Lakonias, Greece. From 2004 until 2007, she was the Minister of Education. Giannakou was a Member of the European Parliament from 2009 until 2014.\nIn January 2022, Giannakou was hospitalized in Athens, Greece after falling from her wheelchair and suffering a subdural hematoma. She died of a heart attack on 27 February 2022, aged 70.","before":"","after":" In January 2022, Giannakou was hospitalized in Athens, Greece after falling from her wheelchair and suffering a subdural hematoma","before_token_range":[24,24],"after_token_range":[62,82]}
{"before_content":"Sehnsa is a large town in Pakistan Administered Azad Kashmir which lies on the west of Gulpur on the Kotli-Rawaplindi road. Sehnsa is a sub-divisional (Thesil) headquarters of Kotli district in the center of Sehnsa valley.Raja Amir Khan is a great lawyer, politician, statesman and the founder of Sehnsa. He is popularly and officially known in Azad Kashmir as Baba-e-Sehnsa( \"Father of the Kashmir\").\nContents [hide] 1 Education 2 Importance 3 Earthquake 2005 4 Location 5 Scenic Places 6 Geography and climate 7 Language 8 Famous people's 9 External links\n[edit]","after_content":"Sehnsa (Urdu: سہنسہ) is a large town in Azad Kashmir. It is a sub-district of the Kotli District.","before":"Raja Amir Khan is a great lawyer, politician, statesman and the founder of Sehnsa. He is popularly and officially known in Azad Kashmir as Baba-e-Sehnsa(\" Father","after":"","before_token_range":[36,63],"after_token_range":[15,15]}
{"before_content":"\"Some Enchanted Evening\" is the thirteenth and final aired and first producedepisode of The Simpsons' first season and originally aired on the Fox network on May 13, 1990. Although it was the first episode produced, it aired as the season finale due to significant animation problems. The episode features Bart, Lisa, and Maggie's encounter with the notorious Babysitter Bandit. After resolving a marital dilemma, Homer and Marge want to spend a night on the town so they need a babysitter to look after their children. They hire Ms. Botz through a babysitting service. Ms. Botz is later revealed to be the \"Babysitter Bandit\" and after restraining the eldest children, she robs the family.\nThe episode features cultural references to such films as The Night of the Hunter and Psycho as well as a musical reference to A Star Is Born. It received mixed reception: some critics deemed it the best episode of the season while others regarded it as the season's poorest.","after_content":"\"Some Enchanted Evening\" is the thirteenth and final episode of The Simpsons first season and first started on the Fox network on May 13, 1990. Although it was the first episode made, it started on television as the season finale because of many animation problems. In the episode, Bart, Lisa, and Maggie meet the notorious \"Babysitter Bandit\". After answering a marital dilemma, Homer and Marge want to spend a night on the town so they need a babysitter to look after their children. They hire Ms. Botz through a babysitting service. Ms. Botz is later known to be the \"Babysitter Bandit\" and after tying up Bart and Lisa, she robs the family.\nThe episode has references to such films as \"The Night of the Hunter\" and \"Psycho\" as well as a musical reference to \"A Star Is Born.\" It got some good and bad reviews; some people thought it the best episode of the season, while others thought it the season's worst.","before":"","after":",","before_token_range":[56,56],"after_token_range":[55,56]}
{"before_content":"An electric fish is a fish that can generate electric fields. It is said to be electrogenic; a fish that has the ability to detect electric fields is said to be electroreceptive. Most electrogenic fish are also electroreceptive. Electric fish species can be found both in the sea and in freshwater rivers of South America (Gymnotiformes) and Africa (Mormyridae). Many fish such as sharks, rays and catfishes can detect electric fields, and are thus electroreceptive, but as they cannot generate an electric field they are not classified as electric fish. Most common bony fish (teleosts), including most fish kept in aquaria or caught for food, are neither electrogenic nor electroreceptive.","after_content":"An Electric fish is a fish that can make electric fields. Fishes that can generate such fields are said to be electorgenic, those that can detect them are called electroreceptive. Most electrogenic fish are also electroreceptive. Many fish, for example sharks, rays, and catfishes are electroreceptive. They cannot generate electric fields though, and are therefore not classified as electric fish. Most bony fish are neither electrogenic nor electroreceptive.","before":"","after":"are electroreceptive.","before_token_range":[69,69],"after_token_range":[50,52]}
{"before_content":"Trossingen (Low Alemannic: Drossinge) is a town in Baden-Württemberg, Germany. It is situated in a region called Baar, between the Swabian Alb and the Black Forest. Stuttgart is about an hour away, Lake Constance about half an hour, and the source of the river Danube can be reached in about twenty minutes by car.\nTrossingen is renowned as a \"music town\". Although it has only around 16,000 inhabitants, the town is home to the renowned 'University of Music Trossingen' (with its famous Early Music department), which is one of Baden-Württemberg's five state conservatories, and there are several other institutions specializing in musical education, like the 'Bundesakademie für musikalische Jugendbildung' and the 'Hohner Konservatorium' .\nIn 1830 Christian Messner from Trossingen, a cloth maker and weaver, copied a harmonica brought to Trossingen by his next door neighbor, a clockmaker from Vienna. This was the beginning of musical instrument production in the town. Messner was so successful at making such instruments that eventually his brother and some relatives also started making harmonicas. From 1840 on his nephew Christian Weiss started working on his own, so by 1855 there were two registered businesses - Christian Messner & Co. and Württ. Harmonikafabrik Ch. WEISS. Trossingen is also the home of the world's oldest extant harmonica manufacturer, C.A Seydel Sohne, founded in 1847.\nSee German Wikipedia page about de:Christian Messner.\nIn 1857 the Matthias Hohner company was founded. Today, Hohner harmonicas and accordions are well known all over the world. Trossingen also houses the German Harmonica Museum.\nTrossingen has a historic railway: the Trossinger Eisenbahn.\nAt the edge of town, in a former clay quarry, were found several dozen skeletons, both complete and partial, of the prosauropod dinosaur Plateosaurus engelhardti during excavations in the early 20th century. The local museum Auberlehaus houses several original bones.","after_content":"Trossingen is a town in South Germany (Baden-Württemberg). It is in a region called Baar, between the Swabian Alb and the Black Forest. Trossingen is called a \"music town\". It has around 16,000 people who live there, there is the 'University of Music Trossingen', which is one of Baden-Württemberg's state conservatories, and there are other institutions specialized in musical education, like the 'Bundesakademie für musikalische Jugendbildung' and the 'Hohner Konservatorium'. In 1857 the Matthias Hohner company was founded. Today, Hohner harmonicas and accordions are famous all over the world. Trossingen houses the German Harmonica Museum, too. Trossingen also has a historic railway: the Trossinger Eisenbahn. Several skeletons of the dinosaur Plateosaurus engelhardti were found in Trossingen during excavations in the early 20th century. The local museum Auberlehaus houses several of the original bones.","before":"(Low Alemannic: Drossinge)","after":"","before_token_range":[1,4],"after_token_range":[1,1]}
{"before_content":"An arteUYYry (plural arteries) (from Greek ἀρτηρία (artēria) 'windpipe, artery') is a blood vessel that takes blood away from the heart to one or more parts of the body (tissues, lungs, brain etc.). Most arteries carry oxygenated blood; the two exceptions are the pulmonary and the umbilical arteries, which carry deoxygenated blood to the organs that oxygenate it (lungs and placenta, respectively). The effective arterial blood volume is that extracellular fluid which fills the arterial system.\nThe arteries are part of the circulatory system, which is responsible for the delivery of oxygen and nutrients to all cells, as well as the removal of carbon dioxide and waste products, the maintenance of optimum blood pH, and the circulation of proteins and cells of the human immune system.","after_content":"An artery is a blood vessel that carries blood away from the heart to other parts of the body. Almost all arteries carry blood with a lot of oxygen in it. The only arteries that do not carry oxygen-rich blood are the pulmonary artery and the umbilical artery. Every artery has three layers. The outer layer is a thick covering made of stretchy tissue. The middle layer is made of muscle, so the artery can get wider or get smaller when the body needs it to. The inner lining is made of the same cells that line the heart. Arteries are deep under the skin. They do not have valves to prevent blood from flowing backwards. Instead, every time the heart beats, the arteries stretch out so the blood has room to go through. Once the walls have completely stretched out, the muscles in the arteries make them shrink back to their normal size. This pushes the blood through.","before":"arteries, which carry deoxygenated blood to the organs that oxygenate it(lungs and placenta, respectively). Theeffective arterial blood volumeisthat extracellular fluid which fills the arterial system. Thearteries are partof thecirculatory system,which is responsible forthedelivery of oxygen and nutrients to all cells, as well as the removal of carbon dioxide and waste products, themaintenance of optimumbloodpH,andthecirculation of proteins and cells ofthehuman immune system.","after":" Every artery has three layers. Theouter layerisa thick covering made of stretchy tissue. Themiddle layer is made of muscle, so the artery can get wider or get smaller when the body needs it to. The inner lining is madeof thesame cells that line the heart. Arteries are deep under the skin. They do not have valves to prevent blood from flowing backwards. Instead,every timetheheart beats, thearteries stretch out so thebloodhas room to go through. Once the walls have completely stretched out,themuscles inthearteries make them shrink back to their normal size.This pushes the blood through.","before_token_range":[48,132],"after_token_range":[50,173]}
{"before_content":"Avant Browser is a freeware web browser from a Chinese programmer named Anderson Che, which unites the Trident layout engine built into Windows (see Internet Explorer shell) with an interface intended to be more feature-rich, flexible and ergonomic than Microsoft's Internet Explorer (IE). It runs on Windows 98 and above, including Windows Vista. Internet Explorer version 6, 7 or 8 must be installed.\nAs of November 2008, total downloads surpassed 22.5 million.\nAvant Browser is currently available in 41 languages.","after_content":"Avant Browser is a free web browser created by a Chinese Programmer called Anderson Che.\nThe Avant browser follows a set of commands that are similar to those of Internet Explorer (known as the Trident layout engine), but has more features and is more customisable. Avant can only work on Windows computers that have Internet Explorer (6, 7 or 8) installed on them.\nThe browser is available in 41 languages. As of November 2008, there were over 22 million Downloads\nThe Official website is avantbrowser.com","before":"currently available in 41 languages.","after":"","before_token_range":[84,89],"after_token_range":[94,94]}
