{"before_context":"William Maurice “Mo” Cowan (born April 4, 1969) is an American politician and lawyer who served as a United States Senator from Massachusetts from February 1, 2013 to July 16, 2013. A member of the Democratic Party, he previously served as legal counsel and chief of staff to Governor Deval Patrick. Patrick appointed him on an interim basis to fill the vacancy left by fellow Democrat John Kerry, who resigned to become U.S. Secretary of State. He declined to run in the 2013 special election to complete the remainder of Kerry's term. He was succeeded by fellow Democrat Ed Markey.\nCowan was the eighth African-American U.S. Senator and the second from Massachusetts after Edward Brooke. He was one of three African-American U.S. Senators in the 113th Congress, along with Republican Senator Tim Scott from South Carolina and Democrat Cory Booker from New Jersey, although he did not serve alongside Booker, who took office on October 31, 2013.","after_context":"William Maurice “Mo” Cowan (born April 4, 1969) is an American politician and lawyer. He was a United States Senator from Massachusetts from February 1, 2013 to July 16, 2013. He is a member of the Democratic Party. He was legal counsel and chief of staff to Governor Deval Patrick. Patrick appointed him on as an interim Senator to replace fellow Democrat John Kerry, who resigned to become U.S. Secretary of State.\nHe did not want to run in the 2013 special election to complete the remainder of Kerry's term. He was replaced by fellow Democrat Ed Markey.\nCowan was the eighth African-American U.S. Senator and the second from Massachusetts after Edward Brooke.","before_sentence":"A member of the Democratic Party, he previously served as legal counsel and chief of staff to Governor Deval Patrick.","after_sentence":"He is a member of the Democratic Party.","before":"A","after":"He is a","before_diff_span_range":[36,37],"after_diff_span_range":[37,40],"before_sentence_token_range":[36,58],"after_sentence_token_range":[36,45],"label":"discourse_anaphora_insertion"}
{"before_context":"Year 46 (XLVI) was a common year starting on Saturday (link will display the full calendar) of the Julian calendar. At the time, it was known as the Year of the Consulship of Asiaticus and Silanus (or, less frequently, year 799 Ab urbe condita). The denomination 46 for this year has been used since the early medieval period, when the Anno Domini calendar era became the prevalent method in Europe for naming years. The year 46 was the dubbed \"The Last Year of Confusion\" in that it was the last of a series of extra-long years (it lasted 445 days) resulting from the Julian Reform.","after_context":"46 is a year in the 1st century. It was a common year starting on Saturday of the Julian calendar. At the time, it was known as the Year of the Consulship of Asiaticus and Silanus.","before_sentence":"Year 46(XLVI) was a common year starting on Saturday(link will display the full calendar) of the Julian calendar.","after_sentence":"46 is a year in the 1st century. It was a common year starting on Saturday of the Julian calendar.","before":"","after":" It","before_diff_span_range":[2,2],"after_diff_span_range":[8,10],"before_sentence_token_range":[0,23],"after_sentence_token_range":[0,22],"label":"discourse_anaphora_insertion"}
{"before_context":"'The Gazette (ガゼット, gazetto, typeset as the GazettE) is a Japanese rock band, and part of the visual kei movement. The band formed in early 2002 and is currently signed to PS Company and King Records.","after_context":"The Gazette (ガゼット, Gazetto, typeset as the GazettE) is a Japanese rock band. It was formed in 2002.","before_sentence":"'The Gazette(ガゼット, gazetto, typeset as the GazettE) is a Japanese rock band, and part of the visual kei movement. The band formed in early 2002 and is currently signed to PS Company and King Records.","after_sentence":"It was formed in 2002.","before":"The band","after":"It was","before_diff_span_range":[25,27],"after_diff_span_range":[17,19],"before_sentence_token_range":[0,43],"after_sentence_token_range":[17,23],"label":"discourse_anaphora_insertion"}
{"before_context":"The apple is the pomaceous fruit of the apple tree, species Malus domestica in the rose family Rosaceae. It is one of the most widely cultivated tree fruits. The tree originated from Central Asia, where its wild ancestor is still found today. There are more than 7,500 known cultivars of apples resulting in a range of desired characteristics. Cultivars vary in their yield and the ultimate size of the tree, even when grown on the same rootstock.\nAt least 55 million tons of apples were grown worldwide in 2005, with a value of about $10 billion. China produced about 35% of this total. The United States is the second leading producer, with more than 7.5% of world production. Iran is third followed by Turkey, Russia, Italy and India.","after_context":"The apple is a fleshy fruit from the apple tree. It is in the species Malus domestica in the rose family Rosaceae. The apple is one of the most grown tree fruits.\nThe apple tree came from Central Asia. Its wild ancestor is still there today. There are more than 7,500 kinds of different apple trees.\nAt least 55 million tons of apples were grown around in the world in 2005. All together, they cost about $10 billion. China produced about 35% of the world's apples. The United States produces more than 7.5% of the apples around the world. This makes it the second greatest producer. Iran is third, after which comes Turkey, Russia, Italy and India.\nkjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui kjui","before_sentence":"It is one of the most widely cultivated tree fruits.","after_sentence":"The apple is one of the most grown tree fruits.","before":"It","after":"The apple","before_diff_span_range":[20,21],"after_diff_span_range":[25,27],"before_sentence_token_range":[20,31],"after_sentence_token_range":[24,35],"label":"discourse_anaphora_resolution"}
{"before_context":"Small Computer System Interface (SCSI, \/ˈskʌzi\/ SKUZ-ee) is a set of standards for physically connecting and transferring data between computers and peripheral devices. The SCSI standards define commands, protocols and electrical and optical interfaces. SCSI is most commonly used for hard disks and tape drives, but it can connect a wide range of other devices, including scanners and CD drives, although not all controllers can handle all devices. The SCSI standard defines command sets for specific peripheral device types; the presence of \"unknown\" as one of these types means that in theory it can be used as an interface to almost any device, but the standard is highly pragmatic and addressed toward commercial requirements.\nSCSI is an intelligent, peripheral, buffered, peer to peer interface. It hides the complexity of physical format. Every device attaches to the SCSI bus in a similar manner. Up to 8 or 16 devices can be attached to a single bus. There can be any number of hosts and peripheral devices but there should be at least one host. SCSI uses handshake signals between devices, SCSI-1, SCSI-2 have the option of parity error checking. Starting with SCSI-U160 (part of SCSI-3) all commands and data are error checked by a CRC32 checksum. The SCSI protocol defines communication from host to host, host to a peripheral device, peripheral device to a peripheral device. However most peripheral devices are exclusively SCSI targets, incapable of acting as SCSI initiators—unable to initiate SCSI transactions themselves. Therefore peripheral-to-peripheral communications are uncommon, but possible in most SCSI applications. The Symbios Logic 53C810 chip is an example of a PCI host interface that can act as a SCSI target.","after_context":"SCSI (Small Computer System Interface)\nSCSI also called \"Skazi\" is more complex solution then EIDE. SCSI\nis a set of standards for physically connecting and transferring data between computers and peripheral devices.","before_sentence":"Small Computer System Interface(SCSI, \/ˈskʌzi\/ SKUZ-ee) is a set of standards for physically connecting and transferring data between computers and peripheral devices.","after_sentence":"SCSI(Small Computer System Interface) SCSI also called\" Skazi\" is more complex solution then EIDE.","before":"","after":" SCSI","before_diff_span_range":[8,8],"after_diff_span_range":[15,17],"before_sentence_token_range":[0,26],"after_sentence_token_range":[0,19],"label":"discourse_anaphora_resolution"}
{"before_context":"Thomas P. \"Oyster\" Burns (September 6, 1864 – November 11, 1928) was an American professional baseball player whose career spanned 15 seasons, 11 of which were spent with the Major League Baseball (MLB) Wilmington Quicksteps (1884), Baltimore Orioles (1884–85, 1887–88), Brooklyn Bridegrooms (1888–95), and New York Giants (1895). Burns, who predominately played as an outfielder, also played as a shortstop, second baseman, third baseman and as a pitcher. Over his career, Burns compiled a career batting average of .300 with 870 runs scored, 1,392 hits, 224 doubles, 129 triples, 65 home runs, and 834 runs batted in (RBI) in 1,188 games played. Although the majority of his career was spent in the major leagues, Burns also played in minor league baseball. He made his MLB debut at the age of 19 and was listed as standing 5 feet 8 inches (173 cm) and weighing 183 pounds (83 kg).\nBurns, nicknamed \"Oyster\" because he sold shellfish in the off-season, was described as a \"loudmouth\" and having \"an irritating voice and personality\". Nevertheless, Burns led the Bridegrooms to an American Association championship in 1889 and a National League pennant in 1890. After retiring from baseball, Burns died on November 11, 1928, in Brooklyn, New York.","after_context":"Thomas P. \"Oyster\" Burns (September 6, 1864– November 11, 1928) was a professional baseball player. He played 11 seasons in Major League Baseball (MLB) for the Wilmington Quicksteps, Baltimore Orioles (1884–85, 1887–88), Brooklyn Bridegrooms (1888–1895), and New York Giants (1895). Burns mostly played as an outfielder, but also played as a shortstop, second baseman, third baseman and pitcher. Over his career, Burns compiled a career batting average of .300 with 1,392 hits, 129 triples, 65 home runs, and 834 runs batted in (RBI) in 1,188 games played. Burns spent most of his career in the major leagues. However, Burns also played in minor league baseball. He made his MLB debut at the age of 19 and was listed as standing 5 feet 8 inches (173 cm) and weighing 183 pounds (83 kg).\nBurns, nicknamed \"Oyster\" because he sold shellfish in the off-season, was described as a \"loudmouth\" and having \"an irritating voice and personality\". Nevertheless, Burns led the Bridegrooms to an American Association championship in 1889 and a National League pennant in 1890. Burns retired from baseball in 1901. He died on November 11, 1928 in Brooklyn, New York.","before_sentence":"Nevertheless, Burns led the Bridegrooms to an American Association championship in 1889 and a National League pennant in 1890.","after_sentence":"Burns retired from baseball in 1901.","before":"After retiring","after":"Burns retired","before_diff_span_range":[229,231],"after_diff_span_range":[216,218],"before_sentence_token_range":[211,232],"after_sentence_token_range":[214,221],"label":"discourse_anaphora_resolution"}
{"before_context":"The hindbrain or rhombencephalon is a developmental categorization of portions of the central nervous system in vertebrates. It includes the medulla, pons, and cerebellum. Together they support vital bodily processes.\nThe hindbrain can be subdivided in a variable number of transversal swellings called rhombomeres. In the human embryo eight rhombomeres can be distinguished, from caudal to rostral: Rh8-Rh1. Rostrally, the isthmus demarcates the boundary with the midbrain.\nA rare brain malformation —\"rhombencephalosynapsis\"—is characterized by a missing vermis resulting in a fused cerebellum. Virtually all patients have some degree of congenital non-progressive cerebellar ataxia and delayed attainment of motor milestones, although many adults have only mildly impaired balance and motor coordination. Other symptoms can include behavioral disorders, sensory processing issues, high pain tolerance, poor temperature regulation, failure to thrive, strabismus, poor depth perception, poor visual spatial skills, chronic constipation, autistic-like features, short stature with or without growth hormone deficiency, and motor stereotypies such as persistent head shaking. Rhombencephalosynapsis can be associated with other brain abnormalities such as agenesis or thinning of the corpus callosum, hydrocephalus due to acqueductal stenosis, and\/or Arnold Chiari malformation. Cognitive outcome is highly variable, and IQs range from intellectually gifted to severely intellectually disabled. The cognitive outcome is typically, although not always, associated with the severity of the rhombencephalosynapsis and any additional brain malformations. Although it was previously thought that patients with rhombencephalosynapsis had shortened lifespans, the increase in older adults being diagnosed with the condition contradicts this theory. Many newly diagnosed adults have attended college, hold down jobs, and have children. Rhombencephalosynapsis is the main symptom of Gomez-Lopez-Hernandez Syndrome. It can also be associated with VACTERL. A study conducted by Seattle Children’s Hospital found that rhombencephalosynapsis is likely much more common than previously thought, perhaps occurring in up to 10% of patients with hydrocephalus. A different study by Seattle Children’s suggested that persistent figure eight or side to side head shaking may be a marker of rhombencephalosynapsis. Rhombencephalosynapsis does not appear to be inherited.\nThe caudal rhombencephalon has been generally considered as the initiation site for neural tube closure.","after_context":"The rhombencephalon (or hindbrain) is a name for parts of the central nervous system in vertebrates.","before_sentence":"The hindbrain or rhombencephalon is a developmental categorization of portions of the central nervous system in vertebrates.","after_sentence":"The rhombencephalon(or hindbrain) is a name for parts of the central nervous system in vertebrates.","before":"hindbrain or rhombencephalon","after":"rhombencephalon(or hindbrain)","before_diff_span_range":[1,4],"after_diff_span_range":[1,4],"before_sentence_token_range":[0,18],"after_sentence_token_range":[0,18],"label":"discourse_reordering"}
{"before_context":"Ruth Anna Marie Schmidt (April 22, 1916 – March 29, 2014) was an American geologist and paleontologist who was a pioneer for women scientists. She spent most of her career in Alaska, where she established a United States Geological Survey (USGS) field office and established the first Department of Geology at the Anchorage Community College, now part of the University of Alaska Anchorage. In 1964, Schmidt directed the initial assessment of the damage done to the city of Anchorage by the Great Alaska Earthquake, the largest earthquake in North American history, and the second largest earthquake ever to be recorded. She worked for the USGS in Washington, DC during the era of McCarthyism and was investigated twice for disloyalty because of her membership in the interracial Washington Cooperative Bookshop. She was cleared both times. She earned a number of awards, honors, and letters of commendation and appreciation. After her death in 2014, she was recognized as a philanthropist.","after_context":"Ruth Anna Marie Schmidt (April 22, 1916 – March 29, 2014) was an American geologist and paleontologist. She created a United States Geological Survey (USGS) field office in Alaska and the first Department of Geology at the Anchorage Community College.","before_sentence":"She spent most of her career in Alaska, where she established a United States Geological Survey(USGS) field office and established the first Department of Geology at the Anchorage Community College, now part of the University of Alaska Anchorage.","after_sentence":"She created a United States Geological Survey(USGS) field office in Alaska and the first Department of Geology at the Anchorage Community College.","before":"spent most of her career in Alaska, where she established a United States Geological Survey(USGS) field office","after":"a United States Geological Survey(USGS) field office in Alaska","before_diff_span_range":[29,48],"after_diff_span_range":[23,34],"before_sentence_token_range":[28,71],"after_sentence_token_range":[21,46],"label":"discourse_reordering"}
{"before_context":"Nadine E. Velázquez (born 20 November 1978) is an American actress and model known for her roles as Catalina Aruca on My Name Is Earl and Sofia Ruxin on The League. She has also appeared in films such as War and Flight, and was a cast member on the TV series Major Crimes.","after_context":"Nadine Velazquez (born November 20, 1978) is an American actress and model she is Best known for her role as Catalina Aruca in the television series My Name Is Earl.","before_sentence":"Nadine E. Velázquez(born 20 November 1978) is an American actress and model known for her roles as Catalina Aruca on My Name Is Earl and Sofia Ruxin on The League.","after_sentence":"Nadine Velazquez(born November 20, 1978) is an American actress and model she is Best known for her role as Catalina Aruca in the television series My Name Is Earl.","before":"E.  Velázquez","after":"Velazquez","before_diff_span_range":[1,4],"after_diff_span_range":[1,2],"before_sentence_token_range":[0,34],"after_sentence_token_range":[0,33],"label":"discourse_reordering"}
{"before_context":"Dhoom 2 ([ˈd̪ʱuːm],English: Blast 2, also abbreviated and known as D:2, D2 and Dhoom 2: Back In Action) is a 2006 Indian action thriller film directed by Sanjay Gadhvi and produced by Aditya Chopra and Yash Chopra at an estimated budget of ₹350 million (US$4.6 million) under the Yash Raj Films banner. It is the second in the Dhoom series. Abhishek Bachchan and Uday Chopra star as buddy cops Jai Dixit and Ali, respectively. The duo attempt to capture Mr. A (Hrithik Roshan), a professional thief whose passion is to steal rare and valuable collectibles using high-technology gadgets. The film features Bipasha Basu and Aishwarya Rai in lead female roles. Dhoom 2 was shot primarily in India, Durban, and Rio de Janeiro, becoming the first major Hindi film to be shot in Brazil. The distributor, Yash Raj Films, promoted the film by forging associations with Pepe Jeans and Coca-Cola. It premiered on 24 November 2006 in India, where it received the widest release in Indian cinema history with over 1800 prints. It was dubbed simultaneously in Tamil as well as in Telugu. Singer Vijay Prakash dubbed for ACP Jai Dixit in Tamil.\nDhoom 2 was generally well received by critics and audiences; it was accepted well by children and adults. It became the highest-grossing Indian film of 2006, and was the highest-grossing film of all time as well at the time of its release. It is the seventh highest-grossing Bollywood film in overseas markets. After grossing over ₹1.5 billion (US$20 million), Dhoom 2 was elevated to a \"blockbuster\" rating on Box Office India. It received an 80% approval rating among critics on Rotten Tomatoes. Critics praised Dhoom 2 for its exotic locales and elaborate action sequences. However, there was an appeal by the Mumbai city police commissioner to censor the fast-paced rash driving scenes due to fears that it would inspire Indian youths to ride their motorcycles rashly, resulting in an increase in the number of road accidents. A sequel titled Dhoom 3 was released on 20 December 2013, which also went on to become the highest-grossing Bollywood film of all time.","after_context":"Dhoom 2 is a 2006 action thriller movie.This movie was directed by Sanjay Gadhvi. This movie was produced by Aditya Chopra. The film stars Hrithik Roshan, Abhishek Bachchan, Aishwarya Rai, Uday Chopra and Bipasha Basu in the lead roles. It is the second installment in the Dhoom series. It was released on November 24, 2006 and was generally well received by critics and audiences. In addition, it was a blockbuster at the box office. It became the highest-grossing Indian film of 2006. ","before_sentence":"Dhoom 2([ˈd̪ʱuːm],English: Blast 2, also abbreviated and known as D:2, D2 and Dhoom 2: Back In Action) is a 2006 Indian action thriller film directed by Sanjay Gadhvi and produced by Aditya Chopra and Yash Chopra at an estimated budget of ₹350 million(US$4.6 million) under the Yash Raj Films banner.","after_sentence":"Dhoom 2 is a 2006 action thriller movie.This movie was directed by Sanjay Gadhvi.","before":"([ˈd̪ʱuːm],English: Blast 2, also abbreviated and known as D:2, D2 and Dhoom 2: Back In Action)","after":"","before_diff_span_range":[2,18],"after_diff_span_range":[2,2],"before_sentence_token_range":[0,61],"after_sentence_token_range":[0,16],"label":"lexical_entity"}
{"before_context":"Koto Matsudaira (松平 康東, Matsudaira Kōtō, 5 February 1903 – 4 May 1994) was a Japanese diplomat who served as an ambassador to the United Nations from 1957 to 1961.","after_context":"Koto Matsudaira (松平 康東, Matsudaira Kōtō, 5 February 1903 – 4 May 1994) was a Japanese diplomat from Tokyo who was an Ambassador to the United Nations from 1957 to 1961.","before_sentence":"Koto Matsudaira(松平 康東, Matsudaira Kōtō, 5 February 1903 - 4 May 1994) was a Japanese diplomat who served as an ambassador to the United Nations from 1957 to 1961.","after_sentence":"Koto Matsudaira(松平 康東, Matsudaira Kōtō, 5 February 1903 - 4 May 1994) was a Japanese diplomat from Tokyo who was an Ambassador to the United Nations from 1957 to 1961.","before":"served as","after":"was","before_diff_span_range":[21,23],"after_diff_span_range":[23,24],"before_sentence_token_range":[0,34],"after_sentence_token_range":[0,35],"label":"lexical_entity"}
{"before_context":"Dobruja or Dobrudja (Bulgarian: Добруджа, transliterated: Dobrudzha or Dobrudža; Romanian: Dobrogea pronounced [ˈdobrod͡ʒe̯a] (listen) or [doˈbrod͡ʒe̯a]; Turkish: Dobruca) is a historical region in Eastern Europe that has been divided since the 19th century between the territories of Bulgaria and Romania. It is situated between the lower Danube River and the Black Sea, and includes the Danube Delta, Romanian coast, and the northernmost part of the Bulgarian coast. The territory of Dobruja is made up of Northern Dobruja, which is part of Romania, and Southern Dobruja, which belongs to Bulgaria.\nThe territory of the Romanian region Dobrogea is organised as the counties of Constanța and Tulcea, with a combined area of 15,500 km2 (6,011 sq. miles) and a population of slightly less than 900 thousand. Its main cities are Constanța, Tulcea, Medgidia and Mangalia. Dobrogea is represented by dolphins in the coat of arms of Romania. The Bulgarian region Dobrudzha is divided among the administrative regions of Dobrich and Silistra; the following villages of Razgrad Province: Konevo, Rainino, Terter and Madrevo; and the village General Kantardzhievo (Varna). This section has a total area of 7,565 km2, with a combined population of some 310,000 people, the main towns being Dobrich and Silistra (regional seats).","after_context":"Dobruja is an area between Bulgaria and Romania. It can be found between the Danube and the Black Sea. The Romanian part of Dobruja, Dobrogea, is made up of the counties of Constanţa and Tulcea. The Bulgarian part of Dobruja, Dobrudzha, is made up of the regions of Dobrich and Silistra.","before_sentence":"Dobruja or Dobrudja(Bulgarian: Добруджа, transliterated: Dobrudzha or Dobrudža; Romanian: Dobrogea pronounced [ˈdobrod͡ʒe̯a](listen) or [doˈbrod͡ʒe̯a]; Turkish: Dobruca) is a historical region in Eastern Europe that has been divided since the 19th century between the territories of Bulgaria and Romania.","after_sentence":"Dobruja is an area between Bulgaria and Romania.","before":"or Dobrudja(Bulgarian: Добруджа, transliterated: Dobrudzha or Dobrudža; Romanian: Dobrogea pronounced [ˈdobrod͡ʒe̯a](listen) or [doˈbrod͡ʒe̯a]; Turkish: Dobruca)","after":"","before_diff_span_range":[1,15],"after_diff_span_range":[1,1],"before_sentence_token_range":[0,49],"after_sentence_token_range":[0,9],"label":"lexical_entity"}
{"before_context":"ISO 4217 is the international standard describing three-letter codes (also known as the currency code) to define the names of currencies established by the International Organization for Standardization (ISO). The ISO 4217 code list is the established norm in banking and business all over the world for defining different currencies, and in many countries the codes for the more common currencies are so well known publicly, that exchange rates published in newspapers or posted in banks use only these to define the different currencies, instead of translated currency names or ambiguous currency symbols. ISO 4217 codes are used on airline tickets and international train tickets to remove any ambiguity about the price.","after_context":"ISO 4217 is the international standard describing three-letter codes (also known as the currency code) to define the names of currencies, as established by the International Organization for Standardization (ISO). The ISO 4217 code list is the common way in banking and business, all over the world, for defining different currencies. In many countries, the codes for the more common currencies are so well-known, by the general public, that exchange rates written in newspapers or posted in banks use only those codes to define the different currencies, instead of translated currency names or currency symbols. ISO 4217 codes are used on airline tickets and international train tickets to remove any uncertainty about the price.","before_sentence":"The ISO 4217 code list is the established norm in banking and business all over the world for defining different currencies, and in many countries the codes for the more common currencies are so well known publicly, that exchange rates published in newspapers or posted in banks use only these to define the different currencies, instead of translated currency names or ambiguous currency symbols.","after_sentence":"In many countries, the codes for the more common currencies are so well-known, by the general public, that exchange rates written in newspapers or posted in banks use only those codes to define the different currencies, instead of translated currency names or currency symbols.","before":"well known publicly","after":"well-known, by the general public","before_diff_span_range":[67,70],"after_diff_span_range":[72,77],"before_sentence_token_range":[32,100],"after_sentence_token_range":[58,107],"label":"lexical_generic"}
{"before_context":"Japan first participated at the Olympic Games in 1912, and has competed at almost every Games since then. The nation was not invited to the 1948 Games after World War II, and Japan was part of the American-led boycott of the 1980 Summer Olympics in Moscow.\nJapan won its first medals in 1920, and its first gold medals in 1928. Japanese athletes have won 439 medals at the Summer Olympic Games (Except Art competitions at the 1936 Summer Olympics), with the most gold medals won in judo. Japan has also won 45 medals at the Winter Olympic Games. The Japanese Olympic Committee was created in 1911 and recognized in 1912.","after_context":"Japan was first at the Olympic Games in 1912.\nThe Japanese Olympic Committee (JOC) was formed in 1911 and recognized in 1912. Jigoro Kano was the first president of the organization.\nThe 1940 Summer Olympics and the 1940 Winter Olympics were planned for Japan, but the organizers withdrew in 1938 because of of the Second Sino-Japanese War. These games were later cancelled because of World War II.\nJapan did host the Olympic games three times, including","before_sentence":"The Japanese Olympic Committee was created in 1911 and recognized in 1912.","after_sentence":"The Japanese Olympic Committee(JOC) was formed in 1911 and recognized in 1912.","before":"created","after":"formed","before_diff_span_range":[108,109],"after_diff_span_range":[16,17],"before_sentence_token_range":[108,121],"after_sentence_token_range":[10,25],"label":"lexical_generic"}
{"before_context":"Hugo Wallace Weaving (born 4 April 1960) is an Australian film and stage actor, as well as a voice actor, best known for his roles as Agent Smith in The Matrix and Elrond in The Lord of the Rings trilogy of films, the title character of V for Vendetta and the voices of Noah the Elder in Happy Feet and Megatron in Transformers.","after_context":"Hugo Wallace Weaving (born 4 April 1960) is an Australian film and stage actor, as well as a voice actor, famous for his roles as Agent Smith in The Matrix and Elrond in The Lord of the Rings trilogy of films, the main character of V for Vendetta and the voices of Noah the Elder in Happy Feet and Megatron in Transformers. He was born in Nigeria to English parents. He spent his childhood in South Africa and then moved to the United Kingdom when he was a teenager. He moved to Australia in 1976. He later became an Australian citizen.","before_sentence":"Hugo Wallace Weaving(born 4 April 1960) is an Australian film and stage actor, as well as a voice actor, best known for his roles as Agent Smith in The Matrix and Elrond in The Lord of the Rings trilogy of films, the title character of V for Vendetta and the voices of Noah the Elder in Happy Feet and Megatron in Transformers.","after_sentence":"Hugo Wallace Weaving(born 4 April 1960) is an Australian film and stage actor, as well as a voice actor, famous for his roles as Agent Smith in The Matrix and Elrond in The Lord of the Rings trilogy of films, the main character of V for Vendetta and the voices of Noah the Elder in Happy Feet and Megatron in Transformers.","before":"best known","after":"famous","before_diff_span_range":[23,25],"after_diff_span_range":[23,24],"before_sentence_token_range":[0,68],"after_sentence_token_range":[0,67],"label":"lexical_generic"}
{"before_context":"Osamu Tezuka (手塚 治虫, Tezuka Osamu, November 3, 1928 – February 9, 1989) was a Japanese Cartoonist, manga artist, animator, producer and medical doctor, although he never practiced medicine. Born in Osaka Prefecture, he is best known as the creator of Astro Boy, Kimba the White Lion and Black Jack. He is often credited as the \"Godfather of Anime\", and is often considered the Japanese equivalent to Walt Disney, who served as a major inspiration during his formative years. His prolific output, pioneering techniques, and innovative redefinitions of genres earned him such titles as \"the father of manga\", \"the god of comics\" and \"kamisama of manga\". His grave is located in Tokyo's Souzen-ji Temple Cemetery.","after_context":"Osamu Tezuka (Japanese: 手塚 治虫, Tezuka Osamu, November 3, 1928 – February 9, 1989) was a famous Japanese cartoonist, manga artist, animator, producer and Doctor of Medicine, although he never practiced medicine. He was born in Osaka Prefecture. He created Astro Boy, Kimba the White Lion and Black Jack. He is often credited as the \"Father of Anime\", and is often considered the Japanese equivalent to Walt Disney, who was a major inspiration for Tezuka.\nTezuka began what was known as the manga revolution in Japan with his New Treasure Island published in 1947. His legendary output would spawn some of the most influential, successful, and well received manga series including the children mangas Astro Boy, Princess Knight and Kimba the White Lion, and the adult oriented series Black Jack, Phoenix, and Buddha, all of which won several awards.\nTezuka died of stomach cancer in 1989. His death had an immediate impact on the Japanese public and other cartoonists. A museum was constructed in Takarazuka dedicated to his memory and life works, and Tezuka received many posthumous awards. Several animations were in production at the time of his death along with the final chapters of Phoenix, which were never released.\nOsamu Tezuka:\n,\"Manga is virtual. Manga is sentiment. Manga is resistance. Manga is bizarre. Manga is pathos. Manga is destruction. Manga is arrogance. Manga is love. Manga is kitsch. Manga is sense of wonder. Manga is … there is no conclusion yet.\"","before_sentence":"His prolific output, pioneering techniques, and innovative redefinitions of genres earned him such titles as\" the father of manga\",\" the god of comics\" and\" kamisama of manga\".","after_sentence":"Several animations were in production at the time of his death along with the final chapters of Phoenix, which were never released.","before":"","after":" Osamu Tezuka:,\" Manga is virtual.","before_diff_span_range":[127,127],"after_diff_span_range":[224,230],"before_sentence_token_range":[96,133],"after_sentence_token_range":[210,234],"label":"nonsim_extraneous_information"}
{"before_context":"Robert Braithwaite, CBE, DL (12 May 1943 – 7 March 2019) was a British entrepreneur, marine engineer and Founder and President of the luxury powerboat manufacturer, alongside John Macklin, Sunseeker.","after_context":"Robert Braithwaite, CBE, DL (12 May 1943 – 7 March 2019) was a British entrepreneur and marine engineer. He was known as the Founder and President of the luxury powerboat manufacturer, alongside John Macklin, Sunseeker. He was born in Otley, Yorkshire.\nBraithwaite died in the early hours of 7 March 2019, aged 75.","before_sentence":"","after_sentence":"He was born in Otley, Yorkshire. Braithwaite died in the early hours of 7 March 2019, aged 75.","before":"","after":"He was born in Otley, Yorkshire.  Braithwaite died in the early hours of 7 March 2019, aged 75.","before_diff_span_range":[37,37],"after_diff_span_range":[43,62],"before_sentence_token_range":[37,37],"after_sentence_token_range":[42,64],"label":"nonsim_extraneous_information"}
{"before_context":"Barbara Rush (born January 4, 1927) is an American stage, film, and television actress.","after_context":"Barbara Rush (born January 4, 1927) is an American stage, movie, and television actress. She is known for her roles in It Came from Outer Space!, Bigger Than Life, When Worlds Collide, The Young Philadelphians, and Robin and the Seven Hoods. She also appeared on television shows such as Peyton Place, Batman, All My Children, 7th Heaven and Knight Rider. She won a Golden Globe Award in 1954.","before_sentence":"","after_sentence":", Bigger Than Life, When Worlds Collide, The Young Philadelphians, and Robin and the Seven Hoods. She also appeared on television shows such as Peyton Place, Batman, All My Children, 7th Heaven and Knight Rider.","before":"","after":" She also appeared on television shows such as Peyton Place, Batman, All My Children, 7th Heaven and Knight Rider.","before_diff_span_range":[19,19],"after_diff_span_range":[46,66],"before_sentence_token_range":[19,19],"after_sentence_token_range":[32,75],"label":"nonsim_extraneous_information"}
{"before_context":"Allan Kardec was a pseudonym of Hippolyte Léon Denizard Rivail (October 3, 1804 - March 31, 1869), compiler or codifier of the Spiritism.\nRivail was born in Lyon, France, in 1804. A disciple and collaborator of Johann Heinrich Pestalozzi, he spoke several languages and taught mathematics, astronomy, physiology, French, physics, chemistry and comparative anatomy. He was already in his early fifties when he became interested in the wildly popular phenomenon of spirit-tapping. At the time, strange phenomena attributed to the action of spirits were reported in many different places, most notably in the U.S. and France, attracting the attention of high society. The first such phenomena were at best frivolous and entertaining, featuring objects that moved or \"tapped\" under what was said to be spirit control. In some cases, this was alleged to be a type of communication: the supposed spirits answered questions by controlling the movements of objects so as to pick out letters to form words, or simply indicate \"yes\" or \"no.\"\nAt the time, Franz Mesmer's theory of animal magnetism was popular in the upper reaches of society. When confronted with the phenomena described, many researchers including Rivail pointed out that animal magnetism might explain them. Rivail, however, after personally seeing a demonstration, quickly dismissed the animal-magnetism hypothesis as being insufficient to completely explain all the facts observed. Rivail was determined to understand exactly what was causing the physical effects popularly attributed to spirits.\nAs an academic with a solid scientific background, Rivail decided to do his own research. Not being a medium, he compiled a list of questions and began working with mediums and channelers to pose them to spirits. Soon the quality of communication with spirits appeared to improve markedly. In 1857 Rivail (signing himself \"Allan Kardec\") published his first book on Spiritism, The Spirits Book. It comprised a series of 1,018 questions exploring matters concerning the nature of spirits, the spirit world, and the relations between the spirit world and the material world. This was followed by a series of other books, like The Book on Mediums and The Gospel According to Spiritism, and by a periodical, the Revue Spirite, which Kardec published until his death.\nRivail first used the name \"Allan Kardec\" allegedly after some spirits with whom he had been communicating told him about a previous incarnation of his as a Druid by that name. Rivail liked the name and decided to use it to keep his Spiritualist writings separate from his academic work.\nHe is interred at the Cimetière du Père Lachaise. His followers keep vigil at his tombstone, seeking to prevent others from photographing it.","after_context":"Allan Kardec (Hippolyte Léon Denizard Rivail 3 October 1804 – 31 March 1869) was a French philosopher and teacher.","before_sentence":"Allan Kardec was a pseudonym of Hippolyte Léon Denizard Rivail(October 3, 1804 - March 31, 1869), compiler or codifier of the Spiritism.","after_sentence":"Allan Kardec(Hippolyte Léon Denizard Rivail 3 October 1804 - 31 March 1869) was a French philosopher and teacher.","before":", compiler or codifier of the Spiritism","after":"was a French philosopher and teacher","before_diff_span_range":[19,26],"after_diff_span_range":[14,20],"before_sentence_token_range":[0,28],"after_sentence_token_range":[0,21],"label":"nonsim_fact_correction"}
{"before_context":"James Anthony Traficant, Jr. (May 8, 1941 to September 27, 2014) was a Democratic politician and member of the United States House of Representatives from Ohio. He represented the 17th Congressional District, which centered on his hometown of Youngstown and included parts of three counties in northeast Ohio's Mahoning Valley. He was expelled after being convicted of taking bribes, filing false tax returns, racketeering, and forcing his aides to perform chores at his farm in Ohio and houseboat in Washington, D.C.. He was sentenced to prison and released on September 2, 2009, after serving a seven-year sentence.","after_context":"James Anthony Traficant, Jr. (May 8, 1941 – September 27, 2014) was an American politician. He was a member of the United States House of Representatives from Ohio. He represented the 17th Congressional District from 1985 until 2002. He was a member of the Democratic Party from 1981 until 2010, and was independent from 2010 until his death.\nTraficant was arrested and imprisoned. He was convicted of taking bribes, filing false tax returns, racketeering, and forcing his aides to perform chores at his farm in Ohio and Washington, D.C. houseboat. He was released on September 2, 2007, after serving seven years.\nTraficant was born in Youngstown, Ohio. He was raised in a Roman Catholic family. He was of mostly Italian and Slovak ancestry. He was married to Patricia \"Tish\" Choppa Traficant.\nTraficant died after an accident at his home in Youngstown. He was 73.","before_sentence":"He was sentenced to prison and released on September 2, 2009, after serving a seven-year sentence.","after_sentence":"He was released on September 2, 2007, after serving seven years.","before":"sentenced to prison and","after":"","before_diff_span_range":[98,102],"after_diff_span_range":[109,109],"before_sentence_token_range":[97,116],"after_sentence_token_range":[108,122],"label":"nonsim_fact_correction"}
{"before_context":"William Leonard Roberts II (born January 28, 1976), better known by his stage name Rick Ross, is an American rapper. Rick Ross founded the record label Maybach Music Group, on which he released his studio albums Deeper Than Rap (2009), Teflon Don (2010), and God Forgives, I Don't (2012). Ross was also the first artist signed to Diddy's management company Ciroc Entertainment. In early 2012, MTV named Ross as the Hottest MC In The Game.","after_context":"William Roberts Leonard II, better known by the stage name Rick Ross, is an American rapper. He is the founder of Maybach Music Group. This group has helped release three of Ross' albums, including Deeper Than Rap (2009), Teflon Don (2010), and God Forgives, I Don't (2013). MTV named him the \"Hottest MC in the Game\" in 2012.","before_sentence":"Rick Ross founded the record label Maybach Music Group, on which he released his studio albums Deeper Than Rap(2009), Teflon Don(2010), and God Forgives, I Don't(2012).","after_sentence":"This group has helped release three of Ross' albums, including Deeper Than Rap(2009), Teflon Don(2010), and God Forgives, I Don't(2013).","before":"(2012","after":"(2013","before_diff_span_range":[58,59],"after_diff_span_range":[58,59],"before_sentence_token_range":[25,63],"after_sentence_token_range":[28,61],"label":"nonsim_fact_correction"}
{"before_context":"Mark Knopfler OBE (born 12 August 1949, Glasgow, Scotland) is a British guitarist, singer, songwriter, record producer and film score composer. Mark Knopfler is best known as the lead guitarist, vocalist and songwriter for the British rock band Dire Straits, which he co-founded in 1977 with his brother David. After Dire Straits disbanded in 1995, Knopfler continued to record and produce albums as a solo artist under his own name. Occasionally, Knopfler has played in other groups, such as the The Notting Hillbillies; as well, he has guested on works by other artists, including The Dandy Warhols, Bob Dylan, Bryan Ferry, Eric Clapton, Jeff Healey, John Fogerty, Jools Holland, Steely Dan, Emmylou Harris, Sonny Landreth, Phil Lynott, Joan Armatrading and Chet Atkins. He has produced albums for artists such as Tina Turner, Willy DeVille, Randy Newman, Bob Dylan and even \"Weird Al\" Yankovic. In addition, he has scored the music to several films, including Metroland, Local Hero, Cal, Last Exit to Brooklyn, Wag the Dog, and Rob Reiner's classic, The Princess Bride.\nHe is one of the most respected fingerstyle guitarists of the modern rock era. Knopfler was ranked #27 on Rolling Stone magazine's list of \"100 Greatest Guitarists of All Time.\"\nMark Knopfler and Dire Straits have sold in excess of 120 million albums to date.","after_context":"Mark Knopfler (born 12 August 1949, Glasgow, Scotland) is a British guitarist, singer, songwriter, record producer and film score composer.\nKnopfler is best known as the founder of the British rock band Dire Straits which formed 1977. After Dire Straits disbanded in 1995, Knopfler continued to record and produce albums as a solo artist and has played in other groups including The Notting Hillbillies. Knopfler has worked with many other music artists such as: Bob Dylan,Eric Clapton and Chet Atkins.\nKnopfler is a respected finger-style guitarist and was ranked #27 on Rolling Stone Magazine's list of \"The 100 Greatest Guitarists of All Time.\"\nMark Knopfler and Dire Straits have sold in excess of 120 million albums.","before_sentence":"Occasionally, Knopfler has played in other groups, such as the The Notting Hillbillies; as well, he has guested on works by other artists, including The Dandy Warhols, Bob Dylan, Bryan Ferry, Eric Clapton, Jeff Healey, John Fogerty, Jools Holland, Steely Dan, Emmylou Harris, Sonny Landreth, Phil Lynott, Joan Armatrading and Chet Atkins.","after_sentence":"Knopfler has worked with many other music artists such as: Bob Dylan,Eric Clapton and Chet Atkins.","before":"; as","after":"as:","before_diff_span_range":[95,97],"after_diff_span_range":[84,86],"before_sentence_token_range":[82,151],"after_sentence_token_range":[74,93],"label":"nonsim_format"}
{"before_context":"Pecorino is the name of a variety of hard Italian cheeses made from sheep's milk. The word pecora, from which the name derives, means sheep). Most are aged and sharp (although unaged ricotta pecorino is an exception). Pecorino Romano is the best known cheese in this category. Others are Pecorino Sardo, Pecorino Siciliano, and Pecorino Toscano. All come in a variety of styles depending on how long they have ben matured. The more matured cheeses, referred to as stagionato, are harder and have a stronger flavour. Some varieties may have spices included in the cheese.\nPecorino Romano is most often used on pasta dishes, like the better-known Parmigiano Reggiano (parmesan). Its distinctive strong, very salty flavour means that it is preferred for some pasta dishes with highly-flavoured sauces, especially those of Roman origin, such as penne all'amatriciana. See also: List of cheeses","after_context":"Pecorino cheese (or simply Pecorino) is the name for a few kinds of Italian cheeses made of sheep milk. The word pecora, from which the name derives, means sheep. Most of these cheeses are aged for some time. They taste rather salty.","before_sentence":"Pecorino is the name of a variety of hard Italian cheeses made from sheep's milk.","after_sentence":"Pecorino cheese(or simply Pecorino) is the name for a few kinds of Italian cheeses made of sheep milk.","before":"from","after":"of","before_diff_span_range":[12,13],"after_diff_span_range":[15,16],"before_sentence_token_range":[0,17],"after_sentence_token_range":[0,21],"label":"nonsim_format"}
{"before_context":"Mount Sanqing (Chinese: 三清山; pinyin: Sānqīng Shān) is a renowned Taoist sacred mountain located 40 kilometres (25 mi) north of Yushan County in Jiangxi Province, China with outstanding scenery. Sanqing means the \"Three Pure Ones\" in Chinese as Mount Sanqing is made up of three main summits: Yujing, Yushui, and Yuhua, representing the Taoist trinity.\nA Chinese phrase “三峰峻拔、如三清列坐其巅” (“Three steep peaks, like the Three Pure Ones sit the summits”) explains why it was named San Qing. Amongst the three hills, the Yujing hill (1817 meters above sea level) is the highest.\nMount Sanqing has been classified as a national park of China. It is a famous honeypot as well as a shelter for animals and plants. It contains more than 2300 species of plants and 400 species of vertebrates. The total area of Mount Sanqing is 229 km². It became a National Geopark in 2005 and a UNESCO World Heritage Site in 2008.","after_context":"Sanqingshan is a UNESCO World Heritage Site in China. It is based on Mount Sanqing, which is a renowned Taoist sacred mountain.\nThe mountain is 40 kilometres (25 mi) north of Yushan County in Jiangxi Province, China. It has outstanding scenery. There are three main summits: Yujing, Yushui, and Yuhua, symbolising the Taoist trinity.\nMount Sanqing is a national park of China. It is a famous \"honeypot\" (place for tourists) and a home of over 2300 species of plants and 400 species of vertebrates. The total area of Mount Sanqing is 229 km². It became a National Geopark in 2005 and a World Heritage Site in 2008.\nThese granite mountains hold the evidence of a billion years of geological evolution. This includes the evidence of important geological events, such as the amalgamation of the supercontinent Rodinia.","before_sentence":"Mount Sanqing has been classified as a national park of China.","after_sentence":"It is a famous\" honeypot\"(place for tourists) and a home of over 2300 species of plants and 400 species of vertebrates.","before":"honeypot","after":"\" honeypot\"(place for tourists) and","before_diff_span_range":[114,115],"after_diff_span_range":[80,86],"before_sentence_token_range":[111,123],"after_sentence_token_range":[74,100],"label":"nonsim_format"}
{"before_context":"Con Air is a 1997 American action film directed by Simon West, written by Scott Rosenberg, and produced by Jerry Bruckheimer, producer of The Rock. The film stars Nicolas Cage, John Cusack, and John Malkovich alongside Steve Buscemi, Colm Meaney, Mykelti Williamson, Ving Rhames, Nick Chinlund, Jesse Borrego, Jose Zuniga, and Monica Potter.\nThe picture was released theatrically on June 6, 1997 by Touchstone Pictures and was a box office success, grossing over $224 million against a production budget of $75 million. Despite this, the critics gave the film mixed reviews, but praised Cage and the cast performances as well as its action sequences, stunts, and Malkovich's portrayal of the villain. The film also borrows its title from the nickname of the Justice Prisoner and Alien Transportation System.","after_context":"Con Air is an American action-thriller movie. It was directed by Simon West and produced by Jerry Bruckheimer. It stars Nicolas Cage, John Malkovich, John Cusack, and Steve Buscemi. It received positive reviews. Roger Ebert gave the movie three out of four stars. In was released on June 6, 1997.","before_sentence":"The film stars Nicolas Cage, John Cusack, and John Malkovich alongside Steve Buscemi, Colm Meaney, Mykelti Williamson, Ving Rhames, Nick Chinlund, Jesse Borrego, Jose Zuniga, and Monica Potter.","after_sentence":"Roger Ebert gave the movie three out of four stars.","before":"","after":" In","before_diff_span_range":[60,60],"after_diff_span_range":[49,51],"before_sentence_token_range":[29,67],"after_sentence_token_range":[40,51],"label":"nonsim_general"}
{"before_context":"I AM SATAN. AHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHAAHAHAHAHAHAHAHAHAHAHAHAHAAHAHA!!!!!!11ONE","after_context":"[[Fⵉⵍⴻ:ⵚⴰⵜⴰⵏ ⴱⴻⴼoⵔⴻ ⵜⵀⴻ Loⵔⴷ.ⵊⵒⴳ|ⵜⵀⵓⵎⴱ|\"ⵚⴰⵜⴰⵏ ⴱⴻⴼoⵔⴻ ⵜⵀⴻ Loⵔⴷ\"]]\n'LⵓⵛⵉⴼⴻⵔⵚⴰⵎⴰⴻⵍⵄⵍⵍⴰⵀⵖoⴷJⴻⵙⵓⵙⵛⵀⵔⵉⵙⵜⵄⵏⵜⵉ-ⵛⵀⵔⵉⵙⵜⵃoⵍⵢⵟⵔⵉⵏⵉⵜⵢⵄⵏⵜⵉ-ⵃoⵍⵢⵟⵔⵉⵏⵉⵜⵢⵚⴰⵜⴰⵏⴹⴻⵎoⵏⵙⵄⵏⴳⴻⵍⵙⵚⵒⵉⵔⵉⵜUⵏⵉⵯⴻⵔⵙⴻⵛoⵏⵙⵓⴻⵍoMⴰⵔⵉⴰMoⵓⵍⴷⴻⵔⵚⵜⴻⵒⵀⴻⵏMⴰⵜⵜⵀⴻⵡⴹoⵎⵉⵏⴳⵓⴻⵣJⵔ.ⵅoⵙⵀⵉⴹoⵎⵉⵏⴳⵓⴻⵣ (ⵎⴻⴰⵏⵉⵏⴳ \"ⵜⵀⴻ ⴻⵏⴻⵎⵢ\" oⵔ \"ⵜⵀⴻ ⵜⵔoⵓⴱⵍⴻ-ⵎⴰⴽⴻⵔ\" ⵉⵏ ⵃⴻⴱⵔⴻⵡ), ⵙoⵎⴻⵜⵉⵎⴻⵙ ⵛⴰⵍⵍⴻⴷ ⵜⵀⴻ ⴹⴻⵯⵉⵍ, ⵉⵙ ⴰ ⴼⵉⴳⵓⵔⴻ ⴼoⵓⵏⴷ ⵉⵏ ⵜⵀⴻ ⵡⵔⵉⵜⵉⵏⴳⵙ oⴼ ⵜⵀⴻ ⵄⴱⵔⴰⵀⴰⵎⵉⵛ ⵔⴻⵍⵉⴳⵉoⵏⵙ. Mⵓⵙⵍⵉⵎⵙ, ⵛⵀⵔⵉⵙⵜⵉⴰⵏⵙ ⴰⵏⴷ Jⴻⵡⵙ ⴱⴻⵍⵉⴻⵯⴻ ⵜⵀⴰⵜ ⵀⴻ ⵜⴻⵎⵒⵜⵙ ⵒⴻoⵒⵍⴻ ⵜo ⴷo ⴱⴰⴷ ⵜⵀⵉⵏⴳⵙ. ⵃⵉⵙ ⵔoⵍⴻ ⵉⵙ ⵜo ⵇⵓⴻⵙⵜⵉoⵏ ⴰⵏⴷ ⵜⴻⵎⵒⵜ ⵒⴻoⵒⵍⴻ'ⵙ ⴼⴰⵉⵜⵀ. ⵟⵀⴻⵢ ⴰⵍⵙo ⵙⴰⵢ ⵜⵀⴰⵜ ⵀⴻ ⵡⴰⵙ oⵏⵛⴻ ⴰⵏ ⴰⵏⴳⴻⵍ ⵏⴰⵎⴻⴷ Lⵓⵛⵉⴼⴻⵔ.\nIⵏ ⵚⴰⵜⴰⵏⵉⵙⵎ, ⵚⴰⵜⴰⵏ ⵉⵙ ⵜⵀoⵓⴳⵀⵜ ⵜo ⴱⴻ ⵊⵓⵙⵜ ⴰ ⵎⴻⵜⴰⵒⵀoⵔ ⴼoⵔ ⵡⵀⴰⵜ ⵀⵓⵎⴰⵏⵙ ⵡⴰⵏⵜ. Iⵏ ⵟⵀⴻⵉⵙⵜⵉⵛ ⵚⴰⵜⴰⵏⵉⵙⵎ, ⵚⴰⵜⴰⵏ ⵉⵙ ⵛoⵏⵙⵉⴷⴻⵔⴻⴷ ⵜo ⴱⴻ ⴰ ⴳooⴷ ⴼoⵔⵛⴻ.","before_sentence":"I AM SATAN.","after_sentence":"[[Fⵉⵍⴻ:ⵚⴰⵜⴰⵏ ⴱⴻⴼoⵔⴻ ⵜⵀⴻ Loⵔⴷ.ⵊⵒⴳ|ⵜⵀⵓⵎⴱ|\" ⵚⴰⵜⴰⵏ ⴱⴻⴼoⵔⴻ ⵜⵀⴻ Loⵔⴷ\" ]]'LⵓⵛⵉⴼⴻⵔⵚⴰⵎⴰⴻⵍⵄⵍⵍⴰⵀⵖoⴷJⴻⵙⵓⵙⵛⵀⵔⵉⵙⵜⵄⵏⵜⵉ-ⵛⵀⵔⵉⵙⵜⵃoⵍⵢⵟⵔⵉⵏⵉⵜⵢⵄⵏⵜⵉ-ⵃoⵍⵢⵟⵔⵉⵏⵉⵜⵢⵚⴰⵜⴰⵏⴹⴻⵎoⵏⵙⵄⵏⴳⴻⵍⵙⵚⵒⵉⵔⵉⵜUⵏⵉⵯⴻⵔⵙⴻⵛoⵏⵙⵓⴻⵍoMⴰⵔⵉⴰMoⵓⵍⴷⴻⵔⵚⵜⴻⵒⵀⴻⵏMⴰⵜⵜⵀⴻⵡⴹoⵎⵉⵏⴳⵓⴻⵣJⵔ.ⵅoⵙⵀⵉⴹoⵎⵉⵏⴳⵓⴻⵣ(ⵎⴻⴰⵏⵉⵏⴳ\" ⵜⵀⴻ ⴻⵏⴻⵎⵢ\" oⵔ\" ⵜⵀⴻ ⵜⵔoⵓⴱⵍⴻ-ⵎⴰⴽⴻⵔ\" ⵉⵏ ⵃⴻⴱⵔⴻⵡ), ⵙoⵎⴻⵜⵉⵎⴻⵙ ⵛⴰⵍⵍⴻⴷ ⵜⵀⴻ ⴹⴻⵯⵉⵍ, ⵉⵙ ⴰ ⴼⵉⴳⵓⵔⴻ ⴼoⵓⵏⴷ ⵉⵏ ⵜⵀⴻ ⵡⵔⵉⵜⵉⵏⴳⵙ oⴼ ⵜⵀⴻ ⵄⴱⵔⴰⵀⴰⵎⵉⵛ ⵔⴻⵍⵉⴳⵉoⵏⵙ. Mⵓⵙⵍⵉⵎⵙ, ⵛⵀⵔⵉⵙⵜⵉⴰⵏⵙ ⴰⵏⴷ Jⴻⵡⵙ ⴱⴻⵍⵉⴻⵯⴻ ⵜⵀⴰⵜ ⵀⴻ ⵜⴻⵎⵒⵜⵙ ⵒⴻoⵒⵍⴻ ⵜo ⴷo ⴱⴰⴷ ⵜⵀⵉⵏⴳⵙ. ⵃⵉⵙ ⵔoⵍⴻ ⵉⵙ ⵜo ⵇⵓⴻⵙⵜⵉoⵏ ⴰⵏⴷ ⵜⴻⵎⵒⵜ ⵒⴻoⵒⵍⴻ'ⵙ ⴼⴰⵉⵜⵀ. ⵟⵀⴻⵢ ⴰⵍⵙo ⵙⴰⵢ ⵜⵀⴰⵜ ⵀⴻ ⵡⴰⵙ oⵏⵛⴻ ⴰⵏ ⴰⵏⴳⴻⵍ ⵏⴰⵎⴻⴷ Lⵓⵛⵉⴼⴻⵔ. Iⵏ ⵚⴰⵜⴰⵏⵉⵙⵎ, ⵚⴰⵜⴰⵏ ⵉⵙ ⵜⵀoⵓⴳⵀⵜ ⵜo ⴱⴻ ⵊⵓⵙⵜ ⴰ ⵎⴻⵜⴰⵒⵀoⵔ ⴼoⵔ ⵡⵀⴰⵜ ⵀⵓⵎⴰⵏⵙ ⵡⴰⵏⵜ.","before":"I AM SATAN.","after":"[[Fⵉⵍⴻ:ⵚⴰⵜⴰⵏ ⴱⴻⴼoⵔⴻ ⵜⵀⴻ Loⵔⴷ. ⵊⵒⴳ|ⵜⵀⵓⵎⴱ|\" ⵚⴰⵜⴰⵏ ⴱⴻⴼoⵔⴻ ⵜⵀⴻ Loⵔⴷ\" ]]'LⵓⵛⵉⴼⴻⵔⵚⴰⵎⴰⴻⵍⵄⵍⵍⴰⵀⵖoⴷJⴻⵙⵓⵙⵛⵀⵔⵉⵙⵜⵄⵏⵜⵉ-ⵛⵀⵔⵉⵙⵜⵃoⵍⵢⵟⵔⵉⵏⵉⵜⵢⵄⵏⵜⵉ-ⵃoⵍⵢⵟⵔⵉⵏⵉⵜⵢⵚⴰⵜⴰⵏⴹⴻⵎoⵏⵙⵄⵏⴳⴻⵍⵙⵚⵒⵉⵔⵉⵜUⵏⵉⵯⴻⵔⵙⴻⵛoⵏⵙⵓⴻⵍoMⴰⵔⵉⴰMoⵓⵍⴷⴻⵔⵚⵜⴻⵒⵀⴻⵏMⴰⵜⵜⵀⴻⵡⴹoⵎⵉⵏⴳⵓⴻⵣJⵔ. ⵅoⵙⵀⵉⴹoⵎⵉⵏⴳⵓⴻⵣ(ⵎⴻⴰⵏⵉⵏⴳ\" ⵜⵀⴻ ⴻⵏⴻⵎⵢ\" oⵔ\" ⵜⵀⴻ ⵜⵔoⵓⴱⵍⴻ-ⵎⴰⴽⴻⵔ\" ⵉⵏ ⵃⴻⴱⵔⴻⵡ), ⵙoⵎⴻⵜⵉⵎⴻⵙ ⵛⴰⵍⵍⴻⴷ ⵜⵀⴻ ⴹⴻⵯⵉⵍ, ⵉⵙ ⴰ ⴼⵉⴳⵓⵔⴻ ⴼoⵓⵏⴷ ⵉⵏ ⵜⵀⴻ ⵡⵔⵉⵜⵉⵏⴳⵙ oⴼ ⵜⵀⴻ ⵄⴱⵔⴰⵀⴰⵎⵉⵛ ⵔⴻⵍⵉⴳⵉoⵏⵙ. Mⵓⵙⵍⵉⵎⵙ, ⵛⵀⵔⵉⵙⵜⵉⴰⵏⵙ ⴰⵏⴷ Jⴻⵡⵙ ⴱⴻⵍⵉⴻⵯⴻ ⵜⵀⴰⵜ ⵀⴻ ⵜⴻⵎⵒⵜⵙ ⵒⴻoⵒⵍⴻ ⵜo ⴷo ⴱⴰⴷ ⵜⵀⵉⵏⴳⵙ.  ⵃⵉⵙ ⵔoⵍⴻ ⵉⵙ ⵜo ⵇⵓⴻⵙⵜⵉoⵏ ⴰⵏⴷ ⵜⴻⵎⵒⵜ ⵒⴻoⵒⵍⴻ'ⵙ ⴼⴰⵉⵜⵀ.  ⵟⵀⴻⵢ ⴰⵍⵙo ⵙⴰⵢ ⵜⵀⴰⵜ ⵀⴻ ⵡⴰⵙ oⵏⵛⴻ ⴰⵏ ⴰⵏⴳⴻⵍ ⵏⴰⵎⴻⴷ Lⵓⵛⵉⴼⴻⵔ.  Iⵏ ⵚⴰⵜⴰⵏⵉⵙⵎ, ⵚⴰⵜⴰⵏ ⵉⵙ ⵜⵀoⵓⴳⵀⵜ ⵜo ⴱⴻ ⵊⵓⵙⵜ ⴰ ⵎⴻⵜⴰⵒⵀoⵔ ⴼoⵔ ⵡⵀⴰⵜ ⵀⵓⵎⴰⵏⵙ ⵡⴰⵏⵜ.  Iⵏ ⵟⵀⴻⵉⵙⵜⵉⵛ ⵚⴰⵜⴰⵏⵉⵙⵎ, ⵚⴰⵜⴰⵏ ⵉⵙ ⵛoⵏⵙⵉⴷⴻⵔⴻⴷ ⵜo ⴱⴻ ⴰ ⴳooⴷ ⴼoⵔⵛⴻ.","before_diff_span_range":[0,4],"after_diff_span_range":[0,96],"before_sentence_token_range":[0,4],"after_sentence_token_range":[0,100],"label":"nonsim_general"}
{"before_context":"Byron Raymond White (June 8, 1917 – April 15, 2002) won fame both as a football halfback and as an associate justice of the Supreme Court of the United States. Appointed to the court by President John F. Kennedy in 1962, he retired in 1993, being the twelfth longest-serving justice in Supreme Court history. He was married to Marion Lloyd Stearns in 1946 and the father of two children, Charles (Barney) Byron White and Nancy Pitkin White.\nWhite was born in Fort Collins, Colorado. He was raised in the nearby town of Wellington, Colorado, where he obtained his high school diploma in 1930. He made a point of returning to Wellington on an annual basis for his high school reunions up until 1999 when his physical health worsened significantly. He died in Denver at the age of 84 from complications of pneumonia. He was the first and only Supreme Court Justice from the state of Colorado.","after_context":"Byron Raymond White (June 8, 1917 – April 15, 2002) was an American judge and former football player. he served as an associate justice of the Supreme Court of the United States. He was appointed to the court by President John F. Kennedy in 1962. He retired in 1993.\nBefore becoming an associate justice, White played for the Pittsburgh Pirates in 1938 and for the Detroit Lions from 1940 to 1941. He played as a halfback.\nWhite died in Denver, Colorado from pneumonia, aged 84.","before_sentence":"Kennedy in 1962, he retired in 1993, being the twelfth longest-serving justice in Supreme Court history.","after_sentence":"Before becoming an associate justice, White played for the Pittsburgh Pirates in 1938 and for the Detroit Lions from 1940 to 1941. He played as a halfback.","before":"twelfth longest-serving justice in","after":"Pittsburgh Pirates in 1938 and for the Detroit Lions from 1940 to 1941","before_diff_span_range":[53,57],"after_diff_span_range":[68,81],"before_sentence_token_range":[42,61],"after_sentence_token_range":[56,86],"label":"nonsim_general"}
{"before_context":"​\nDavid Woodard (birth registered April 6, 1964 in Santa Barbara, California) is an American businessman. During the late 1990s Woodard coined the term prequiem (abbreviation of preemptive-requiem), a neologism that describes his Buddhist enterprise of composing and rendering a dedicated piece of music to be conducted during or slightly before its subject's physical death. The year 2005 found him objecting to \"nonsense that has come to define Western culture.\"\nHe is known for his copies of the Dreamachine, which have been exhibited in art museums throughout the world. In Germany he is known for contributions to the literary journal Der Freund, including writings on inter-species karma and the Paraguayan settlement Nueva Germania.","after_context":"David Woodard (born April 6, 1964 in Santa Barbara, California) is an American postmodern writer and conductor. He invented the concept and portmanteau word prequiem, a musical composition that is conducted while its beneficiary lay dying.\nWoodard invented a fictional psychoactive machine called the Feraliminal Lycanthropizer. At the end of the 20th century he fabricated replicas of an actual psychoactive device called the Dreamachine.\nWoodard is also known for his work with a Paraguayan colony called Nueva Germania. His German book of correspondence Five Years, coauthored by Swiss novelist Christian Kracht, describes some of the humanitarian work performed there.","before_sentence":"​ David Woodard(birth registered April 6, 1964 in Santa Barbara, California) is an American businessman.","after_sentence":"David Woodard(born April 6, 1964 in Santa Barbara, California) is an American postmodern writer and conductor.","before":"businessman","after":"","before_diff_span_range":[18,19],"after_diff_span_range":[20,20],"before_sentence_token_range":[0,20],"after_sentence_token_range":[0,21],"label":"nonsim_noise_deletion"}
{"before_context":"Logroño is a city in northern Spain, on the Ebro River. It is the capital of the autonomous community of La Rioja, formerly known as Logroño Province. The population of Logroño in 2006 was 147,036. The city is a centre of the trade in Rioja wine, for which the area is noted, and also produces wood, metal, and textile products.","after_context":"Logroño is a city in northern Spain, capital of La Rioja. It's in the Ebro valley. The population is 150.000.","before_sentence":"Logroño is a city in northern Spain, on the Ebro River. It is the capital of the autonomous community of La Rioja, formerly known as Logroño Province.","after_sentence":"Logroño is a city in northern Spain, capital of La Rioja.","before":"on the Ebro River.  It is the capital of the autonomous community","after":"capital","before_diff_span_range":[8,21],"after_diff_span_range":[8,9],"before_sentence_token_range":[0,31],"after_sentence_token_range":[0,13],"label":"nonsim_noise_deletion"}
{"before_context":"Body painting, or sometimes bodypainting, is a form of body art, considered by some as the most ancient form of art. Unlike tattoo and other forms of body art, body painting is temporary, painted onto the human skin, and lasts for only several hours, or at most (in the case of Mehndi or \"henna tattoo\") a couple of weeks. Body painting that is limited to the face is known as face painting. Body painting is also referred to as (a form of) temporary tattoos; large scale or full-body painting is more commonly referred to as body painting, while smaller or more detailed work is generally referred to as temporary tattoos.\nTemporary body paints, such as liquid latex, are ideal for pre-tattoo designs. Liquid latex body paint is 'peelable' when dry so in effect you produce a 'to scale' design that can be removed from the skin intact. Liquidflesh.com are a safe, reliable source for liquid latex body paint in the U.K., they also ship worldwide.","after_context":"Body-painting (also body painting and bodypainting) is a form of art. It is a kind of body art, of using the human body to make a form of art. Special colors are applied to the skin to make a work of art. Body-painting is temporary. Unlike a tattoo, the colors last for a few hours only.","before_sentence":"Liquid latex body paint is'peelable' when dry so in effect you produce a'to scale' design that can be removed from the skin intact. Liquidflesh.com are a safe, reliable source for liquid latex body paint in the U.K.","after_sentence":"","before":" Liquidflesh. com are a safe, reliable source for liquid latex body paint in the U. K., they also ship worldwide.","after":"","before_diff_span_range":[153,175],"after_diff_span_range":[64,64],"before_sentence_token_range":[142,188],"after_sentence_token_range":[64,64],"label":"nonsim_noise_deletion"}
{"before_context":"Grand Duke Sergei Alexandrovich of Russia (Сергей Александрович; 11 May 1857 – 17 February 1905) was the fifth son and seventh child of Emperor Alexander II of Russia. He was an influential figure during the reigns of his brother Emperor Alexander III of Russia and his nephew Emperor Nicholas II, who was also his brother-in-law through Sergei's marriage to Elizabeth, the sister of Tsarina Alexandra.\nGrand Duke Sergei's education gave him lifelong interests in culture and the arts. Like all male members of the Romanov dynasty, he followed a military career, and he fought in the Russo-Turkish War of 1877–78, receiving the Order of St George for courage and bravery in action. In 1882, his brother, Tsar Alexander III, appointed him Commander of the 1st Battalion Preobrazhensky Life Guard Regiment, a position he held until 1891. In 1889, Grand Duke Sergei was promoted to the rank of Major General. In 1884, Sergei married Princess Elisabeth of Hesse and by Rhine, a granddaughter of Queen Victoria. Their marriage remained childless, but they became the guardians of the two children of his brother, Grand Duke Paul Alexandrovich of Russia: Grand Duchess Maria, and Grand Duke Dmitri. Grand Duke Sergei Alexandrovich and his wife promoted the marriage of Sergei's nephew, Tsar Nicholas II, with Princess Alix of Hesse, Elizabeth's youngest sister.\nBetween 1891 and 1905, Grand Duke Sergei served as Governor-General of Moscow. His reputation was tarnished as he was partially blamed for the Khodynka Tragedy, which, during the festivities following the coronation of Emperor Nicholas II, resulted in more than a thousand deaths. As a Governor of Moscow, Grand Duke Sergei was responsible for the expulsion of Moscow's 20,000 Jews at the start of his tenure, and he repressed a student movement to prevent the spread of revolutionary ideas. His conservative policies, extreme even by contemporary standards, made him a polarizing figure, and he was regarded as a reactionary. In 1894 Grand Duke Sergei was made a member of the State Council. In 1896 he was promoted to Lieutenant General and appointed as Commander of Moscow military district. After thirteen years of service, Grand Duke Sergei resigned from the Governorship on 1 January 1905. Targeted by the SR Combat Organization, he was assassinated by a terrorist bomb at the Kremlin.","after_context":"Grand Duke Sergei Alexandrovich of Russia 11 May 1857 17 February 1905 was the fifth son and seventh child of Emperor Alexander II of Russia he was an influential figure during the reign of his brother Emperor Alexander III of Russia and his nephew Nicholas II , who was also married brother - in - law through Sergei marriage to Elizabeth of Hesse and by Rhine , the sister of Tsarina Alexandra .","before_sentence":"His reputation was tarnished as he was partially blamed for the Khodynka Tragedy, which, during the festivities following the coronation of Emperor Nicholas II, resulted in more than a thousand deaths. As a Governor of Moscow, Grand Duke Sergei was responsible for the expulsion of Moscow's 20,000 Jews at the start of his tenure, and he repressed a student movement to prevent the spread of revolutionary ideas.","after_sentence":"","before":" As a Governor of Moscow, Grand Duke Sergei was responsible for the expulsion of Moscow's 20,000 Jews at the start of his tenure, and he repressed a student movement to prevent the spread of revolutionary ideas.  His conservative policies, extreme even by contemporary standards, made him a polarizing figure, and he was regarded as a reactionary.","after":"","before_diff_span_range":[274,332],"after_diff_span_range":[73,73],"before_sentence_token_range":[265,340],"after_sentence_token_range":[73,73],"label":"semantic_deletion"}
{"before_context":"Sarona Reiher (born January 10, 1978) is a professional wrestler who works for WWE under the ring name Tamina Snuka. She is the daughter of WWE Hall of Famer Jimmy \"Superfly\" Snuka and the younger sister of former WWE wrestler Deuce.","after_context":"Sarona Reiher (born January 10, 1978 in Vancouver, Washington) better known by her ring name Tamina Snuka, is a American professional wrestler. She is curretly wrestling for the WWE. She is the daughter of WWE Hall of Famer Jimmy \"Superfly\" Snuka.","before_sentence":"She is the daughter of WWE Hall of Famer Jimmy\" Superfly\" Snuka and the younger sister of former WWE wrestler Deuce.","after_sentence":"She is the daughter of WWE Hall of Famer Jimmy\" Superfly\" Snuka.","before":"and the younger sister of former WWE wrestler Deuce","after":"","before_diff_span_range":[37,46],"after_diff_span_range":[48,48],"before_sentence_token_range":[23,47],"after_sentence_token_range":[35,50],"label":"semantic_deletion"}
{"before_context":"Bristol Airport (IATA: BRS, ICAO: EGGD), located at Lulsgate Bottom in North Somerset, is the commercial airport serving the city of Bristol, England, and the surrounding area. Originally named Bristol (Lulsgate) Airport in 1955, from March 1997 to March 2010 it became known as Bristol International Airport. In 2003, the airport drew 45% of its passengers from the former county of Avon area, 13% from Devon, 10% from Somerset. In 2011 it was the ninth busiest airport in the United Kingdom, handling 5,780,746 passengers, a 0.6% increase compared with 2010.\nThe airport has a CAA Public Use Aerodrome Licence (number P432) that allows flights for the public transport of passengers and for flying instruction.","after_context":"Bristol Airport (IATA: BRS, ICAO: EGGD), is in Lulsgate Bottom in North Somerset. It is the commercial airport for the city of Bristol, England, and the area around it. It opened as Bristol (Lulsgate) Airport in 1955, from March 1997 to March 2010 it became known as Bristol International Airport. In 2003, the airport drew 45% of its passengers from the former county of Avon area, 13% from Devon, 10% from Somerset. It also has bases for Easyjet and Ryanair. In 2011, it was the ninth busiest airport in the United Kingdom, with 5,780,746 passengers, a 0.6 percent rise compared with 2010.\nIn March 2010, the airport was given the name Bristol Airport.","before_sentence":"The airport has a CAA Public Use Aerodrome Licence(number P432) that allows flights for the public transport of passengers and for flying instruction.","after_sentence":"In March 2010, the airport was given the name Bristol Airport.","before":"has a CAA Public Use Aerodrome Licence(number P432) that allows flights for","after":"","before_diff_span_range":[115,127],"after_diff_span_range":[134,134],"before_sentence_token_range":[112,138],"after_sentence_token_range":[126,139],"label":"semantic_deletion"}
{"before_context":"Beverly Eaves \"Bev\" Perdue (born Beverly Marlene Moore; January 14, 1947) is an American politician and member of the Democratic Party who served as the 73rd Governor of the U.S. state of North Carolina from 2009 to 2013. She was the first female governor of North Carolina.\nPerdue started her political career in the 1980s, serving in the North Carolina House of Representatives. She then served five terms in the North Carolina Senate before she was elected as the 32nd Lieutenant Governor of North Carolina. Perdue was elected to the office of Governor of North Carolina in 2008 against Charlotte Mayor Pat McCrory by a 50-46 margin. When Hillary Clinton dropped out of the 2008 presidential race, The New York Times mentioned Perdue as a potential future presidential candidate.\nOn January 26, 2012, facing sinking approval ratings, Perdue announced that she would not seek reelection in the 2012 gubernatorial election. She left office in January 2013.","after_context":"Beverly Eaves \"Bev\" Perdue (aka Beverly Marlene Moore; born January 14) is an American politician and Democrat. From January 2009 to 2013, she was 73rd Governor in the U.S. State of North Carolina. She was the first female Governor in that state.\nBecause of declining approval ratings, in January 2012, Perdue said she would not do another term. In January of the following year, she was succeeded by Pat McCrory.\nBev Perdue was born in Grundy, Virginia. Some sources mention 1947 as her birth date, while others say 1948.","before_sentence":"She was the first female governor of North Carolina.","after_sentence":"She was the first female Governor in that state.","before":"","after":"Governor in that state.","before_diff_span_range":[51,51],"after_diff_span_range":[46,50],"before_sentence_token_range":[46,56],"after_sentence_token_range":[42,52],"label":"semantic_elaboration_background"}
{"before_context":"Northeastern Ontario is the region within the Canadian province of Ontario which lies north and east of Lakes Superior and Huron. Northeastern Ontario consists of Algoma District, Sudbury District, Cochrane District, Timiskaming District, Nipissing District, Manitoulin District and the single-tier municipality of Greater Sudbury.\nFor some purposes, Parry Sound District and Muskoka District Municipality are treated as part of Northeastern Ontario even though they are geographically in Central Ontario. These two districts are coloured in green on the map.\nNortheastern Ontario and Northwestern Ontario may also be grouped together as Northern Ontario. An important difference between the two sub-regions is that Northeastern Ontario has a sizeable Franco-Ontarian population, with approximately 25 per cent of the region's population speaking French as a first language compared to just 3.2 per cent in the northwest.","after_context":"Northeastern Ontario is a region in the Canadian province of Ontario. It includes the districts of Algoma, Sudbury, Cochrane, Timiskaming, Nipissing, and Manitoulin. Parry Sound District and District Municipality of Muskoka are sometimes included in Northeastern Ontario, although they are usually included in Central Ontario.\nNortheastern Ontario is sometimes included with Northwestern Ontario as Northern Ontario. One differance between the two parts is that Northeastern Ontario has a large Franco-Ontarian population. Almost 25 percent of Northeastern Ontario's population speaks French as a first language.","before_sentence":"For some purposes, Parry Sound District and Muskoka District Municipality are treated as part of Northeastern Ontario even though they are geographically in Central Ontario.","after_sentence":"Parry Sound District and District Municipality of Muskoka are sometimes included in Northeastern Ontario, although they are usually included in Central Ontario.","before":"","after":"usually included","before_diff_span_range":[72,72],"after_diff_span_range":[48,50],"before_sentence_token_range":[51,78],"after_sentence_token_range":[30,54],"label":"semantic_elaboration_background"}
{"before_context":"Rhizopus stolonifer (black bread mold) is a widely distributed Mucoralean mold. Asexual spores are formed within sporangia, which break to release the spores when mature. Germination of these spores forms the haploid hyphae of a new mycelium. R. stolonifer grows rapidly at temperatures between 15 and 30 degrees C. Rhizopus stolonifer is a heterotrophic species (Schipper 1984), in that sexual reproduction occurs only when opposite mating types (designated + and -) come in contact. Successful mating results in the formation of durable zygospores at the point of contact. Subsequently, the zygospore germinates and forms a sporangiophore whose sporangium contains both + and - haploid spores.\nThere are three varieties: R. stolonifer var. stolonifer produces straight, erect sporangiophores, whereas those of R. stolonifer var. lyococcos are curved . A closely related species, Rhizopus sexualis, differs primarily in being homothallic (self-compatible).","after_context":"Rhizopus stolonifer (black bread mold) is a very common type of mold. It grows and reproduces like most molds. Spores are made inside a part of the mold called a sporangia. When the spores are ready to grow the sporangia breaks open and lets the spores float out. The spores land on a place where they can turn into a new mold, and begin to grow. They very quickly start making hyphae, small tendrils that look like roots. Hyphae are not roots, but part of the mycelium, which is the main part of the mold. Black bread mold grows very fast Asexual spores are formed within sporangia, which break to release the spores when mature. Germination of these spores forms the haploid hyphae of a new mycelium. R. stolonifer grows rapidly at temperatures between 15 and 30 degrees C. Rhizopus stolonifer is a heterotrophic species (Schipper 1984), in that sexual reproduction occurs only when opposite mating types (designated + and -) come in contact. Successful mating results in the formation of durable zygospores at the point of contact. Subsequently, the zygospore germinates and forms a sporangiophore whose sporangium contains both + and - haploid spores.\nThere are three varieties: R. stolonifer var. stolonifer produces straight, erect sporangiophores, whereas those of R. stolonifer var. lyococcos are curved . A closely related species, Rhizopus sexualis, differs primarily in being homothallic (self-compatible).","before_sentence":"Rhizopus stolonifer(black bread mold) is a widely distributed Mucoralean mold.","after_sentence":"Spores are made inside a part of the mold called a sporangia. When the spores are ready to grow the sporangia breaks open and lets the spores float out.","before":"","after":" When the spores are ready to grow the sporangia breaks open and lets the spores float out.","before_diff_span_range":[8,8],"after_diff_span_range":[34,52],"before_sentence_token_range":[0,13],"after_sentence_token_range":[22,53],"label":"semantic_elaboration_background"}
{"before_context":"A sphere (from Greek σφαῖρα — sphaira, \"globe, ball\") is a perfectly round geometrical object in three-dimensional space that is the surface of a completely round ball, (viz., analogous to a circular object in two dimensions) Like a circle, which geometrically is a two-dimensional object, a sphere is defined mathematically as the set of points that are all at the same distance r from a given point, but in three-dimensional space. This distance r is the radius of the ball, and the given point is the center of the mathematical ball. The longest straight line through the ball, connecting two points of the sphere, passes through the center and its length is thus twice the radius; it is a diameter of the ball.\nWhile outside mathematics the terms \"sphere\" and \"ball\" are sometimes used interchangeably, in mathematics a distinction is made between the sphere (a two-dimensional closed surface embedded in three-dimensional Euclidean space) and the ball (a three-dimensional shape that includes the sphere as well as everything inside the sphere). The ball and the sphere share the same radius, diameter, and center.","after_context":"A sphere is a shape in space that is like the surface of a ball. Usually, the words ball and sphere mean the same thing. But in mathematics, a sphere is the surface of a ball, which is given by all the points in three dimensional space that are located at a fixed distance from the center. The distance from the center is called radius of the sphere. When the sphere is filled in with all the points inside, it called a ball.\nCommon things that have the shape of a sphere are are basketballs, superballs, and playground balls. The Earth and the Sun are nearly spherical, meaning sphere-shaped. A sphere is the three-dimensional analog of a circle.","before_sentence":"This distance r is the radius of the ball, and the given point is the center of the mathematical ball.","after_sentence":"Common things that have the shape of a sphere are are basketballs, superballs, and playground balls. The Earth and the Sun are nearly spherical, meaning sphere-shaped.","before":"the","after":" The Earth and the Sun are nearly spherical, meaning sphere-shaped.","before_diff_span_range":[85,86],"after_diff_span_range":[107,118],"before_sentence_token_range":[84,106],"after_sentence_token_range":[92,123],"label":"semantic_elaboration_example"}
{"before_context":"A vinculum is a horizontal line placed over a mathematical expression, used to indicate that it is to be considered a group.\nExamples of its use include the case of a group of infinitely repeating digits, for example,\nIt is also used in the notation of a radical to indicate the radicand whose root is being indicated. In the case of\nthe quantity a\nb\n+\n2\n{\\displaystyle ab+2} is the radicand, and thus has a vinculum over it.\nThe vinculum is also sometimes used in Boolean_algebra, where it serves to indicate a group of expressions whose logical result is to be NOTed, as in","after_context":"A vinculum is a horizontal line placed over a mathematical expression. It shows that this expression belongs together as a group. (Vinculum is Latin for \"chain\".)\nExamples of its use include the case of a group of infinitely repeating digits, for example,\nIt is also used in common arithmetic to show that the numerator is being divided by the denominator as a whole group.\nIt is also used in the notation of a radical to indicate the radicand whose root is being indicated. In the next case, the quantity a\nb\n+\n2\n{\\displaystyle ab+2} is the radicand, and thus has a vinculum over it.\nIt is also used to show the repeating terms in a periodic continued fraction. Quadratic irrational numbers are the only numbers that have these.","before_sentence":"Examples of its use include the case of a group of infinitely repeating digits, for example, It is also used in the notation of a radical to indicate the radicand whose root is being indicated.","after_sentence":") Examples of its use include the case of a group of infinitely repeating digits, for example, It is also used in common arithmetic to show that the numerator is being divided by the denominator as a whole group.","before":"","after":"common arithmetic to show that the numerator is being divided by the denominator as a whole group.","before_diff_span_range":[47,47],"after_diff_span_range":[53,70],"before_sentence_token_range":[24,62],"after_sentence_token_range":[31,73],"label":"semantic_elaboration_example"}
{"before_context":"Rheology \/riːˈɒlədʒi\/ is the study of the flow of matter, primarily in the liquid state, but also as 'soft solids' or solids under conditions in which they respond with plastic flow rather than deforming elastically in response to an applied force. It applies to substances which have a complex microstructure, such as muds, sludges, suspensions, polymers and other glass formers (e.g., silicates), as well as many foods and additives, bodily fluids (e.g., blood) and other biological materials or other materials which belong to the class of soft matter. Newtonian fluids can be characterized by a single coefficient of viscosity for a specific temperature. Although this viscosity will change with temperature, it does not change with the strain rate. Only a small group of fluids exhibit such constant viscosity, and they are known as Newtonian fluids. But for a large class of fluids, the viscosity changes with the strain rate (or relative velocity of flow) are called non-Newtonian fluids. Rheology generally accounts for the behaviour of non-Newtonian fluids, by characterizing the minimum number of functions that are needed to relate stresses with rate of change of strains or strain rates. For example, ketchup can have its viscosity reduced by shaking (or other forms of mechanical agitation, where the relative movement of different layers in the material actually causes the reduction in viscosity) but water cannot. Ketchup is a shear thinning material, as an increase in relative velocity caused a reduction in viscosity, while some other non-Newtonian materials show the opposite behaviour: viscosity going up with relative deformation, which are called shear thickening or dilatant materials. Since Sir Isaac Newton originated the concept of viscosity, the study of liquids with strain rate dependent viscosity is also often called Non-Newtonian fluid mechanics.\nThe term rheology was coined by Eugene C. Bingham, a professor at Lafayette College, in 1920, from a suggestion by a colleague, Markus Reiner. The term was inspired by the aphorism of Simplicius (often misattributed to Heraclitus), panta rhei, \"everything flows\"\nThe experimental characterization of a material's rheological behaviour is known as rheometry, although the term rheology is frequently used synonymously with rheometry, particularly by experimentalists. Theoretical aspects of rheology are the relation of the flow\/deformation behaviour of material and its internal structure (e.g., the orientation and elongation of polymer molecules), and the flow\/deformation behaviour of materials that cannot be described by classical fluid mechanics or elasticity.","after_context":"Rheology is the study of the flow of liquids and soft solids like mud or blood.","before_sentence":"Rheology \/riːˈɒlədʒi\/ is the study of the flow of matter, primarily in the liquid state, but also as'soft solids' or solids under conditions in which they respond with plastic flow rather than deforming elastically in response to an applied force.","after_sentence":"Rheology is the study of the flow of liquids and soft solids like mud or blood.","before":"' or","after":"like mud or blood","before_diff_span_range":[19,21],"after_diff_span_range":[12,16],"before_sentence_token_range":[0,45],"after_sentence_token_range":[0,17],"label":"semantic_elaboration_example"}
{"before_context":"Mexico\nMexican athletes have won a total of 62 medals - with athletics, boxing and diving as the top medal-producing sports.\nThe National Olympic Committee for Mexico is the Comité Olímpico Mexicano and was created in 1923.","after_context":"Mexico first was at the Olympic Games in 1900. They have been in every Summer Olympic Games since 1924. Mexico has also been in several Winter Olympic Games since 1928.\nMexico was the host nation of the 1968 Summer Olympics in Mexico City.\nThe National Olympic Committee for Mexico is the Comité Olímpico Mexicano and was formed in 1923.","before_sentence":"Mexico Mexican athletes have won a total of 62 medals - with athletics, boxing and diving as the top medal-producing sports.","after_sentence":"Mexico first was at the Olympic Games in 1900.","before":"","after":"first was at the Olympic Games in 1900.","before_diff_span_range":[1,1],"after_diff_span_range":[1,9],"before_sentence_token_range":[0,23],"after_sentence_token_range":[0,10],"label":"semantic_elaboration_generic"}
{"before_context":"Estelle Harris (née Nussbaum; April 4, 1928) is an American stand-up comedienne, actress, and voice artist, often recognized for her shrill, grating voice. She is best known for her role as Estelle Costanza on Seinfeld from 1992 to 1998, as the voice of Mrs. Potato Head in the Toy Story franchise, and Muriel on The Suite Life of Zack & Cody.","after_context":"Estelle Harris (born Estelle Nussbaum April 4, 1928 in New York City, New York) is a comedian, actress, voice actress, and television actress. She is best known for her role as Estelle Costanza in Seinfield. To younger audiences she is known for her role as Mrs. Potato Head in Toy Story 2, and in Toy Story 3. She is also known as Muriel on The Suite Life of Zach and Cody.","before_sentence":"Estelle Harris(née Nussbaum; April 4, 1928) is an American stand-up comedienne, actress, and voice artist, often recognized for her shrill, grating voice.","after_sentence":"Estelle Harris(born Estelle Nussbaum April 4, 1928 in New York City, New York) is a comedian, actress, voice actress, and television actress.","before":"","after":"television actress","before_diff_span_range":[19,19],"after_diff_span_range":[25,27],"before_sentence_token_range":[0,31],"after_sentence_token_range":[0,30],"label":"semantic_elaboration_generic"}
{"before_context":"The 2010 Brooklyn\/Queens tornadoes were a severe weather event that occurred in the boroughs of Brooklyn and Queens in New York City. These tornadoes were the second to touch down in New York City that year, the first having occurred in the Bronx on July 25. The storms struck New York City just as the evening rush hour was beginning. Damaging winds, heavy downpours, and hail up to 1 inch (2.5 cm) wreaked havoc with the evening commute. Hundreds of downed trees led to a temporary suspension of service on the Long Island Rail Road, Amtrak, and several subway lines including the L train, 7 train, and M train, leaving tens of thousands of commuters stranded. Passage on local roadways was nearly impossible due to fallen branches and downed power lines. Major highways including the Long Island Expressway and the Grand Central Parkway were at a standstill. A woman was killed when a tree fell and crushed the vehicle she was driving. Extensive and widespread wind damage led to over 30,000 downed trees, and power lines. Scattered power outages were reported across parts of the city.\nTwo separate tornadoes were later confirmed in Park Slope and Flushing, two areas that suffered the worst damage from the storms. The stronger of the two tornadoes touched down over Flushing and was rated an EF1 with maximum winds of 100 mph. In addition to the tornadoes, the National Weather Service confirmed the occurrence of a macroburst bringing winds up to 125 mph to a wide swath of Middle Village and Forest Hills.","after_context":"The 2010 Brooklyn\/Queens tornadoes were a severe weather event that happened in the boroughs of Brooklyn and Queens in New York City. Two tornadoes touched down in Park Slope, Brooklyn and Flushing, Queens. It happened between 5:37 PM to 5:57 PM EDT on September 16, 2010. The tornadoes were the second to hit New York City that year, after a tornado that hit Queens on July 25. The stronger of the two tornadoes hit Flushing and was rated an EF1 with winds of up to 100 mph.\nThe thunderstorm hit New York City during the evening rush hour. It brought strong winds, heavy rain, and hail. The strong winds brought down over 30,000 trees and power lines. In addition to the tornadoes, a macroburst hit Middle Village and Forest Hills in Queens. The macroburst had heavy rain and strong winds of up to 125 mph.","before_sentence":"In addition to the tornadoes, the National Weather Service confirmed the occurrence of a macroburst bringing winds up to 125 mph to a wide swath of Middle Village and Forest Hills.","after_sentence":"In addition to the tornadoes, a macroburst hit Middle Village and Forest Hills in Queens.","before":"","after":"in Queens","before_diff_span_range":[271,271],"after_diff_span_range":[140,142],"before_sentence_token_range":[251,283],"after_sentence_token_range":[134,151],"label":"semantic_elaboration_generic"}
{"before_context":"James Henry Scullin (18 September 1876 – 28 January 1953) was an Australian Labor Party politician and the ninth Prime Minister of Australia. Two days after he was sworn in as Prime Minister the Wall Street Crash of 1929 occurred, marking the beginning of the Great Depression and subsequent Great Depression in Australia. Already in a weak political position, the economic crisis would prove overwhelming for Scullin, with interpersonal and policy disagreements causing a three-way split of his party in 1931. These defections would bring down his government by the end of the year, and the Scullin's government was routed as the resulting early election of 1931. Despite his chaotic term of office, Scullin was personally popular and was a leading figure in the Labor movement throughout his lifetime. He would remain a trusted éminence grise within the party until his retirement in 1949.","after_context":"James Henry Scullin (18 September 1876 – 28 January 1953) was the ninth Prime Minister of Australia from October 1929 until January 1932. He became Prime Minister two days before the Great Depression began. His government could not stop the effects of the Depression. His government suffered a big defeat at the December 1931 election. Scullin stayed as leader of the Labor Party but lost the 1934 election.","before_sentence":"Two days after he was sworn in as Prime Minister the Wall Street Crash of 1929 occurred, marking the beginning of the Great Depression and subsequent Great Depression in Australia.","after_sentence":"He became Prime Minister two days before the Great Depression began.","before":"the Wall Street Crash of 1929 occurred, marking the beginning of the Great Depression","after":"the Great Depression began","before_diff_span_range":[35,49],"after_diff_span_range":[32,36],"before_sentence_token_range":[25,57],"after_sentence_token_range":[25,37],"label":"semantic_hypernymy"}
{"before_context":"The Max Headroom broadcast signal intrusion was a television signal hijacking occurring in Chicago, Illinois, United States, on the evening of November 22, 1987, involving at least two individuals known as Dan Rather and John R. MacDougall. It is an example of what is known in the television business as broadcast signal intrusion. Two Chicago television stations had their broadcast signals hijacked by Dan Rather wearing a Max Headroom mask and sunglasses. A homemade Max Headroom background rocked back and forth in the background.\nDan was successful in interrupting two broadcast television stations within the course of three hours. The first incident took place for 25 seconds during the sportscast on the 9:00 PM news on WGN-TV Channel 9, and the second, two hours later, after 11:00 PM on PBS affiliate WTTW Channel 11 for about 90 seconds during a broadcast of an episode of the Doctor Who serial Horror of Fang Rock.\nThe second pirate broadcast, which lasted 90 seconds and was pre-recorded on videotape, featured the individual parodying WGN and television in general. The hacker rambled on making reference to Headroom's endorsement of Coke, the series Clutch Cargo, and WGN anchor Chuck Swirsky, then pretended to defecate as a \"masterpiece for all the greatest world newspaper nerds\", a reference to WGN's call letters (\"World's Greatest Newspaper\"). The video ended with the hacker’s exposed buttocks being spanked with a flyswatter by an accomplice before normal programming resumed.\nThe incident made national headlines and the people responsible have been identified as Dan Rather and John R. MacDougall. Dan and MacDougall then got arrested in 1995 for hijacking, they served 1 year in prison.","after_context":"The Max Headroom broadcast signal intrusion was a television signal hijacking that happened in Chicago, Illinois, United States, on the evening of November 22, 1987. It involved at least three unknown people. It is an example of what is known in the television business as broadcast signal intrusion. Two Chicago television stations, WGN-TV and WTTW, had their broadcast signals hijacked by an unknown person wearing a Max Headroom mask and sunglasses. A homemade Max Headroom background rocked back and forth in the background. The incident happened two times within a course of three hours. The first incident took place for 25 seconds during the sportscast on the 9:00 PM news on WGN-TV Channel 9, and the second, two hours later, after 11:00 PM on PBS related WTTW Channel 11 for about 90 seconds during a broadcast of an episode of the Doctor Who serial Horror of Fang Rock.\nThe incident made national headlines and the people responsible have never been identified.","before_sentence":"Dan was successful in interrupting two broadcast television stations within the course of three hours.","after_sentence":"The incident happened two times within a course of three hours.","before":"Dan was successful in interrupting two broadcast television stations","after":"The incident happened two times","before_diff_span_range":[94,103],"after_diff_span_range":[94,99],"before_sentence_token_range":[94,110],"after_sentence_token_range":[94,106],"label":"semantic_hypernymy"}
{"before_context":"Charlotte Harbor Estuary, the second largest bay in Florida, is located on the Gulf of Mexico coast of west Florida, mostly (2\/3) in Charlotte County, Florida with the remaining 1\/3 in Lee County. The harbor's mouth is located behind Gasparilla Island, one of the many coastal barrier islands on the southwest coast of Florida, with access from the Gulf of Mexico through the Boca Grande Pass between Gasparilla Island on the north and Lacosta Island on the south. Charlotte Harbor covers about 270 sq mi (700 km2)\nCharlotte Harbor Estuary is a natural estuary spanning the west coast of Florida from Venice to Bonita Springs on the Gulf of Mexico and is one of the most productive wetlands in Florida. The estuary has a large watershed, and includes Charlotte Harbor itself as well as the Peace River, Caloosahatchee River (via Pine Island Sound) and Myakka River basins. It covers 12,653 square kilometers (4,885 sq mi), the second largest open water estuary in the state.\nIt is classified as a bar-built estuary, formed when sandbars build up along the coastline. The sand bars block the waters behind them from the sea. Such estuaries tend to be shallow with minimal tidal action.\nThis is a threatened ecosystem because of the rapid increase of growth and development, poor land-use policies, and the overuse of natural resources. The Charlotte Harbor Aquatic Preserves, established by the state of Florida in 1975, are five contiguous aquatic preserves within the greater Charlotte Harbor estuary. It includes salt marshes, mangroves, seagrass, oyster and tidal flats. It is the preserve of many species, including the American alligator, West Indian manatee, bald eagle, wood stork, piping plover, green and loggerhead sea turtles, royal false pawpaw (Deeringothamnus pulchellus), Florida perforate cladonia (Cladonia perforata) and many more.\nThe harbor is fed with fresh water from the Myakka River on its northwest corner and the Peace River on its northeastern corner. Charlotte Harbor is bordered by the communities of Boca Grande, Port Charlotte, Charlotte Harbor, Punta Gorda and Bokeelia. Charlotte Harbor connects to San Carlos Bay to the south by way of Pine Island Sound and Matlacha Pass.","after_context":"Charlotte Harbor Estuary, is the second largest bay in Florida, it is on the Gulf of Mexico coast of west Florida, it is in Charlotte County, Florida","before_sentence":"Charlotte Harbor Estuary, the second largest bay in Florida, is located on the Gulf of Mexico coast of west Florida, mostly(2\/3) in Charlotte County, Florida with the remaining 1\/3 in Lee County.","after_sentence":"","before":"mostly(2\/3)","after":"it is","before_diff_span_range":[23,24],"after_diff_span_range":[24,26],"before_sentence_token_range":[0,39],"after_sentence_token_range":[0,0],"label":"semantic_hypernymy"}
{"before_context":"Keith Carter (1970 – February 3, 2016), also known as Big Kap and The Wardin, was an American hip-hop DJ who was born in New York City. In 1995, he was a member of hip hop supergroup The Flip Squad. He was well known for the 1999 album The Tunnel with Funkmaster Flex, named after the New York nightclub where he was a regular DJ. He died in New York late on February 3, 2016 due to a heart attack. He was aged 45 at the time of his death. According to his road manager Ab Traxx, Keith dealt with diabetes, but he did not believe it was what caused his fatal heart attack. Keith was previously slated to work on a showcase in Atlanta on the day of his death, shortly after his passing, the event became a memorial for Keith.\nBig Kap is also well known for a video that went viral in 2011 consisting of Notorious B.I.G. throwing a water bottle at Big Kap during a Summer Jam concert before storming off the stage in 1995.","after_context":"Big Kap was a DJ who was born at New York in 1970. He is well known for his album The Tunnel with DJ Funkmaster Flex, which was released in 1999. He died due to a heart attack on February 3, 2016 in New York. He was aged 45 at the time of his death.","before_sentence":"Keith Carter(1970 - February 3, 2016), also known as Big Kap and The Wardin, was an American hip-hop DJ who was born in New York City.","after_sentence":"Big Kap was a DJ who was born at New York in 1970.","before":"City.","after":"","before_diff_span_range":[25,26],"after_diff_span_range":[13,13],"before_sentence_token_range":[0,32],"after_sentence_token_range":[0,14],"label":"syntactic_deletion"}
{"before_context":"Polksville is an unincorporated community in Bath County, Kentucky, United States. Polksville is located on U.S. Route 60 2.5 miles (4.0 km) northwest of Salt Lick.","after_context":"Polksville is an unincorporated community in Bath County, Kentucky, United States. Polksville is on U.S. Route 60. It is 2.5 miles (4.0 km) northwest of Salt Lick.","before_sentence":"Polksville is located on U.S.","after_sentence":"Polksville is on U.S.","before":"located","after":"","before_diff_span_range":[16,17],"after_diff_span_range":[16,16],"before_sentence_token_range":[14,21],"after_sentence_token_range":[14,20],"label":"syntactic_deletion"}
{"before_context":"Freedom of the press is the guarantee by a government of free public press for its citizens and their associations, extended to members of news-gathering organizations (journalists), and their published reporting. In many countries there are constitutional or statutory protections pertaining to freedom of the press. With respect to governmental information, any government distinguishes which materials are public or protected from disclosure to the public based on classification of information as sensitive, classified or secret and being otherwise protected from disclosure due to relevance of the information to protecting the national interest. Many governments are also subject to sunshine laws or freedom of information legislation that are used to define the ambit of national interest.\nIn developed countries, freedom of the press implies that all people should have the right to express themselves in writing or in any other way of expression of personal opinion or creativity. The Universal Declaration of Human Rights states: \"Everyone has the right to freedom of opinion and expression; this right includes freedom to hold opinions without interference, and impart information and ideas through any media regardless of frontiers\"\nThis philosophy is usually accompanied by legislation ensuring various degrees of freedom of scientific research (known as scientific freedom), publishing, press and printing the depth to which these laws are entrenched in a country's legal system can go as far down as its constitution. The concept of freedom of speech is often covered by the same laws as freedom of the press, thereby giving equal treatment to media and individuals.\nBesides legal definitions, some non-governmental organizations use other criteria to judge the level of press freedom around the world:\nEvery year, Reporters Without Borders establishes a ranking of countries in terms of their freedom of the press. The Worldwide press freedom index list is based on responses to surveys sent to journalists that are members of partner organisations of the RWB, as well as related specialists such as researchers, jurists and human rights activists. The survey asks questions about direct attacks on journalists and the media as well as other indirect sources of pressure against the free press, such as pressure on journalists by non-governmental groups. RWB is careful to note that the index only deals with press freedom, and does not measure the quality of journalism.\nIn 2003, the countries where press was the most free were Finland, Iceland, the Netherlands and Norway. In 2004, apart from the above countries, Denmark, Ireland, Slovakia, and Switzerland were tied at the top of the list, followed by New Zealand and Latvia. The country with the least degree of press freedom was North Korea, followed by Burma, Turkmenistan, People's Republic of China (mainland only), Vietnam, Nepal,and Iran.\nAccording to Reporters Without Borders, more than a third of the world's people live in countries where there is no press freedom. Overwhelmingly, these people live in countries where there is no system of democracy or where there are serious deficiencies in the democratic process.\nFreedom of the press is an extremely problematic concept for most non-democratic systems of government since, in the modern age, strict control of access to information is critical to the existence of most non-democratic governments and their associated control systems and security apparatus. To this end, most non-democratic societies employ state-run news organizations to promote the propaganda critical to maintaining an existing political power base and suppress (often very brutally, through the use of police, military, or intelligence agencies) any significant attempts by the media or individual journalists to challenge the approved \"government line\" on contentious issues. In such countries, journalists operating on the fringes of what is deemed to be acceptable will very often find themselves the subject of considerable intimidation by agents of the state. This can range from simple threats to their professional careers (firing, professional blacklisting) to death threats, kidnapping, torture, and assassination.\nReporters Without Borders reports that, in 2003, 42 journalists lost their lives pursuing their profession and that, in the same year, at least 130 journalists were in prison as a result of their occupational activities. In 2005, 63 journalists and 5 media assistants were killed worldwide.","after_context":"Freedom of the press is a promise by a government not to punish journalists and other people who report the news for doing their job. It is an idea that is like freedom of speech, because it protects people from expressing their opinions or beliefs. Many countries have passed laws or constitutional amendments protecting freedom of the press.","before_sentence":"Freedom of the press is the guarantee by a government of free public press for its citizens and their associations, extended to members of news-gathering organizations(journalists), and their published reporting. In many countries there are constitutional or statutory protections pertaining to freedom of the press.","after_sentence":"Many countries have passed laws or constitutional amendments protecting freedom of the press.","before":"there are","after":"","before_diff_span_range":[34,36],"after_diff_span_range":[53,53],"before_sentence_token_range":[0,51],"after_sentence_token_range":[48,62],"label":"syntactic_deletion"}
{"before_context":"Elba (Latin: Ilva) is an island in Tuscany, Italy, 20 km from the coastal town of Piombino (42°44′N 10°22′E﻿ \/ ﻿42.733°N 10.367°E﻿ \/ 42.733; 10.367) . It is the largest island of the Tuscan Archipelago, and the third largest island in Italy after Sicily and Sardinia. Elba and the other islands (Gorgona, Capraia, Pianosa, Montecristo, Giglio and Giannutri) of the Tuscan Archipelago are protected in the National Park of the Tuscan Archipelago. The French island of Corsica lies about 35 Km to the west.\nThe island is divided into eight comunes: Portoferraio, Campo nell'Elba, Capoliveri, Marciana, Marciana Marina, Porto Azzurro, Rio Marina and Rio nell'Elba. The land area of the island is about 224 km2 (86 square miles) and the coastline is about 147 km (91 miles). The highest mountain is Monte Capanne at 1018 metres (3340 feet).","after_context":"Elba is third largest island off the coast of Italy.\nThe land area of the island is about 224 square kms and the coastline is about 147 km. The highest mountain is Monte Capanne at 1018 metres (3340 feet).","before_sentence":"It is the largest island of the Tuscan Archipelago, and the third largest island in Italy after Sicily and Sardinia.","after_sentence":"Elba is third largest island off the coast of Italy.","before":"in","after":"","before_diff_span_range":[43,44],"after_diff_span_range":[9,9],"before_sentence_token_range":[36,58],"after_sentence_token_range":[0,11],"label":"syntactic_generic"}
{"before_context":"Married... with Children is an American sitcom that aired for 11 seasons that featured a dysfunctional family living in a fictional Chicago, Illinois suburb. The show, notable for being the first prime time television series to air on Fox, ran from April 5, 1987, to June 9, 1997. The series was created by Michael G. Moye and Ron Leavitt. The show was known for handling non-standard topics for the time period, which garnered the then-fledgling Fox network a standing among the Big Three television networks.\nThe series' 11-season, 259-episode run makes it the longest-lasting live-action sitcom on the Fox network. The show's famous theme song is \"Love and Marriage\" by Sammy Cahn and Jimmy Van Heusen, performed by Frank Sinatra from the 1955 television production Our Town.\nThe first season of the series was videotaped at ABC Television Center in Hollywood. From season two to season eight, the show was taped at Sunset Gower Studios in Hollywood and the remaining three seasons were taped at Sony Pictures Studios in Culver City. The series was produced by Embassy Communications on its first season and the remaining seasons by ELP Communications under the studio Columbia Pictures Television (and eventually Columbia TriStar Television).\nIn 2007, it placed as #46 of Time Magazine's \"100 Best TV Shows of All-Time.\" In 2008, The show placed #94 on Entertainment Weekly's \"New TV Classics\" list.\nOn April 22, 2012, Fox re-aired the series premiere in honor of its 25th anniversary.","after_context":"Married... with Children is an American] sitcom that aired for 11 seasons. It was about a family living in a fictional Chicago, Illinois, suburb. It stars Ed O'Neill, Katey Segal, Christina Applegate, Ted McGinley, and David Garrison. On April 22, 2012, Fox re-aired the series premiere in honor of its 25th anniversary.","before_sentence":"with Children is an American sitcom that aired for 11 seasons that featured a dysfunctional family living in a fictional Chicago, Illinois suburb.","after_sentence":"It was about a family living in a fictional Chicago, Illinois, suburb.","before":"","after":",","before_diff_span_range":[27,27],"after_diff_span_range":[29,30],"before_sentence_token_range":[4,29],"after_sentence_token_range":[16,31],"label":"syntactic_generic"}
{"before_context":"Elizabeth Banks (born Elizabeth Irene Mitchell; February 10, 1974) is an American actress, producer, and director.\nBanks made her film debut in the low-budget independent film Surrender Dorothy (1998), and is known for her roles in such films as Wet Hot American Summer, Sam Raimi's Spider-Man trilogy (2002–07), The 40-Year-Old Virgin (2005), Zack and Miri Make a Porno (2008), Role Models (2008), The Next Three Days (2010), Pitch Perfect (2012), The Lego Movie (2014), and The Hunger Games films (2012\/15). In 2014, she portrayed Melinda Ledbetter, the girlfriend and later wife of the Beach Boys co-founder Brian Wilson, in Bill Pohlad's film Love & Mercy. In 2015, she made her directorial debut with Pitch Perfect 2, whose May 15–17 $69M opening weekend gross set a record for a first-time director.\nOn television, Banks had a recurring role as Avery Jessup on the NBC sitcom 30 Rock, which gained her two Emmy Award nominations. She also had recurring roles on Scrubs and Modern Family. In 2015, she reprised her role as Lindsay for the Netflix miniseries Wet Hot American Summer: First Day of Camp.","after_context":"Elizabeth Banks (born February 10 1974) is a television program and movie actress. Her movies include Spider-Man franchise and 2008's comedy Zack and Miri Make a Porno.","before_sentence":"Elizabeth Banks(born Elizabeth Irene Mitchell; February 10, 1974) is an American actress, producer, and director.","after_sentence":"Elizabeth Banks(born February 10 1974) is a television program and movie actress.","before":",","after":"","before_diff_span_range":[8,9],"after_diff_span_range":[5,5],"before_sentence_token_range":[0,22],"after_sentence_token_range":[0,15],"label":"syntactic_generic"}
{"before_context":"Rutherford Birchard Hayes (October 4, 1822– January 17, 1893) was the 19th President of the United States from March 4 1877 to March 4 1881 and was twice the Governor of Ohio 1868-1872 and 1876-1877.\nHayes was born in Delaware, Ohio and graduated from Harvard Law School in 1845. He practiced law in Lower Sandusky (now Fremont) and was a city solicitor for Cincinatti 1858-1861. He served in the American Civil War and rose to the rank of major-general in 1864 and also served in the US congress 1864-1867 as a Republican before being elected the Governor of Ohio. In 1876, he won the Republican party presidential nomination but believed he had lost the Election to Democrat Samuel J. Tilden.\nHayes was elected President by one electoral vote after the highly disputed election of 1876. Losing the popular vote to his opponent, Samuel Tilden, Hayes was the only president whose election was decided by a congressional commission. During his otherwise uneventful presidency, he ordered federal troops to suppress The Great Railroad Strike of 1877 and he kept his promise to southerners by extracting troops from the South, effectively ending the era of Reconstruction. He reformed the civil service by alienating political spoils seekers and advocated the repeal of the Tenure of Office Act . He chose not to run for a second term.","after_context":"Rutherford B. Hayes (1822 - 1893 was the 19th President of the United States. He served only one term, from 1877 to 1881. Hayes was a Republican and was elected governor of Ohio three times prior to becoming president. Hayes narrowly won the contested election of 1876, only defeating Democratic opponent Samuel Tilden after a Congressional committee awarded Hayes some disputed electoral votes.","before_sentence":"Rutherford Birchard Hayes(October 4, 1822- January 17, 1893) was the 19th President of the United States from March 4 1877 to March 4 1881 and was twice the Governor of Ohio 1868-1872 and 1876-1877.","after_sentence":"Hayes(1822 - 1893 was the 19th President of the United States.","before":"","after":".","before_diff_span_range":[18,18],"after_diff_span_range":[14,15],"before_sentence_token_range":[0,39],"after_sentence_token_range":[3,16],"label":"syntactic_sentence_fusion"}
{"before_context":"The history of Latin poetry can be understood as the adaptation of Greek models. The verse comedies of Plautus are considered the earliest surviving examples of Latin literature and are estimated to have been composed around 205-184 BC. The start of Latin literature is conventionally dated to the first performance of a play in verse by a Greek slave, Livius Andronicus, at Rome in 240 BC. Livius translated Greek New Comedy for Roman audiences, using meters that were basically those of Greek drama, modified to the needs of Latin. His successors Plautus and Terence further refined the borrowings from the Greek stage and the prosody of their verse is substantially the same as for classical Latin verse. The traditional meter of Greek epic, the dactylic hexameter, was introduced into Latin literature by Ennius (239-169 BC), virtually a contemporary of Livius, who substituted it for the jerky Saturnian meter in which Livius had been composing epic verses. Ennius moulded a poetic diction and style suited to the imported hexameter, providing a model for 'classical' poets such as Virgil and Ovid. The late republic saw the emergence of Neoteric Poets, notably Catullus—rich young men from the Italian provinces, conscious of metropolitan sophistication, and looking to the scholarly Alexandrian poet Callimachus for inspiration. Catullus shared the Alexandrian's preference for short poems and wrote within a variety of meters borrowed from Greece, including Aeolian forms such as hendecasyllabic verse, the Sapphic stanza and Greater Asclepiad, as well as iambic verses such as the choliamb and the iambic tetrameter catalectic (a dialogue meter borrowed from Old Comedy). Horace, whose career crossed the divide between republic and empire, followed Catullus' lead in employing Greek lyrical forms, identifying with Alcaeus of Mytilene, composing Alcaic stanzas, and also with Archilochus, composing poetic invectives in the Iambus tradition (in which he adopted the metrical form of the Epode or 'Iambic Distich'). Horace was a contemporary of Virgil and, like the epic poet, he wrote verses in dactylic hexameter, but in a conversational and epistolary style. Virgil's hexameters are generally regarded as \"the supreme metrical system of Latin literature.\"","after_context":"Latin poetry is the poetry of Ancient Rome. They started by adapting Greek models. The verse comedies of Plautus are the earliest surviving examples of Latin literature. They were probably composed around 205–184 BC. There was a play written by a Greek slave, Livius Andronicus, at Rome in 240 BC. Livius translated Greek comedy for Roman audiences. He used metres that were those of Greek drama, but modified to the needs of Latin. His successors, Plautus and Terence, continued this process. The traditional metre of Greek epic poetry, the dactylic hexameter, was introduced into Latin literature by Ennius (239–169 BC). Ennius provided a model for the later 'classical' poets such as Virgil and Ovid. Horace (who was a contemporary of Virgil) wrote verses in dactylic hexameter. They were in a conversational style, as if writing a letter. Virgil's hexameters are regarded as \"the supreme metrical system of Latin literature\".","before_sentence":"Catullus shared the Alexandrian's preference for short poems and wrote within a variety of meters borrowed from Greece, including Aeolian forms such as hendecasyllabic verse, the Sapphic stanza and Greater Asclepiad, as well as iambic verses such as the choliamb and the iambic tetrameter catalectic(a dialogue meter borrowed from Old Comedy). Horace, whose career crossed the divide between republic and empire, followed Catullus' lead in employing Greek lyrical forms, identifying with Alcaeus of Mytilene, composing Alcaic stanzas, and also with Archilochus, composing poetic invectives in the Iambus tradition(in which he adopted the metrical form of the Epode or'Iambic Distich').","after_sentence":"Horace(who was a contemporary of Virgil) wrote verses in dactylic hexameter.","before":", whose career crossed the divide between republic and empire, followed Catullus' lead in employing Greek lyrical forms, identifying with Alcaeus of Mytilene, composing Alcaic stanzas, and also with Archilochus, composing poetic invectives in the Iambus tradition(in which he adopted the metrical form of the Epode or'Iambic Distich').  Horace","after":"(who","before_diff_span_range":[279,329],"after_diff_span_range":[136,137],"before_sentence_token_range":[232,350],"after_sentence_token_range":[133,147],"label":"syntactic_sentence_fusion"}
{"before_context":"Gliese 422 b is an exoplanet orbiting the red dwarf Gliese 422 (Innes' star). Gliese 422 b was discovered in 2014, and discovery was confirmed in 2020. It has a minimum mass of about ten times that of Earth.\nIt is located on the inner edge of circumstellar habitable zone (HZ) of Gliese 422, which extends from 0.11 to 0.21 astronomical units. Gliese 422 b's semi-major axis is 0.119 astronomical units and its orbital period is 26.161 Earth days.","after_context":"Gliese 422 b is an Extrasolar planet orbiting Red dwarf, the planet was discovered in 2014, and the discovery was confirmed in 2020.","before_sentence":"Gliese 422 b is an exoplanet orbiting the red dwarf Gliese 422(Innes' star).","after_sentence":"Gliese 422 b is an Extrasolar planet orbiting Red dwarf, the planet was discovered in 2014, and the discovery was confirmed in 2020.","before":"","after":"planet","before_diff_span_range":[8,8],"after_diff_span_range":[11,12],"before_sentence_token_range":[0,17],"after_sentence_token_range":[0,26],"label":"syntactic_sentence_fusion"}
{"before_context":"Dalarö is a locality situated in Haninge Municipality, Stockholm County, Sweden with 1,199 inhabitants in 2010.\nIt is situated south-east of Stockholm and is part of Metropolitan Stockholm and serves as a recreational summer spot for Stockholmers. At the beginning of the year 2004, the automobile company Volvo used the town for the unconventional The Mystery of Dalarö advertising campaign.\nDalarö is Haninge Municipality's oldest locality, originally an old pilot- and customscommunity. Today Dalarö is largely characterized by the development which were added in the late 1800s, when society developed into a popular summer resort for Stockholmers. Dalarö has long been home to Swedish high society's seaside houses. Since the 19th century, the town of Dalarö has been a fashionable holiday resort for the international upper class. Dalarö is also a desirable family resort for the wealthy. The historical valuable buildings are of national interest. Dalarö society as well as the surrounding built-up area has a diverse year-round and summer cottages. During the summer months Dalarö frequented by a large number of tourists.","after_context":"Dalarö is a locality in Haninge Municipality in Stockholm County in Sweden. In 2010, 1,199 people lied there. It is situated southeast of Stockholm and is part of Metropolitan Stockholm. It serves as a recreational summer resort for people from Stockholm.","before_sentence":"It is situated south-east of Stockholm and is part of Metropolitan Stockholm and serves as a recreational summer spot for Stockholmers.","after_sentence":"It is situated southeast of Stockholm and is part of Metropolitan Stockholm. It serves as a recreational summer resort for people from Stockholm.","before":"and","after":".  It","before_diff_span_range":[32,33],"after_diff_span_range":[34,37],"before_sentence_token_range":[20,42],"after_sentence_token_range":[22,47],"label":"syntactic_sentence_splitting"}
{"before_context":"In physical geography, a steppe (Russian: степь - [sʲtʲepʲ], Ukrainian: степ - \/stʲɛp\/, Kazakh: дала - \/dɑlɑ\/), pronounced in English as \/stɛp\/, is a plain without trees (apart from those near rivers and lakes); it is similar to a prairie, although a prairie is generally considered as being dominated by tall grasses, while short grasses are said to be the norm in the steppe. It may be semi-desert, or covered with grass or shrubs or both, depending on the season and latitude. The term is also used to denote the climate encountered in regions too dry to support a forest, but not dry enough to be a desert.\nThe climate of mid-latitude steppes can be summarized by hot summers and cold winters, averaging 250-500 mm (10-20 inches) of rain or equivalent in snowfall per year. In tropical locations, necessary rainfall to separate steppes from true deserts may be half as much again due to greater evapotranspiration. ==Biology==(i hate biology I FAILED IT)\nPlant life is usually greater than one foot tall, including the blue grama and buffalo grass, cacti, sagebrush, spear grass, and other small relatives of the sunflower. Animal life includes the Corsac Fox, Mongolian Gerbil, Saiga Antelope, Eurasian Lynx, and the Saker Falcon.\n==Locations==(PUEDO IR AL BANO)\nThe world's largest zone of steppes, often referred to as \"the Great Steppe\", is found in central Russia and neighbouring countries in Central Asia. The Pontic steppe stretches from Ukraine in the west to the Ural Mountains and the Caspian Sea. To the east of the Caspian Sea, the steppes extend through Turkmenistan, Uzbekistan and Kazakhstan to the Altai, Koppet Dag and Tian Shan ranges. The vast Eurasian Steppe, as it is called, incorporates all of these steppes. The area is bordered in the north, on the eastern side of the Urals, by the forested West Siberian Plain taiga, extending nearly as far as the Arctic Ocean. Other regions of steppes include transition zones between savanna and severe desert such as the Sahel that fringes the true Sahara or similar semi-arid lands that fringe the Thar desert of the Indian subcontinent or the more severe deserts of Australia. Another large steppe area is located in the central United States and western Canada. The High Plains steppe is the westernmost part of the Great Plains region. A significant steppe, noteworthy for not grading into desert, is the Sertão of northeastern Brazil.\nSome steppes are to be found in transition zones between zones of Mediterranean climate and desert, such as Tijuana, Baja California, and in places cut off from adequate moisture due to rain shadow effects such as Zaragoza, Spain.","after_context":"In physical geography, a steppe is a plain without trees (apart from those near rivers and lakes). It is similar to a short-grass prairie, although a prairie is generally considered as North America, and the steppe is in eastern Europe and central Asia. Sometimes the short-grass prairie in North America is also called a steppe. Similar places in Africa are called savanna. The world's largest steppe, sometimes called The Great Steppe, is in Russia. ","before_sentence":"In physical geography, a steppe(Russian: степь - [sʲtʲepʲ], Ukrainian: степ - \/stʲɛp\/, Kazakh: дала - \/dɑlɑ\/), pronounced in English as \/stɛp\/, is a plain without trees(apart from those near rivers and lakes); it is similar to a prairie, although a prairie is generally considered as being dominated by tall grasses, while short grasses are said to be the norm in the steppe.","after_sentence":"In physical geography, a steppe is a plain without trees(apart from those near rivers and lakes). It is similar to a short-grass prairie, although a prairie is generally considered as North America, and the steppe is in eastern Europe and central Asia.","before":"; it","after":".  It","before_diff_span_range":[36,38],"after_diff_span_range":[19,22],"before_sentence_token_range":[0,78],"after_sentence_token_range":[0,49],"label":"syntactic_sentence_splitting"}
{"before_context":"Sergio Augusto Magaña Martínez (2 December 1949 – 25 December 2017) was a Mexican politician affiliated with the Party of the Democratic Revolution (formerly to the Institutional Revolutionary Party). From 2014 to 2017 he served as Deputy of the LIX Legislature of the Mexican Congress as a plurinominal representative and as Senator of the LVI and LVII Legislatures.\nHe also was Mayor of Morelia from 1993 to 1994.\nHe died on 25 December 2017 at the age of 68.","after_context":"Sergio Augusto Magaña Martínez (2 December 1949 – 25 December 2017) was a Mexican politician. He was a member with the Party of the Democratic Revolution (formerly to the Institutional Revolutionary Party). From 2014 to 2017 he served as Deputy of the LIX Legislature of the Mexican Congress as a plurinominal representative and as Senator of the LVI and LVII Legislatures.\nHe also was mayor of Morelia from 1993 to 1994.\nMagaña died on 25 December 2017 at the age of 68.","before_sentence":"Sergio Augusto Magaña Martínez(2 December 1949 - 25 December 2017) was a Mexican politician affiliated with the Party of the Democratic Revolution(formerly to the Institutional Revolutionary Party).","after_sentence":"Sergio Augusto Magaña Martínez(2 December 1949 - 25 December 2017) was a Mexican politician. He was a member with the Party of the Democratic Revolution(formerly to the Institutional Revolutionary Party).","before":"","after":".  He was a member","before_diff_span_range":[16,16],"after_diff_span_range":[16,22],"before_sentence_token_range":[0,32],"after_sentence_token_range":[0,36],"label":"syntactic_sentence_splitting"}
