{"before_content":"Libramont-Chevigny is a Walloon municipality of Belgium in Luxembourg Province. On 1 January 2007 the municipality, which covers 177.86 km², had 9,981 inhabitants, giving a population density of 56.1 inhabitants per km².","after_content":"Libramont-Chevigny is a municipality located in the Belgian province of Luxembourg.\nIn 2007 its population was 9981.\nIt is located at 49° 55 North, 05° 22 East.","before":"On 1 January","after":"","before_token_range":[11,14],"after_token_range":[13,13]}
{"before_content":"MacKinlay Kantor (February 4, 1904 – October 11, 1977), born Benjamin McKinlay Kantor, was an American journalist, novelist and screenwriter. He wrote more than 30 novels, several based on the American Civil War, and won the Pulitzer Prize for Fiction in 1956 for his 1955 novel Andersonville, about the Confederate prisoner of war camp. (The novel is often erroneously believed to have been the basis for the stage play and TV movie The Andersonville Trial (1970), as well as for the TV mini-series Andersonville (1995), but neither of those films have any connection to Kantor's work.)","after_content":"Benjamin McKinlay Kantor (or MacKinlay Kantor; February 4, 1904 – October 11, 1977) was an American journalist and novelist who received a Pulitzer Prize for Fiction in 1956. He wrote out over 30 novels, several set in the American Civil War. Kantor was born in Webster City, Iowa; he died from a heart attack at seventy-three in Sarasota, Florida.","before":"for his 1955 novel Andersonville","after":"","before_token_range":[48,53],"after_token_range":[39,39]}
{"before_content":"Daniel Hamhuis (born December 13, 1982) is a Canadian professional ice hockey defenceman who currently plays with and is an alternate captain for the Vancouver Canucks of the National Hockey League.\nHamhuis played major junior hockey with the Prince George Cougars of the Western Hockey League (WHL) and was selected 12th overall by the Nashville Predators in the 2001 NHL Entry Draft. The following year, he was awarded the Bill Hunter Memorial Trophy and Four Broncos Memorial Trophy as the league's best defenceman and player of the year, respectively; he would also be named the top defenceman in the Canadian Hockey League (CHL), the governing body of major junior hockey in Canada. After a final season in the WHL, Hamhuis made his professional debut with the Milwaukee Admirals of the American Hockey League (AHL), a minor league affiliate of the Predators. He made his NHL debut the next year for Nashville. After five seasons with the club, Hamhuis became an unrestricted free agent and signed a six-year contract with the Canucks. In his first year with the club, he helped Vancouver to the 2011 Stanley Cup Finals, where they lost to the Boston Bruins.\nHamhuis has played in several international tournaments at both the junior and senior levels for Canada. At the 2001 and 2002 World Junior Championships, he won a bronze and silver medal, respectively. He also appeared in four straight World Championships, winning a gold at the 2007 tournament and silver at both the 2008 and 2009 tournaments. On January 7th, 2014, he was named to the 2014 Canadian Olympic Hockey Team, winning a gold medal at the 2014 Winter Olympics.","after_content":"Daniel Hamhuis (born December 13, 1982 in Smithers, British Columbia, Canada) is a professional Canadian ice hockey defencemen that currently plays for the Vancouver Canucks of the National Hockey League (NHL).\nHamhuis formerly played for the Nashville Predators for 6 seasons.\nHamhuis played in the WHL for the Prince George Cougars for 4 seasons and played for the Milwaukee Admirals in the AHL.","before":"Canadianprofessional","after":"professionalCanadian","before_token_range":[10,12],"after_token_range":[15,17]}
{"before_content":"Charlie Christian (July 29, 1916 - March 2, 1942) was a famous jazz guitarist. He played with the Benny Goodman sextet starting in 1939 and is often considered the first electric guitar innovator. Goodman was initially reluctant to hire Christian, due in part to the novelty of the electric guitar, but was so impressed by Christian's playing he changed his mind.\nChristian was influenced by early acoustic guitarists like jazzman Eddie Lang and bluesman Lonnie Johnson, who had introduced the guitar solo from what had been a rhythm instrument. Christian introduced the electric guitar solo, using an amplified guitar, which with its superior sustain and volume was almost like a different instrument. Christian paved the way for the modern dominant guitar sound that was followed by other pioneers, including T-Bone Walker, B.B. King, all the way to Jimi Hendrix, all electric guitar players really. For this reason Christian was inducted into the Rock and Roll Hall of Fame as an \"Early Contributor\". The other dominant guitar player in the 1940s was Django Reinhardt, who played acoustic guitar before the war and only took up the electric guitar long after Christiab's death. Though known mainly for his influence on electric guitar, Christian was also an important player in the development of bebop, or \"modern jazz\", and his jam sessions at Minton's Playhouse in New York City were landmarks in the evolution of bop from the then-popular, radio-friendly, accessible swing music to the more intimate and experimental bebop. This transition is readily apparent to even a casual observer in two sets of Christian recording with the sextet made on the same day. Christian and tbe rest of the sextet recorded \"Blues in B\" and \"Waiting for Benny\", which were basically bop jam sessions. The free flow of these sessions contrasts with the more formal swing music recorded after Goodman arrived. Christian contracted tuberculosis and pneumonia and died at just 25 years old. He remains a highly respected early guitar player and modern jazz innovator.","after_content":"Charlie Christian (1916-1942) was a Jazz guitarist. He is important, because he is one of the first to use an electric guitar.","before":"(July 29, 1916 - March 2, 1942","after":"(1916-1942","before_token_range":[2,9],"after_token_range":[2,3]}
{"before_content":"Eudora is a city in Douglas County, Kansas, United States. The city is located along the Kansas and Wakarusa Rivers. As of the 2010 census, the city population was 6,136.","after_content":"Eudora is a city in Douglas County, Kansas, United States. The city is along the Kansas River and the Wakarusa River. In 2010, 6,136 people lived there.","before":"located","after":"","before_token_range":[16,17],"after_token_range":[16,16]}
{"before_content":"Maresquel-Ecquemicourt is a commune in the Pas-de-Calais département in the Nord-Pas-de-Calais region of France.","after_content":"Maresquel-Ecquemicourt is a commune. It is found in the region Nord-Pas-de-Calais in the Pas-de-Calais department in the north of France.","before":"département","after":"department","before_token_range":[7,8],"after_token_range":[16,17]}
{"before_content":"Coordinates: 51°23′1″N 0°31′32″E﻿ \/ ﻿51.38361°N 0.52556°E﻿ \/ 51.38361; 0.52556\nThe Pentagon Shopping Centre (known locally as 'The Pentagon') is a shopping centre in Chatham in Kent. The shopping centre is located next to the Waterfront bus station which replaces the Pentagon bus station, which 80% of services use. The shopping centre contains over 70 shops, many high street names in fashion, homeware and food stores. There are also cafes, restaurants and a bowling alley. As is common with some other 1970's era town centre shopping centres, The Penatagon does not feature a food court or any dedicated dining area. Instead, there are various food outlets scattered throughout the centre. Built as part of the redevelopment of Chatham town centre in the 1970s, the Pentagon also features the high rise Mountbatten House office block, which has controversially stood empty or part-used for most of its history. The Pentagon, Mountbatten House and the multi-storey carparks are built in distinctive orange-red brick with grey concrete.","after_content":"The Pentagon Shopping Centre (known locally as 'The Pentagon') is a shopping centre in Chatham, Kent. The shopping centre is next to the Waterfront bus station which replaced the Pentagon bus station.","before":"replaces","after":"replaced","before_token_range":[45,46],"after_token_range":[31,32]}
{"before_content":"João Clemente Baena Soares (born 14 May 1931) is a Brazilian diplomat. Soares was born in Belém. He worked at the Brazilian Ministry of External Relations for 31 years before being elected to serve as Secretary General of the Organization of American States from 1984 to 1994.\nBetween 1997 and 2006, he was a member of the United Nations International Law Commission. On 4 November 2003 UN Secretary-General Kofi Annan appointed him to sit on the High Level Threat Panel. On September 1, 2006, he was appointed to the United Nations Human Rights Council's High-Level Commission of Inquiry charged with probing allegations that Israel systematically targeted and killed Lebanese civilians during the 2006 Lebanon War.","after_content":"João Clemente Baena Soares (born 14 May 1931) is a Brazilian diplomat. He was born in Belém. He worked at the Brazilian Ministry of External Relations for 31 years before being elected to serve as Secretary General of the Organization of American States from 1984 to 1994. He was replaced in 1994 with President César Gaviria.","before":"On 4 November 2003 UN Secretary-General Kofi Annan appointed him to sit on the High Level Threat Panel. On September 1, 2006, he was appointed to the United Nations Human Rights Council's High-Level Commission of Inquiry charged with probing allegations that Israel systematically targeted and killed Lebanese civilians during the 2006 Lebanon War.","after":"","before_token_range":[67,121],"after_token_range":[61,61]}
{"before_content":"\"Have Yourself a Merry Little Christmas\" is a song introduced by Judy Garland in the 1944 MGM musical Meet Me in St. Louis. Frank Sinatra later recorded a version with modified lyrics, which has become more common than the original. The song was credited to Hugh Martin and Ralph Blane, although during a December 21, 2006 NPR interview, Martin said that Blane had encouraged him to write the song but had not had anything more to do with writing it. In 2007, ASCAP ranked \"Have Yourself a Merry Little Christmas\" the third most performed Christmas song written by ASCAP members of the past five years.","after_content":"Have Yourself a Merry Little Christmas is an extremely popular Christmas song that is played every holiday season. The song was first introduced by Judy Garland. A modified version was introduced via Frank Sinatra, and the modified version is more popular than the original version.","before":"\"Have Yourself a Merry Little Christmas\"","after":"Have Yourself a Merry Little Christmas","before_token_range":[0,8],"after_token_range":[0,6]}
{"before_content":"Peter Bogdanovich ComSE (Serbian: Петар Богдановић, romanized: Petar Bogdanović; July 30, 1939 – January 6, 2022) was an American director, writer, actor, producer, critic, and film historian.\nOne of the \"New Hollywood\" directors, Bogdanovich started as a film journalist until he got hired to work on Roger Corman's The Wild Angels (1966). After that film's success, he directed his own film Targets (1968), a critical success. He gained widespread recognition for his acclaimed coming-of-age film The Last Picture Show (1971). The film received eight Academy Award nominations, including for the Best Picture, with Bogdanovich receiving nominations for Best Director and Best Adapted Screenplay.\nFollowing The Last Picture Show, he directed the screwball comedy What's Up, Doc? (1972), a major box office success, and another critical and commercial success, Paper Moon (1973), which earned him a Golden Globe Award for Best Director nomination. His following three films were all critical and commercial failures, including Daisy Miller (1974). He took a three-year hiatus before making a comeback with cult films Saint Jack (1979) and They All Laughed (1981). After his girlfriend Dorothy Stratten's murder, he took another four-year hiatus from filmmaking and wrote a memoir on her death titled The Killing of the Unicorn before making a comeback with Mask (1985), a critical and commercial success. He later went on to direct films such as Noises Off (1992), The Thing Called Love (1993), The Cat's Meow (2001), and She's Funny That Way (2014). As an actor, he is known for his roles in HBO series The Sopranos and Orson Welles's last movie The Other Side of the Wind (2018), which he also helped to finish. He received a Grammy Award for Best Music Film for directing the Tom Petty documentary Runnin' Down a Dream (2007).\nAn accomplished film historian, he directed documentaries such as Directed by John Ford (1971) and The Great Buster: A Celebration (2018), and published over ten books, some of which include in-depth interviews with friends Howard Hawks and Alfred Hitchcock. Bogdanovich's works have been cited as important influences by many major filmmakers.","after_content":"Peter Bogdanovich (born July 30, 1939) is an American movie director, writer, movie producer, screenwriter, critic, actor, and historian. He is known for his movies The Last Picture Show, Paper Moon, Mask, They All Laughed, What's Up, Doc?, and Texasville.\nHe was born in Kingsville, New York.","before":"actor,producer, critic,","after":",screenwriter, critic,actor,","before_token_range":[23,29],"after_token_range":[18,24]}
{"before_content":"The mathematical constant e is the base of the natural logarithm. It is occasionally called Euler's number after the Swiss mathematician Leonhard Euler, or Napier's constant in honor of the Scottish mathematician John Napier who introduced logarithms. (e is not to be confused with γ – the Euler-Mascheroni constant – which is itself sometimes called Euler's constant.) e is one of the most important numbers in mathematics, alongside the additive and multiplicative identities 0 and 1, the imaginary unit i, and π, the circumference to diameter ratio for any circle. It has a number of equivalent definitions; some of them are given below. To the 20th decimal place:\nRegrouping the digits after the decimals thus gives a form of e that is easy to remember:\n2.7 1828 1828 45 90 45\nNote also that 45 is half of 90.","after_content":"e is a mathematical constant forming the basis of the natural logarithm and it is one of the most important numbers in mathematics. e is an irrational number, like π. To the 20th decimal place:\ne ≈ 2.71828182845904523536","before":".","after":"and it","before_token_range":[11,12],"after_token_range":[12,14]}
{"before_content":"Altnau is a municipality in the district of Kreuzlingen, in the canton of Thurgau, Switzerland.","after_content":"Altnau is a municipality of the district of Kreuzlingen in the canton of Thurgau in Switzerland.","before":",","after":"","before_token_range":[9,10],"after_token_range":[9,9]}
{"before_content":"\/\/Anonymous Activity Fox Business (officially known as Fox Business Network) is an American business news channel owned by the Fox News Media division of Fox Corporation. The channel broadcasts primarily from studios at 1211 Avenue of the Americas in Midtown ManhattanLaunched on October 15, 2007, the network features trading day coverage and a nightly lineup of opinion-based talk shows.\nDay-to-day operations are run by Kevin Magee, executive vice president of Fox News; Neil Cavuto is the vice president and managing editor for the network and business news operation overall.\nAs of February 2015, Fox Business Network is available to approximately 74,224,000 pay television households (63.8% of households with television) in the United States.","after_content":"Fox Business (officially known as Fox Business Network) is an American business news channel owned by the Fox News Media division of Fox Corporation. The channel broadcasts primarily from studios at 1211 Avenue of the Americas in Midtown Manhattan. Launched on October 15, 2007, the network features trading day coverage and a nightly lineup of opinion-based talk shows.\nDay-to-day operations are run by Kevin Magee, executive vice president of Fox News; Neil Cavuto is the vice president and managing editor for the network and business news operation overall.[source?]\nAs of February 2015, Fox Business Network is available to approximately 74,224,000 pay television households (63.8% of households with television) in the United States.","before":".","after":".[source?]","before_token_range":[96,97],"after_token_range":[96,98]}
{"before_content":"My Favorite Year is a 1982 American comedy film written by Dennis Palumbo and Norman Steinberg, and directed by Richard Benjamin, which tells the story of a young comedy writer. It stars Peter O'Toole, Mark Linn-Baker, Jessica Harper, Joseph Bologna, Lou Jacobi, Bill Macy, Lainie Kazan, Selma Diamond, Cameron Mitchell, and Gloria Stuart. O'Toole was nominated for the Academy Award for Best Actor. The film was adapted into an unsuccessful 1992 Broadway musical of the same name.","after_content":"My Favorite Year is a 1982 American comedy movie. It was directed by Richard Benjamin. It stars Peter O'Toole, Mark Linn-Baker, Jessica Harper, and Joseph Bologna. It was released on October 1, 1982.","before":"Lou Jacobi, Bill Macy, Lainie Kazan, Selma Diamond, Cameron Mitchell, and Gloria Stuart","after":"","before_token_range":[47,60],"after_token_range":[42,42]}
{"before_content":"Debian \/ˈdɛbiən\/ is an operating system composed of free software mostly carrying the GNU General Public License. The operating system is developed by an internet collaboration of volunteers aligned with The Debian Project. Its focus of different kernels makes it appeal to different titles, such as Debian GNU\/Linux and kFreeBSD. Debian names its operating systems with kernel names and the word GNU, since Debian depends on its software development using GNU tools.\nDebian GNU\/Linux is one of the most popular Linux distributions for personal and Internet server machines. Debian is seen as a solid Linux, and as a consequence has been used as a base for other Linux distributions. Debian has been forked many times, but is not affiliated with derivatives. The vitality the Debian project plays in open source is demonstrated in pursuit of advancing development and security patches in relation to its strong participation of CVE compatibility efforts. Information sources related to the many derivatives can be found with internet and wikipedia pages: Debian derivatives.","after_content":"Debian is a free operating system which is the Linux kernel (the core of Linux itself) and application software run on its kernel. Much of the the application and utility software was done by the GNU project, so Debian Linux is more correctly called \"Debian GNU\/Linux\". It is one of the most complete and popular Linux distributions.","before":"and kFreeBSD","after":"","before_token_range":[50,52],"after_token_range":[47,47]}
{"before_content":"Terrance Lee \"Terry\" Labonte (born November 16, 1956) is an American former stock car racing driver, and current racing commentator. A two-time NASCAR Sprint Cup Series (then Winston Cup Series) champion and 1989 IROC champion, he is the older brother of 2000 Winston Cup champion Bobby Labonte, and the father of former Nationwide Series driver Justin Labonte. He also co-owns a Chevrolet dealership in North Carolina with Rick Hendrick. He appeared on the CBS series The Dukes of Hazzard in 1984, where he played an unnamed pit crew member. In 2000, he also appeared in commercials for Denny's restaurants with the Kellogg's Racing team, such as Kellogg's Country Inn Specialties Slam, and Country Inn Specialties Slim Slam.","after_content":"Terry Lee Labonte (born (1956-11-16)November 16, 1956) is a former NASCAR Winston Cup Series retired american racecar driver, Labonte was introduced to racing by his father, who worked on racecars as a hobby, He is a brother of former driver Bobby Labonte, and the father of NASCAR Winston Cup Series driver Justin Labonte, He appeared in the 1983 Burt Reynolds movie, Prism Motorsporter Ace, In 1984, he portrayed a crewman from the movie The Dukes of Hazzard, In 2000, he appeared in a Denny's commercial.","before":"","after":"1983 Burt Reynolds movie, Prism Motorsporter Ace, In 1984, he portrayed a crewman from the movie","before_token_range":[81,81],"after_token_range":[62,78]}
{"before_content":"In humans and animals, fear is modulated by the process of cognition and learning. Thus fear is judged as rational or appropriate and irrational or inappropriate. An irrational fear is called a phobia.\nPsychologists such as John B. Watson, Robert Plutchik, and Paul Ekman have suggested that there is only a small set of basic or innate emotions and that fear is one of them. This hypothesized set includes such emotions as acute stress reaction, anger, angst, anxiety, fright, horror, joy, panic, and sadness. Fear is closely related to, but should be distinguished from, the emotion anxiety, which occurs as the result of threats that are perceived to be uncontrollable or unavoidable. The fear response serves survival by generating appropriate behavioral responses, so it has been preserved throughout evolution.","after_content":"Fear is a feeling or an emotion. A person who fears something does not want it to happen. The fear response comes from sensing danger. It leads to the fight-or-flight response. In extreme cases of fear (horror and terror) there may be a freeze response or paralysis.\nIn humans and animals, fear is adjusted by cognition and learning. Thus fear is rational or appropriate, or it is irrational or inappropriate. An irrational fear is called a phobia.\nFear is the body's way of protecting itself from doing things that may be dangerous. For example, if one has a fear of jumping off a cliff, he\/she will not do it. This saves one from death. In this case, fear is a good thing but in others, it can be bad. An example of fear being bad is if it stops one from doing something important, like going to see a doctor.\nThere is only a small set of basic or innate emotions and fear is one of them. Without fear we would not be so careful and responsible like we are now if we didn't have any fear then people would stop working and they would not have the fear of being poor and they would also not care if they actually doing something that might be the cause of their death so at the end every one has fear it might be the fear of snakes,dogs, heights anything else but fear is some thing that we all have and we all try to overtake The fear response helps survival by triggering appropriate behavioral responses. It has been preserved throughout evolution.","before":"are perceived to be uncontrollable or unavoidable.","after":"","before_token_range":[112,119],"after_token_range":[268,268]}
{"before_content":"A foldable smartphone (also known as a foldable phone or simply foldable) is smartphone with a folding form factor. Devices whose displays fold on a vertical axis are designed to fold out into a wider, tablet-like form, but are still usable in a smaller, folded state; the display may either wrap around to the back of the device when folded (as with the Royole Flexpai and Huawei Mate X), or use a booklet-like design where the larger, folded screen is located on the interior, and a screen on its \"cover\" allows the user to interact with the device without opening it (such as the Samsung Galaxy Fold). Horizontally-folding smartphones have also been produced, typically using a clamshell form factor.\nPrecursors to the concept have used multiple touchscreen panels on a hinge in a similar manner, but the term is currently synonymous with implementations that utilize a flexible display; concepts of such devices date back as early as Nokia's \"Morph\" concept (2008), and a concept presented by Samsung Electronics in 2013 (as part of a larger set of concepts utilizing flexible OLED displays), while the first commercially available folding smartphones with OLED displays began to emerge in November 2018.\nThe first generation of commercially-released foldable smartphones have been faced with concerns over their durability, as well as their high prices.","after_content":"A foldable phone (also known as a foldable smartphone) is a smartphone with a folding form factor. Some variants of the concept use multiple touchscreen panels on a hinge, while other designs utilise a flexible display. Concepts of such devices date back as early as Nokia's \"Morph\" concept in 2008, and a concept presented by Samsung in 2013 (as part of a larger set of concepts utilizing flexible OLED displays), while the first commercially available folding smartphones with OLED displays began to emerge in November 2018.","before":"","after":"while other designs utilise","before_token_range":[138,138],"after_token_range":[32,36]}
{"before_content":"\"Some Enchanted Evening\" is the thirteenth and final aired and first producedepisode of The Simpsons' first season and originally aired on the Fox network on May 13, 1990. Although it was the first episode produced, it aired as the season finale due to significant animation problems. The episode features Bart, Lisa, and Maggie's encounter with the notorious Babysitter Bandit. After resolving a marital dilemma, Homer and Marge want to spend a night on the town so they need a babysitter to look after their children. They hire Ms. Botz through a babysitting service. Ms. Botz is later revealed to be the \"Babysitter Bandit\" and after restraining the eldest children, she robs the family.\nThe episode features cultural references to such films as The Night of the Hunter and Psycho as well as a musical reference to A Star Is Born. It received mixed reception: some critics deemed it the best episode of the season while others regarded it as the season's poorest.","after_content":"\"Some Enchanted Evening\" is the thirteenth and final episode of The Simpsons first season and first started on the Fox network on May 13, 1990. Although it was the first episode made, it started on television as the season finale because of many animation problems. In the episode, Bart, Lisa, and Maggie meet the notorious \"Babysitter Bandit\". After answering a marital dilemma, Homer and Marge want to spend a night on the town so they need a babysitter to look after their children. They hire Ms. Botz through a babysitting service. Ms. Botz is later known to be the \"Babysitter Bandit\" and after tying up Bart and Lisa, she robs the family.\nThe episode has references to such films as \"The Night of the Hunter\" and \"Psycho\" as well as a musical reference to \"A Star Is Born.\" It got some good and bad reviews; some people thought it the best episode of the season, while others thought it the season's worst.","before":"","after":",","before_token_range":[56,56],"after_token_range":[55,56]}
{"before_content":"The Honda CR-V is a compact SUV, manufactured since 1995 by Honda. It was loosely derived from the Honda Civic. There are discrepancies as to what \"CR-V\" stands for. Mike Danko states that it stands for \"Comfortable Runabout Vehicle\", although sales literature in the UK has reportedly made references to \"Compact Recreational Vehicle\". It actually stands for Civic Recreational Vehicle. Honda began producing the CR-V in Sayama, Japan, and Swindon, UK, for worldwide markets, adding North American manufacturing sites in East Liberty, Ohio, in 2007; El Salto, Jalisco, Mexico, in late 2007; and Alliston, Ontario, Canada, in 2012. The CR-V also is produced in Wuhan (Hubei province) for the Chinese market by the Dongfeng Honda Automobile Company, a joint venture with Dongfeng Motor Corporation.\nThe CR-V is Honda's second smallest utility vehicle, slotting between the smaller HR-V and the larger Pilot.","after_content":"The Honda CR-V is a compact SUV, manufactured since 1995 by Honda. It was loosely based on the Honda Civic. It debuted in Japan in 1996. In 1997 the the five-passenger compact utility vehicle was introduced in North America. At first it was available only as a four-wheel drive model. It was powered by a 126-horsepower 2.0-liter four-cylinder engine. Honda first began producing the CR-V in Sayama, Japan, and Swindon, UK, for worldwide markets. It added North American manufacturing sites in East Liberty, Ohio, in 2007; El Salto, Jalisco, Mexico, in late 2007; and Alliston, Ontario, Canada, in 2012. The CR-V also is produced in Wuhan (Hubei province) for the Chinese market by the Dongfeng Honda Automobile Company. They are a joint venture with Dongfeng Motor Corporation. The CR-V is Honda's second smallest utility vehicle, slotting between the smaller HR-V and the larger Pilot. In 2015 the CR-V was named Motor Trend SUV of the year.","before":", adding","after":" It added","before_token_range":[84,86],"after_token_range":[87,90]}
{"before_content":"A shingle beach is a beach which is armoured with pebbles or small- to medium-sized cobbles. Typically, the stone composition may grade from characteristic sizes ranging from two to 200 mm diameter. The name derives from the beach's resemblance to the surface of a composition roof shingle. While this beach landform is most commonly associated with Western Europe, examples are found in Bahrain, the United States and in a number of other world regions, such as the east coast of New Zealand's South Island, where they are associated with the shingle fans of braided rivers.\nThe ecosystems formed by this unique association of rock and sand allow colonization by a variety of rare and endangered species.","after_content":"A shingle beach is a beach which is formed of pebbles. These beaches strongly resist erosion by waves.\nThis beach landform is quite common in Western Europe, because the pebbles come from the lines of flint in the chalk. When the chalk erodes, the tough flint stays as pebbles.\nOther examples are found in Bahrain, North America and in a number of other world regions. On the east coast of New Zealand's South Island, there are mixed shingle and sand fans amongst braided rivers. The ecosystems formed by this mix of pebbles and sand allow colonization by rare and endangered species.","before":"","after":"and sand","before_token_range":[99,99],"after_token_range":[88,90]}
{"before_content":"Fela Kuti (born Olufela Olusegun Oludotun Ransome-Kuti; 15 October 1938 – 2 August 1997), also known as Fela Anikulapo Kuti or simply Fela, was a Nigerian multi-instrumentalist, musician, composer, pioneer of the Afrobeat music genre, human rights activist, and political maverick.","after_content":"Fela Anikulapo Kuti (15 October 1938 – 2 August 1997), or just Fela, was a Nigerian musician and composer who was very important in a genre called afrobeat. He played the saxophone, guitar, drums, keyboards and trumpet, and he sang. He was also a human rights activist. The American singer James Brown said that Kuti was one of the originators (starters) of the funk genre.\nKuti died in 1997 of Kaposi's sarcoma, an illness caused by AIDS. In 2008 a musical production called Fela! was created, about Kuti's life and career.","before":"musician,composer,","after":"guitar,drums,keyboards and trumpet","before_token_range":[31,35],"after_token_range":[37,44]}
{"before_content":"St Pancras railway station, also known as London St Pancras and since 2007 as St Pancras International is a central London railway terminus celebrated for its Victorian architecture. The Grade I listed building stands on Euston Road in St Pancras, London, between the British Library, King's Cross station and the Regent's Canal. It was opened in 1868 by the Midland Railway as the southern terminus of that company's Midland Main Line, which connected London with the East Midlands and Yorkshire. When it opened, the arched Barlow train shed was the largest single-span roof in the world.\nAfter escaping planned demolition in the 1960s, the complex was renovated and expanded during the 2000s at a cost of £800 million with a ceremony attended by the Queen and extensive publicity introducing it as a public space. A security-sealed terminal area was constructed for Eurostar services to Continental Europe—via High Speed 1 and the Channel Tunnel—along with platforms for domestic connections to the Midlands, north and south-east England. The restored station houses fifteen platforms, a shopping centre and a bus station, in addition to London Underground services from King's Cross St Pancras tube station. St Pancras is owned by London and Continental Railways along with the adjacent urban regeneration area known as King's Cross Central.","after_content":"St Pancras station, also known since 2007 as St Pancras International, is a central London railway terminus celebrated for its Victorian architecture. The Grade I listed building stands on Euston Road between the British Library, King's Cross station and the Regent's Canal. It was opened in 1868 by the Midland Railway as the southern terminus of the company, which became the LMS: the London, Midland and Scottish railway. When the station opened, the arched train shed was the largest single-span roof in the world.\nAfter escaping planned demolition in the 1960s, the complex was renovated and expanded during the 2000s at a cost of £800 million. A secure terminal area was constructed for Eurostar services to Continental Europe—via High Speed 1 and the Channel Tunnel—along with platforms for domestic connections to the north and south-east of England. The restored station houses fifteen platforms, a shopping centre and a bus station, in addition to London Underground services from King's Cross St. Pancras tube station. St Pancras is owned by London and Continental Railways along with the adjacent urban regeneration area known as King's Cross Central.","before":"","after":"of","before_token_range":[174,174],"after_token_range":[146,147]}
{"before_content":"George Corley Wallace, Jr. (August 25, 1919 – September 13, 1998), was a governor of Alabama for four terms; 1963–1967, 1971–1979 and 1983–1987. \"The most influential loser\" in 20th-century U.S. politics, according to biographers Dan T. Carter and Stephan Lesher, he ran for US president four times, running officially as a Democrat three times and in the American Independent Party once. A 1972 assassination attempt left him wheel-chair bound. He is best known for his Southern populist pro-segregation attitudes during the American desegregation period, convictions he renounced later in life.","after_content":"George Corley Wallace (born August 25, 1919 – died September 13, 1998) was an American politician. He served as Governor of Alabama serving from 1963 to 1967.\nWallace was born in Cilio, Alabama. When Wallace was running for President, he was shot and paralyzed for the rest of his life. His is known for having different views on segregation. He was a Democrat.\nWallace died at the age of 79 from a spinal infection after 26 years of being in a wheelchair.","before":"was agovernorof","after":" Hewas aDemocrat. Wallace died at the ageof79 from a spinal infection after 26 years of being in a wheelchair","before_token_range":[16,20],"after_token_range":[67,92]}
{"before_content":"The Minié ball, or Minni ball, is a type of muzzle-loading spin-stabilized bullet for rifled muskets named after its co-developer, Claude-Étienne Minié, inventor of the French Minié rifle. It came to prominence in the Crimean and American Civil War.\nRifling – the addition of spiral grooves inside a gun barrel, which imparts a spin to a bullet – greatly increases the range and accuracy of a gun. Prior to the Minié ball, balls had to be jammed down the rifle barrel, sometimes with a mallet, and after a relatively small number of shots, gunpowder residue built up in the spiral grooves, which then had to be cleaned out. The development of the Minié ball was significant because it was the first projectile which was small enough to be easily put down the barrel of a rifled long gun. Both the American Springfield Model 1861 and the British Pattern 1853 Enfield rifled muskets – the most common weapons used during the American Civil War – used the Minié ball.","after_content":"The Minié ball, or Minni ball, is a type of muzzle-loading spin-stabilized bullet for rifled muskets named after its developer, Claude-Étienne Minié, inventor of the French Minié rifle. It came to prominence in the Crimean War and American Civil War.\nRifling, the addition of spiral grooves inside a gun barrel, givesa spin to a bullet, greatly increasing the range and accuracy of a gun. Before the Minié ball, balls had to be jammed down the rifle barrel, sometimes with a mallet, and after a relatively small number of shots, gunpowder leftovers built up in the spiral grooves, which then had to be cleaned out. The development of the Minié ball was significant, because it was the first projectile that was small enough to be easily put down the barrel of a rifled long gun. Both the American Springfield Model 1861 and the British Pattern 1853 Enfield rifled muskets, the most common weapons used during the American Civil War, used the Minié ball.\nThe Minié ball did a lot if damage in the American Civil War. It made it really hard for surgeons to treat wounded soldiers because Minié balls shattered bones often.","before":"Prior to","after":"Before","before_token_range":[75,77],"after_token_range":[74,75]}
{"before_content":"Takashi Takabayashi (高林 隆, Takabayashi Takashi, August 2, 1931 – December 27, 2009) was a Japanese football player. He played for Japan national team.","after_content":"Takashi Takabayashi (born 2 August 1931 - died 27 December 2009) is a former Japanese football player. He has played for Japan national team.","before":"(高林 隆, Takabayashi Takashi,","after":"","before_token_range":[2,6],"after_token_range":[4,4]}
{"before_content":"Malacology is the scientific study of molluscs. A malacologist identifies mollusc species, discovers and names new species of molluscs, studies mollusc ecosystems, and learns about the diets, reproductive behavior and intelligence of such animals as snails, clams, octopi, squid and conchs.","after_content":"Malacology is the study of mollusks. These animals include snails, slugs, clams, mussels, octopus, squid, and many other kinds of animals without backbones that are often found in the sea, but sometimes in lakes and rivers, and on land. Most of them have shells, but not all of them. Some people save these shells because they may be very pretty. Many people eat mollusks, especially those people who live near the ocean.\nScientists study mollusks to learn how many kinds there are, where they are found, how they came to be as they are, and what their lives are like, as well as many other things about them. These scientists are called malacologists.","before":"A malacologist identifies mollusc species,discovers and names new species of molluscs, studies mollusc ecosystems, and learns about the diets, reproductive behavior and intelligence of such animals as snails, clams,octopi, squidandconchs.","after":"These animals include snails,slugs, clams,mussels, octopus, squid,andmany other kinds of animals without backbones that are often found in the sea, but sometimes in lakes and rivers, and on land.Most of them have shells, but not all of them. Some people save these shells because they may be very pretty. Many people eat mollusks, especially those people who live near the ocean. Scientists study mollusks to learn how many kinds there are, where they are found, how they came to be as they are, and what their lives are like, as well as many other things about them. These scientists are called malacologists.","before_token_range":[8,47],"after_token_range":[7,124]}
{"before_content":"In the biblical Books of Kings (2 Kings 18:4; written c. 550 BCE), the Nehushtan (Hebrew: נחשתן‎ Nəḥuštān [nə.ħuʃ.taːn]) is the derogatory name given to the bronze serpent on a pole first described in the Book of Numbers which God told Moses to erect so that the Israelites who saw it would be protected from dying from the bites of the \"fiery serpents\", which God had sent to punish them for speaking against Him and Moses (Numbers 21:4–9). In Kings, King Hezekiah institutes an iconoclastic reform that requires the destruction of \"the brazen serpent that Moses had made; for unto those days the children of Israel did burn incense to it; and it was called Nehushtan\". The term means \"a brazen thing, a mere piece of brass\".","after_content":"The Nehushtan (Hebrew: נחשתן Nəḥuštān [nə.ħuʃ.taːn]) is the bronze serpent on a pole first described in the Book of Numbers. God told Moses to make it. This was to cure the Israelites. Those who saw the nehushtan would be cured from the deathly bites of the \"fiery serpents\". God initially sent the fiery serpents to to punish them for speaking against Him and Moses (Numbers 21:4-9 KJV). In the biblical Books of Kings (2 Kings 18:4; written c. 550 BCE), King Hezekiah leads an iconoclastic reform. This requires the destruction of \"the brazen serpent that Moses had made; for unto those days the children of Israel did burn incense to it; and it was called Nehushtan\". The term means \"a brazen thing, a mere piece of brass\".","before":"(Numbers 21","after":"(Numbers 21","before_token_range":[83,85],"after_token_range":[75,76]}
{"before_content":"Hanna-Barbera was an animated cartoon production company that dominated television animation during the second half of the 20th century. Hanna-Barbera was formed in 1944 by MGM animation directors William Hanna and Joseph Barbera and live-action director George Sidney as H-B Enterprises, in order to produce sponsored films and later television commercials.\nAfter MGM shut down its animation studio in 1957, H-B Enterprises became Hanna and Barbera's full-time job, and the company was re-named Hanna-Barbera Productions in 1960. Over the years, Hanna-Barbera produced many successful cartoon shows, including The Huckleberry Hound Show, The Flintstones, Top Cat, The Yogi Bear Show, The Jetsons, Jonny Quest, Space Ghost and Dino Boy, Scooby-Doo, and The Smurfs, many of which would go on to become icons of Western pop culture. In the mid-1980s, the company's fortunes declined somewhat after the profitability of Saturday morning cartoons were eclipsed by weekday afternoon syndication. In 1991, the company was purchased by Turner Broadcasting, primarily so that Ted Turner could use its library of ca 3300 cartoon half-hours as the basis of the programming for its new Cartoon Network cable television channel. But it does not hold rights to the animated series done by Hanna-Barbera. These series were done as spin-offs from live action TV series and the ownership rights of these series remained with owners of the live action series. Re-christened H-B Production Company in 1992, and Hanna-Barbera Cartoons in 1993, the studio continued without active regular input from William Hanna or Joseph Barbera, who both went into semi-retirement yet continued to serve as ceremonial figureheads for the studio.\nDuring the late 1990s, Turner turned Hanna-Barbera towards primarily producing new material for the Cartoon Network. In 1996, Turner was bought out by Time Warner. With Bill Hanna's death in 2001, Hanna-Barbera was absorbed into Warner Bros. Animation, and Cartoon Network Studios assumed production of Cartoon Network output. Joe Barbera remained with Warner Bros. Animation as a ceremonial figurehead until his death in 2006. The Hanna-Barbera name is today only used to market properties and productions associated with Hanna-Barbera's \"classic\" works such as The Flintstones and Scooby-Doo.","after_content":"Hanna-Barbera was a company that made cartoons. They were about Scooby-Doo, Yogi Bear,and a bunch more.\nIt was started by William Hanna and Joseph Barbara.","before":"Hanna-Barbera","after":" It","before_token_range":[20,21],"after_token_range":[17,19]}
{"before_content":"Sergio Augusto Magaña Martínez (2 December 1949 – 25 December 2017) was a Mexican politician affiliated with the Party of the Democratic Revolution (formerly to the Institutional Revolutionary Party). From 2014 to 2017 he served as Deputy of the LIX Legislature of the Mexican Congress as a plurinominal representative and as Senator of the LVI and LVII Legislatures.\nHe also was Mayor of Morelia from 1993 to 1994.\nHe died on 25 December 2017 at the age of 68.","after_content":"Sergio Augusto Magaña Martínez (2 December 1949 – 25 December 2017) was a Mexican politician. He was a member with the Party of the Democratic Revolution (formerly to the Institutional Revolutionary Party). From 2014 to 2017 he served as Deputy of the LIX Legislature of the Mexican Congress as a plurinominal representative and as Senator of the LVI and LVII Legislatures.\nHe also was mayor of Morelia from 1993 to 1994.\nMagaña died on 25 December 2017 at the age of 68.","before":"He","after":"Magaña","before_token_range":[73,74],"after_token_range":[78,79]}
{"before_content":"A duel is a formalized type of combat in which two individuals participate. They usually develop out of a desire for one party (the challenger) to redress a perceived insult to his honor by the other participant in the duel. The goal of the duel is not so much to kill the opponent, as to restore one's own honor by being willing to risk one's life. Duels may be distinguished from trials by combat, in that duel is not used to indicate guilt or innocence, and duels were not official procedures. Indeed, duels were often illegal. Honor can not be damaged by a person of lower class, therefore, duels are fought between members of the same social class, especially members of the upper classes. Duelling is now illegal in all but a few countries around the world.","after_content":"A duel is a fight between two people who have similar deadly weapons and have agreed to a set of rules before the fight takes place. The fight is usually about a matter of honor. The goal of a duel is not usually to kill the opponent but to restore the honor of the man who declared the duel. Duels are not official laws, they are carried out by individuals.\nDuels were practiced from the 15th to 20th century in Western societies.","before":"formalized typeofcombat in which two individuals participate","after":"fight between two people who have similar deadly weapons and have agreed to a setofrules before the fight takes place","before_token_range":[4,13],"after_token_range":[4,26]}
{"before_content":"Daud Kamal 4 January 1935 - 5 December 1987(Urdu: داؤد کمال)) was a Professor of English Literature at University of Peshawar, Pakistan. He was educated at Cambridge University, UK. Kamal started writing poetry in his twenties and became one of the major English language poets of Pakistan. He received three gold medals for his poetry from the Triton College and his poems were recorded for the Library of Congress, Washington DC. USA. ‘Remote Beginnings’ and ‘A Selection of Verse’ (ISBN 0-19-577812-X), are his anthologies. He also did translations of the classic Urdu poet Ghalib in English. Born at Abbottabad into an academic family. His father Mohammad Ali, S. Pk, was the Vice Chancellor of the Peshawar University. He got his early education at Burn Hall School in Srinagar(not to be confused with the branch of the school in Abbottabad, Pakistan); graduated with distinction from the University of Peshawar; obtained his tripos from the University of Cambridge. Starting off as a lecturer after his return from Cambridge, Daud Kamal was appointed Professor and Chairman of the Department of English, University of Peshawar in 1980 and continued to serve in this position till his death on December 5, 1987, leaving behind a wife, two daughters and a son.\nDaud Kamal published his free verse translation 'Ghalib: Reverberations' in 1970 hailed by many as the best rendering of the master in English. His first collection 'Compass of love and other poems' appeared in 1973. This was followed by 'Recognitions' (1979), 'Selections of Faiz in English' (1984) and 'A Remote Beginning' 1985. Kamal's rendering of Faiz was published in another edition from India in 1988.\nKamal's work has been posthumously collected and published in the following titles: 'Rivermist' (1992), 'Before the Carnations Wither' (1995) and 'A Selection of Verse' (1997).","after_content":"Daud Kamal (1935–1987) was a Pakistani poet and academic, from Peshawar city. He was a Professor of English Literature at University of Peshawar. He wrote some poems in English. His poems were recorded for the Library of Congress in the United States. He also did translations of the classic Urdu poet Ghalib in English.","before":")","after":"","before_token_range":[12,13],"after_token_range":[15,15]}
{"before_content":"Seed of Chucky is a 2004 American comedy slasher film, the fifth installment of the Child's Play series, and sequel to 1998's Bride of Chucky as well as the first film to be distributed by an another company since Child's Play. The film was written and directed by Don Mancini, who created the series and has written all of the films. With this entry, Mancini made his directorial debut. The film is set six years after Child's Play 3 and Bride of Chucky and follows a young doll named Glen, the son of Chucky and Tiffany, resurrecting his parents, causing terrible chaos.\nThe film, shot in Romania, continues the series' evolution from the pure horror genre of the first movie to a hybrid horror-comedy. It was the last Child's Play film to be released in theaters, with all future installments to be released direct to DVD. The film was followed by another sequel, Curse of Chucky, released on home video and Netflix in 2013.","after_content":"Seed of Chucky is a 2004 American comedy slasher movie. It is the fifth installment of the Child's Play series, and sequel to 1998's Bride of Chucky. The movie was written and directed by Don Mancini, who created the series .\nThe film, shot in Romania, continues the series' evolution from horror to a horror-comedy. It was the last Child's Play movie to be released in theaters, with all future installments to be released direct to DVD.","before":"hybrid","after":"","before_token_range":[133,134],"after_token_range":[63,63]}
{"before_content":"John Randolph Thune (born January 7, 1961) is the junior United States Senator from South Dakota and a member of the Republican Party. He previously served as a United States Representative for South Dakota's at-large congressional district. He will become South Dakota's Senior senator with the retirement of Tim Johnson.","after_content":"John Randolph Thune (born January 7, 1961) is an American politician. Thune is the junior United States Senator from South Dakota and a member of the Republican Party. He previously served as a United States Representative for South Dakota's at-large congressional district.\nThune was born on January 7, 1961 in Murdo, South Dakota. He is of a Norwegian descent. Thune studied at Biola University and at the University of South Dakota. He has been married to Kimberley Weems since 1984. They have two children.","before":"","after":"Thune was born on January 7, 1961 in Murdo,","before_token_range":[42,42],"after_token_range":[48,57]}
{"before_content":"Daniel Leroy Baldwin (born October 5, 1960) is an American actor, producer and director. He is the second oldest of the four Baldwin brothers, all of whom are actors. Daniel Baldwin is known for his role as Detective Beau Felton in the popular NBC TV series Homicide: Life on the Street. Other films of his include Ned Blessing: The True Story of My Life (1992), Mulholland Falls (1996), Vampires (1998), The Pandora Project (1998), Stealing Candy (2002), Paparazzi (2004), and Grey Gardens (2009).","after_content":"Daniel Leroy Baldwin (born October 5, 1960) is an American movie, television, stage, voice actor, movie producer and movie director who is known for being the brother of Alec Baldwin, Stephen Baldwin, and William Baldwin. He is also known for his roles in Ned Blessing: The True Story of My Life (1992), Mulholland Falls (1996), Vampires (1998), The Pandora Project (1998), Stealing Candy (2002), Paparazzi (2004), and Grey Gardens (2009).\nBaldwin was born on October 5, 1960 in Massapequa, New York. He studied at from Alfred G. Berner High School and at McKenna Junior High School.","before":"the second oldest of the four Baldwin brothers, all of whom are actors. Daniel Baldwin isknown for his","after":"alsoknown for hisroles","before_token_range":[20,40],"after_token_range":[41,46]}
{"before_content":"Orsa is a town (pop. 5,200) in Dalarna, Sweden and the seat of Orsa Municipality, Dalarna County.","after_content":"Orsa is an urban area in the county of Dalarna in Sweden. It is the seat of Orsa Municipality.","before":"","after":"an urban area in the county of Dalarna in Sweden","before_token_range":[2,2],"after_token_range":[2,12]}
{"before_content":"A T-shirt (or tee shirt) is a shirt, usually buttonless, collarless, and pocketless, with a round neck and short sleeves, that is pulled on over the head and covers most of a person's torso. The sleeves of the T-shirt extend at least slightly over the shoulder but not completely over the elbow. A shirt that is either longer or shorter than this ceases to be a T-shirt, at least in the classic sense.\nT-shirts are manufactured by the textile industry. They are typically made of cotton or polyester fibers (or a mix of the two), knitted together in a jersey stitch that gives a T-shirt its distinctive soft texture. T-shirts are often decorated with text and\/or pictures.\nT-shirt fashions include styles for men and women, and for all age groups, including baby, youth and adult sizes.","after_content":"A T-shirt or tee shirt is a kind of shirt which has short sleeves. These sleeves cover the shoulders and the top of the arm, but they do not cover the elbow or the forearm. T-shirts are usually made from cotton fabric or fabric which contains a mix of cotton and polyester. T-shirts are usually considered a casual type of clothing. Both men and women wear T-shirts in Western countries, such as the United States,Canada, England, and France. In some countries, such as Muslim countries, women do not wear t-shirts outside of the home.","before":"polyester fibers(ora mix of","after":"fabric which containsa mix ofcotton and polyester","before_token_range":[95,100],"after_token_range":[46,55]}
{"before_content":"The Enemy is a post-apocalyptic young adult horror novel written by Charlie Higson. The book takes place in London after a worldwide sickness has infected adults turning them into something akin to zombies. It was published by Puffin Books in the UK on 3 September 2009 and by Disney-Hyperion in the U.S. on 11 May 2010. The Enemy is the first in a planned series of six. The second novel, titled 'The Dead', was published on 16 September 2010.\nThe third novel in the series is to be published in 2011.","after_content":"The Enemy is a young adult horror novel. It was written by English author Charlie Higson. The novel takes place in London. It is about the life of children after a worldwide sickness has turned adults into zombies. It was published by Puffin Books in the UK on 3 September, 2009.","before":"infectedadultsturning them","after":"turnedadults","before_token_range":[25,29],"after_token_range":[39,41]}
{"before_content":"Daniel Defoe (\/dɪˈfoʊ\/; 13 September 1660 - 24 April 1731), born Daniel Foe, was an English trader, writer, journalist, pamphleteer and spy. He is most famous for his novel Robinson Crusoe, which is second only to the Bible in its number of translations. Defoe is noted for being one of the earliest proponents of the novel, as he helped to popularise the form in Britain with others such as Aphra Behn and Samuel Richardson, and is among the founders of the English novel.\nDefoe wrote many political tracts and often was in trouble with the authorities, including prison time. Intellectuals and political leaders paid attention to his fresh ideas and sometimes consulted with him.\nDefoe was a prolific and versatile writer, producing more than three hundred works—books, pamphlets, and journals—on diverse topics, including politics, crime, religion, marriage, psychology, and the supernatural. He was also a pioneer of business journalism and economic journalism.","after_content":"Daniel Defoe (Born 13 September 1660 and died 24 April 1731) was an trader, writer, and journalist from England. His best known work is the novel Robinson Crusoe. In some languages, it is sold as number 2 bestseller, after the Bible.","before":"Heismost famous for his","after":"His best known workisthe","before_token_range":[28,34],"after_token_range":[23,29]}
{"before_content":"James Anthony Traficant, Jr. (May 8, 1941 to September 27, 2014) was a Democratic politician and member of the United States House of Representatives from Ohio. He represented the 17th Congressional District, which centered on his hometown of Youngstown and included parts of three counties in northeast Ohio's Mahoning Valley. He was expelled after being convicted of taking bribes, filing false tax returns, racketeering, and forcing his aides to perform chores at his farm in Ohio and houseboat in Washington, D.C.. He was sentenced to prison and released on September 2, 2009, after serving a seven-year sentence.","after_content":"James Anthony Traficant, Jr. (May 8, 1941 – September 27, 2014) was an American politician. He was a member of the United States House of Representatives from Ohio. He represented the 17th Congressional District from 1985 until 2002. He was a member of the Democratic Party from 1981 until 2010, and was independent from 2010 until his death.\nTraficant was arrested and imprisoned. He was convicted of taking bribes, filing false tax returns, racketeering, and forcing his aides to perform chores at his farm in Ohio and Washington, D.C. houseboat. He was released on September 2, 2007, after serving seven years.\nTraficant was born in Youngstown, Ohio. He was raised in a Roman Catholic family. He was of mostly Italian and Slovak ancestry. He was married to Patricia \"Tish\" Choppa Traficant.\nTraficant died after an accident at his home in Youngstown. He was 73.","before":"aDemocratic politician and","after":"an American politician. He wasa","before_token_range":[17,21],"after_token_range":[17,24]}
{"before_content":"Trossingen (Low Alemannic: Drossinge) is a town in Baden-Württemberg, Germany. It is situated in a region called Baar, between the Swabian Alb and the Black Forest. Stuttgart is about an hour away, Lake Constance about half an hour, and the source of the river Danube can be reached in about twenty minutes by car.\nTrossingen is renowned as a \"music town\". Although it has only around 16,000 inhabitants, the town is home to the renowned 'University of Music Trossingen' (with its famous Early Music department), which is one of Baden-Württemberg's five state conservatories, and there are several other institutions specializing in musical education, like the 'Bundesakademie für musikalische Jugendbildung' and the 'Hohner Konservatorium' .\nIn 1830 Christian Messner from Trossingen, a cloth maker and weaver, copied a harmonica brought to Trossingen by his next door neighbor, a clockmaker from Vienna. This was the beginning of musical instrument production in the town. Messner was so successful at making such instruments that eventually his brother and some relatives also started making harmonicas. From 1840 on his nephew Christian Weiss started working on his own, so by 1855 there were two registered businesses - Christian Messner & Co. and Württ. Harmonikafabrik Ch. WEISS. Trossingen is also the home of the world's oldest extant harmonica manufacturer, C.A Seydel Sohne, founded in 1847.\nSee German Wikipedia page about de:Christian Messner.\nIn 1857 the Matthias Hohner company was founded. Today, Hohner harmonicas and accordions are well known all over the world. Trossingen also houses the German Harmonica Museum.\nTrossingen has a historic railway: the Trossinger Eisenbahn.\nAt the edge of town, in a former clay quarry, were found several dozen skeletons, both complete and partial, of the prosauropod dinosaur Plateosaurus engelhardti during excavations in the early 20th century. The local museum Auberlehaus houses several original bones.","after_content":"Trossingen is a town in South Germany (Baden-Württemberg). It is in a region called Baar, between the Swabian Alb and the Black Forest. Trossingen is called a \"music town\". It has around 16,000 people who live there, there is the 'University of Music Trossingen', which is one of Baden-Württemberg's state conservatories, and there are other institutions specialized in musical education, like the 'Bundesakademie für musikalische Jugendbildung' and the 'Hohner Konservatorium'. In 1857 the Matthias Hohner company was founded. Today, Hohner harmonicas and accordions are famous all over the world. Trossingen houses the German Harmonica Museum, too. Trossingen also has a historic railway: the Trossinger Eisenbahn. Several skeletons of the dinosaur Plateosaurus engelhardti were found in Trossingen during excavations in the early 20th century. The local museum Auberlehaus houses several of the original bones.","before":"(Low Alemannic: Drossinge)","after":"","before_token_range":[1,4],"after_token_range":[1,1]}
{"before_content":"Sehnsa is a large town in Pakistan Administered Azad Kashmir which lies on the west of Gulpur on the Kotli-Rawaplindi road. Sehnsa is a sub-divisional (Thesil) headquarters of Kotli district in the center of Sehnsa valley.Raja Amir Khan is a great lawyer, politician, statesman and the founder of Sehnsa. He is popularly and officially known in Azad Kashmir as Baba-e-Sehnsa( \"Father of the Kashmir\").\nContents [hide] 1 Education 2 Importance 3 Earthquake 2005 4 Location 5 Scenic Places 6 Geography and climate 7 Language 8 Famous people's 9 External links\n[edit]","after_content":"Sehnsa (Urdu: سہنسہ) is a large town in Azad Kashmir. It is a sub-district of the Kotli District.","before":"Raja Amir Khan is a great lawyer, politician, statesman and the founder of Sehnsa. He is popularly and officially known in Azad Kashmir as Baba-e-Sehnsa(\" Father","after":"","before_token_range":[36,63],"after_token_range":[15,15]}
{"before_content":"Saint-Cierges is a former municipality in the district of Gros-de-Vaud in the canton of Vaud in Switzerland. Its name refers to Saint Cyriacus, who is the town's patron saint. The municipalities of Chapelle-sur-Moudon, Correvon, Denezy, Martherenges, Neyruz-sur-Moudon, Peyres-Possens, Saint-Cierges, Thierrens and Chanéaz merged on 1 January 2013 into the new municipality of Montanaire.","after_content":"Saint-Cierges is a former municipality of the district of Gros-de-Vaud in the canton of Vaud in Switzerland. On 1 January 2013 the former municipalities of Chanéaz, Chapelle-sur-Moudon, Correvon, Denezy, Martherenges, Neyruz-sur-Moudon, Peyres-Possens, Saint-Cierges and Thierrens joined together to become the new municipality of Montanaire.","before":",","after":"and","before_token_range":[47,48],"after_token_range":[40,41]}
{"before_content":"Paul Muegge (September 28, 1936 – August 16, 2021) was an American politician who served in the Oklahoma Senate from the 20th district from 1990 to 2002.\nMuegge graduated from Lamont High School.\nHe died on August 16, 2021, in Tonkawa, Oklahoma at age 84.","after_content":"Paul Muegge (September 28, 1936 – August 16, 2021) was an American politician. He was a member of the Oklahoma Senate from the 20th district from 1990 to 2002. He was a member of the Democratic Party. Muegge was born in Lamont, Oklahoma.\nMuegge died on August 16, 2021, in Tonkawa, Oklahoma at age 84.","before":"He","after":"Muegge","before_token_range":[38,39],"after_token_range":[51,52]}
{"before_content":"Ralph Steven Greco (born May 25, 1942) was the Johnson and Johnson Distinguished Professor, Emeritus of Surgery at Stanford University School of Medicine. He was a leader of the resident Well Being in surgery movement and surgical training program leader.\nDr.Ralph Greco died in 31 of March at his home on the Stanford campus, surrounded by family. He was 76.\nThe cause of death was prostate cancer","after_content":"Ralph Steven Greco (May 25, 1942 – March 31, 2019) was an American surgeon and sculptor. He was the Johnson and Johnson Distinguished Professor, Emeritus of Surgery at Stanford University School of Medicine. He was well-known for his advocacy for the well-being of surgery residents. He retired from Stanford in 2017.\nGreco was born in the Bronx, a borough of New York City. He went to Yale University. He was married to Irene L. Wapnir. The couple had three children.\nGreco died from prostate cancer on March 31, 2019 in Stanford, California. He was 76.","before":"","after":"was an American surgeon and sculptor.","before_token_range":[9,9],"after_token_range":[12,18]}
{"before_content":"Ann Noreen Widdecombe (born 4 October 1947) is a former British Conservative Party politician and has been a novelist since 2000. She is a Privy Councillor and was the Member of Parliament for Maidstone from 1987 to 1997 and for Maidstone and The Weald from 1997 to 2010. She was a social conservative and a member of the Conservative Christian Fellowship. She retired from politics at the 2010 general election. Since 2002 she has also made numerous television and radio appearances, including as a television presenter. She is a convert from Anglicanism to Roman Catholicism. Peter Thorp aggressively masturbates to pictures of Ann Widdecombe.","after_content":"Ann Noreen Widdecombe (born 4 October 1947 in Bath, Somerset, England) is a former British politician. She was the Conservative Party Member of Parliament (MP) for the constituency of Maidstone and The Weald from 1987 to 2010.\nShe was first elected to the House of Commons at the 1987 General Election. From 1995 to 1997, she was the Minister of State for Prisons. Ann Widdecombe served in William Hague's shadow cabinet from 1997 to 2001 and retired as an MP at the 2010 General Election.\nThroughout her political career, Ann Widdecombe was quite socially conservative and converted from the Church of England to Roman Catholocism in 1992 after the Church of England voted to allow female priests.","before":"","after":"(MP)","before_token_range":[34,34],"after_token_range":[26,27]}
{"before_content":"Tonight is the fourth extended play by the South Korean boy band Big Bang, released under YG Entertainment. It was their first new materials released in South Korea after two-year hiatus as a group. Their comeback was met with mostly positive receptions, with the lead-single of the same name becoming a chart topper on the Gaon Chart.","after_content":"Tonight is the 4th extended play of South Korean band, Big Bang. It is released under YG Entertainment.","before":"by the","after":"of","before_token_range":[6,8],"after_token_range":[6,7]}
{"before_content":"Nestorius (in Greek: Νεστόριος; c. 386–c. 451) was Archbishop of Constantinople from 10 April 428 to 22 June 431. He was accused by his political enemy, Cyril of Alexandria, of Nestorianism because he objected to the popular practise of calling the Virgin Mary the \"Mother of God\" theotokos. He was condemned at the Council of Ephesus before his supporters could arrive and dethroned. His views were widely held in the East, and the consequence was the creation of the Assyrian Church of the East, over the Persian border and hence beyond Greek political control.","after_content":"Nestorius (in Greek: Νεστόριος; c. 386–c. 451) was Archbishop of Constantinople from 10 April 428 to 22 June 431. He was accused by his political enemy Cyril of Alexandria of Nestorianism because he objected to the popular practise of calling the Virgin Mary the \"Mother of God\" theotokos. He was condemned at the Council of Ephesus before his supporters could arrive and he was then dethroned. His views were widely held in the East, and the consequence was the creation of the Assyrian Church of the East, over the Persian border and hence beyond Greek political control.\nSaints","before":"","after":"Saints","before_token_range":[109,109],"after_token_range":[110,111]}
{"before_content":"Michael Brandner (born 13 February 1995) is an Austrian professional association football player who plays for FC Liefering.","after_content":"Michael Brandner ( born 13 February 1995) is a football player from Austria. He plays for F. C. Liefering, the second team of F.C. Red Bull Salzburg, in the SKY GO Erste Liga (2nd level in Austrian football) as midfielder.","before":"(born","after":"( born","before_token_range":[2,3],"after_token_range":[2,4]}
{"before_content":"Learning music by ear is done by repeatedly listening to other musicians and then attempting to recreate what one hears. This is how people learn music in any musical tradition in which there is no complete musical notation. Many people in cultures which do have notation still learn by ear, and ear training is common practice among those who use notation extensively.\nIn the West learning by ear is associated with traditional and folk music, but many classical music forms throughout the world lack notation, and have therefore been passed from generation to generation by ear.\nThe Suzuki method of teaching music focuses on playing by ear from a very young age. In his book \"Teaching from the Balance Point,\" Edward Kreitman, a US based Suzuki Teacher, clearly distinguishes \"learning by ear\" as a separate, completely different process from \"learning by rote\". See also: Music lesson","after_content":"Learning music by ear is learning to play a piece of music by listening to other people playing it and then trying to play it oneself. In some musical traditions there is no written music and everybody plays by ear all the time. Folk music is traditionally learned by listening to other musicians and copying them. This is how music is passed from one generation to another.\nMost people in the Western musical tradition learn pieces and songs by reading music, but it is good to try to play music by ear sometimes. It can be a very useful skill.\nThe Suzuki method of learning instruments started in Japan but is now used in many countries. It teaches young children to play an instrument (usually the violin) by ear.","before":"","after":" It can be a very useful skill","before_token_range":[100,100],"after_token_range":[98,106]}
{"before_content":"Vanessa is a feminine given name, especially popular in the United States. It was invented by the Anglo-Irish writer Jonathan Swift for Esther Vanhomrigh, whom Swift had met in 1708 and whom he tutored. The name was created by taking \"Van\" from Vanhomrigh's last name and adding \"Essa\", a pet form of Esther.\nIn 1726 the name Vanessa appeared in print for the first time in Cadenus and Vanessa, an autobiographical poem about Swift's relationship with Vanhomrigh. Swift had written the poem in 1713, but it was not published until three years after Vanhomrigh died. Vanessa has been adopted later as the name of a genus of butterfly by Johan Christian Fabricius in 1807.\nVanessa was the 71st most popular name for girls born in the United States in 2007. It has been among the top 200 names for girls in the United States since 1953 and among the top 100 names for girls since 1977. It first appeared among the top 1,000 names for girls in the United States in 1950, when it appeared on the list ranked in 939th place.","after_content":"The name Vanessa is a popular female name. It was created around 1708. The name was the 71st most popular female name for girls in the United States for 2007. It first appeared across the Top 1000 female names in the United States around 1950. There are several celebrities under the name, including Vanessa L. Williams and Vanessa Hudgens.","before":"and whom he tutored","after":"","before_token_range":[32,36],"after_token_range":[14,14]}
{"before_content":"Norbert Balatsch (10 March 1928 – 6 May 2020) was an Austrian conductor, especially known as a choral conductor, who began as a baritone choir singer. He was the long-term choir director of both the Vienna State Opera and the Bayreuth Festival. Two of his recordings won Grammy Awards.","after_content":"Norbert Balatsch (German: [ˈnɔʁbɛʁt ˈbala:tʃ]; 10 March 1928 – 6 May 2020) was an Austrian conductor. He was known as a choral conductor, who began as a baritone choir singer. He was the long-term choir director of both the Vienna State Opera and the Bayreuth Festival. He won two Grammy Awards. Balatsch was born in Vienna.\nBalatsch died on 6 May 2020 in Vienna, aged 92.","before":", especially","after":". He was","before_token_range":[13,15],"after_token_range":[16,20]}
{"before_content":"Donald Newcombe (June 14, 1926 – February 19, 2019), nicknamed Newk, was an American professional baseball pitcher in Negro league and Major League Baseball who played for the Newark Eagles (1944-45), Brooklyn\/Los Angeles Dodgers (1949–51 and 1954–58), Cincinnati Reds (1958–60), and Cleveland Indians (1960).\nNewcombe was the first pitcher to win the Rookie of the Year, Most Valuable Player, and Cy Young Awards during his career. This distinction would not be achieved again until 2011, when Detroit Tigers pitcher Justin Verlander accomplished the feat. In 1949, he became the first black pitcher to start a World Series game. In 1951, Newcombe was the first black pitcher to win twenty games in one season. In 1956, the inaugural year of the Cy Young Award, he became the first pitcher to win the National League MVP and the Cy Young in the same season.\nAn excellent hitter among pitchers, Newcombe compiled a career batting average of .271 with 15 home runs and was used as a pinch hitter, a rarity for pitchers.","after_content":"Donald Newcombe (June 14, 1926 – February 19, 2019), nicknamed \"Newk\", was an American professional baseball pitcher in Negro league and Major League Baseball. He played for the Newark Eagles (1944–45), Brooklyn\/Los Angeles Dodgers (1949–1951 and 1954–58), Cincinnati Reds (1958–1960), and Cleveland Indians (1960). Newcombe was born in Madison, New Jersey. He died on February 19, 2019 in Los Angeles from a long-illness, aged 92.","before":"who","after":". He","before_token_range":[29,30],"after_token_range":[31,34]}
{"before_content":"Lamellibrachia is a genus of tube worms related to the giant tube worm, Riftia pachyptila. It lives at deep-sea cold seeps where hydrocarbons (oil and methane) are leaking out of the seafloor. It is entirely reliant on internal, sulfide-oxidizing bacterial symbionts for its nutrition. L. luymesi provides the bacteria with hydrogen sulfide and oxygen by taking them up from the environment and binding them to a specialized hemoglobin molecule. Unlike the tube worms that live at hydrothermal vents, Lamellibrachia uses a posterior extension of its body called the root to take up hydrogen sulfide from the seep sediments. Lamellibrachia may also help fuel the generation of sulfide by excreting sulfate through their roots into the sediments below the aggregations.\nThe most well-known seeps where L. luymesi lives are in the northern Gulf of Mexico from 500 to 800 m depth. This tube worm can reach lengths of over 3 m (10 ft), grows very slowly, and may hold the longevity record for an invertebrate with individuals living to be over 250 years old.[dubious – discuss] It forms biogenic habitat by creating large aggregations of hundreds to thousands of individuals. Living in these aggregations are over a hundred different species of animals, many of which are found only at these seeps.\nWhile most species of vestimentiferan tubeworms live in deep waters below the photic zone, Lamellibrachia satsuma was discovered in Kagoshima Bay, Kagoshima at a depth of only 82 m, the shallowest depth record for a vestimentiferan.","after_content":"Seep tube worms (which are of the genus Lamellibrachia) are related to the giant tube worms. They live on the floor of the oceans, near cold seeps. There crude oil and methane come out of the ocean floor. The worm forms a symbiosis with cerain bacteria. These can oxidise sulfides. The worm binds the bacteria to a special hemoglobin molecule. It provides them with hydrogen sulfide and oxygen. In return, the bacteria feed the worm. The worms can grow to a length of about 3 metres.","before":"Lamellibrachia is a genus oftube worms","after":"Seeptube worms(which are of the genus Lamellibrachia) are","before_token_range":[0,7],"after_token_range":[0,10]}
{"before_content":"The International Statistical Classification of Diseases and Related Health Problems (most commonly known by the abbreviation ICD) is a medical classification that provides codes to classify diseases and a wide variety of signs, symptoms, abnormal findings, complaints, social circumstances, and external causes of injury or disease. Under this system, every health condition can be assigned to a unique category and given a code, up to six characters long. Such categories can include a set of similar diseases.\nThe International Classification of Diseases is published by the World Health Organization (WHO) and used worldwide for morbidity and mortality statistics, reimbursement systems, and automated decision support in medicine. This system is designed to promote international comparability in the collection, processing, classification, and presentation of these statistics. The ICD is a core classification of the WHO Family of International Classifications (WHO-FIC).\nThe ICD is revised periodically and is currently in its tenth edition. The ICD-10, as it is therefore known, was developed in 1992 to track mortality statistics. ICD-11 is planned for 2015 and will be revised using Web 2.0 principles. Annual minor updates and triennial major updates are published by the WHO. The ICD is part of a \"family\" of guides that can be used to complement each other, including also the International Classification of Functioning, Disability and Health which focuses on the domains of functioning (disability) associated with health conditions, from both medical and social perspectives.","after_content":"The International Statistical Classification of Diseases and Related Health Problems (also known as ICD) is a list of codes that classify diseases and medical problems. A special, unique code is given to:\nICD is published by the World Health Organization. One of the ICD's goals is to make sure that different doctors - and different countries - are using the same diagnoses. This makes it easier to compare how diseases affect different countries. The ICD has been changed and updated many times. The most recent edition is the ICD-11. ICD-11 has been adopted by the World Health Assembly of WHO for use starting 1 January 2022 It has been revised using Web 2.0.","before":"symptoms, abnormal findings, complaints, social circumstances, and external causes of injury or disease. Under this system, every health condition can be assigned","after":"","before_token_range":[35,58],"after_token_range":[34,34]}
{"before_content":"The WWE SmackDown Tag Team Championship is a professional wrestling world tag team championship created and promoted by the American professional wrestling promotion WWE on the SmackDown brand. It is one of two tag team championships for WWE's main roster, along with the Raw Tag Team Championship on the Raw brand. The current champions are American Alpha, who are in their first reign, both as a team and individually.\nUnveiled on the August 23, 2016 episode of SmackDown Live, it was created to be the counterpart title to the then-WWE Tag Team Championship, which became exclusive to Raw as a result of the 2016 WWE draft. That title was subsequently renamed after the crowning of the inaugural SmackDown Tag Team Champions, Heath Slater and Rhyno.","after_content":"The WWE SmackDown Tag Team Championship is a wrestling title owned by WWE. It was created for the SmackDown Live brand after the return of the brand extension. The WWE Tag Team Championship became exclusive of Raw. The first champions were Heath Slater and Rhyno and current champions are American Alpha.","before":"on the","after":"","before_token_range":[49,51],"after_token_range":[38,38]}
{"before_content":"Walter \"Clyde\" Frazier Jr. (born March 29, 1945) is an American former professional basketball player of the National Basketball Association (NBA). As their floor general and top perimeter defender, he led the New York Knicks to the franchise's only two championships (1970 and 1973), and was inducted into the Naismith Memorial Basketball Hall of Fame in 1987. Upon his retirement from basketball, Frazier went into broadcasting; he is currently a color commentator for telecasts of Knicks games on the MSG Network.","after_content":"Walter Frazier Jr. (born March 29, 1945 in Atlanta, Georgia) is an American former basketball player in the National Basketball Association. As their floor general, he led the New York Knicks to the franchise's only two championships (1970 and 1973), and was inducted into the Naismith Memorial Basketball Hall of Fame in 1987. Upon his retirement from basketball, Frazier went into broadcasting; he is currently a color commentator for telecasts of Knicks games on the MSG Network. Frazier is very well known by the nickname Clyde as well as the much lesser known nickname Mr. Cool. Frazier is considered one of the greatest point guards of all time, and particularly one of the greatest defensive guards as well. He was noted for his exceptionally quick hands, and it is claimed that he once stole the ball on eight consecutive plays in a 1971 game against Atlanta (steals were not an official statistic at the time). At one point Frazier held the single-game championship round record for assists.","before":"","after":"in Atlanta, Georgia","before_token_range":[11,11],"after_token_range":[9,12]}
{"before_content":"Osmosis is the movement of water molecules across a semi-permeable membrane from a region of low concentration to a region of high concentration until a state of dynamic equilibrium is reached. This movement of water has the effect of equalising the concentration on both sides of the membrane.\nOsmosis is the movement of water molecules across a partially-permeable membrane down a water potential gradient. More specifically, it is the movement of water across a partially permeable membrane from an area of high water potential (low solute concentration) to an area of low water potential (high solute concentration). It is a physical process in which a solvent moves, without input of energy, across a semipermeable membrane (permeable to the solvent, but not the solute) separating two solutions of different concentrations. Osmosis releases energy, and can be made to do work. Osmosis is a passive process, like diffusion.\nNet movement of solvent is from the less-concentrated (hypotonic) to the more-concentrated (hypertonic) solution, which tends to reduce the difference in concentrations. This effect can be countered by increasing the pressure of the hypertonic solution, with respect to the hypotonic. The osmotic pressure is defined to be the pressure required to maintain an equilibrium, with no net movement of solvent. Osmotic pressure is a colligative property, meaning that the osmotic pressure depends on the molar concentration of the solute but not on its identity.\nOsmosis is important in biological systems, as many biological membranes are semipermeable. In general, these membranes are impermeable to organic solutes with large molecules, such as polysaccharides, while permeable to water and small, uncharged solutes. Permeability may depend on solubility properties, charge, or chemistry, as well as solute size. Water molecules travel through the plasma cell wall, tonoplast (vacuole) or protoplast in two ways, either by diffusing across the phospholipid bilayer directly, or via aquaporins (small transmembrane proteins similar to those in facilitated diffusion and in creating ion channels). Osmosis provides the primary means by which water is transported into and out of cells. The turgor pressure of a cell is largely maintained by osmosis, across the cell membrane, between the cell interior and its relatively hypotonic environment.","after_content":"Osmosis is the movement of water through a plasma membrane from a region of low salt concentration to a region of high concentration. Osmosis is passive transport, meaning it does not require energy to be applied. What causes osmotic pressure is different concentrations of salt ions on the two sides of the membrane. When osmosis happens, water moves from the side of the membrane with a lower amount of osmotic pressure to the side of the membrane with the higher amount. An important example of osmosis is the movement of liquid (solvent) molecules across a cell membrane into a cell with a higher solute concentration. Osmosis is a fundamental part of cell biochemistry, but also has mechanical applications and usages.","before":"water potential gradient. More specifically, it is the movement of water acrossa","after":"cell withahigher","before_token_range":[63,77],"after_token_range":[103,107]}
{"before_content":"Echuca (\/əˈtʃuːkə\/ ə-CHOO-kə) is a town located on the banks of the Murray River and Campaspe River in Victoria, Australia. The border town of Moama is adjacent on the northern side of the Murray River in New South Wales. Echuca is the administrative centre and largest settlement in the Shire of Campaspe. As of the 2011 census, Echuca had a population of 13,708. The population of the combined Echuca and Moama townships was estimated be 20,365 at June 2015.\nEchuca, an Aboriginal name meaning \"Meeting of the Waters\", is indicative of the role rivers have played in the town's existence. Echuca is situated close to the junction of the Goulburn, Campaspe, and Murray Rivers. Its position at the closest point of the Murray to Melbourne contributed to its development as a thriving river port city during the 19th century.","after_content":"Echuca (\/[invalid input: 'icon']əˈtʃuːkə\/ ə-CHOO-kə) is a city on the banks of the Murray River and Campaspe River in Victoria, Australia. On the other bank of the Murray is the New South Wales town of Moama. Echuca is the administrative centre and largest town in the Shire of Campaspe. In 2011 there were 14,190 people living in Echuca. Echuca is an Aboriginal word meaning \"Meeting of the Waters\". Echuca is close to the junction of the Goulburn, Campaspe and Murray Rivers. It is the closest point of the Murray to Melbourne. This meant it developed as a river port during the 19th century.","before":"The bordertown of Moamais adjacent on the northern side of the Murray River in New South Wales","after":"On the other bank of the Murray is the New South Walestown of Moama","before_token_range":[23,42],"after_token_range":[23,38]}
{"before_content":"Virtual XI (pronounced: Virtual Eleven) is the eleventh studio album by English heavy metal band Iron Maiden, released on 23 March 1998. It is the band's second and final album with Blaze Bayley on vocals.","after_content":"Virtual XI is an album by Iron Maiden. It is their eleventh studio album.\nThe album was released on 23 March 1998. It was not liked by reviewers. One person who reviewed it said that it sounded \"lifeless\" and \"tired.\"","before":"theeleventh studio albumby English heavy metal band Iron Maiden,","after":"an album by Iron Maiden. It is theireleventh studio album. The album was","before_token_range":[6,17],"after_token_range":[3,20]}
{"before_content":"Elio Sgreccia (6 June 1928 – 5 June 2019) was an Italian bioethicist and a cardinal of the Roman Catholic Church. He was president emeritus of the Pontifical Academy for Life, director of the international medical ethics journal Medicina e Morale, president of the Ut Vitam Habeant Foundation and the Donum Vitae Association of the Diocese of Rome, and honorary president of the International Federation of Bioethics Centers and Institutes of Personalist Inspiration (FIBIP).","after_content":"Elio Sgreccia (6 June 1928 – 5 June 2019) was an Italian bioethicist and a cardinal of the Roman Catholic Church. He was born in Arcevia. He became a priest in 1952, and was created cardinal by Pope Benedict XVI in 2010. Sgreccia was president of the Pontifical Academy for Life from 2005 to 2008. He was also director of the international medical ethics journal Medicina e Morale, president of the Ut Vitam Habeant Foundation and the Donum Vitae Association of the Diocese of Rome, and honorary president of the International Federation of Bioethics Centers and Institutes of Personalist Inspiration (FIBIP).\nSgreccia died on 5 June 2019, a day before his 91st birthday.","before":"","after":"Sgreccia died on 5 June 2019, a day before his 91st birthday.","before_token_range":[81,81],"after_token_range":[110,122]}
{"before_content":"The iPad is a tablet computer developed by Apple Inc. Announced on January 27, 2010, it is Apple first tablet computer and it fits into the device category between a smartphone and a laptop computer. Similar in functionality to a larger and more powerful iPhone or iPod touch, it runs a modified version of the same operating system (iPhone OS). Its stock applications have been redesigned to take advantage of the larger screen with added functionality similar to their Mac OSX counterparts.\nThe iPad has a 9.7-inch (25 cm) LED backlit multi-touch display with a pixel resolution of 1024x768, 16 to 64 gigabytes (GB) of flash memory, a 1-gigahertz (GHz) Apple A4 processor, Bluetooth 2.1, and a 30-pin dock connector to sync with iTunes and connect wired accessories.\nTwo models have been announced: one with 802.11n Wi-Fi and one with 802.11n Wi-Fi and 3G (which can connect to HSDPA cellular networks), and Assisted GPS. Both models may be purchased with three different memory capacities.\nAs Apple's first device to use its iBookstore service and companion iBooks ebook reading application, the iPad has been compared to Amazon's Kindle.","after_content":"The iPad is the first tablet computer made by Apple Inc. Apple introduced it on January 27, 2010. It falls somewhere between a smartphone and a laptop computer in the way it works.","before":"Announced","after":"Apple introduced it","before_token_range":[11,12],"after_token_range":[12,15]}
{"before_content":"In organized sports, point shaving is what Cody Parkey specializes in, the Eagles paid him on 1\/6\/19 to miss the final kick and he followed through with it, he gets paid on 1\/7\/19. Unlike other forms of sports betting, spread betting invariably motivates point shaving. A point shaving scheme generally involves a sports gambler and one or more players of the team favored to win the game. In exchange for a bribe, the player or players agree to ensure that their team will not \"cover the point spread\" (i.e. the bribed player's team may still win, but by not as big a margin as predicted by bookmakers). The gambler then wagers against the bribed team. Alternatively, an official (referee) of the game may be bribed, or even bet on his own behalf, so that one or more \"close calls\" will be called in favor of the \"underdog\" rather than the team favored to win.","after_content":"In sports, point shaving, is a certain type of match fixing where basketball or other sports players try to prevent a team from covering a published point spread. Spread betting usually motivates point shaving. The point shaving scheme usually involves a sports gambler and several players who are likely to win the game. In exchange for a bribe, the players agree to making sure the team they are on will not cover the point spread. The gamblers then wager against the bribed team.","before":"gambler","after":"gamblers","before_token_range":[118,119],"after_token_range":[83,84]}
{"before_content":"Animation is the technique in which each frame of a film or movie is produced individually, whether generated as a computer graphic, or by photographing a drawn image, or by repeatedly making small changes to a model unit (see claymation and stop motion), and then photographing the result with a special animation camera. When the frames are strung together and the resulting film is viewed at a speed of 16 or more frames per second, there is an illusion of continuous movement (due to the persistence of vision). Generating such a film is very labour intensive and tedious, though the development of computer animation has greatly sped up the process.\nGraphics file formats like GIF, MNG and Flash allow animation to be viewed on a computer or over the Internet.","after_content":"Animation is a process by which each frame of a movie is produced on its own, and is shot with a special camera. There are three methods by which it can be done:\nWhen such frames come together, the resulting work is viewed at a speed of sixteen to twenty-four images per second, and an illusion of movement develops (because of persistence of vision).\nIn spite of computer animation gradually taking its place, it still takes a lot of time and work to make such product.","before":"then photographing the result","after":"is shot","before_token_range":[44,48],"after_token_range":[18,20]}
{"before_content":"The bilateral relations between the People's Republic of Bangladesh and Kingdom of Thailand were established on October 5, 1972.Thailand opened its embassy in Bangladesh in 1974, but Bangladesh has opened its embassy in Bangkok in 1975.","after_content":"Bangladesh–Thailand relations refer to foreign relations between the People's Republic of Bangladesh and the Kingdom of Thailand. Relations were established on 5 October 1972. Trade relations between Bangladesh and Thailand grow stronger with each passing year, particularly with regard to commodity relations. Thailand, as a more developed country, sees many Bengali students coming over to study the sciences.","before":"1972.Thailand opened its embassy in Bangladesh in 1974,","after":" Thailand,as a more developed country, sees many Bengali students coming over to study the sciences","before_token_range":[20,30],"after_token_range":[47,65]}
{"before_content":"Jean Rhys, CBE (\/riːs\/; born Ella Gwendolyn Rees Williams (24 August 1890 – 14 May 1979), was a mid-20th-century novelist who was born and grew up in the Caribbean island of Dominica. From the age of 16, she was mainly resident in England, where she was sent for her education. She is best known for her novel Wide Sargasso Sea (1966), written as a prequel to Charlotte Brontë's Jane Eyre. In 1978 she was appointed a Commander of the Order of the British Empire for her writing.","after_content":"Jean Rhys, CBE (24 August 1890 – 14 May 1979), born Ella Gwendolyn Rees Williams, was a novelist from Dominica. She is best known for her novel Wide Sargasso Sea.","before":"mid-20th-century","after":"","before_token_range":[21,22],"after_token_range":[20,20]}
{"before_content":"A paddle is a tool, originally a boat propulsion implement for mixing or pushing against liquids, typically in order to propel a boat. Paddles for use in canoes consist of a wooden, fibreglass or metal rod (the shaft) with a handle on one end and a rigid sheet (the blade) on the other end. Paddles for use in kayaks are longer, with a blade on each end, and usually no handles.\nThe paddle is held with two hands, some distance apart from each other. For normal use, it is drawn through the water in a backwards direction. The two blades of a kayak paddle are dipped alternately on either side of the kayak. A paddle is distinguished from an oar in that the paddle is held in the user's hands and completely supported by the paddler, whereas an oar is primarily supported by the boat.\nOn mechanical paddle steamers, the motorized paddling is not done with a mass of paddles or oars but by rotating one or a few paddle wheels (rather the inverse of a water mill)","after_content":"A paddle is a tool used for pushing against liquids, either as a form of propulsion in a boat or for mixing likids.","before":"","after":"used","before_token_range":[5,5],"after_token_range":[5,6]}
{"before_content":"Avant Browser is a freeware web browser from a Chinese programmer named Anderson Che, which unites the Trident layout engine built into Windows (see Internet Explorer shell) with an interface intended to be more feature-rich, flexible and ergonomic than Microsoft's Internet Explorer (IE). It runs on Windows 98 and above, including Windows Vista. Internet Explorer version 6, 7 or 8 must be installed.\nAs of November 2008, total downloads surpassed 22.5 million.\nAvant Browser is currently available in 41 languages.","after_content":"Avant Browser is a free web browser created by a Chinese Programmer called Anderson Che.\nThe Avant browser follows a set of commands that are similar to those of Internet Explorer (known as the Trident layout engine), but has more features and is more customisable. Avant can only work on Windows computers that have Internet Explorer (6, 7 or 8) installed on them.\nThe browser is available in 41 languages. As of November 2008, there were over 22 million Downloads\nThe Official website is avantbrowser.com","before":"currently available in 41 languages.","after":"","before_token_range":[84,89],"after_token_range":[94,94]}
{"before_content":"Jerry Lewis (born Joseph Levitch; March 16, 1926) is an American comedian, actor, film producer, screenwriter, film director and singer. He is best-known for his slapstick humor in screen, television, stage and radio. He was originally paired up with Dean Martin in 1946, forming the famed comedy team of Martin and Lewis. In addition to the duo's popular nightclub work, they starred in a successful series of comedy films for Paramount Pictures. As an innovative filmmaker, Lewis is credited with inventing the video assist system in cinematography. Lewis is also known for his charity fund-raising telethons and position as national chairman for the Muscular Dystrophy Association (MDA). Lewis has won several awards for lifetime achievements from The American Comedy Awards, The Golden Camera, Los Angeles Film Critics Association, and The Venice Film Festival, and he has two stars on the Hollywood Walk of Fame. In 2005, he received the Governors Award of the Academy of Television Arts & Sciences Board of Governors, which is the highest Emmy Award presented. On February 22, 2009, the Academy of Motion Picture Arts and Sciences awarded Lewis the Jean Hersholt Humanitarian Award.","after_content":"Jerry Lewis (born 16 March 1926) is a comedian and actor from the United States. He is best known for acting in many comedy movies from the 1950s and 1960s. He also helps to raise money for people with disabilities and illnesses.","before":"","after":"1960s","before_token_range":[36,36],"after_token_range":[31,32]}
{"before_content":"Anvar Khāmahʼī (Persian: انور خامه‌ای, (20 March 1917 – 20 November 2018) was an Iranian sociologist, economist, journalist, and politician, who has written many books in his specialty fields, including his analytical and critical book Revisionism from Marx to Mao Tse-Tung. He was a university professor at the Université catholique de Louvain in Belgium, and a UNESCO fellow. Khamei was an activist of the Tudeh Party of Iran in the 1940s, but he quit in January 1948, and concentrated on his journalistic and academic activities. He turned 100 in March 2017. and died on 20 November 2018 at the age of 101 from Respiratory failure.","after_content":"Anvar Khāmahʼī (20 March 1917 – 20 November 2018) was an Iranian sociologist, economist, journalist, and politician. He wrote many books in his specialty fields, including his analytical and critical book Revisionism from Marx to Mao Tse-Tung. He was a university professor at the Université catholique de Louvain in Belgium.\nKhamei was an activist of the Tudeh Party of Iran in the 1940s, but he quit in January 1948.\nKhamei died on 20 November 2018 at the age of 101 from respiratory failure in Karaj, Iran.","before":"He turned 100 in March 2017.","after":"Khamei","before_token_range":[97,103],"after_token_range":[80,81]}
{"before_content":"The Pharaoh Hound is a Maltese breed of dog and the national dog of Malta. In Maltese it is called Kelb tal-Fenek, which means \"rabbit dog\". It is traditionally used for hunting rabbit in the Maltese Islands.\nBased on DNA analysis, the breed has no link with Ancient Egypt. However, a popular myth holds that the breed is descended from the Tesem, one of the ancient Egyptian hunting dogs. Some believe that there are similarities between the breed and images of dogs found on the walls of ancient Egyptian tombs. This myth proposes that the Pharaoh Hound was brought by the Phoenicians to Malta, where it has existed for over 2,000 years.\nThe breed has variously been classified as a member of the sighthound group.","after_content":"The Pharaoh Hound is a breed of dog. Pharaoh Hounds are special because of their fur is always bright orange in colour. They needs lots of exercise, and they are fast runners and can jump high. They need little brushing because their fur is very short. In the past people used them to hunt rabbits.","before":"andthe national dog of Malta. In","after":". Pharaoh Hounds are special because of their fur is always bright orange in colour. They needs lots of exercise,andthey are fast runners and can jump high. They need little brushing because their fur is very short. Inthe past people used them to hunt rabbits","before_token_range":[9,17],"after_token_range":[8,60]}
{"before_content":"Adrenoleukodystrophy (ALD) is a disease linked to the X chromosome. It is a result of fatty acid buildup caused by a defect in the very long chain of fatty acids transporter in peroxisomes, which then causes damage to the myelin sheath of the nerves, resulting in seizures and hyperactivity. Other symptoms include problems with speaking, listening, and understanding verbal instructions.\nIn more detail, it is a disorder of peroxisomal fatty acid beta oxidation which results in the accumulation of very long chain fatty acids in tissues throughout the body. The most severely affected tissues are the myelin in the central nervous system, the adrenal cortex, and the Leydig cells in the testes. Clinically, ALD is a heterogeneous disorder, presenting with several distinct phenotypes, and no clear pattern of genotype-phenotype correlation. As an X-linked disorder, ALD presents most commonly in males, however approximately 50% of heterozygote females show some symptoms later in life. Approximately two-thirds of ALD patients will present with the childhood cerebral form of the disease, which is the most severe form. It is characterized by normal development in early childhood, followed by rapid degeneration to a vegetative state. The other forms of ALD vary in terms of onset and clinical severity, ranging from adrenal insufficiency to progressive paraparesis in early adulthood (this form of the disease is typically known as adrenomyeloneuropathy).\nALD is caused by mutations in ABCD1, a gene located on the X chromosome that codes for ALD, a peroxisomal membrane transporter protein. The exact mechanism of the pathogenesis of the various forms of ALD is not known. Biochemically, individuals with ALD show very high levels of unbranched, saturated, very long chain fatty acids, particularly cerotic acid (26:0). The level of cerotic acid in plasma does not correlate with clinical presentation. Treatment options for ALD are limited. Dietary treatment is with Lorenzo's oil. For the childhood cerebral form, stem cell transplant and gene therapy are options if the disease is detected early in the clinical course. Adrenal insufficiency in ALD patients can be successfully treated. ALD is the most common peroxisomal inborn error of metabolism, with an incidence estimated between 1:18,000 and 1:50,000. It does not have a significantly higher incidence in any specific ethnic groups.","after_content":"Adrenoleukodystrophy is a disease that is linked on the X chromosome. It is a result of fatty acid digestive enzymes not breaking up the fats, which accumulate in the brain and end up damaging the myelin that surrounds nerves, causing seizures, fits, hyperactivity, difficulties in school, speaking, listening and understanding verbal commands","before":" In more detail, it is a disorder of peroxisomal fatty acid beta oxidation which results in the accumulation of very long chain fatty acids in tissues throughout the body. The most severely affected tissues are the myelin in the central nervous system, the adrenal cortex, and the Leydig cells in the testes. Clinically, ALD is a heterogeneous disorder, presenting with several distinct phenotypes, and no clear pattern of genotype-phenotype correlation. As an X-linked disorder, ALD presents most commonly in males, however approximately 50% of heterozygote females show some symptoms later in life. Approximately two-thirds of ALD patients will present with the childhood cerebral form of the disease, which is the most severe form. It is characterized by normal development in early childhood, followed by rapid degeneration to a vegetative state. The other forms of ALD vary in terms of onset and clinical severity, ranging from adrenal insufficiency to progressive paraparesis in early adulthood(this form of the disease is typically known as adrenomyeloneuropathy). ALD is caused by mutations in ABCD1, a gene located on the X chromosome that codes for ALD, a peroxisomal membrane transporter protein. The exact mechanism of the pathogenesis of the various forms of ALD is not known. Biochemically, individuals with ALD show very high levels of unbranched, saturated, very long chain fatty acids, particularly cerotic acid(26:0). The level of cerotic acid in plasma does not correlate with clinical presentation. Treatment options for ALD are limited. Dietary treatment is with Lorenzo's oil. For the childhood cerebral form, stem cell transplant and gene therapy are options if the disease is detected early in the clinical course. Adrenal insufficiency in ALD patients can be successfully treated. ALD is the most common peroxisomal inborn error of metabolism, with an incidence estimated between 1:18,000 and 1:50,000. It does not have a significantly higher incidence in any specific ethnic groups.","after":"","before_token_range":[65,389],"after_token_range":[55,55]}
{"before_content":"Suhoor (Arabic:سحور lit. of the dawn), also called Sehri, Sahari and Sahur in other languages, is an Islamic term referring to the meal consumed early in the morning by Muslims before fasting, sawm, in daylight hours during the Islamic month of Ramadan. The meal is eaten before the sun rises, and before the fajr or dawn prayer. Suhoor as the morning meal is matched by iftar as the evening meal, during Ramadan. lalalala","after_content":"Suhoor (Arabic: سحور lit. of the dawn) is also called Sehri, Sahari and Sahur in other languages. It is an Islamic term referring to the meal had early in the morning by Muslims before fasting.","before":"consumed","after":"had","before_token_range":[29,30],"after_token_range":[32,33]}
{"before_content":"A Cooler Climate is a 1999 American made-for-television drama film directed by Susan Seidelman starring Sally Field and Judy Davis. It is based on a book with the same name by Zena Collier and originally aired on Showtime on August 22, 1999.","after_content":"A Cooler Climate is a 1999 American made for television drama movie directed by Susan Seidelman and was based on the novel of the same name. It stars Sally Field, Judy Davis, Jerry Wasserman, Winston Rekert and aired on Showtime on 22 August 1999.","before":"Judy Davis. It is","after":"was","before_token_range":[18,23],"after_token_range":[17,18]}
{"before_content":"Tower 42 is the tallest skyscraper in the City of London and the eighth tallest in Greater London. Its original name was the NatWest Tower (or National Westminster Tower), having been built to house NatWest's international headquarters. It is still commonly referred to as the NatWest Tower. Seen from above, the shape of the tower resembles that of the NatWest logo (three chevrons in a hexagonal arrangement).\nThe tower, designed by Richard Seifert and engineered by Pell Frischmann, is located at 25 Old Broad Street. It was built by John Mowlem & Co between 1971 and 1980, first occupied in 1980, and formally opened on 11 June 1981 by Queen Elizabeth II.\nThe construction cost was £72 million (approximately £328 million today). It is 183 metres (600 ft) high, which made it the tallest building in the United Kingdom until the topping out of One Canada Square at Canary Wharf in 1990. It was the tallest building to have been built in London in the 1980s. It held the status of tallest building in the City of London for 30 years, until it was surpassed by the Heron Tower in December 2009.\nThe building today is multi-tenanted and comprises Grade A office space and restaurant facilities, with one restaurant situated on the 24th floor, and the other, a champagne and seafood bar, on the 42nd floor. In 2011 it was bought by the South African businessman Nathan Kirsh for £282.5 million.","after_content":"Tower 42, previously known as the NatWest tower or National Westminster Tower is a skyscraper in the City of London, England. From the top the design of the building is made to resemble the NatWest logo.\nIt was constructed between 1971 and 1980, first occupied in 1980 and opened on 11 June 1981 by Queen Elizabeth II. When completed it became the tallest building in the United Kingdom and remained the tallest in the city of London for 30 years until the completion of Heron Tower in December 2009.\nThe cost to build it was £72 million (£283 million today). The building today has grade A office spaces, a restaurant on the 24th floor and a champagne and seafood bar on the 42nd floor.","before":"until the topping out of One Canada Square at Canary Wharf in 1990. It wasthe tallestbuilding to have been built in London","after":"and remainedthe tallest","before_token_range":[143,168],"after_token_range":[74,78]}
{"before_content":"The Oxford English Dictionary (OED), published by the Oxford University Press, is a descriptive (as opposed to prescriptive) dictionary of the English language. As well as describing English usage in its many variations throughout the world, it traces the historical development of the language, providing a comprehensive resource to scholars and academic researchers. The second edition, published in 1989, came to 21,728 pages in 20 volumes.\nAlthough work had begun on the dictionary in 1857, it was not until 1884 that it began to be published, in unbound fascicles as work continued on the project, under the name of A New English Dictionary on Historical Principles; Founded Mainly on the Materials Collected by The Philological Society. In 1895 the title The Oxford English Dictionary (OED) was first used unofficially on the covers of the series, and in 1928 the full dictionary was republished in ten bound volumes. In 1933 the title The Oxford English Dictionary fully replaced the former name in all occurrences in its reprinting as twelve volumes with a one-volume supplement. More supplements came over the years until 1989, when the second edition was published. Since 2000, a third edition of the dictionary has been underway, approximately a third of which is now complete.\nThe first electronic version of the dictionary was made available in 1988. The online version has been available since 2000, and as of April 2014 was receiving over two million hits per month. The third edition of the dictionary will probably only appear in electronic form; the chief executive of Oxford University Press, Nigel Portwood, feels it unlikely that it will ever be printed.","after_content":"The Oxford English Dictionary (or OED) is a dictionary. It is published by the Oxford University Press in England, and is the largest English dictionary.\nIt traces the historical development of the English language, and is a resource to writers and scholars. It describes how the language has been used.\nThe second edition came to 21,728 pages in 20 volumes, published in 1989.\nWork began on the dictionary in 1857, but it was not until 1884 that it began to be published in parts, under the name of A New English Dictionary on historical principles; founded mainly on the materials collected by the Philological Society. In 1895, the title The Oxford English Dictionary (OED) was first used unofficially on the covers of the series, and in 1928 the full dictionary was republished in ten bound volumes. In 1933, the The Oxford English Dictionary was reprinted as twelve volumes with a one-volume supplement. More supplements came over the years until 1989, when the second edition was published. Since 2000, a third edition of the dictionary has been underway, approximately a third of which is now complete.\nThe first electronic version of the dictionary was done in 1988. The online version has been available since 2000, and as of April 2014 was receiving over two million hits per month. The third edition of the dictionary will probably only appear in electronic form; Nigel Portwood, chief executive of Oxford University Press, feels it unlikely that it will ever be printed.","before":"","after":"English","before_token_range":[46,46],"after_token_range":[35,36]}
{"before_content":"{JAMES HAS no life\nThe Crow, called the Apsáalooke in their own Siouan language, or variants including Absaroka, are Native Americans, who in historical times lived in the Yellowstone River valley, which extends from present-day Wyoming, through Montana and into North Dakota, where it joins the Missouri River. Today, they are enrolled in the federally recognized Crow Tribe of Montana.\nPressured by the Ojibwe and Cree peoples (the Iron Confederacy), who had earlier and better access to guns through the fur trade, they had migrated there from the Ohio Eastern Woodland area to settle south of Lake Winnipeg, Canada. From there, they were pushed to the west by the Cheyennes. Both the Crow and the Cheyennes were then pushed farther west by the Lakota (Sioux), who took over the territory from the Black Hills of South Dakota to the Big Horn Mountains of Montana; the Cheyennes finally became close allies of the Sioux, but the Crows remained bitter enemies of both Sioux and Cheyennes. The Crow were generally friendly with the whites and managed to retain a large reservation of over 9300 km2 despite territorial losses.\nSince the 19th century, Crow people have been concentrated on their reservation established south of Billings, Montana. They also live in several major, mainly western, cities. Tribal headquarters are located at Crow Agency, Montana.","after_content":"The Crow (also known as Apsáalooke in their own Siouan language, or Absaroka) are Native Americans. In the past, they lived in the Yellowstone River valley, which is in Wyoming, Montana, and North Dakota. Today, they are federally recognized as the Crow Tribe of Montana.\nDuring their history, the Crow have changed their territory many times because of conflicts with the Ojibwe, Cree, Cheyennes, and Lakota (Sioux) peoples. They were generally friendly with the whites. Since the 19th century, most Crow people have lived on their reservation that is south of Billings, Montana. Although they have lost land, it is over 9300 km2. They also live in several major western cities. The tribe's headquarters are located at Crow Agency, Montana.","before":", mainly","after":"","before_token_range":[226,228],"after_token_range":[128,128]}
{"before_content":"Vaginitis is an inflammation of the vagina.Cite error: The <ref> tag has too many names (see the help page). It can result in discharge, itching and pain, and is often associated with an irritation or infection of the vulva. It is usually due to infection. The three main kinds of vaginitis are bacterial vaginosis (BV), vaginal candidiasis, and trichomoniasis. A woman may have any combination of vaginal infections at one time. The symptoms that arise vary with the infection, although there are general symptoms that all vaginitis infections have and infected women may also be asymptomatic. Testing for vaginal infections is not a part of routine pelvic exams; therefore, women should neither assume their health care providers will know of the infection, nor that they will provide appropriate treatment without their input.","after_content":"Vaginitis is an inflammation of the vagina. It may result in discharge, itching and pain. Vulva irritation or infection is often involved. It is usually because of the latter.\nA woman having this condition may have these symptoms:","before":" The three main kinds","after":"","before_token_range":[50,55],"after_token_range":[31,31]}
{"before_content":"Pierremont is a commune in the Pas-de-Calais département in the Nord-Pas-de-Calais region of France.","after_content":"Pierremont is a commune. It is found in the region Nord-Pas-de-Calais in the Pas-de-Calais department in the north of France.","before":"","after":"north","before_token_range":[10,10],"after_token_range":[19,20]}
{"before_content":"Igor Mikhailovich Diakonov (Russian: И́горь Миха́йлович Дья́конов) (December 30, 1914 (January 12, 1915), Petrograd – May 2, 1999, St Petersburg) was a Russian\/Soviet historian, linguist, and translator who should be ranked among the greatest authorities on Ancient Near East and its languages. Diakonov, both of whose brothers were distinguished historians, was brought up in Norway and graduated from the Leningrad University in 1938, joining the staff of the Hermitage Museum the same year. In 1949, he published a comprehensive study of Assyria, followed by the monograph on Media in 1956. Later, he teamed with the linguist Sergei Starostin to produce authoritative studies of the Caucasian, Afro-Asiatic and Hurro-Urartian languages.","after_content":"Igor Mikhailovich Diakonov (December 30, 1914 (January 12, 1915), Petrograd – May 2, 1999, St Petersburg) was a Russian\/Soviet historian, linguist, and translator who should be ranked among the greatest authorities on Ancient Near East and its languages.","before":"(January 12","after":"","before_token_range":[11,12],"after_token_range":[9,9]}
{"before_content":"Windows Media Player is an proprietary software digital media player and media library application developed by Microsoft that is used for playing audio, video and images on personal computers running the Microsoft Windows operating system, as well as on Pocket PC and Windows Mobile-based devices. Editions of Windows Media Player were also released for the Apple Macintosh and Solaris operating systems, but have since been discontinued.\nIn addition to being a media player, Windows Media Player includes the ability to rip music from, and copy music to compact discs, synchronize content with a digital audio player (MP3 player) or other mobile devices, and let users purchase or rent music from a number of online music stores.\nWindows Media Player replaced an earlier piece of software simply called Media Player, adding features beyond simple video or audio playback. The default file formats are WMV (Windows Media Video & Audio), WMA (Windows Media Audio), and ASF (Advanced Streaming Format), and supports its own XML based playlist format called WPL (Windows Playlist).","after_content":"Windows Media Player is a media player made by Microsoft. It is already installed on Microsoft Windows operating systems, and a different version is available for some Apple Macintosh operating systems. The program allows people to watch certain video files and play music files that are in a compatible format. How the program looks can also be changed with skins, and it can be made small enough to fit on the taskbar.","before":"media player, Windows Media Player includes","after":"","before_token_range":[75,81],"after_token_range":[56,56]}
{"before_content":"Robert Thomas-Pattinson (born 13 May 1986) is an English actor, model and musician, best known for playing Edward Cullen in the film adaptation of Twilight, based on the novel by Stephenie Meyer, and Cedric Diggory in Harry Potter and the Goblet of Fire.","after_content":"Robert Thomas-Pattinson (born May 13, 1986) is an English actor, model and musician, best known for playing Edward Cullen in the movie adaptation of Twilight, and Cedric Diggory in Harry Potter and the Goblet of Fire.","before":"13May","after":"May13,","before_token_range":[3,5],"after_token_range":[3,6]}
{"before_content":"Vitellius (Latin: Aulus Vitellius Germanicus Augustus; 24 September 15 – 22 December 69), was Roman Emperor for eight months, from 16 April to 22 December 69. Vitellius was proclaimed emperor following the quick succession of the previous emperors Galba and Otho, in a year of civil war known as the Year of the Four Emperors. Vitellius was the first to add the honorific cognomen Germanicus to his name instead of Caesar upon his accession; the latter name had fallen into disrepute in many quarters because of the actions of Nero.\nHis claim to the throne was soon challenged by legions stationed in the eastern provinces, who proclaimed their commander Vespasian emperor instead. War ensued, leading to a crushing defeat for Vitellius at the Second Battle of Bedriacum in northern Italy. Once he realised his support was wavering, Vitellius prepared to abdicate in favour of Vespasian, but was executed in Rome by Vespasian's soldiers on 22 December 69.","after_content":"Aulus Vitellius Germanicus was later known as Vitellius was an Roman Emperor for eight months from 16 April to 22 December 69.\nVitellius was acclaimed emperor following quick succession of previous emperors Galba and Marcus Salvius Otho, in the year of civil war known as Year of the Four Emperors\nVitellius was the first add the honorific cognomen Germanicus to his name was instead of Caesar upon his accession; the latter name had fallen into disrepute in many quarters because of the actions of Roman Emperor Nero.","before":"","after":"later known as Vitellius was an","before_token_range":[13,13],"after_token_range":[4,10]}
{"before_content":"Stephen N. Adubato Sr. (born December 24, 1932) is an American Democratic Party politician and an educator.\nStephen N. Adubato Sr. grew up in Newark, NJ. His father died in 1950 at the age of 44. He has 4 siblings. He married Frances Calvello in 1954. They have three children, Steve Jr., Theresa and Michele.\nHe graduated from Barringer High School in Newark in 1949 and received his bachelor's degree in political science from Seton Hall University in 1954. Mr. Adubato attended Rutgers Law School, but did not complete his degree. He began his career in education as a history and government teacher in the Newark public school system, where he taught for 15 years. While teaching, he obtained a master’s degree in education from Seton Hall University in 1960 and completed the coursework for a doctorate in education. Mr. Adubato was awarded an honorary doctorate from Kean University on May 11, 2010.\nIn 1962, Adubato ran for office as a Democratic District Leader in Newark's North Ward, to which he was elected. In 1968 he was elected as North Ward Democratic party chairman.\nMr. Adubato served on the executive board of the Newark Teachers' Union and worked as their legislative representative and he was a consultant to the New Jersey chancellor of higher education.\nIn 1970, he founded The North Ward Educational and Cultural Center in a small office on the second floor of a storefront on Bloomfield Avenue in Newark. The name was latter changed to The North Ward Center. In 1973, The North Ward Center purchased the Clark Mansion, which previously housed the Prospect Country and Day School, a financially troubled private school that could not restore nor maintain the historical integrity of the facility.\nIn 1997, The North Ward Center founded the Robert Treat Academy Charter School, one of the first charter schools authorized by the New Jersey Department of Education. The school has 450 students in grades K-8. In 2008, Robert Treat was named a Blue Ribbon school by the US Department of Education. In August 2009, Robert Treat opened a second campus on in the former St. Mary's school on the campus of the Newark Abbey.\nIn August 2009, Mr. Adubato stepped down as executive director. He was succeeded by Adrianne Davis, who retired from her post as Clerk of Essex County, New Jersey. He remains active in the organization as its chief fundraiser. His daughter, Michele, became the deputy executive director of The North Ward Center.","after_content":"Stephen N. Adubato Sr. (December 24, 1932 – October 2020) was an American politician and teacher. He was born in Newark, New Jersey.\nIn 1962, Adubato ran for office as a Democratic District Leader in Newark's North Ward, to which he was elected. In 1968 he was elected as North Ward Democratic party chairman.\nHe was one the executive board of the Newark Teachers' Union and worked as their legislative representative.\nAdubato Sr. died in October 2020 in Newark at the age of 87.","before":"In 1970, he founded The North Ward Educational and Cultural Centerina small office on the second floor of a storefront on Bloomfield Avenuein Newark","after":"Adubato Sr. diedinOctober 2020in Newarkat the age of 87","before_token_range":[244,271],"after_token_range":[85,99]}
{"before_content":"Kambiz Hosseini (Persian: کامبیز حسینی) (born August 1, 1975 in Rasht, Iran) is an international award-winning Iranian satirist, writer, actor, TV and radio host based in New York. He is the current host of the political satire news show Poletik as well as a weekly podcast on human rights in Iran titled, Five in the Afternoon. He created and hosted the successful and critically acclaimed TV show Parazit on Voice of America from 2009-2012, which reached 30 million viewers worldwide.","after_content":"Kambiz Hosseini is an Iranian TV and Radio presenter in New York. He is now the presenter of the political satire news show Poletik and also a weekly podcast on human rights in Iran by the name of Five in the afternoon. He made and presented the successful TV show Parazit on the persian Voice of America from 2009-2012. this show had 30 million viewers in the world.","before":"thecurrent host","after":"nowthepresenter","before_token_range":[30,33],"after_token_range":[15,18]}
{"before_content":"Muesli (\/ˈmjuːzli\/ MEWZ-lee; Swiss German: Müesli [ˈmyə̯sli], non-Swiss Standard German: Müsli [ˈmyːsli] (listen)) is a cold breakfast cereal dish based on rolled oats and ingredients like grains, nuts, seeds and fresh or dried fruits. This mix may be combined with one or more liquids like milk, almond milk, other plant milks, yogurt, or fruit juice and left for a time to soften the oats before being consumed.\nDeveloped around 1900 by Swiss doctor Maximilian Bircher-Benner for patients in his hospital, muesli is available ready-made in prepackaged dry form, or it can be made from scratch. In Switzerland and Germany, it is also eaten as a light evening dish called Birchermüesli complet: muesli with Café complet (milk coffee, accompanied with bread, butter, and jam. (Butterbrot)).","after_content":"Muesli (pronounced as MEWZ-lee) is a type of breakfast cereal made with rolled oats and other ingredients such as grains, nuts, seeds and fresh or dried fruits. Muesli is often served with milk or yoghurt, or occasionally with fruit juice.\nMuesli was first developed in 1900 by Swiss physician Maximilian Bircher-Benner. He invented muesli so that patients in his hospital were able to eat a ready-made meal in a dry form, either made fresh or stored.","before":"cold","after":"","before_token_range":[16,17],"after_token_range":[9,9]}
{"before_content":"Nargis Rabadi (24 April 1929 – 6 March 2018), better known by her stage name Shammi, was an Indian film actress who appeared in over two hundred Hindi films. Shammi remained a sought-after with filmmakers when it came to goofy and comic roles, especially in the period 1949–1969 and later from 1980–2002. Her famous films as supporting actress included Dil Apna Aur Preet Parai, Half Ticket, Halaku, Samaj Ko Badal Dalo,Khuda Gawah, Coolie No. 1, Gopi Kishan and Hum Saath Saath Hain and films with Rajesh Khanna like The Train, Aanchal, Kudrat, Red Rose (film), Awara Baap and Swarg. She had been a leading actress playing main female lead or second female lead in Hindi films between 1949–1955 as well. Later, from 1986 till 1998, she appeared in many popular television serials such as Dekh Bhai Dekh, Zabaan Sambhal Ke, Shriman Shrimati, Kabhi Yeh Kabhi Woh and Filmi Chakkar. Shammi was married to film producer director Sultan Ahmed for seven years, before they were divorced. Shammi is the younger sister of fashion designer Mani Rabadi.","after_content":"Shammi (24 April 1929 – 6 March 2018), born Nargis Rabadi, was an Indian movie actress. She appeared in over two hundred Hindi movies. Shammi was born in Bombay, India.\nHer famous movies as supporting actress included Dil Apna Aur Preet Parai, Half Ticket, Halaku, Samaj Ko Badal Dalo,Khuda Gawah, Coolie No. 1, Gopi Kishan and Hum Saath Saath Hain and movies with Rajesh Khanna like The Train, Aanchal, Kudrat, Red Rose (movie), Awara Baap and Swarg.\nShammi died in her sleep on the March 6, 2018, from natural causes at the age of 88.","before":"She had been a leading actress playing main female lead or second female lead","after":"","before_token_range":[118,132],"after_token_range":[100,100]}
{"before_content":"An electric fish is a fish that can generate electric fields. It is said to be electrogenic; a fish that has the ability to detect electric fields is said to be electroreceptive. Most electrogenic fish are also electroreceptive. Electric fish species can be found both in the sea and in freshwater rivers of South America (Gymnotiformes) and Africa (Mormyridae). Many fish such as sharks, rays and catfishes can detect electric fields, and are thus electroreceptive, but as they cannot generate an electric field they are not classified as electric fish. Most common bony fish (teleosts), including most fish kept in aquaria or caught for food, are neither electrogenic nor electroreceptive.","after_content":"An Electric fish is a fish that can make electric fields. Fishes that can generate such fields are said to be electorgenic, those that can detect them are called electroreceptive. Most electrogenic fish are also electroreceptive. Many fish, for example sharks, rays, and catfishes are electroreceptive. They cannot generate electric fields though, and are therefore not classified as electric fish. Most bony fish are neither electrogenic nor electroreceptive.","before":"","after":"are electroreceptive.","before_token_range":[69,69],"after_token_range":[50,52]}
{"before_content":"Scott Raynor (born May 23, 1978) was the original drummer, and founding member of Blink-182 (1992-1998), until he was asked to leave the band in mid-1998. He was eventually replaced by Travis Barker. He was an avid Metallica fan in his youth. He became a drummer when he joined his first band with some friends because they called all the \"good instruments\" before Raynor could choose.\nWhen asked about his expulsion from Blink-182 in an interview, Scott said the following:\nRaynor's name was credited in Blink 182's cameo appearance in American Pie, though Travis Barker joined the band before production.\nAfter that there were some reports that Raynor was shot dead in 2003, following a dispute with his new band Grimbly. This turned out to be a hoax. He said on his message board that he is alive, but a homeless man from San Diego was apparently killed in incidents linked to the rumour.\nAlternative sources claim Raynor's departure from Blink-182 had nothing to do with his drinking habits. A fan web page claims Scott left the band in pursuit of his college degree. None of the band members have recently spoken about Raynor, hence rumours and hearsay are constantly floating about.\nSome suggested the lyrics of the song \"Man Overboard\" off the live album The Mark, Tom, and Travis Show (The Enema Strikes Back!) were directed at Raynor, but Hoppus denied this rumor when he guest presented Loveline.\nOn August 14 2006, b182.com released an exclusive interview, in which Mark Hoppus answered 20 questions, for which fans had been seeking an answer, since the hiatus of Blink-182. When asked about his thoughts on Scott Raynor, Hoppus said he would prefer not to answer, and that Raynor had discussed the matter of his own will in interviews.","after_content":"Scott Raynor (May 23, 1978) is an American drummer. He was Blink-182's drummer from 1992 to 1998, when he was told to leave the band. Now Raynor is a drummer for the bands Isinglass and One Track Mind.\nWhen asked about being removed from Blink-182 in an interview, this is what Raynor said:","before":"(born May","after":"(May","before_token_range":[2,4],"after_token_range":[2,3]}
{"before_content":"Kandiyohi County (\/kændiːˈjoʊhaɪ\/ kan-dee-YOH-hy) is a county located in the U.S. state of Minnesota. As of the 2010 census, its population was 42,239. Its county seat is Willmar.\nKandiyohi County comprises the Willmar, MN Micropolitan Statistical Area.","after_content":"Kandiyohi County is a county in the U.S. state of Minnesota. As of 2010, 42,239 people lived there. The county seat is Willmar.","before":"its population was42,239","after":"42,239people lived there","before_token_range":[23,28],"after_token_range":[18,23]}
{"before_content":"Clive Staples Lewis (29 November 1898 – 22 November 1963), commonly referred to as C. S. Lewis and known to his friends and family as \"Jack\", was an Irish-born British novelist, academic, medievalist, literary critic, essayist, lay theologian and Christian apologist. He is well known for his fictional work, especially The Screwtape Letters, The Chronicles of Narnia and The Space Trilogy.\nLewis was a close friend of J. R. R. Tolkien, and both authors were leading figures in the English faculty at Oxford University and in the informal Oxford literary group known as the \"Inklings\". According to his memoir Surprised by Joy, Lewis had been baptised in the Church of Ireland at birth, but fell away from his faith during his adolescence. Owing to the influence of Tolkien and other friends, at the age of 32 Lewis returned to Christianity, becoming \"a very ordinary layman of the Church of England\". His conversion had a profound effect on his work, and his wartime radio broadcasts on the subject of Christianity brought him wide acclaim.\nIn 1956, he married the American writer Joy Gresham, 17 years his junior, who died four years later of cancer at the age of 45.\nLewis died three years after his wife, as the result of renal failure. His death came one week before his 65th birthday. Media coverage of his death was minimal, as he died on 22 November 1963 – the same day that U.S. President John F. Kennedy was assassinated, and the same day another famous author, Aldous Huxley, died.\nLewis's works have been translated into more than 30 languages and have sold millions of copies. The books that make up The Chronicles of Narnia have sold the most and have been popularised on stage, TV, radio and cinema.","after_content":"C.S. Lewis (1898-1963) was an author and scholar was is best known for his fantasy works, most famous The Chronicles of Narniaand his essays and writings on theology and defense of modern Christianity.","before":"(29 November 1898 - 22 November 1963","after":"(1898-1963","before_token_range":[3,10],"after_token_range":[2,3]}
{"before_content":"An arteUYYry (plural arteries) (from Greek ἀρτηρία (artēria) 'windpipe, artery') is a blood vessel that takes blood away from the heart to one or more parts of the body (tissues, lungs, brain etc.). Most arteries carry oxygenated blood; the two exceptions are the pulmonary and the umbilical arteries, which carry deoxygenated blood to the organs that oxygenate it (lungs and placenta, respectively). The effective arterial blood volume is that extracellular fluid which fills the arterial system.\nThe arteries are part of the circulatory system, which is responsible for the delivery of oxygen and nutrients to all cells, as well as the removal of carbon dioxide and waste products, the maintenance of optimum blood pH, and the circulation of proteins and cells of the human immune system.","after_content":"An artery is a blood vessel that carries blood away from the heart to other parts of the body. Almost all arteries carry blood with a lot of oxygen in it. The only arteries that do not carry oxygen-rich blood are the pulmonary artery and the umbilical artery. Every artery has three layers. The outer layer is a thick covering made of stretchy tissue. The middle layer is made of muscle, so the artery can get wider or get smaller when the body needs it to. The inner lining is made of the same cells that line the heart. Arteries are deep under the skin. They do not have valves to prevent blood from flowing backwards. Instead, every time the heart beats, the arteries stretch out so the blood has room to go through. Once the walls have completely stretched out, the muscles in the arteries make them shrink back to their normal size. This pushes the blood through.","before":"arteries, which carry deoxygenated blood to the organs that oxygenate it(lungs and placenta, respectively). Theeffective arterial blood volumeisthat extracellular fluid which fills the arterial system. Thearteries are partof thecirculatory system,which is responsible forthedelivery of oxygen and nutrients to all cells, as well as the removal of carbon dioxide and waste products, themaintenance of optimumbloodpH,andthecirculation of proteins and cells ofthehuman immune system.","after":" Every artery has three layers. Theouter layerisa thick covering made of stretchy tissue. Themiddle layer is made of muscle, so the artery can get wider or get smaller when the body needs it to. The inner lining is madeof thesame cells that line the heart. Arteries are deep under the skin. They do not have valves to prevent blood from flowing backwards. Instead,every timetheheart beats, thearteries stretch out so thebloodhas room to go through. Once the walls have completely stretched out,themuscles inthearteries make them shrink back to their normal size.This pushes the blood through.","before_token_range":[48,132],"after_token_range":[50,173]}
{"before_content":"A waiter is a male who \"waits\" on tables, often at a restaurant or a bar. A female waiter is often called a waitress. The gender-neutral server and collective waitstaff can also be used.\nWaiting tables is one of the most common occupations in the U.S. (along with nursing, and teaching). The Bureau of Labor Statistics estimates that, as of May 2005, there are over 2.2 million () persons employed as waiters and waitresses in the U.S.\nWaiters' duties include preparing tables for a meal, taking customers' orders and serving drinks and food in a restaurant. Depending on the restaurant, other less common duties may be required, such as singing birthday songs to customers who are celebrating a birthday. A theme restaurant may even require waiters to dance (e.g. Joe's Crab Shack). There are now event caterers that outsource waiter\/s\/esess to events and specific functions.\n\"Silver Service\" waiters are specially trained to serve at banquets or high-end restaurants. They follow specific rules of service and it is a skilled job. They generally wear black and white with a long, white apron (extending from the waist to ankle).\nThe head waiter is in charge of the staff of waiters, and is also responsible for assigning seating. This person can also be referred to as the maître d'hôtel. Some restaurants employ busboys to assist the waiters.","after_content":"A man who works in a restaurant or cafe. He takes orders and delivers food to customers. A female waiter is a waitress. A good waiter can also help the customers by recommending the best food.","before":"Waiting tables is one of the most common occupations in the U.S.(along with nursing, and teaching). The Bureau of Labor Statistics estimates that, as of May 2005, there are over 2.2 million() persons employed as waiters and waitresses in the U.S. Waiters' duties include preparing tables for a meal, taking customers' orders and serving drinks and food in a restaurant. Depending on the restaurant, other less common duties may be required, such as singing birthday songs to customers who are celebrating a birthday. A theme restaurant may even require waiters to dance(e.g. Joe's Crab Shack). There are now event caterers that outsource waiter\/s\/esess to events and specific functions.\" Silver Service\" waiters are specially trained to serve at banquets or high-end restaurants. They follow specific rules of service and it is a skilled job. They generally wear black and white with a long, white apron(extending from the waist to ankle). The head waiter is in charge of the staff of waiters, and is also responsible for assigning seating. This person can also be referred to as the maître d'hôtel. Some restaurants employ busboys to assist the waiters.","after":"","before_token_range":[38,241],"after_token_range":[40,40]}
{"before_content":"Butanone, also known as methyl ethyl ketone (MEK),[a] is an organic compound with the formula CH3C(O)CH2CH3. This colorless liquid ketone has a sharp, sweet odor reminiscent of butterscotch and acetone. It is produced industrially on a large scale, and also occurs in trace amounts in nature. It is soluble in water and is commonly used as an industrial solvent.","after_content":"Butanone, also called methyl ethyl ketone (MEK), is an organic compound with the chemical formula CH3C(O)CH2CH3. It is a simple ketone with four carbon atoms. It smells sharp and sweet, like butterscotch and acetone mixed. It is soluble in water and is used as a solvent.","before":"This colorless liquid","after":"","before_token_range":[22,25],"after_token_range":[26,26]}
{"before_content":"Edward Paul Beck (June 28, 1936-October 16, 2019) is a former American college basketball player. He is best known as the starting center and team captain of the \"Fiddlin' Five,\" the University of Kentucky's 1958 NCAA championship team.\nBeck was recruited to play at Kentucky after scoring 1,549 points leading winning two state titles at Fort Valley High School. Beck was named team captain by head coach Adolph Rupp going into his senior season after scoring 259 points and grabbing 380 rebounds as a junior. As a senior, Beck scored 163 points and had 337 rebounds in 29 games and was named Southeastern Conference (SEC) Defensive Player of the Year. Beck finished his college career with 459 points scored (5.6 per game) and 783 rebounds (10.0 per game) in 78 total games.\nAfter his collegiate career ended Beck opted not to play professionally, turning down a contract from the New York Knicks. He decided to pursue a career in ministry and became an ordained Methodist minister after graduating from the Candler School of Theology at Emory University.","after_content":"Edward Paul Beck (June 28, 1936 – October 16, 2019) was an American college basketball player. He was best known as the starting center and team captain of the \"Fiddlin' Five,\" the University of Kentucky's 1958 NCAA championship team.\nBeck finished his college career with 459 points scored (5.6 per game) and 783 rebounds (10.0 per game) in 78 total games.\nBeck died on October 16, 2019 in Phoenix, Arizona at the age of 83.","before":"is","after":"was","before_token_range":[20,21],"after_token_range":[21,22]}
{"before_content":"Naomichi Ueda (植田 直通, Ueda Naomichi, born 24 October 1994) is a Japanese footballer who plays as a defender for Ligue 1 side Nîmes Olympique on loan from Belgian side Cercle Brugge.","after_content":"Naomichi Ueda (植田 直通, Ueda Naomichi, born October 24, 1994) is a Japanese football player. He plays for the Japan national team.","before":"Ligue 1 side Nîmes Olympique on loan from Belgian side Cercle Brugge","after":"","before_token_range":[23,35],"after_token_range":[27,27]}
{"before_content":"Mosleh Zamani (also referred to as Moslah Zamani) is a 21-year old Iranian-Kurdish boy at the risk of imminent execution for adultery. According to Iranian Criminal Code all sexual relations outside marriage are adulterous. In his case this was a relationship with his girlfriend.\nZamani was arrested at age of 17 and spent 4 years awaiting verdict. Recently, his death sentence was upheld and he could be executed at any time.\nZamani's case raised strong controversies, both because of nature of his crime and the fact he was minor at the time it took place. The Iranian government had signed the International Covenant on Civil and Political Rights and, because of this, is prohibited from sentencing minors to death.\nThe only person who has the authority to commute Zamani's death sentence is Iranian Head of the Judiciary Ayatollah Mahmoud Hashemi Shahroudi.","after_content":"Mosleh Zamani (also referred as Moslah Zamani) is now 21-year old Iranian-Kurdish boy from Sanandaj, who is facing execution for adultery (under Iranian law, every sexual contacts outside marriage, even if both people are unmarried, is adulterous).\nMosleh, who was arrested at age of 17 and spend four years in prison, was recently sentenced to death by hanging.\nHis case raised strong controversies, because of both nature of his crime and fact he was 17 year old (Iran, because of international obligations, is not permitted to sentence anyone to death for crime he or she had committed under age of 18).\nNow the only person, who could commute the death sentence is Ayatollah Mahmoud Hashemi Shahroudi, the head of the judiciary.","before":"Criminal Code all","after":"law, every","before_token_range":[28,31],"after_token_range":[24,26]}
{"before_content":"Barbara Marx Sinatra (née Blakeley; March 10, 1927 – July 25, 2017) was an American model and showgirl who was married to Zeppo Marx from 1959-1973 and was the fourth and final wife of Frank Sinatra from 1976 until his death in 1998.","after_content":"Barbara Marx Sinatra (née Blakeley; March 10, 1927 – July 25, 2017) was an American model and showgirl. She was born in Bosworth, Missouri. She was married to Zeppo Marx from 1959 to 1973 and was the fourth and final wife of Frank Sinatra from 1976 until his death in 1998.\nIn 1998, a Golden Palm Star on the Palm Springs Walk of Stars was dedicated to her.\nSinatra died on July 25, 2017 in Rancho Mirage, California of natural causes at the age of 90.","before":"","after":" She was born in Bosworth, Missouri.","before_token_range":[21,21],"after_token_range":[22,29]}
{"before_content":"WWE SmackDown! Here Comes the Pain (Known as Exciting Pro Wrestling 5 in Japan) is a video game released on the PlayStation 2 console by THQ on October 27, 2003. It is a sequel to WWE SmackDown! Shut Your Mouth and is part of the WWE SmackDown! series based on World Wrestling Entertainment's weekly TV show of the same name. It was the first SmackDown! game to feature a catchphrase not linked back to The Rock in its title. It was also the final WWE game under the SmackDown! name and it was succeeded by WWE SmackDown! vs. Raw.","after_content":"WWE SmackDown! Here Comes the Pain is a professional wrestling video game developed by Yuke's and published by THQ. The game was known as Exciting Pro Wrestling 5 in Japan.\nIt was released on October 27, 2003 in North America, November 7, 2003 in Europe and on January 29, 2004 in Japan. The game was the first in the WWE SmackDown! video game series and is the sequel to WWE SmackDown! Shut Your Mouth. It was the last game under the SmackDown! title and was followed by WWE SmackDown! vs. Raw.","before":") is a video game","after":". It was","before_token_range":[15,20],"after_token_range":[32,36]}
{"before_content":"Marietta Giannakou (Greek: Μαριέττα Γιαννάκου, 6 June 1951 – 27 February 2022) was a Greek politician, member of New Democracy. She served as Minister for National Education and Religious Affairs of Greece.","after_content":"Marietta Giannakou (Greek: Μαριέττα Γιαννάκου, 6 June 1951 – 27 February 2022) was a Greek politician. She was a member of the New Democracy Party. Giannakou was born in Geraki Lakonias, Greece. From 2004 until 2007, she was the Minister of Education. Giannakou was a Member of the European Parliament from 2009 until 2014.\nIn January 2022, Giannakou was hospitalized in Athens, Greece after falling from her wheelchair and suffering a subdural hematoma. She died of a heart attack on 27 February 2022, aged 70.","before":"","after":" In January 2022, Giannakou was hospitalized in Athens, Greece after falling from her wheelchair and suffering a subdural hematoma","before_token_range":[24,24],"after_token_range":[62,82]}
