{"before_content":"Kandiyohi County (\/kændiːˈjoʊhaɪ\/ kan-dee-YOH-hy) is a county located in the U.S. state of Minnesota. As of the 2010 census, its population was 42,239. Its county seat is Willmar.\nKandiyohi County comprises the Willmar, MN Micropolitan Statistical Area.","after_content":"Kandiyohi County is a county in the U.S. state of Minnesota. As of 2010, 42,239 people lived there. The county seat is Willmar.","before":"its population was42,239","after":"42,239people lived there","before_token_range":[23,28],"after_token_range":[18,23]}
{"before_content":"George Corley Wallace, Jr. (August 25, 1919 – September 13, 1998), was a governor of Alabama for four terms; 1963–1967, 1971–1979 and 1983–1987. \"The most influential loser\" in 20th-century U.S. politics, according to biographers Dan T. Carter and Stephan Lesher, he ran for US president four times, running officially as a Democrat three times and in the American Independent Party once. A 1972 assassination attempt left him wheel-chair bound. He is best known for his Southern populist pro-segregation attitudes during the American desegregation period, convictions he renounced later in life.","after_content":"George Corley Wallace (born August 25, 1919 – died September 13, 1998) was an American politician. He served as Governor of Alabama serving from 1963 to 1967.\nWallace was born in Cilio, Alabama. When Wallace was running for President, he was shot and paralyzed for the rest of his life. His is known for having different views on segregation. He was a Democrat.\nWallace died at the age of 79 from a spinal infection after 26 years of being in a wheelchair.","before":"was agovernorof","after":" Hewas aDemocrat. Wallace died at the ageof79 from a spinal infection after 26 years of being in a wheelchair","before_token_range":[16,20],"after_token_range":[67,92]}
{"before_content":"Fela Kuti (born Olufela Olusegun Oludotun Ransome-Kuti; 15 October 1938 – 2 August 1997), also known as Fela Anikulapo Kuti or simply Fela, was a Nigerian multi-instrumentalist, musician, composer, pioneer of the Afrobeat music genre, human rights activist, and political maverick.","after_content":"Fela Anikulapo Kuti (15 October 1938 – 2 August 1997), or just Fela, was a Nigerian musician and composer who was very important in a genre called afrobeat. He played the saxophone, guitar, drums, keyboards and trumpet, and he sang. He was also a human rights activist. The American singer James Brown said that Kuti was one of the originators (starters) of the funk genre.\nKuti died in 1997 of Kaposi's sarcoma, an illness caused by AIDS. In 2008 a musical production called Fela! was created, about Kuti's life and career.","before":"musician,composer,","after":"guitar,drums,keyboards and trumpet","before_token_range":[31,35],"after_token_range":[37,44]}
{"before_content":"Ralph Steven Greco (born May 25, 1942) was the Johnson and Johnson Distinguished Professor, Emeritus of Surgery at Stanford University School of Medicine. He was a leader of the resident Well Being in surgery movement and surgical training program leader.\nDr.Ralph Greco died in 31 of March at his home on the Stanford campus, surrounded by family. He was 76.\nThe cause of death was prostate cancer","after_content":"Ralph Steven Greco (May 25, 1942 – March 31, 2019) was an American surgeon and sculptor. He was the Johnson and Johnson Distinguished Professor, Emeritus of Surgery at Stanford University School of Medicine. He was well-known for his advocacy for the well-being of surgery residents. He retired from Stanford in 2017.\nGreco was born in the Bronx, a borough of New York City. He went to Yale University. He was married to Irene L. Wapnir. The couple had three children.\nGreco died from prostate cancer on March 31, 2019 in Stanford, California. He was 76.","before":"","after":"was an American surgeon and sculptor.","before_token_range":[9,9],"after_token_range":[12,18]}
{"before_content":"MacKinlay Kantor (February 4, 1904 – October 11, 1977), born Benjamin McKinlay Kantor, was an American journalist, novelist and screenwriter. He wrote more than 30 novels, several based on the American Civil War, and won the Pulitzer Prize for Fiction in 1956 for his 1955 novel Andersonville, about the Confederate prisoner of war camp. (The novel is often erroneously believed to have been the basis for the stage play and TV movie The Andersonville Trial (1970), as well as for the TV mini-series Andersonville (1995), but neither of those films have any connection to Kantor's work.)","after_content":"Benjamin McKinlay Kantor (or MacKinlay Kantor; February 4, 1904 – October 11, 1977) was an American journalist and novelist who received a Pulitzer Prize for Fiction in 1956. He wrote out over 30 novels, several set in the American Civil War. Kantor was born in Webster City, Iowa; he died from a heart attack at seventy-three in Sarasota, Florida.","before":"for his 1955 novel Andersonville","after":"","before_token_range":[48,53],"after_token_range":[39,39]}
{"before_content":"Kambiz Hosseini (Persian: کامبیز حسینی) (born August 1, 1975 in Rasht, Iran) is an international award-winning Iranian satirist, writer, actor, TV and radio host based in New York. He is the current host of the political satire news show Poletik as well as a weekly podcast on human rights in Iran titled, Five in the Afternoon. He created and hosted the successful and critically acclaimed TV show Parazit on Voice of America from 2009-2012, which reached 30 million viewers worldwide.","after_content":"Kambiz Hosseini is an Iranian TV and Radio presenter in New York. He is now the presenter of the political satire news show Poletik and also a weekly podcast on human rights in Iran by the name of Five in the afternoon. He made and presented the successful TV show Parazit on the persian Voice of America from 2009-2012. this show had 30 million viewers in the world.","before":"thecurrent host","after":"nowthepresenter","before_token_range":[30,33],"after_token_range":[15,18]}
{"before_content":"In organized sports, point shaving is what Cody Parkey specializes in, the Eagles paid him on 1\/6\/19 to miss the final kick and he followed through with it, he gets paid on 1\/7\/19. Unlike other forms of sports betting, spread betting invariably motivates point shaving. A point shaving scheme generally involves a sports gambler and one or more players of the team favored to win the game. In exchange for a bribe, the player or players agree to ensure that their team will not \"cover the point spread\" (i.e. the bribed player's team may still win, but by not as big a margin as predicted by bookmakers). The gambler then wagers against the bribed team. Alternatively, an official (referee) of the game may be bribed, or even bet on his own behalf, so that one or more \"close calls\" will be called in favor of the \"underdog\" rather than the team favored to win.","after_content":"In sports, point shaving, is a certain type of match fixing where basketball or other sports players try to prevent a team from covering a published point spread. Spread betting usually motivates point shaving. The point shaving scheme usually involves a sports gambler and several players who are likely to win the game. In exchange for a bribe, the players agree to making sure the team they are on will not cover the point spread. The gamblers then wager against the bribed team.","before":"gambler","after":"gamblers","before_token_range":[118,119],"after_token_range":[83,84]}
{"before_content":"Daniel Defoe (\/dɪˈfoʊ\/; 13 September 1660 - 24 April 1731), born Daniel Foe, was an English trader, writer, journalist, pamphleteer and spy. He is most famous for his novel Robinson Crusoe, which is second only to the Bible in its number of translations. Defoe is noted for being one of the earliest proponents of the novel, as he helped to popularise the form in Britain with others such as Aphra Behn and Samuel Richardson, and is among the founders of the English novel.\nDefoe wrote many political tracts and often was in trouble with the authorities, including prison time. Intellectuals and political leaders paid attention to his fresh ideas and sometimes consulted with him.\nDefoe was a prolific and versatile writer, producing more than three hundred works—books, pamphlets, and journals—on diverse topics, including politics, crime, religion, marriage, psychology, and the supernatural. He was also a pioneer of business journalism and economic journalism.","after_content":"Daniel Defoe (Born 13 September 1660 and died 24 April 1731) was an trader, writer, and journalist from England. His best known work is the novel Robinson Crusoe. In some languages, it is sold as number 2 bestseller, after the Bible.","before":"Heismost famous for his","after":"His best known workisthe","before_token_range":[28,34],"after_token_range":[23,29]}
{"before_content":"Scott Raynor (born May 23, 1978) was the original drummer, and founding member of Blink-182 (1992-1998), until he was asked to leave the band in mid-1998. He was eventually replaced by Travis Barker. He was an avid Metallica fan in his youth. He became a drummer when he joined his first band with some friends because they called all the \"good instruments\" before Raynor could choose.\nWhen asked about his expulsion from Blink-182 in an interview, Scott said the following:\nRaynor's name was credited in Blink 182's cameo appearance in American Pie, though Travis Barker joined the band before production.\nAfter that there were some reports that Raynor was shot dead in 2003, following a dispute with his new band Grimbly. This turned out to be a hoax. He said on his message board that he is alive, but a homeless man from San Diego was apparently killed in incidents linked to the rumour.\nAlternative sources claim Raynor's departure from Blink-182 had nothing to do with his drinking habits. A fan web page claims Scott left the band in pursuit of his college degree. None of the band members have recently spoken about Raynor, hence rumours and hearsay are constantly floating about.\nSome suggested the lyrics of the song \"Man Overboard\" off the live album The Mark, Tom, and Travis Show (The Enema Strikes Back!) were directed at Raynor, but Hoppus denied this rumor when he guest presented Loveline.\nOn August 14 2006, b182.com released an exclusive interview, in which Mark Hoppus answered 20 questions, for which fans had been seeking an answer, since the hiatus of Blink-182. When asked about his thoughts on Scott Raynor, Hoppus said he would prefer not to answer, and that Raynor had discussed the matter of his own will in interviews.","after_content":"Scott Raynor (May 23, 1978) is an American drummer. He was Blink-182's drummer from 1992 to 1998, when he was told to leave the band. Now Raynor is a drummer for the bands Isinglass and One Track Mind.\nWhen asked about being removed from Blink-182 in an interview, this is what Raynor said:","before":"(born May","after":"(May","before_token_range":[2,4],"after_token_range":[2,3]}
{"before_content":"Tonight is the fourth extended play by the South Korean boy band Big Bang, released under YG Entertainment. It was their first new materials released in South Korea after two-year hiatus as a group. Their comeback was met with mostly positive receptions, with the lead-single of the same name becoming a chart topper on the Gaon Chart.","after_content":"Tonight is the 4th extended play of South Korean band, Big Bang. It is released under YG Entertainment.","before":"by the","after":"of","before_token_range":[6,8],"after_token_range":[6,7]}
{"before_content":"WWE SmackDown! Here Comes the Pain (Known as Exciting Pro Wrestling 5 in Japan) is a video game released on the PlayStation 2 console by THQ on October 27, 2003. It is a sequel to WWE SmackDown! Shut Your Mouth and is part of the WWE SmackDown! series based on World Wrestling Entertainment's weekly TV show of the same name. It was the first SmackDown! game to feature a catchphrase not linked back to The Rock in its title. It was also the final WWE game under the SmackDown! name and it was succeeded by WWE SmackDown! vs. Raw.","after_content":"WWE SmackDown! Here Comes the Pain is a professional wrestling video game developed by Yuke's and published by THQ. The game was known as Exciting Pro Wrestling 5 in Japan.\nIt was released on October 27, 2003 in North America, November 7, 2003 in Europe and on January 29, 2004 in Japan. The game was the first in the WWE SmackDown! video game series and is the sequel to WWE SmackDown! Shut Your Mouth. It was the last game under the SmackDown! title and was followed by WWE SmackDown! vs. Raw.","before":") is a video game","after":". It was","before_token_range":[15,20],"after_token_range":[32,36]}
{"before_content":"The Oxford English Dictionary (OED), published by the Oxford University Press, is a descriptive (as opposed to prescriptive) dictionary of the English language. As well as describing English usage in its many variations throughout the world, it traces the historical development of the language, providing a comprehensive resource to scholars and academic researchers. The second edition, published in 1989, came to 21,728 pages in 20 volumes.\nAlthough work had begun on the dictionary in 1857, it was not until 1884 that it began to be published, in unbound fascicles as work continued on the project, under the name of A New English Dictionary on Historical Principles; Founded Mainly on the Materials Collected by The Philological Society. In 1895 the title The Oxford English Dictionary (OED) was first used unofficially on the covers of the series, and in 1928 the full dictionary was republished in ten bound volumes. In 1933 the title The Oxford English Dictionary fully replaced the former name in all occurrences in its reprinting as twelve volumes with a one-volume supplement. More supplements came over the years until 1989, when the second edition was published. Since 2000, a third edition of the dictionary has been underway, approximately a third of which is now complete.\nThe first electronic version of the dictionary was made available in 1988. The online version has been available since 2000, and as of April 2014 was receiving over two million hits per month. The third edition of the dictionary will probably only appear in electronic form; the chief executive of Oxford University Press, Nigel Portwood, feels it unlikely that it will ever be printed.","after_content":"The Oxford English Dictionary (or OED) is a dictionary. It is published by the Oxford University Press in England, and is the largest English dictionary.\nIt traces the historical development of the English language, and is a resource to writers and scholars. It describes how the language has been used.\nThe second edition came to 21,728 pages in 20 volumes, published in 1989.\nWork began on the dictionary in 1857, but it was not until 1884 that it began to be published in parts, under the name of A New English Dictionary on historical principles; founded mainly on the materials collected by the Philological Society. In 1895, the title The Oxford English Dictionary (OED) was first used unofficially on the covers of the series, and in 1928 the full dictionary was republished in ten bound volumes. In 1933, the The Oxford English Dictionary was reprinted as twelve volumes with a one-volume supplement. More supplements came over the years until 1989, when the second edition was published. Since 2000, a third edition of the dictionary has been underway, approximately a third of which is now complete.\nThe first electronic version of the dictionary was done in 1988. The online version has been available since 2000, and as of April 2014 was receiving over two million hits per month. The third edition of the dictionary will probably only appear in electronic form; Nigel Portwood, chief executive of Oxford University Press, feels it unlikely that it will ever be printed.","before":"","after":"English","before_token_range":[46,46],"after_token_range":[35,36]}
{"before_content":"Vitellius (Latin: Aulus Vitellius Germanicus Augustus; 24 September 15 – 22 December 69), was Roman Emperor for eight months, from 16 April to 22 December 69. Vitellius was proclaimed emperor following the quick succession of the previous emperors Galba and Otho, in a year of civil war known as the Year of the Four Emperors. Vitellius was the first to add the honorific cognomen Germanicus to his name instead of Caesar upon his accession; the latter name had fallen into disrepute in many quarters because of the actions of Nero.\nHis claim to the throne was soon challenged by legions stationed in the eastern provinces, who proclaimed their commander Vespasian emperor instead. War ensued, leading to a crushing defeat for Vitellius at the Second Battle of Bedriacum in northern Italy. Once he realised his support was wavering, Vitellius prepared to abdicate in favour of Vespasian, but was executed in Rome by Vespasian's soldiers on 22 December 69.","after_content":"Aulus Vitellius Germanicus was later known as Vitellius was an Roman Emperor for eight months from 16 April to 22 December 69.\nVitellius was acclaimed emperor following quick succession of previous emperors Galba and Marcus Salvius Otho, in the year of civil war known as Year of the Four Emperors\nVitellius was the first add the honorific cognomen Germanicus to his name was instead of Caesar upon his accession; the latter name had fallen into disrepute in many quarters because of the actions of Roman Emperor Nero.","before":"","after":"later known as Vitellius was an","before_token_range":[13,13],"after_token_range":[4,10]}
{"before_content":"\/\/Anonymous Activity Fox Business (officially known as Fox Business Network) is an American business news channel owned by the Fox News Media division of Fox Corporation. The channel broadcasts primarily from studios at 1211 Avenue of the Americas in Midtown ManhattanLaunched on October 15, 2007, the network features trading day coverage and a nightly lineup of opinion-based talk shows.\nDay-to-day operations are run by Kevin Magee, executive vice president of Fox News; Neil Cavuto is the vice president and managing editor for the network and business news operation overall.\nAs of February 2015, Fox Business Network is available to approximately 74,224,000 pay television households (63.8% of households with television) in the United States.","after_content":"Fox Business (officially known as Fox Business Network) is an American business news channel owned by the Fox News Media division of Fox Corporation. The channel broadcasts primarily from studios at 1211 Avenue of the Americas in Midtown Manhattan. Launched on October 15, 2007, the network features trading day coverage and a nightly lineup of opinion-based talk shows.\nDay-to-day operations are run by Kevin Magee, executive vice president of Fox News; Neil Cavuto is the vice president and managing editor for the network and business news operation overall.[source?]\nAs of February 2015, Fox Business Network is available to approximately 74,224,000 pay television households (63.8% of households with television) in the United States.","before":".","after":".[source?]","before_token_range":[96,97],"after_token_range":[96,98]}
{"before_content":"Orsa is a town (pop. 5,200) in Dalarna, Sweden and the seat of Orsa Municipality, Dalarna County.","after_content":"Orsa is an urban area in the county of Dalarna in Sweden. It is the seat of Orsa Municipality.","before":"","after":"an urban area in the county of Dalarna in Sweden","before_token_range":[2,2],"after_token_range":[2,12]}
{"before_content":"Naomichi Ueda (植田 直通, Ueda Naomichi, born 24 October 1994) is a Japanese footballer who plays as a defender for Ligue 1 side Nîmes Olympique on loan from Belgian side Cercle Brugge.","after_content":"Naomichi Ueda (植田 直通, Ueda Naomichi, born October 24, 1994) is a Japanese football player. He plays for the Japan national team.","before":"Ligue 1 side Nîmes Olympique on loan from Belgian side Cercle Brugge","after":"","before_token_range":[23,35],"after_token_range":[27,27]}
{"before_content":"The WWE SmackDown Tag Team Championship is a professional wrestling world tag team championship created and promoted by the American professional wrestling promotion WWE on the SmackDown brand. It is one of two tag team championships for WWE's main roster, along with the Raw Tag Team Championship on the Raw brand. The current champions are American Alpha, who are in their first reign, both as a team and individually.\nUnveiled on the August 23, 2016 episode of SmackDown Live, it was created to be the counterpart title to the then-WWE Tag Team Championship, which became exclusive to Raw as a result of the 2016 WWE draft. That title was subsequently renamed after the crowning of the inaugural SmackDown Tag Team Champions, Heath Slater and Rhyno.","after_content":"The WWE SmackDown Tag Team Championship is a wrestling title owned by WWE. It was created for the SmackDown Live brand after the return of the brand extension. The WWE Tag Team Championship became exclusive of Raw. The first champions were Heath Slater and Rhyno and current champions are American Alpha.","before":"on the","after":"","before_token_range":[49,51],"after_token_range":[38,38]}
{"before_content":"Robert Thomas-Pattinson (born 13 May 1986) is an English actor, model and musician, best known for playing Edward Cullen in the film adaptation of Twilight, based on the novel by Stephenie Meyer, and Cedric Diggory in Harry Potter and the Goblet of Fire.","after_content":"Robert Thomas-Pattinson (born May 13, 1986) is an English actor, model and musician, best known for playing Edward Cullen in the movie adaptation of Twilight, and Cedric Diggory in Harry Potter and the Goblet of Fire.","before":"13May","after":"May13,","before_token_range":[3,5],"after_token_range":[3,6]}
{"before_content":"My Favorite Year is a 1982 American comedy film written by Dennis Palumbo and Norman Steinberg, and directed by Richard Benjamin, which tells the story of a young comedy writer. It stars Peter O'Toole, Mark Linn-Baker, Jessica Harper, Joseph Bologna, Lou Jacobi, Bill Macy, Lainie Kazan, Selma Diamond, Cameron Mitchell, and Gloria Stuart. O'Toole was nominated for the Academy Award for Best Actor. The film was adapted into an unsuccessful 1992 Broadway musical of the same name.","after_content":"My Favorite Year is a 1982 American comedy movie. It was directed by Richard Benjamin. It stars Peter O'Toole, Mark Linn-Baker, Jessica Harper, and Joseph Bologna. It was released on October 1, 1982.","before":"Lou Jacobi, Bill Macy, Lainie Kazan, Selma Diamond, Cameron Mitchell, and Gloria Stuart","after":"","before_token_range":[47,60],"after_token_range":[42,42]}
{"before_content":"Altnau is a municipality in the district of Kreuzlingen, in the canton of Thurgau, Switzerland.","after_content":"Altnau is a municipality of the district of Kreuzlingen in the canton of Thurgau in Switzerland.","before":",","after":"","before_token_range":[9,10],"after_token_range":[9,9]}
{"before_content":"A shingle beach is a beach which is armoured with pebbles or small- to medium-sized cobbles. Typically, the stone composition may grade from characteristic sizes ranging from two to 200 mm diameter. The name derives from the beach's resemblance to the surface of a composition roof shingle. While this beach landform is most commonly associated with Western Europe, examples are found in Bahrain, the United States and in a number of other world regions, such as the east coast of New Zealand's South Island, where they are associated with the shingle fans of braided rivers.\nThe ecosystems formed by this unique association of rock and sand allow colonization by a variety of rare and endangered species.","after_content":"A shingle beach is a beach which is formed of pebbles. These beaches strongly resist erosion by waves.\nThis beach landform is quite common in Western Europe, because the pebbles come from the lines of flint in the chalk. When the chalk erodes, the tough flint stays as pebbles.\nOther examples are found in Bahrain, North America and in a number of other world regions. On the east coast of New Zealand's South Island, there are mixed shingle and sand fans amongst braided rivers. The ecosystems formed by this mix of pebbles and sand allow colonization by rare and endangered species.","before":"","after":"and sand","before_token_range":[99,99],"after_token_range":[88,90]}
{"before_content":"Sergio Augusto Magaña Martínez (2 December 1949 – 25 December 2017) was a Mexican politician affiliated with the Party of the Democratic Revolution (formerly to the Institutional Revolutionary Party). From 2014 to 2017 he served as Deputy of the LIX Legislature of the Mexican Congress as a plurinominal representative and as Senator of the LVI and LVII Legislatures.\nHe also was Mayor of Morelia from 1993 to 1994.\nHe died on 25 December 2017 at the age of 68.","after_content":"Sergio Augusto Magaña Martínez (2 December 1949 – 25 December 2017) was a Mexican politician. He was a member with the Party of the Democratic Revolution (formerly to the Institutional Revolutionary Party). From 2014 to 2017 he served as Deputy of the LIX Legislature of the Mexican Congress as a plurinominal representative and as Senator of the LVI and LVII Legislatures.\nHe also was mayor of Morelia from 1993 to 1994.\nMagaña died on 25 December 2017 at the age of 68.","before":"He","after":"Magaña","before_token_range":[73,74],"after_token_range":[78,79]}
{"before_content":"The Pharaoh Hound is a Maltese breed of dog and the national dog of Malta. In Maltese it is called Kelb tal-Fenek, which means \"rabbit dog\". It is traditionally used for hunting rabbit in the Maltese Islands.\nBased on DNA analysis, the breed has no link with Ancient Egypt. However, a popular myth holds that the breed is descended from the Tesem, one of the ancient Egyptian hunting dogs. Some believe that there are similarities between the breed and images of dogs found on the walls of ancient Egyptian tombs. This myth proposes that the Pharaoh Hound was brought by the Phoenicians to Malta, where it has existed for over 2,000 years.\nThe breed has variously been classified as a member of the sighthound group.","after_content":"The Pharaoh Hound is a breed of dog. Pharaoh Hounds are special because of their fur is always bright orange in colour. They needs lots of exercise, and they are fast runners and can jump high. They need little brushing because their fur is very short. In the past people used them to hunt rabbits.","before":"andthe national dog of Malta. In","after":". Pharaoh Hounds are special because of their fur is always bright orange in colour. They needs lots of exercise,andthey are fast runners and can jump high. They need little brushing because their fur is very short. Inthe past people used them to hunt rabbits","before_token_range":[9,17],"after_token_range":[8,60]}
{"before_content":"Echuca (\/əˈtʃuːkə\/ ə-CHOO-kə) is a town located on the banks of the Murray River and Campaspe River in Victoria, Australia. The border town of Moama is adjacent on the northern side of the Murray River in New South Wales. Echuca is the administrative centre and largest settlement in the Shire of Campaspe. As of the 2011 census, Echuca had a population of 13,708. The population of the combined Echuca and Moama townships was estimated be 20,365 at June 2015.\nEchuca, an Aboriginal name meaning \"Meeting of the Waters\", is indicative of the role rivers have played in the town's existence. Echuca is situated close to the junction of the Goulburn, Campaspe, and Murray Rivers. Its position at the closest point of the Murray to Melbourne contributed to its development as a thriving river port city during the 19th century.","after_content":"Echuca (\/[invalid input: 'icon']əˈtʃuːkə\/ ə-CHOO-kə) is a city on the banks of the Murray River and Campaspe River in Victoria, Australia. On the other bank of the Murray is the New South Wales town of Moama. Echuca is the administrative centre and largest town in the Shire of Campaspe. In 2011 there were 14,190 people living in Echuca. Echuca is an Aboriginal word meaning \"Meeting of the Waters\". Echuca is close to the junction of the Goulburn, Campaspe and Murray Rivers. It is the closest point of the Murray to Melbourne. This meant it developed as a river port during the 19th century.","before":"The bordertown of Moamais adjacent on the northern side of the Murray River in New South Wales","after":"On the other bank of the Murray is the New South Walestown of Moama","before_token_range":[23,42],"after_token_range":[23,38]}
{"before_content":"The iPad is a tablet computer developed by Apple Inc. Announced on January 27, 2010, it is Apple first tablet computer and it fits into the device category between a smartphone and a laptop computer. Similar in functionality to a larger and more powerful iPhone or iPod touch, it runs a modified version of the same operating system (iPhone OS). Its stock applications have been redesigned to take advantage of the larger screen with added functionality similar to their Mac OSX counterparts.\nThe iPad has a 9.7-inch (25 cm) LED backlit multi-touch display with a pixel resolution of 1024x768, 16 to 64 gigabytes (GB) of flash memory, a 1-gigahertz (GHz) Apple A4 processor, Bluetooth 2.1, and a 30-pin dock connector to sync with iTunes and connect wired accessories.\nTwo models have been announced: one with 802.11n Wi-Fi and one with 802.11n Wi-Fi and 3G (which can connect to HSDPA cellular networks), and Assisted GPS. Both models may be purchased with three different memory capacities.\nAs Apple's first device to use its iBookstore service and companion iBooks ebook reading application, the iPad has been compared to Amazon's Kindle.","after_content":"The iPad is the first tablet computer made by Apple Inc. Apple introduced it on January 27, 2010. It falls somewhere between a smartphone and a laptop computer in the way it works.","before":"Announced","after":"Apple introduced it","before_token_range":[11,12],"after_token_range":[12,15]}
{"before_content":"The Honda CR-V is a compact SUV, manufactured since 1995 by Honda. It was loosely derived from the Honda Civic. There are discrepancies as to what \"CR-V\" stands for. Mike Danko states that it stands for \"Comfortable Runabout Vehicle\", although sales literature in the UK has reportedly made references to \"Compact Recreational Vehicle\". It actually stands for Civic Recreational Vehicle. Honda began producing the CR-V in Sayama, Japan, and Swindon, UK, for worldwide markets, adding North American manufacturing sites in East Liberty, Ohio, in 2007; El Salto, Jalisco, Mexico, in late 2007; and Alliston, Ontario, Canada, in 2012. The CR-V also is produced in Wuhan (Hubei province) for the Chinese market by the Dongfeng Honda Automobile Company, a joint venture with Dongfeng Motor Corporation.\nThe CR-V is Honda's second smallest utility vehicle, slotting between the smaller HR-V and the larger Pilot.","after_content":"The Honda CR-V is a compact SUV, manufactured since 1995 by Honda. It was loosely based on the Honda Civic. It debuted in Japan in 1996. In 1997 the the five-passenger compact utility vehicle was introduced in North America. At first it was available only as a four-wheel drive model. It was powered by a 126-horsepower 2.0-liter four-cylinder engine. Honda first began producing the CR-V in Sayama, Japan, and Swindon, UK, for worldwide markets. It added North American manufacturing sites in East Liberty, Ohio, in 2007; El Salto, Jalisco, Mexico, in late 2007; and Alliston, Ontario, Canada, in 2012. The CR-V also is produced in Wuhan (Hubei province) for the Chinese market by the Dongfeng Honda Automobile Company. They are a joint venture with Dongfeng Motor Corporation. The CR-V is Honda's second smallest utility vehicle, slotting between the smaller HR-V and the larger Pilot. In 2015 the CR-V was named Motor Trend SUV of the year.","before":", adding","after":" It added","before_token_range":[84,86],"after_token_range":[87,90]}
{"before_content":"Eudora is a city in Douglas County, Kansas, United States. The city is located along the Kansas and Wakarusa Rivers. As of the 2010 census, the city population was 6,136.","after_content":"Eudora is a city in Douglas County, Kansas, United States. The city is along the Kansas River and the Wakarusa River. In 2010, 6,136 people lived there.","before":"located","after":"","before_token_range":[16,17],"after_token_range":[16,16]}
{"before_content":"{JAMES HAS no life\nThe Crow, called the Apsáalooke in their own Siouan language, or variants including Absaroka, are Native Americans, who in historical times lived in the Yellowstone River valley, which extends from present-day Wyoming, through Montana and into North Dakota, where it joins the Missouri River. Today, they are enrolled in the federally recognized Crow Tribe of Montana.\nPressured by the Ojibwe and Cree peoples (the Iron Confederacy), who had earlier and better access to guns through the fur trade, they had migrated there from the Ohio Eastern Woodland area to settle south of Lake Winnipeg, Canada. From there, they were pushed to the west by the Cheyennes. Both the Crow and the Cheyennes were then pushed farther west by the Lakota (Sioux), who took over the territory from the Black Hills of South Dakota to the Big Horn Mountains of Montana; the Cheyennes finally became close allies of the Sioux, but the Crows remained bitter enemies of both Sioux and Cheyennes. The Crow were generally friendly with the whites and managed to retain a large reservation of over 9300 km2 despite territorial losses.\nSince the 19th century, Crow people have been concentrated on their reservation established south of Billings, Montana. They also live in several major, mainly western, cities. Tribal headquarters are located at Crow Agency, Montana.","after_content":"The Crow (also known as Apsáalooke in their own Siouan language, or Absaroka) are Native Americans. In the past, they lived in the Yellowstone River valley, which is in Wyoming, Montana, and North Dakota. Today, they are federally recognized as the Crow Tribe of Montana.\nDuring their history, the Crow have changed their territory many times because of conflicts with the Ojibwe, Cree, Cheyennes, and Lakota (Sioux) peoples. They were generally friendly with the whites. Since the 19th century, most Crow people have lived on their reservation that is south of Billings, Montana. Although they have lost land, it is over 9300 km2. They also live in several major western cities. The tribe's headquarters are located at Crow Agency, Montana.","before":", mainly","after":"","before_token_range":[226,228],"after_token_range":[128,128]}
{"before_content":"Donald Newcombe (June 14, 1926 – February 19, 2019), nicknamed Newk, was an American professional baseball pitcher in Negro league and Major League Baseball who played for the Newark Eagles (1944-45), Brooklyn\/Los Angeles Dodgers (1949–51 and 1954–58), Cincinnati Reds (1958–60), and Cleveland Indians (1960).\nNewcombe was the first pitcher to win the Rookie of the Year, Most Valuable Player, and Cy Young Awards during his career. This distinction would not be achieved again until 2011, when Detroit Tigers pitcher Justin Verlander accomplished the feat. In 1949, he became the first black pitcher to start a World Series game. In 1951, Newcombe was the first black pitcher to win twenty games in one season. In 1956, the inaugural year of the Cy Young Award, he became the first pitcher to win the National League MVP and the Cy Young in the same season.\nAn excellent hitter among pitchers, Newcombe compiled a career batting average of .271 with 15 home runs and was used as a pinch hitter, a rarity for pitchers.","after_content":"Donald Newcombe (June 14, 1926 – February 19, 2019), nicknamed \"Newk\", was an American professional baseball pitcher in Negro league and Major League Baseball. He played for the Newark Eagles (1944–45), Brooklyn\/Los Angeles Dodgers (1949–1951 and 1954–58), Cincinnati Reds (1958–1960), and Cleveland Indians (1960). Newcombe was born in Madison, New Jersey. He died on February 19, 2019 in Los Angeles from a long-illness, aged 92.","before":"who","after":". He","before_token_range":[29,30],"after_token_range":[31,34]}
{"before_content":"Paul Muegge (September 28, 1936 – August 16, 2021) was an American politician who served in the Oklahoma Senate from the 20th district from 1990 to 2002.\nMuegge graduated from Lamont High School.\nHe died on August 16, 2021, in Tonkawa, Oklahoma at age 84.","after_content":"Paul Muegge (September 28, 1936 – August 16, 2021) was an American politician. He was a member of the Oklahoma Senate from the 20th district from 1990 to 2002. He was a member of the Democratic Party. Muegge was born in Lamont, Oklahoma.\nMuegge died on August 16, 2021, in Tonkawa, Oklahoma at age 84.","before":"He","after":"Muegge","before_token_range":[38,39],"after_token_range":[51,52]}
{"before_content":"The mathematical constant e is the base of the natural logarithm. It is occasionally called Euler's number after the Swiss mathematician Leonhard Euler, or Napier's constant in honor of the Scottish mathematician John Napier who introduced logarithms. (e is not to be confused with γ – the Euler-Mascheroni constant – which is itself sometimes called Euler's constant.) e is one of the most important numbers in mathematics, alongside the additive and multiplicative identities 0 and 1, the imaginary unit i, and π, the circumference to diameter ratio for any circle. It has a number of equivalent definitions; some of them are given below. To the 20th decimal place:\nRegrouping the digits after the decimals thus gives a form of e that is easy to remember:\n2.7 1828 1828 45 90 45\nNote also that 45 is half of 90.","after_content":"e is a mathematical constant forming the basis of the natural logarithm and it is one of the most important numbers in mathematics. e is an irrational number, like π. To the 20th decimal place:\ne ≈ 2.71828182845904523536","before":".","after":"and it","before_token_range":[11,12],"after_token_range":[12,14]}
{"before_content":"Nestorius (in Greek: Νεστόριος; c. 386–c. 451) was Archbishop of Constantinople from 10 April 428 to 22 June 431. He was accused by his political enemy, Cyril of Alexandria, of Nestorianism because he objected to the popular practise of calling the Virgin Mary the \"Mother of God\" theotokos. He was condemned at the Council of Ephesus before his supporters could arrive and dethroned. His views were widely held in the East, and the consequence was the creation of the Assyrian Church of the East, over the Persian border and hence beyond Greek political control.","after_content":"Nestorius (in Greek: Νεστόριος; c. 386–c. 451) was Archbishop of Constantinople from 10 April 428 to 22 June 431. He was accused by his political enemy Cyril of Alexandria of Nestorianism because he objected to the popular practise of calling the Virgin Mary the \"Mother of God\" theotokos. He was condemned at the Council of Ephesus before his supporters could arrive and he was then dethroned. His views were widely held in the East, and the consequence was the creation of the Assyrian Church of the East, over the Persian border and hence beyond Greek political control.\nSaints","before":"","after":"Saints","before_token_range":[109,109],"after_token_range":[110,111]}
{"before_content":"Vaginitis is an inflammation of the vagina.Cite error: The <ref> tag has too many names (see the help page). It can result in discharge, itching and pain, and is often associated with an irritation or infection of the vulva. It is usually due to infection. The three main kinds of vaginitis are bacterial vaginosis (BV), vaginal candidiasis, and trichomoniasis. A woman may have any combination of vaginal infections at one time. The symptoms that arise vary with the infection, although there are general symptoms that all vaginitis infections have and infected women may also be asymptomatic. Testing for vaginal infections is not a part of routine pelvic exams; therefore, women should neither assume their health care providers will know of the infection, nor that they will provide appropriate treatment without their input.","after_content":"Vaginitis is an inflammation of the vagina. It may result in discharge, itching and pain. Vulva irritation or infection is often involved. It is usually because of the latter.\nA woman having this condition may have these symptoms:","before":" The three main kinds","after":"","before_token_range":[50,55],"after_token_range":[31,31]}
{"before_content":"\"Have Yourself a Merry Little Christmas\" is a song introduced by Judy Garland in the 1944 MGM musical Meet Me in St. Louis. Frank Sinatra later recorded a version with modified lyrics, which has become more common than the original. The song was credited to Hugh Martin and Ralph Blane, although during a December 21, 2006 NPR interview, Martin said that Blane had encouraged him to write the song but had not had anything more to do with writing it. In 2007, ASCAP ranked \"Have Yourself a Merry Little Christmas\" the third most performed Christmas song written by ASCAP members of the past five years.","after_content":"Have Yourself a Merry Little Christmas is an extremely popular Christmas song that is played every holiday season. The song was first introduced by Judy Garland. A modified version was introduced via Frank Sinatra, and the modified version is more popular than the original version.","before":"\"Have Yourself a Merry Little Christmas\"","after":"Have Yourself a Merry Little Christmas","before_token_range":[0,8],"after_token_range":[0,6]}
{"before_content":"Walter \"Clyde\" Frazier Jr. (born March 29, 1945) is an American former professional basketball player of the National Basketball Association (NBA). As their floor general and top perimeter defender, he led the New York Knicks to the franchise's only two championships (1970 and 1973), and was inducted into the Naismith Memorial Basketball Hall of Fame in 1987. Upon his retirement from basketball, Frazier went into broadcasting; he is currently a color commentator for telecasts of Knicks games on the MSG Network.","after_content":"Walter Frazier Jr. (born March 29, 1945 in Atlanta, Georgia) is an American former basketball player in the National Basketball Association. As their floor general, he led the New York Knicks to the franchise's only two championships (1970 and 1973), and was inducted into the Naismith Memorial Basketball Hall of Fame in 1987. Upon his retirement from basketball, Frazier went into broadcasting; he is currently a color commentator for telecasts of Knicks games on the MSG Network. Frazier is very well known by the nickname Clyde as well as the much lesser known nickname Mr. Cool. Frazier is considered one of the greatest point guards of all time, and particularly one of the greatest defensive guards as well. He was noted for his exceptionally quick hands, and it is claimed that he once stole the ball on eight consecutive plays in a 1971 game against Atlanta (steals were not an official statistic at the time). At one point Frazier held the single-game championship round record for assists.","before":"","after":"in Atlanta, Georgia","before_token_range":[11,11],"after_token_range":[9,12]}
