{
    "nodes": [
        {
            "ix": "9-660_v2_0",
            "content": "An inexpensive and easy-to-implement approach to a Quality Management System for an academic research lab",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_2",
            "content": "Background: Increasing concerns emerge regarding the limited success in reproducing data and translating research results into applications. This is a major problem for science, society and economy. Driven by industry or scientific networks, several attempts to combat this crisis are initiated. However, only few measures address the applicability and feasibility of implementation of actions into an academic research environment with limited resources.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_3",
            "content": "Methods: Here we propose a strategy catalogue aiming for a quality management system suitable for many research labs, on the example of a cell culture focused laboratory. Our proposal is guided by its inexpensiveness and possibility of rapid installation. For this we used eLabFTW, an electronic lab book, as hub for all other components of our Quality Management System (QMS) and digital storage of lab journals. We introduced Standard Operation Procedures (SOPs) as well as a managed bio bank for safer long-term storage of bio samples. Next, we set up a lab meeting as feedback mechanism for the QMS. Finally, we implemented an automated pipeline to be used for example for drug screens.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_4",
            "content": "Results : With this effort we want to reduce individual differences in work techniques, to further improve the quality of our results. Although, just recently established, we can already observe positive outcomes in quality of experimental results, improvements in sample and data storage, stakeholder engagement and even promotion of new scientific discoveries.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_5",
            "content": "Conclusions: We believe that our experiences can help to establish a road map to increase value and output of preclinical research in academic labs with limited budget and personnel.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_6",
            "content": "Background and Goal",
            "ntype": "title",
            "meta": {
                "section": "1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_7",
            "content": "By sharing our motivation and experiences in this effort, the aim of this article is serve as a reference supply for other leadership staff, both from academic or technical background, dedicated to responsible research innovation. Given the persistent hurdles in overcoming the bridge from biomedical lab discoveries to socio-economic applications in most of the projects, even with successful project development and breakthrough character, we dedicate this article especially to stakeholders involved in translational research. This spans from bench/animal scientists, to application specialists, to academic professors as well as to opinion leaders of funding agencies, scientific journals and governmental policy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_8",
            "content": "In our minds, laboratory quality is defined by highly accurate, efficient, transparent, data protective and through internal feedback algorithms constancy improving lab procedures. Laboratory quality control (QC) is the supervised sum of all measures put in place to aiming to achieve those parameters as most comprehensively as possible. We believe QC ensures lab operations streamlined to more efficiently than without leading to economic efficacy (by reducing time and resources due to minimizing wasteful replications), user loyalty and trust in own data since QC aims to minimize untrustable results. In a large picture, the authors believe that QC will shorten the delay of introducing innovation in clinics and market. Thus, unlike as considered by traditional society assumptions to restrict the innovation character of a lab, and, although for academic labs certain flexibilities need to be secured by not too heavy QC restrictions, QC represents an innovation mark and competition advancement especially in regards to sustainability (of results).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_9",
            "content": "Two main factors urged us to introduce more stringent and monitored QC strategies in our lab. First, using same cell models and substance, a follow up project on an established, prior by at least two independent scientists of our lab confirmed model of pharmacological mediated suppression of a molecular signaling pathway in vitro, a new third lab member had difficult to replicate the model to the same extend. In the search of inequalities in the experimental design amongst the conducted, we identified differences in the manufacturer of the drug candidate, outdated cell authentication certificate, or even lack of knowledge of the genetic identity of one of the used cell model, as well as inconsistency in documenting the age of the cells when stressing them with the drug as contributors to the situation.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_10",
            "content": "Due to its immense documentation load, the establishment of a quality management system (QMS) certified with ISO 9001 standard <REF-1> in biomedical research labs, like ours (state-funded lab with less than 20 employees, only two of them being permanent positions, one being the lab head, the other a technician), is challenging. This is particularly true for academic labs where usually staff is changing rapidly and the progress for individual careers is often the dominator for operator’s decision making. However, it is shown, that a lack of quality management and transparency are two reasons for the ongoing reproducibility crisis <REF-2> – <REF-4> . We implemented a slim line QMS that should lead to an increase of confidence in our scientific lab outcomes by optimizing internal processes for elevated transparency and reproducibility.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_11",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_12",
            "content": "We introduced several technological tools to optimize processes, which combined, will form the QMS ( Figure 1 ) of our lab.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_13",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Blocks that form the QMS and their function inside of it. SOP: Standard operation procedure, QMS: Quality management system.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/28462/14ce84eb-ef8a-47d2-b61e-3cb0a8851fe6_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_14",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Blocks that form the QMS and their function inside of it.</title> <p>SOP: Standard operation procedure, QMS: Quality management system.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/28462/14ce84eb-ef8a-47d2-b61e-3cb0a8851fe6_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Blocks that form the QMS and their function inside of it. SOP: Standard operation procedure, QMS: Quality management system.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/28462/14ce84eb-ef8a-47d2-b61e-3cb0a8851fe6_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_15",
            "content": "Experience with freeware solution for electronic lab documentation",
            "ntype": "title",
            "meta": {
                "section": "3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_16",
            "content": "Transparent data management is a cornerstone for research integrity. As the basis of our work we set up an electronic documentation system to document all lab activities of all lab members. We chose eLabFTW <REF-5> in the current version 3.4.8, an open source solution to track experiments with a powerful and flexible database. In the used version it provides all features necessary to provide the grounds of conformity with the principles of good research practices as proposed by the German research Foundation (DFG). This includes, not exclusively, the installation of a non-delete policy for created entries. The relevant software code can be found on GitHub platform <REF-6> . eLabFTW is made up from two parts. One is called ‘experiments’ and is the lab journal part of the software, the other is called ‘database’ and lets the user create text entries in self defined data types. The journal part of eLabFTW is used by each researcher to document their research, and for project management. Created entries cannot be deleted and changes to these entries will automatically be logged. The database part makes up the backbone of our QMS. We decided to share reading and search authorization for all entries amongst all registered personal accounts in our working group to increase transparency and to stimulate the critical interaction. Data storage, backup and archiving of eLabFTW data files can be easily implemented in regular executed local data management policy. All finished experiments are time stamped (digital signature), and blocked for editing from any user by the server itself. This will secure the written text and attached primary data (pictures, raw data from lab machines etc.) from later manipulations, as they are now unchangeable and undeletable.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_17",
            "content": "After trying a few electronic lab book solutions, eLabFTW was chosen as the documentation solution for our lab, because is has some advantages over other electronic lab books, which include: A strong encryption and modern codebase (only ELN with A+ rating on Mozilla’s Observatory), RFC 3161 compliant timestamping of experiments it is community developed through volunteers (by scientists, for scientists) and compatible with all common browsers (also mobile). Furthermore it allows the import and export in common file formats and is translated into various languages. An instance of eLabFTW is hosted on out universities own servers, which ensures high availability.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_18",
            "content": "Establishment of coherent protocol and lab tool documentation system",
            "ntype": "title",
            "meta": {
                "section": "4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_19",
            "content": "SOPs are a main principle of most QMS. To our experience, even within one working unit, for one given experiment various self-developed, self-adapted protocols are in use at the same time. By implementing a binding SOP policy for all users, defining the accountability of the data to qualify for the use in external presentation such as in a scientific publication, we aim to enhance process coherence in order to increase intra-lab reproducibility success. As first step, a template for SOPs was created and its categorization and storage were implemented in the electronic lab documentation system followed by the establishment of a writing procedure for how to complete the template was developed. Any person can then write a draft of a new SOPs, but creation of the SOPs and QMS implementation are managed by selected authorized identity (in our hands a governmental- certified technical assistant to ensure conformation with regulation processes), to avoid duplicates or development of multiple parallel versions of one subjects. Approved, newly established SOPs then are categorized by name, a standardized alphanumerical identifier, and version number. Then all new SOPs get uploaded to the database of the electronic lab book. If applicable, SOPs are electronically linked with each other if their execution/specification depends on each other. In the last year 91 unique procedures and recipes have been standardized. 31 of them have been revised at least once, to either correct them, or adapt them to new findings or necessities. The SOPs are built that way, that one SOP describes one specific process. For the example of a qPCR, this would be one SOP for RNA extraction, one for cDNA synthesis, and one for the qPCR itself. The SOPs cover every area of lab work, from cell culture, over molecular methods and buffer preparation, to lab maintenance and data management. Every new employee will be sent a package of our most used methods and receipts as well as SOPs related to his proposed project, prior to their first day of work, so they have the chance to already get familiar with the methods in theory.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_20",
            "content": "Moreover, virtual one-to-one project development meetings have been integrated in our e-documentation system by weekly, time-stamped progress reports of each lab member. Those are composed of structure items common for academic research projects featuring presentation of new results, problems experienced, suggestions of problem management and update on current literature. Leadership provides feedback on each parameter within a timely manner to secure up-to-date project management. Importantly, apart our open visibility of progress reports and feedback to all team members ensuring full transparency for all stakeholders, we have set up visibility-restricted sub projects. Those more restricted groups are intended to exchange work-in–progress documents between the individual user and the leadership, that have certain impact on the “outside-presentation” of the lab, such as presentations or manuscript drafts. We found this virtual project development-meeting platform enables efficient time management of the leadership and has been proven suitable to be conform with guidelines to minimize social contact, that have been stated by governments worldwide to fight the Covid-19 pandemic.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_21",
            "content": "Bio Bank",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_22",
            "content": "According to FAIR principles, when publishing research results, used material and created bio samples (tissue, cell pellets, DNA, RNA, plasmids, etc.) need to be held in stock to allow for future replications of the experiments performed or to share lab tools with the community. By establishing our lab bio bank, we aimed to provide a centralized storage facility for bio samples both for experimental and clinical research projects The bio bank consists of a temperature surveilled 500 L -80°C deep freezer, that stores about 400 cryo boxes and a 110 L liquid nitrogen tank, that stores 40 cryo boxes. The nitrogen tank is used to store cell culture cryo vials only. Other samples are stored in the freezer. Both, freezer and nitrogen tank, contain labelled boxes with designated positions for bio samples. Stored samples are characterized by a unique identifier. Long term preservation is supported by using freezing approved label technology and designation with printing instead of handwriting. The entire needed lab infrastructure to install our bio bank is a standard set up in each lab and does not require extra investments. Due to the anticipated large and constantly increasing number of bio samples included in the storage, we decided not to integrate the storage data into the database of eLabFTW but used a separate SQL database as the digital complement of the physical bio bank. Nevertheless, samples and experiments can be cross referenced in both platforms using the unique identifiers of the samples in the experiment section of eLabFTW, thereby securing complete and intertwined electronic documentation in our QMS. All lab members can search for samples in the digital database. However only three people have write access and can add and delete entries. Only those three people can access the physical bio bank, to add and remove samples. With this setup we aim to minimize sample loss and mix up, as well as ensure proper labelling of the samples.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_23",
            "content": "Quality assessment of cell models",
            "ntype": "title",
            "meta": {
                "section": "6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_24",
            "content": "As for many research labs, most of our projects fundament on in vitro experiments. For most of the cancer research projects, we perform our work by using the standard disease model type: the cancer cell line. Meanwhile paying particular attention to create the most-accurate-as-possible recapitulation of the pathophysiology of the disease by using 3D cultures, we furthermore surveil our technical quality of the applied biological test matrixes. This includes a) the confirmation of authentication through short tandem repeat analysis (STR) of cultured models every 6 months, b) the use of as-young-as-possible cell models (monitoring cell passage number); c) surveillance and - if necessary - clearance of mycoplasma contamination (PCR-based mycoplasma detection) and d) adherence to culture procedures as defined in SOPs. The STR analysis is outsourced to an in-house service. There Quantitation was performed using the QuantusTM Fluorometer (Promega) and the QuantiFluor® dsDNA Sample Kit (Promega) following manufacturer’s instructions. A multiplex PCR of 21 STR loci (PowerPlex® 21 System Kit, Promega) was performed in a total reaction volume of 12.5 µl with 0.5 ng template DNA. Thermal cycling conditions were followed as described by the manufacturer. Capillary electrophoretic separation was performed on the ABI Prism® Genetic Analyzer 3130 equipped with a 36 cm Capillary Array/POP-4 (Applied Biosystems, Darmstadt, Germany) following manufacturer’s instructions. Data acquisition and analysis was performed using the ABI Prism 3130 Collection software (Applied Biosystems) and GeneMapperID® v.3.2 software (Applied Biosystems, Darmstadt, Germany). For STR and mycoplasma test we invest less than 20 USD in total. We believe that the adherence to chronic execution of those simple methods is an economical, feasible and robust measure to sustainably reduce the creation of low-value cancer cell line data.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_25",
            "content": "Feedback and update communication platform",
            "ntype": "title",
            "meta": {
                "section": "7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_26",
            "content": "A monthly gathering of all participating and interested stakeholders secures the communication of updates and feedback mechanism of the QMS. Here also the state of the QMS is constantly revised by all lab members, and the further development is coordinated. The date and location for the meeting is circulated well in advance to ensure high frequency of participation of invitees. The feedback platform is open for all stakeholders independently of profession, profession hierarchy and amount of involvement in hands-on lab work. Each time a protocol of the meeting is generated in form of meeting minutes-like listing including specification of attendance. Although sometimes time consuming due to extent exchange of opposing opinions on topics, we hypothesize the impact of this outreach effort to involve all participants in the policy development extends further then the QMS. We believe such a platform increases the teamwork atmosphere and group belonging hereby increasing work atmosphere. We also think this is a valuable tool to fight occurrence of inequality and discrimination in our working group. The generated meeting minutes will be used to permanently alter the QMS to guarantee the highest possible quality. For that they will also be uploaded to the electronic lab book.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_27",
            "content": "Automation for lab work execution",
            "ntype": "title",
            "meta": {
                "section": "8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_28",
            "content": "Automation is a standard in industry labs and clinical diagnostics. We implemented a robotic liquid handling instrument (Beckman Coulter Biomek FxP) connected with automated plate reading for performing pharmacology testing on a cancer cell (Vargas-Toscano et al .) <REF-7> . We chose this method as our implementation trial since this is one of our most frequently used lab procedures. Our validation experiments based on manual repetition of the experiment proves that the functionality of our automation assay. Besides the accurate execution, the possibility of direct data reporting into the electronic lab documentation system and the possibility of electronic surveillance of executed pipetting for error reduction makes the inclusion of automation a valuable measure to increase reproducibly and transparency of our work. Given the existence of low-cost pipetting automation, more economically feasible options instead of the Biomek solution are available. Here, single-dose pumps in particular come to mind. These are of cause not as comfortable as robotic systems but fulfill the need of standardized pipetting. Used pumps can be bought for less than 1000 USD.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_29",
            "content": "Results and discussion",
            "ntype": "title",
            "meta": {
                "section": "9",
                "sec-type": "results | discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_30",
            "content": "In our experience the approach of using an all-digital lab book with shared reading rights and automated storage of raw data, does not only guarantee data management according to FAIR <REF-8> or increase the transparency according to the Hong Kong principles <REF-9> , but also helps to increase motivation of the team in general and thereby improving scientific development of the users. From all 17 lab members (at the time of publishing this), only 4 are not using the electronic lab book for recording their experiments. Those are members who are at the end of their projects and were therefore encouraged to keep their old method of recording, for consistency. Yet also those people use the database part of the electronic lab book, as well as the SOPs. The implementation of eLabFTW was a rather quick process. It is hosted on our university servers and as soon as the IT department set up a user group for our lab, our lab technician could populate the internal database during less than a week, as all inventory lists, primer lists, enzyme lists etc. where already available in a digital format and only had to be converted and imported to eLabFTW. As soon as this was done, the whole lab had a one day introduction into the functions of eLabFTW and where then able to use it. As eLabFTW is an open source freeware, there were no additional costs by our lab to use it. Exept from the 4 users mentioned before, for existing users old data is still stored in hand written lab books, but new projects are documented electronically. All new lab members will directly start documentation with the electronic lab book.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_31",
            "content": "The use of SOPs, which were uploaded to the electronic lab book, lead to the standardization of particular processes in the lab. Before researchers performed several experiments with protocols from other or former labs. This leads to lack of reproducibility inside of the lab. Now a higher consistency of experimental results is given, as all researchers perform each experiment in only a single way, minimizing individual differences. Initial creation of SOPs was a very time costly process, as we had to decide which protocols to use to form a standard procedure. In addition, we decided, that only one person should write the final version of the SOPs, to keep constant wording and style. However other lab members handed in drafts and were involved in creating preliminary versions for specific SOPs. Now the addition of new SOPs is not very time consuming, as a draft will be created by the researcher who introduces a new method, after this method is refined, and the person responsible for creating SOPs will finalize them.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_32",
            "content": "Compared to shared freezers used in the lab, central administration by only a few people highly reduces the loss of samples and mix-ups. Furthermore, the bio bank and its digital complement, with the possibility of linking it to the electronic lab book, make it very easy to find all samples used in all experiments. Since the Bio Bank is relatively freshly implemented, we cannot give results for the improvement of storage over longer periods of time yet. Until now the model of a digital copy of the bio bank, combined with limited access to the physical bank is holding up. All samples that got stored in the bio bank are still unmistakably findable. We argue that due to the QMS we fulfill the requirements for storage of data and samples, according to good scientific practice guidelines, as proposed by DFG <REF-10> . The SQL-Database was set up by our IT department. Before that the samples have already been moved to the biobank and all necessary information was already stored in an Excel-File that could then be imported to the SQL-Database. Because SQL Servers are also available as freeware, there are no additional costs, then running a Server for a lab that wants to implement such a database.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_33",
            "content": "STR and regular mycoplasma testing lead to rejection of low quality cell cultures, ensuring higher significance of results derived from experiments with those cells ( Table 1 <REF-11> ). Especially for metabolics or pharmacoproteomics experiments, a contamination with mycoplasma can lead to wrongful results. In our experience, even the most skillful and experienced cell culture scientists cannot avoid the introduction of unrecognized contamination. We found out that both, mycoplasma PCR and STR-Analysis are no big additional time costs. The PCR can be set up in about 5 minutes and then runs for 2.5 hours in which regular lab work can be continued. As the STR-Analysis is done by an in-house service, we just need to provide the DNA which can be extracted in about 30 minutes. With the introduced QMS, in our lab we identified cancer cell models have established subclones with different genetic background due to inter cell line contamination. Those subclones were designed as a different cell line instead of a subclone. The introduction of the QMS leads to big project adjustments and in some case to termination of experiments. We also put on hold a scheduled submission of a manuscript draft for publication due to cell line miss-identification.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_34",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Short tandem repeat (STR) profile of contaminated brain cancer cell line mix assumed to be BTSC349 (mix), which got contaminated with BTSC268 cells. For comparison and a reference for the scientific community, STR profiles of parental lines are provided as well. STRs with mixes of both cell lines are marked. For original data as supplied by in-house service, see underlying data <REF-11> .",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_35",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Short tandem repeat (STR) profile of contaminated brain cancer cell line mix assumed to be BTSC349 (mix), which got contaminated with BTSC268 cells.</title> <p>For comparison and a reference for the scientific community, STR profiles of parental lines are provided as well. STRs with mixes of both cell lines are marked. For original data as supplied by in-house service, see underlying data <sup> <xref ref-type=\"bibr\" rid=\"ref-11\">11</xref> </sup>.</p> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">STR</th> <th align=\"left\">BTSC349</th> <th align=\"left\">BTSC268</th> <th align=\"left\">Mix</th> <th align=\"left\">STR</th> <th align=\"left\">BTSC349</th> <th align=\"left\">BTSC268</th> <th align=\"left\">Mix</th> </tr> </thead> <tbody> <tr> <td align=\"left\"> <bold>D3S1358</bold> </td> <td align=\"right\">14, 16</td> <td align=\"right\">14, 15</td> <td align=\"right\">14, 15</td> <td align=\"right\"> <bold>vWA</bold> </td> <td align=\"right\">17</td> <td align=\"right\">14, 18</td> <td align=\"right\">14, 18 (17)</td> </tr> <tr> <td align=\"left\"> <bold>SD1S1656</bold> </td> <td align=\"right\">15</td> <td align=\"right\">15.3</td> <td align=\"right\">15.3</td> <td align=\"right\"> <bold>D21S11</bold> </td> <td align=\"right\">29</td> <td align=\"right\">29, 30</td> <td align=\"right\">29, 30</td> </tr> <tr> <td align=\"left\"> <bold>D6S1043</bold> </td> <td align=\"right\">7, 19</td> <td align=\"right\">11, 15</td> <td align=\"right\">11, 15 (7,19)</td> <td align=\"right\"> <bold>D7S820</bold> </td> <td align=\"right\">10,11</td> <td align=\"right\">9, 10</td> <td align=\"right\">9, 10 (11)</td> </tr> <tr> <td align=\"left\"> <bold>S13S317</bold> </td> <td align=\"right\">12</td> <td align=\"right\">8, 11, 12</td> <td align=\"right\">8, 11, 12</td> <td align=\"right\"> <bold>D5S818</bold> </td> <td align=\"right\">12</td> <td align=\"right\">11</td> <td align=\"right\">11 (12)</td> </tr> <tr> <td align=\"left\"> <bold>PENTA E</bold> </td> <td align=\"right\">17, 18</td> <td align=\"right\">12</td> <td align=\"right\">12 (17, 18)</td> <td align=\"right\"> <bold>TPOX</bold> </td> <td align=\"right\">8</td> <td align=\"right\">8, 12</td> <td align=\"right\">8, 12</td> </tr> <tr> <td align=\"left\"> <bold>D16S539</bold> </td> <td align=\"right\">11, 12</td> <td align=\"right\">9, 13</td> <td align=\"right\">9, 13 (11, 12)</td> <td align=\"right\"> <bold>D8S1179</bold> </td> <td align=\"right\">13, 14</td> <td align=\"right\">11, 13</td> <td align=\"right\">11, 13 (14)</td> </tr> <tr> <td align=\"left\"> <bold>DS18S51</bold> </td> <td align=\"right\">12, 14</td> <td align=\"right\">12, 13</td> <td align=\"right\">12, 13</td> <td align=\"right\"> <bold>D12S391</bold> </td> <td align=\"right\">21</td> <td align=\"right\">21, 24</td> <td align=\"right\">21, 24</td> </tr> <tr> <td align=\"left\"> <bold>D2S1338</bold> </td> <td align=\"right\">17, 18</td> <td align=\"right\">23, 24</td> <td align=\"right\">23, 24 (17)</td> <td align=\"right\"> <bold>D19S433</bold> </td> <td align=\"right\">12, 15</td> <td align=\"right\">14</td> <td align=\"right\">14 (12, 15)</td> </tr> <tr> <td align=\"left\"> <bold>CSF1PO</bold> </td> <td align=\"right\">11, 12</td> <td align=\"right\">12</td> <td align=\"right\">12 (11)</td> <td align=\"right\"> <bold>FGA</bold> </td> <td align=\"right\">20, 25</td> <td align=\"right\">21, 22</td> <td align=\"right\">21, 22 (20)</td> </tr> <tr> <td align=\"left\"> <bold>PENTA D</bold> </td> <td align=\"right\">11, 13</td> <td align=\"right\">10, 14</td> <td align=\"right\">10, 14 (11, 13)</td> <td align=\"right\"> <bold>AMEL</bold> </td> <td align=\"right\">xy</td> <td align=\"right\">x</td> <td align=\"right\">x</td> </tr> <tr> <td align=\"left\"> <bold>TH01</bold> </td> <td align=\"right\">9, 9.3</td> <td align=\"right\">6, 8</td> <td align=\"right\">6, 8 (9.3)</td> <td/> <td/> <td/> <td/> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Short tandem repeat (STR) profile of contaminated brain cancer cell line mix assumed to be BTSC349 (mix), which got contaminated with BTSC268 cells. For comparison and a reference for the scientific community, STR profiles of parental lines are provided as well. STRs with mixes of both cell lines are marked. For original data as supplied by in-house service, see underlying data <REF-11> .",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_36",
            "content": "The implemented communication system already proved its worth by leading to updated and refined versions of some SOPs. Given the deliverables of the meetings have a large influence on future lab procedures, we have experienced an increase in involvement and commitment of responsible lab members in this effort. A regular non-science oriented lab meeting creates an opportunity for easier expression of general matters thereby facilitating interpersonal communication amongst stakeholders. The virtual one-to-one project development report-feedback loops provides an opportunity to timely manage diverse research branches with moderate resources needed at each time.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_37",
            "content": "As the technologically most advanced component of our QMS, we implemented an automated pipetting system in our lab routines. We believe that the robustness and transparency of the data generation, as well as the simplicity of its use in supporting repetitive work procedures are the reasons for high attractiveness to many lab users and that robotic assays increase the value and innovation of our work. As such, the application of the screening identified a repurpose of a FDA approved neurotransmitter drug to inhibit growth of brain tumor cells. Given the recent high-profile publications revealing the importance of neurotransmitter signaling for the biology of brain cancer <REF-12> , our QMS coincidently enabled us to contribute to current line of cancer research that we had not purposely addressed without it. Our initial results applying this industry-like assay on drug resistance testing on cell models are very encouraging. However, conclusive evaluations on whether data quality is improved requires further projects comparing manual pipetting-derived data with corresponding data retrieved from the robot tool. Such a project is currently underway.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_38",
            "content": "Summary",
            "ntype": "title",
            "meta": {
                "section": "10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_39",
            "content": "We present a rapid-to-implement, feedback approved method guide for initial steps to improve value of preclinical lab deliverables in a budget-restricted academic research environment. Given the increasing concerns on the value of preclinical research, we believe our activities are in line with current goals of funding authorities, academic self-governance and help to improve trust and recognition of science in society. We hypothesize that side effects of a QMS can also reduce inequality/discrimination amongst stakeholders.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_40",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_41",
            "content": "Underlying data",
            "ntype": "title",
            "meta": {
                "section": "11.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_42",
            "content": "Zenodo: STR Analysis results BTSC 349, BTSC268 and mix of both. http://doi.org/10.5281/zenodo.3901446 <REF-11>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_43",
            "content": "This project contains the following underlying data:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_44",
            "content": "- - 15-1-Wiss2020-01-16.fsa (BTSC 349 short tandem repeat analysis)\n- - 15-3-Wiss2020-01-16.fsa (BTSC268 short tandem repeat analysis)\n- - 15-4-Wiss2020-01-16.fsa (Mixed cell line short tandem repeat analysis)",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_45",
            "content": "Data are available under the terms of the Creative Commons Attribution 4.0 International license (CC-BY 4.0).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_46",
            "content": "<REF-1> DIN EN ISO 9001: 2015-11 - Quality management systems. Beuth, 2015. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_47",
            "content": "<REF-2> Tackett JL Miller JD : Introduction to the Special Section on Increasing Replicability, Transparency, and Openness in Clinical Psychology. J Abnorm Psychol. 2019 ; 128 ( 6 ): 487 – 492 . 31368726 10.1037/abn0000455",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_48",
            "content": "<REF-4> Baker M : Is there a reproducibility crisis? Nature. 2016 ; 533 ( 7604 ): 452 – 454 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_49",
            "content": "<REF-5> elabftw.net . [cited 2020 Mar 19]. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_50",
            "content": "<REF-6> eLabFTW version 3.4.8 . [cited 2020 May 06]. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_51",
            "content": "<REF-7> Vargas-Toscano A Khan D Nickel AC : Robot technology identifies a Parkinsonian therapeutics repurpose to target stem cells of glioblastoma. CNS Oncol. 2020 ; 9 ( 2 ): CNS58 . 32462934 10.2217/cns-2020-0004",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_52",
            "content": "<REF-8> Wilkinson M Dumontier M Aalbersberg IJJ : The FAIR Guiding Principles for scientific data management and stewardship. Sci Data. 2016 ; 3 : 160018. 26978244 10.1038/sdata.2016.18 4792175",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_53",
            "content": "<REF-9> Moher D Bouter L Kleinert S : The Hong Kong Principles for Assessing Researchers: Fostering Research Integrity. OSF Reprints. 2019 . 10.31219/osf.io/m9abx",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_54",
            "content": "<REF-10> German Research Foundation Guidelines for Safeguarding Good Research Practice, Code of Conduct . Self-published, 2019 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_55",
            "content": "<REF-11> Nickel AC : STR Analysis results BTSC 349, BTSC268 and mix of both . [Data set]. Zenodo. 2020 . http://www.doi.org/10.5281/zenodo.3901446",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-660_v2_56",
            "content": "<REF-12> Venkataramani V Tanev DI Strahle C : Glutamatergic Synaptic Input to Glioma Cells Drives Brain Tumour Progression. Nature. 2019 ; 573 ( 7775 ): 532 – 538 . 31534219 10.1038/s41586-019-1564-x",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "9-660_v2_0@0",
            "content": "An inexpensive and easy-to-implement approach to a Quality Management System for an academic research lab",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_0",
            "start": 0,
            "end": 104,
            "label": {}
        },
        {
            "ix": "9-660_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "9-660_v2_2@0",
            "content": "Background: Increasing concerns emerge regarding the limited success in reproducing data and translating research results into applications.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_2",
            "start": 0,
            "end": 139,
            "label": {}
        },
        {
            "ix": "9-660_v2_2@1",
            "content": "This is a major problem for science, society and economy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_2",
            "start": 141,
            "end": 197,
            "label": {}
        },
        {
            "ix": "9-660_v2_2@2",
            "content": "Driven by industry or scientific networks, several attempts to combat this crisis are initiated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_2",
            "start": 199,
            "end": 294,
            "label": {}
        },
        {
            "ix": "9-660_v2_2@3",
            "content": "However, only few measures address the applicability and feasibility of implementation of actions into an academic research environment with limited resources.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_2",
            "start": 296,
            "end": 454,
            "label": {}
        },
        {
            "ix": "9-660_v2_3@0",
            "content": "Methods: Here we propose a strategy catalogue aiming for a quality management system suitable for many research labs, on the example of a cell culture focused laboratory.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_3",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "9-660_v2_3@1",
            "content": "Our proposal is guided by its inexpensiveness and possibility of rapid installation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_3",
            "start": 171,
            "end": 254,
            "label": {}
        },
        {
            "ix": "9-660_v2_3@2",
            "content": "For this we used eLabFTW, an electronic lab book, as hub for all other components of our Quality Management System (QMS) and digital storage of lab journals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_3",
            "start": 256,
            "end": 412,
            "label": {}
        },
        {
            "ix": "9-660_v2_3@3",
            "content": "We introduced Standard Operation Procedures (SOPs) as well as a managed bio bank for safer long-term storage of bio samples.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_3",
            "start": 414,
            "end": 537,
            "label": {}
        },
        {
            "ix": "9-660_v2_3@4",
            "content": "Next, we set up a lab meeting as feedback mechanism for the QMS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_3",
            "start": 539,
            "end": 602,
            "label": {}
        },
        {
            "ix": "9-660_v2_3@5",
            "content": "Finally, we implemented an automated pipeline to be used for example for drug screens.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_3",
            "start": 604,
            "end": 689,
            "label": {}
        },
        {
            "ix": "9-660_v2_4@0",
            "content": "Results : With this effort we want to reduce individual differences in work techniques, to further improve the quality of our results.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_4",
            "start": 0,
            "end": 133,
            "label": {}
        },
        {
            "ix": "9-660_v2_4@1",
            "content": "Although, just recently established, we can already observe positive outcomes in quality of experimental results, improvements in sample and data storage, stakeholder engagement and even promotion of new scientific discoveries.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_4",
            "start": 135,
            "end": 361,
            "label": {}
        },
        {
            "ix": "9-660_v2_5@0",
            "content": "Conclusions: We believe that our experiences can help to establish a road map to increase value and output of preclinical research in academic labs with limited budget and personnel.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_5",
            "start": 0,
            "end": 181,
            "label": {}
        },
        {
            "ix": "9-660_v2_6@0",
            "content": "Background and Goal",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_6",
            "start": 0,
            "end": 18,
            "label": {}
        },
        {
            "ix": "9-660_v2_7@0",
            "content": "By sharing our motivation and experiences in this effort, the aim of this article is serve as a reference supply for other leadership staff, both from academic or technical background, dedicated to responsible research innovation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_7",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "9-660_v2_7@1",
            "content": "Given the persistent hurdles in overcoming the bridge from biomedical lab discoveries to socio-economic applications in most of the projects, even with successful project development and breakthrough character, we dedicate this article especially to stakeholders involved in translational research.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_7",
            "start": 231,
            "end": 528,
            "label": {}
        },
        {
            "ix": "9-660_v2_7@2",
            "content": "This spans from bench/animal scientists, to application specialists, to academic professors as well as to opinion leaders of funding agencies, scientific journals and governmental policy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_7",
            "start": 530,
            "end": 716,
            "label": {}
        },
        {
            "ix": "9-660_v2_8@0",
            "content": "In our minds, laboratory quality is defined by highly accurate, efficient, transparent, data protective and through internal feedback algorithms constancy improving lab procedures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_8",
            "start": 0,
            "end": 179,
            "label": {}
        },
        {
            "ix": "9-660_v2_8@1",
            "content": "Laboratory quality control (QC) is the supervised sum of all measures put in place to aiming to achieve those parameters as most comprehensively as possible.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_8",
            "start": 181,
            "end": 337,
            "label": {}
        },
        {
            "ix": "9-660_v2_8@2",
            "content": "We believe QC ensures lab operations streamlined to more efficiently than without leading to economic efficacy (by reducing time and resources due to minimizing wasteful replications), user loyalty and trust in own data since QC aims to minimize untrustable results.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_8",
            "start": 339,
            "end": 604,
            "label": {}
        },
        {
            "ix": "9-660_v2_8@3",
            "content": "In a large picture, the authors believe that QC will shorten the delay of introducing innovation in clinics and market.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_8",
            "start": 606,
            "end": 724,
            "label": {}
        },
        {
            "ix": "9-660_v2_8@4",
            "content": "Thus, unlike as considered by traditional society assumptions to restrict the innovation character of a lab, and, although for academic labs certain flexibilities need to be secured by not too heavy QC restrictions, QC represents an innovation mark and competition advancement especially in regards to sustainability (of results).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_8",
            "start": 726,
            "end": 1055,
            "label": {}
        },
        {
            "ix": "9-660_v2_9@0",
            "content": "Two main factors urged us to introduce more stringent and monitored QC strategies in our lab.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_9",
            "start": 0,
            "end": 92,
            "label": {}
        },
        {
            "ix": "9-660_v2_9@1",
            "content": "First, using same cell models and substance, a follow up project on an established, prior by at least two independent scientists of our lab confirmed model of pharmacological mediated suppression of a molecular signaling pathway in vitro, a new third lab member had difficult to replicate the model to the same extend.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_9",
            "start": 94,
            "end": 411,
            "label": {}
        },
        {
            "ix": "9-660_v2_9@2",
            "content": "In the search of inequalities in the experimental design amongst the conducted, we identified differences in the manufacturer of the drug candidate, outdated cell authentication certificate, or even lack of knowledge of the genetic identity of one of the used cell model, as well as inconsistency in documenting the age of the cells when stressing them with the drug as contributors to the situation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_9",
            "start": 413,
            "end": 812,
            "label": {}
        },
        {
            "ix": "9-660_v2_10@0",
            "content": "Due to its immense documentation load, the establishment of a quality management system (QMS) certified with ISO 9001 standard <REF-1> in biomedical research labs, like ours (state-funded lab with less than 20 employees, only two of them being permanent positions, one being the lab head, the other a technician), is challenging.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_10",
            "start": 0,
            "end": 328,
            "label": {}
        },
        {
            "ix": "9-660_v2_10@1",
            "content": "This is particularly true for academic labs where usually staff is changing rapidly and the progress for individual careers is often the dominator for operator’s decision making.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_10",
            "start": 330,
            "end": 507,
            "label": {}
        },
        {
            "ix": "9-660_v2_10@2",
            "content": "However, it is shown, that a lack of quality management and transparency are two reasons for the ongoing reproducibility crisis <REF-2> – <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_10",
            "start": 509,
            "end": 655,
            "label": {}
        },
        {
            "ix": "9-660_v2_10@3",
            "content": "We implemented a slim line QMS that should lead to an increase of confidence in our scientific lab outcomes by optimizing internal processes for elevated transparency and reproducibility.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_10",
            "start": 657,
            "end": 843,
            "label": {}
        },
        {
            "ix": "9-660_v2_11@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_11",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "9-660_v2_12@0",
            "content": "We introduced several technological tools to optimize processes, which combined, will form the QMS ( Figure 1 ) of our lab.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_12",
            "start": 0,
            "end": 122,
            "label": {}
        },
        {
            "ix": "9-660_v2_13@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_13",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "9-660_v2_15@0",
            "content": "Experience with freeware solution for electronic lab documentation",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_15",
            "start": 0,
            "end": 65,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@0",
            "content": "Transparent data management is a cornerstone for research integrity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 0,
            "end": 67,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@1",
            "content": "As the basis of our work we set up an electronic documentation system to document all lab activities of all lab members.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 69,
            "end": 188,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@2",
            "content": "We chose eLabFTW <REF-5> in the current version 3.4.8, an open source solution to track experiments with a powerful and flexible database.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 190,
            "end": 327,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@3",
            "content": "In the used version it provides all features necessary to provide the grounds of conformity with the principles of good research practices as proposed by the German research Foundation (DFG).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 329,
            "end": 519,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@4",
            "content": "This includes, not exclusively, the installation of a non-delete policy for created entries.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 521,
            "end": 612,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@5",
            "content": "The relevant software code can be found on GitHub platform <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 614,
            "end": 681,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@6",
            "content": "eLabFTW is made up from two parts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 683,
            "end": 716,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@7",
            "content": "One is called ‘experiments’ and is the lab journal part of the software, the other is called ‘database’ and lets the user create text entries in self defined data types.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 718,
            "end": 886,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@8",
            "content": "The journal part of eLabFTW is used by each researcher to document their research, and for project management.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 888,
            "end": 997,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@9",
            "content": "Created entries cannot be deleted and changes to these entries will automatically be logged.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 999,
            "end": 1090,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@10",
            "content": "The database part makes up the backbone of our QMS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 1092,
            "end": 1142,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@11",
            "content": "We decided to share reading and search authorization for all entries amongst all registered personal accounts in our working group to increase transparency and to stimulate the critical interaction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 1144,
            "end": 1341,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@12",
            "content": "Data storage, backup and archiving of eLabFTW data files can be easily implemented in regular executed local data management policy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 1343,
            "end": 1474,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@13",
            "content": "All finished experiments are time stamped (digital signature), and blocked for editing from any user by the server itself.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 1476,
            "end": 1597,
            "label": {}
        },
        {
            "ix": "9-660_v2_16@14",
            "content": "This will secure the written text and attached primary data (pictures, raw data from lab machines etc.) from later manipulations, as they are now unchangeable and undeletable.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_16",
            "start": 1599,
            "end": 1773,
            "label": {}
        },
        {
            "ix": "9-660_v2_17@0",
            "content": "After trying a few electronic lab book solutions, eLabFTW was chosen as the documentation solution for our lab, because is has some advantages over other electronic lab books, which include: A strong encryption and modern codebase (only ELN with A+ rating on Mozilla’s Observatory), RFC 3161 compliant timestamping of experiments it is community developed through volunteers (by scientists, for scientists) and compatible with all common browsers (also mobile).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_17",
            "start": 0,
            "end": 460,
            "label": {}
        },
        {
            "ix": "9-660_v2_17@1",
            "content": "Furthermore it allows the import and export in common file formats and is translated into various languages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_17",
            "start": 462,
            "end": 569,
            "label": {}
        },
        {
            "ix": "9-660_v2_17@2",
            "content": "An instance of eLabFTW is hosted on out universities own servers, which ensures high availability.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_17",
            "start": 571,
            "end": 668,
            "label": {}
        },
        {
            "ix": "9-660_v2_18@0",
            "content": "Establishment of coherent protocol and lab tool documentation system",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_18",
            "start": 0,
            "end": 67,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@0",
            "content": "SOPs are a main principle of most QMS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 0,
            "end": 37,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@1",
            "content": "To our experience, even within one working unit, for one given experiment various self-developed, self-adapted protocols are in use at the same time.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 39,
            "end": 187,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@2",
            "content": "By implementing a binding SOP policy for all users, defining the accountability of the data to qualify for the use in external presentation such as in a scientific publication, we aim to enhance process coherence in order to increase intra-lab reproducibility success.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 189,
            "end": 456,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@3",
            "content": "As first step, a template for SOPs was created and its categorization and storage were implemented in the electronic lab documentation system followed by the establishment of a writing procedure for how to complete the template was developed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 458,
            "end": 699,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@4",
            "content": "Any person can then write a draft of a new SOPs, but creation of the SOPs and QMS implementation are managed by selected authorized identity (in our hands a governmental- certified technical assistant to ensure conformation with regulation processes), to avoid duplicates or development of multiple parallel versions of one subjects.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 701,
            "end": 1033,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@5",
            "content": "Approved, newly established SOPs then are categorized by name, a standardized alphanumerical identifier, and version number.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 1035,
            "end": 1158,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@6",
            "content": "Then all new SOPs get uploaded to the database of the electronic lab book.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 1160,
            "end": 1233,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@7",
            "content": "If applicable, SOPs are electronically linked with each other if their execution/specification depends on each other.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 1235,
            "end": 1351,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@8",
            "content": "In the last year 91 unique procedures and recipes have been standardized. 31 of them have been revised at least once, to either correct them, or adapt them to new findings or necessities.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 1353,
            "end": 1539,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@9",
            "content": "The SOPs are built that way, that one SOP describes one specific process.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 1541,
            "end": 1613,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@10",
            "content": "For the example of a qPCR, this would be one SOP for RNA extraction, one for cDNA synthesis, and one for the qPCR itself.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 1615,
            "end": 1735,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@11",
            "content": "The SOPs cover every area of lab work, from cell culture, over molecular methods and buffer preparation, to lab maintenance and data management.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 1737,
            "end": 1880,
            "label": {}
        },
        {
            "ix": "9-660_v2_19@12",
            "content": "Every new employee will be sent a package of our most used methods and receipts as well as SOPs related to his proposed project, prior to their first day of work, so they have the chance to already get familiar with the methods in theory.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_19",
            "start": 1882,
            "end": 2119,
            "label": {}
        },
        {
            "ix": "9-660_v2_20@0",
            "content": "Moreover, virtual one-to-one project development meetings have been integrated in our e-documentation system by weekly, time-stamped progress reports of each lab member.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_20",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "9-660_v2_20@1",
            "content": "Those are composed of structure items common for academic research projects featuring presentation of new results, problems experienced, suggestions of problem management and update on current literature.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_20",
            "start": 170,
            "end": 373,
            "label": {}
        },
        {
            "ix": "9-660_v2_20@2",
            "content": "Leadership provides feedback on each parameter within a timely manner to secure up-to-date project management.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_20",
            "start": 375,
            "end": 484,
            "label": {}
        },
        {
            "ix": "9-660_v2_20@3",
            "content": "Importantly, apart our open visibility of progress reports and feedback to all team members ensuring full transparency for all stakeholders, we have set up visibility-restricted sub projects.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_20",
            "start": 486,
            "end": 676,
            "label": {}
        },
        {
            "ix": "9-660_v2_20@4",
            "content": "Those more restricted groups are intended to exchange work-in–progress documents between the individual user and the leadership, that have certain impact on the “outside-presentation” of the lab, such as presentations or manuscript drafts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_20",
            "start": 678,
            "end": 916,
            "label": {}
        },
        {
            "ix": "9-660_v2_20@5",
            "content": "We found this virtual project development-meeting platform enables efficient time management of the leadership and has been proven suitable to be conform with guidelines to minimize social contact, that have been stated by governments worldwide to fight the Covid-19 pandemic.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_20",
            "start": 918,
            "end": 1193,
            "label": {}
        },
        {
            "ix": "9-660_v2_21@0",
            "content": "Bio Bank",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_21",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@0",
            "content": "According to FAIR principles, when publishing research results, used material and created bio samples (tissue, cell pellets, DNA, RNA, plasmids, etc.) need to be held in stock to allow for future replications of the experiments performed or to share lab tools with the community.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 0,
            "end": 278,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@1",
            "content": "By establishing our lab bio bank, we aimed to provide a centralized storage facility for bio samples both for experimental and clinical research projects The bio bank consists of a temperature surveilled 500 L -80°C deep freezer, that stores about 400 cryo boxes and a 110 L liquid nitrogen tank, that stores 40 cryo boxes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 280,
            "end": 602,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@2",
            "content": "The nitrogen tank is used to store cell culture cryo vials only.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 604,
            "end": 667,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@3",
            "content": "Other samples are stored in the freezer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 669,
            "end": 708,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@4",
            "content": "Both, freezer and nitrogen tank, contain labelled boxes with designated positions for bio samples.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 710,
            "end": 807,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@5",
            "content": "Stored samples are characterized by a unique identifier.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 809,
            "end": 864,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@6",
            "content": "Long term preservation is supported by using freezing approved label technology and designation with printing instead of handwriting.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 866,
            "end": 998,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@7",
            "content": "The entire needed lab infrastructure to install our bio bank is a standard set up in each lab and does not require extra investments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 1000,
            "end": 1132,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@8",
            "content": "Due to the anticipated large and constantly increasing number of bio samples included in the storage, we decided not to integrate the storage data into the database of eLabFTW but used a separate SQL database as the digital complement of the physical bio bank.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 1134,
            "end": 1393,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@9",
            "content": "Nevertheless, samples and experiments can be cross referenced in both platforms using the unique identifiers of the samples in the experiment section of eLabFTW, thereby securing complete and intertwined electronic documentation in our QMS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 1395,
            "end": 1634,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@10",
            "content": "All lab members can search for samples in the digital database.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 1636,
            "end": 1698,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@11",
            "content": "However only three people have write access and can add and delete entries.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 1700,
            "end": 1774,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@12",
            "content": "Only those three people can access the physical bio bank, to add and remove samples.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 1776,
            "end": 1859,
            "label": {}
        },
        {
            "ix": "9-660_v2_22@13",
            "content": "With this setup we aim to minimize sample loss and mix up, as well as ensure proper labelling of the samples.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_22",
            "start": 1861,
            "end": 1969,
            "label": {}
        },
        {
            "ix": "9-660_v2_23@0",
            "content": "Quality assessment of cell models",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_23",
            "start": 0,
            "end": 32,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@0",
            "content": "As for many research labs, most of our projects fundament on in vitro experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 0,
            "end": 81,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@1",
            "content": "For most of the cancer research projects, we perform our work by using the standard disease model type: the cancer cell line.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 83,
            "end": 207,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@2",
            "content": "Meanwhile paying particular attention to create the most-accurate-as-possible recapitulation of the pathophysiology of the disease by using 3D cultures, we furthermore surveil our technical quality of the applied biological test matrixes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 209,
            "end": 446,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@3",
            "content": "This includes a) the confirmation of authentication through short tandem repeat analysis (STR) of cultured models every 6 months, b) the use of as-young-as-possible cell models (monitoring cell passage number); c) surveillance and - if necessary - clearance of mycoplasma contamination (PCR-based mycoplasma detection) and d) adherence to culture procedures as defined in SOPs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 448,
            "end": 824,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@4",
            "content": "The STR analysis is outsourced to an in-house service.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 826,
            "end": 879,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@5",
            "content": "There Quantitation was performed using the QuantusTM Fluorometer (Promega) and the QuantiFluor® dsDNA Sample Kit (Promega) following manufacturer’s instructions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 881,
            "end": 1041,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@6",
            "content": "A multiplex PCR of 21 STR loci (PowerPlex® 21 System Kit, Promega) was performed in a total reaction volume of 12.5 µl with 0.5 ng template DNA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 1043,
            "end": 1186,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@7",
            "content": "Thermal cycling conditions were followed as described by the manufacturer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 1188,
            "end": 1261,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@8",
            "content": "Capillary electrophoretic separation was performed on the ABI Prism® Genetic Analyzer 3130 equipped with a 36 cm Capillary Array/POP-4 (Applied Biosystems, Darmstadt, Germany) following manufacturer’s instructions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 1263,
            "end": 1476,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@9",
            "content": "Data acquisition and analysis was performed using the ABI Prism 3130 Collection software (Applied Biosystems) and GeneMapperID® v.3.2 software (Applied Biosystems, Darmstadt, Germany).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 1478,
            "end": 1661,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@10",
            "content": "For STR and mycoplasma test we invest less than 20 USD in total.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 1663,
            "end": 1726,
            "label": {}
        },
        {
            "ix": "9-660_v2_24@11",
            "content": "We believe that the adherence to chronic execution of those simple methods is an economical, feasible and robust measure to sustainably reduce the creation of low-value cancer cell line data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_24",
            "start": 1728,
            "end": 1918,
            "label": {}
        },
        {
            "ix": "9-660_v2_25@0",
            "content": "Feedback and update communication platform",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_25",
            "start": 0,
            "end": 41,
            "label": {}
        },
        {
            "ix": "9-660_v2_26@0",
            "content": "A monthly gathering of all participating and interested stakeholders secures the communication of updates and feedback mechanism of the QMS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_26",
            "start": 0,
            "end": 139,
            "label": {}
        },
        {
            "ix": "9-660_v2_26@1",
            "content": "Here also the state of the QMS is constantly revised by all lab members, and the further development is coordinated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_26",
            "start": 141,
            "end": 256,
            "label": {}
        },
        {
            "ix": "9-660_v2_26@2",
            "content": "The date and location for the meeting is circulated well in advance to ensure high frequency of participation of invitees.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_26",
            "start": 258,
            "end": 379,
            "label": {}
        },
        {
            "ix": "9-660_v2_26@3",
            "content": "The feedback platform is open for all stakeholders independently of profession, profession hierarchy and amount of involvement in hands-on lab work.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_26",
            "start": 381,
            "end": 528,
            "label": {}
        },
        {
            "ix": "9-660_v2_26@4",
            "content": "Each time a protocol of the meeting is generated in form of meeting minutes-like listing including specification of attendance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_26",
            "start": 530,
            "end": 656,
            "label": {}
        },
        {
            "ix": "9-660_v2_26@5",
            "content": "Although sometimes time consuming due to extent exchange of opposing opinions on topics, we hypothesize the impact of this outreach effort to involve all participants in the policy development extends further then the QMS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_26",
            "start": 658,
            "end": 879,
            "label": {}
        },
        {
            "ix": "9-660_v2_26@6",
            "content": "We believe such a platform increases the teamwork atmosphere and group belonging hereby increasing work atmosphere.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_26",
            "start": 881,
            "end": 995,
            "label": {}
        },
        {
            "ix": "9-660_v2_26@7",
            "content": "We also think this is a valuable tool to fight occurrence of inequality and discrimination in our working group.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_26",
            "start": 997,
            "end": 1108,
            "label": {}
        },
        {
            "ix": "9-660_v2_26@8",
            "content": "The generated meeting minutes will be used to permanently alter the QMS to guarantee the highest possible quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_26",
            "start": 1110,
            "end": 1223,
            "label": {}
        },
        {
            "ix": "9-660_v2_26@9",
            "content": "For that they will also be uploaded to the electronic lab book.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_26",
            "start": 1225,
            "end": 1287,
            "label": {}
        },
        {
            "ix": "9-660_v2_27@0",
            "content": "Automation for lab work execution",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_27",
            "start": 0,
            "end": 32,
            "label": {}
        },
        {
            "ix": "9-660_v2_28@0",
            "content": "Automation is a standard in industry labs and clinical diagnostics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_28",
            "start": 0,
            "end": 66,
            "label": {}
        },
        {
            "ix": "9-660_v2_28@1",
            "content": "We implemented a robotic liquid handling instrument (Beckman Coulter Biomek FxP) connected with automated plate reading for performing pharmacology testing on a cancer cell (Vargas-Toscano et al .) <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_28",
            "start": 68,
            "end": 274,
            "label": {}
        },
        {
            "ix": "9-660_v2_28@2",
            "content": "We chose this method as our implementation trial since this is one of our most frequently used lab procedures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_28",
            "start": 276,
            "end": 385,
            "label": {}
        },
        {
            "ix": "9-660_v2_28@3",
            "content": "Our validation experiments based on manual repetition of the experiment proves that the functionality of our automation assay.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_28",
            "start": 387,
            "end": 512,
            "label": {}
        },
        {
            "ix": "9-660_v2_28@4",
            "content": "Besides the accurate execution, the possibility of direct data reporting into the electronic lab documentation system and the possibility of electronic surveillance of executed pipetting for error reduction makes the inclusion of automation a valuable measure to increase reproducibly and transparency of our work.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_28",
            "start": 514,
            "end": 827,
            "label": {}
        },
        {
            "ix": "9-660_v2_28@5",
            "content": "Given the existence of low-cost pipetting automation, more economically feasible options instead of the Biomek solution are available.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_28",
            "start": 829,
            "end": 962,
            "label": {}
        },
        {
            "ix": "9-660_v2_28@6",
            "content": "Here, single-dose pumps in particular come to mind.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_28",
            "start": 964,
            "end": 1014,
            "label": {}
        },
        {
            "ix": "9-660_v2_28@7",
            "content": "These are of cause not as comfortable as robotic systems but fulfill the need of standardized pipetting.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_28",
            "start": 1016,
            "end": 1119,
            "label": {}
        },
        {
            "ix": "9-660_v2_28@8",
            "content": "Used pumps can be bought for less than 1000 USD.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_28",
            "start": 1121,
            "end": 1168,
            "label": {}
        },
        {
            "ix": "9-660_v2_29@0",
            "content": "Results and discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_29",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "9-660_v2_30@0",
            "content": "In our experience the approach of using an all-digital lab book with shared reading rights and automated storage of raw data, does not only guarantee data management according to FAIR <REF-8> or increase the transparency according to the Hong Kong principles <REF-9> , but also helps to increase motivation of the team in general and thereby improving scientific development of the users.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_30",
            "start": 0,
            "end": 387,
            "label": {}
        },
        {
            "ix": "9-660_v2_30@1",
            "content": "From all 17 lab members (at the time of publishing this), only 4 are not using the electronic lab book for recording their experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_30",
            "start": 389,
            "end": 523,
            "label": {}
        },
        {
            "ix": "9-660_v2_30@2",
            "content": "Those are members who are at the end of their projects and were therefore encouraged to keep their old method of recording, for consistency.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_30",
            "start": 525,
            "end": 664,
            "label": {}
        },
        {
            "ix": "9-660_v2_30@3",
            "content": "Yet also those people use the database part of the electronic lab book, as well as the SOPs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_30",
            "start": 666,
            "end": 757,
            "label": {}
        },
        {
            "ix": "9-660_v2_30@4",
            "content": "The implementation of eLabFTW was a rather quick process.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_30",
            "start": 759,
            "end": 815,
            "label": {}
        },
        {
            "ix": "9-660_v2_30@5",
            "content": "It is hosted on our university servers and as soon as the IT department set up a user group for our lab, our lab technician could populate the internal database during less than a week, as all inventory lists, primer lists, enzyme lists etc. where already available in a digital format and only had to be converted and imported to eLabFTW.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_30",
            "start": 817,
            "end": 1155,
            "label": {}
        },
        {
            "ix": "9-660_v2_30@6",
            "content": "As soon as this was done, the whole lab had a one day introduction into the functions of eLabFTW and where then able to use it.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_30",
            "start": 1157,
            "end": 1283,
            "label": {}
        },
        {
            "ix": "9-660_v2_30@7",
            "content": "As eLabFTW is an open source freeware, there were no additional costs by our lab to use it.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_30",
            "start": 1285,
            "end": 1375,
            "label": {}
        },
        {
            "ix": "9-660_v2_30@8",
            "content": "Exept from the 4 users mentioned before, for existing users old data is still stored in hand written lab books, but new projects are documented electronically.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_30",
            "start": 1377,
            "end": 1535,
            "label": {}
        },
        {
            "ix": "9-660_v2_30@9",
            "content": "All new lab members will directly start documentation with the electronic lab book.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_30",
            "start": 1537,
            "end": 1619,
            "label": {}
        },
        {
            "ix": "9-660_v2_31@0",
            "content": "The use of SOPs, which were uploaded to the electronic lab book, lead to the standardization of particular processes in the lab.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_31",
            "start": 0,
            "end": 127,
            "label": {}
        },
        {
            "ix": "9-660_v2_31@1",
            "content": "Before researchers performed several experiments with protocols from other or former labs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_31",
            "start": 129,
            "end": 218,
            "label": {}
        },
        {
            "ix": "9-660_v2_31@2",
            "content": "This leads to lack of reproducibility inside of the lab.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_31",
            "start": 220,
            "end": 275,
            "label": {}
        },
        {
            "ix": "9-660_v2_31@3",
            "content": "Now a higher consistency of experimental results is given, as all researchers perform each experiment in only a single way, minimizing individual differences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_31",
            "start": 277,
            "end": 434,
            "label": {}
        },
        {
            "ix": "9-660_v2_31@4",
            "content": "Initial creation of SOPs was a very time costly process, as we had to decide which protocols to use to form a standard procedure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_31",
            "start": 436,
            "end": 564,
            "label": {}
        },
        {
            "ix": "9-660_v2_31@5",
            "content": "In addition, we decided, that only one person should write the final version of the SOPs, to keep constant wording and style.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_31",
            "start": 566,
            "end": 690,
            "label": {}
        },
        {
            "ix": "9-660_v2_31@6",
            "content": "However other lab members handed in drafts and were involved in creating preliminary versions for specific SOPs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_31",
            "start": 692,
            "end": 803,
            "label": {}
        },
        {
            "ix": "9-660_v2_31@7",
            "content": "Now the addition of new SOPs is not very time consuming, as a draft will be created by the researcher who introduces a new method, after this method is refined, and the person responsible for creating SOPs will finalize them.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_31",
            "start": 805,
            "end": 1029,
            "label": {}
        },
        {
            "ix": "9-660_v2_32@0",
            "content": "Compared to shared freezers used in the lab, central administration by only a few people highly reduces the loss of samples and mix-ups.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_32",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "9-660_v2_32@1",
            "content": "Furthermore, the bio bank and its digital complement, with the possibility of linking it to the electronic lab book, make it very easy to find all samples used in all experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_32",
            "start": 137,
            "end": 315,
            "label": {}
        },
        {
            "ix": "9-660_v2_32@2",
            "content": "Since the Bio Bank is relatively freshly implemented, we cannot give results for the improvement of storage over longer periods of time yet.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_32",
            "start": 317,
            "end": 456,
            "label": {}
        },
        {
            "ix": "9-660_v2_32@3",
            "content": "Until now the model of a digital copy of the bio bank, combined with limited access to the physical bank is holding up.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_32",
            "start": 458,
            "end": 576,
            "label": {}
        },
        {
            "ix": "9-660_v2_32@4",
            "content": "All samples that got stored in the bio bank are still unmistakably findable.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_32",
            "start": 578,
            "end": 653,
            "label": {}
        },
        {
            "ix": "9-660_v2_32@5",
            "content": "We argue that due to the QMS we fulfill the requirements for storage of data and samples, according to good scientific practice guidelines, as proposed by DFG <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_32",
            "start": 655,
            "end": 823,
            "label": {}
        },
        {
            "ix": "9-660_v2_32@6",
            "content": "The SQL-Database was set up by our IT department.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_32",
            "start": 825,
            "end": 873,
            "label": {}
        },
        {
            "ix": "9-660_v2_32@7",
            "content": "Before that the samples have already been moved to the biobank and all necessary information was already stored in an Excel-File that could then be imported to the SQL-Database.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_32",
            "start": 875,
            "end": 1051,
            "label": {}
        },
        {
            "ix": "9-660_v2_32@8",
            "content": "Because SQL Servers are also available as freeware, there are no additional costs, then running a Server for a lab that wants to implement such a database.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_32",
            "start": 1053,
            "end": 1207,
            "label": {}
        },
        {
            "ix": "9-660_v2_33@0",
            "content": "STR and regular mycoplasma testing lead to rejection of low quality cell cultures, ensuring higher significance of results derived from experiments with those cells ( Table 1 <REF-11> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_33",
            "start": 0,
            "end": 185,
            "label": {}
        },
        {
            "ix": "9-660_v2_33@1",
            "content": "Especially for metabolics or pharmacoproteomics experiments, a contamination with mycoplasma can lead to wrongful results.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_33",
            "start": 187,
            "end": 308,
            "label": {}
        },
        {
            "ix": "9-660_v2_33@2",
            "content": "In our experience, even the most skillful and experienced cell culture scientists cannot avoid the introduction of unrecognized contamination.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_33",
            "start": 310,
            "end": 451,
            "label": {}
        },
        {
            "ix": "9-660_v2_33@3",
            "content": "We found out that both, mycoplasma PCR and STR-Analysis are no big additional time costs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_33",
            "start": 453,
            "end": 541,
            "label": {}
        },
        {
            "ix": "9-660_v2_33@4",
            "content": "The PCR can be set up in about 5 minutes and then runs for 2.5 hours in which regular lab work can be continued.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_33",
            "start": 543,
            "end": 654,
            "label": {}
        },
        {
            "ix": "9-660_v2_33@5",
            "content": "As the STR-Analysis is done by an in-house service, we just need to provide the DNA which can be extracted in about 30 minutes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_33",
            "start": 656,
            "end": 782,
            "label": {}
        },
        {
            "ix": "9-660_v2_33@6",
            "content": "With the introduced QMS, in our lab we identified cancer cell models have established subclones with different genetic background due to inter cell line contamination.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_33",
            "start": 784,
            "end": 950,
            "label": {}
        },
        {
            "ix": "9-660_v2_33@7",
            "content": "Those subclones were designed as a different cell line instead of a subclone.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_33",
            "start": 952,
            "end": 1028,
            "label": {}
        },
        {
            "ix": "9-660_v2_33@8",
            "content": "The introduction of the QMS leads to big project adjustments and in some case to termination of experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_33",
            "start": 1030,
            "end": 1137,
            "label": {}
        },
        {
            "ix": "9-660_v2_33@9",
            "content": "We also put on hold a scheduled submission of a manuscript draft for publication due to cell line miss-identification.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_33",
            "start": 1139,
            "end": 1256,
            "label": {}
        },
        {
            "ix": "9-660_v2_34@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_34",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "9-660_v2_36@0",
            "content": "The implemented communication system already proved its worth by leading to updated and refined versions of some SOPs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_36",
            "start": 0,
            "end": 117,
            "label": {}
        },
        {
            "ix": "9-660_v2_36@1",
            "content": "Given the deliverables of the meetings have a large influence on future lab procedures, we have experienced an increase in involvement and commitment of responsible lab members in this effort.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_36",
            "start": 119,
            "end": 310,
            "label": {}
        },
        {
            "ix": "9-660_v2_36@2",
            "content": "A regular non-science oriented lab meeting creates an opportunity for easier expression of general matters thereby facilitating interpersonal communication amongst stakeholders.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_36",
            "start": 312,
            "end": 488,
            "label": {}
        },
        {
            "ix": "9-660_v2_36@3",
            "content": "The virtual one-to-one project development report-feedback loops provides an opportunity to timely manage diverse research branches with moderate resources needed at each time.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_36",
            "start": 490,
            "end": 665,
            "label": {}
        },
        {
            "ix": "9-660_v2_37@0",
            "content": "As the technologically most advanced component of our QMS, we implemented an automated pipetting system in our lab routines.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_37",
            "start": 0,
            "end": 123,
            "label": {}
        },
        {
            "ix": "9-660_v2_37@1",
            "content": "We believe that the robustness and transparency of the data generation, as well as the simplicity of its use in supporting repetitive work procedures are the reasons for high attractiveness to many lab users and that robotic assays increase the value and innovation of our work.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_37",
            "start": 125,
            "end": 402,
            "label": {}
        },
        {
            "ix": "9-660_v2_37@2",
            "content": "As such, the application of the screening identified a repurpose of a FDA approved neurotransmitter drug to inhibit growth of brain tumor cells.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_37",
            "start": 404,
            "end": 547,
            "label": {}
        },
        {
            "ix": "9-660_v2_37@3",
            "content": "Given the recent high-profile publications revealing the importance of neurotransmitter signaling for the biology of brain cancer <REF-12> , our QMS coincidently enabled us to contribute to current line of cancer research that we had not purposely addressed without it.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_37",
            "start": 549,
            "end": 817,
            "label": {}
        },
        {
            "ix": "9-660_v2_37@4",
            "content": "Our initial results applying this industry-like assay on drug resistance testing on cell models are very encouraging.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_37",
            "start": 819,
            "end": 935,
            "label": {}
        },
        {
            "ix": "9-660_v2_37@5",
            "content": "However, conclusive evaluations on whether data quality is improved requires further projects comparing manual pipetting-derived data with corresponding data retrieved from the robot tool.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_37",
            "start": 937,
            "end": 1124,
            "label": {}
        },
        {
            "ix": "9-660_v2_37@6",
            "content": "Such a project is currently underway.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_37",
            "start": 1126,
            "end": 1162,
            "label": {}
        },
        {
            "ix": "9-660_v2_38@0",
            "content": "Summary",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_38",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "9-660_v2_39@0",
            "content": "We present a rapid-to-implement, feedback approved method guide for initial steps to improve value of preclinical lab deliverables in a budget-restricted academic research environment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_39",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "9-660_v2_39@1",
            "content": "Given the increasing concerns on the value of preclinical research, we believe our activities are in line with current goals of funding authorities, academic self-governance and help to improve trust and recognition of science in society.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_39",
            "start": 185,
            "end": 422,
            "label": {}
        },
        {
            "ix": "9-660_v2_39@2",
            "content": "We hypothesize that side effects of a QMS can also reduce inequality/discrimination amongst stakeholders.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_39",
            "start": 424,
            "end": 528,
            "label": {}
        },
        {
            "ix": "9-660_v2_40@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_40",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "9-660_v2_41@0",
            "content": "Underlying data",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_41",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "9-660_v2_42@0",
            "content": "Zenodo: STR Analysis results BTSC 349, BTSC268 and mix of both.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_42",
            "start": 0,
            "end": 62,
            "label": {}
        },
        {
            "ix": "9-660_v2_42@1",
            "content": "http://doi.org/10.5281/zenodo.3901446 <REF-11>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_42",
            "start": 64,
            "end": 109,
            "label": {}
        },
        {
            "ix": "9-660_v2_43@0",
            "content": "This project contains the following underlying data:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_43",
            "start": 0,
            "end": 51,
            "label": {}
        },
        {
            "ix": "9-660_v2_44@0",
            "content": "- - 15-1-Wiss2020-01-16.fsa (BTSC 349 short tandem repeat analysis)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_44",
            "start": 0,
            "end": 66,
            "label": {}
        },
        {
            "ix": "9-660_v2_44@1",
            "content": "- - 15-3-Wiss2020-01-16.fsa (BTSC268 short tandem repeat analysis)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_44",
            "start": 68,
            "end": 133,
            "label": {}
        },
        {
            "ix": "9-660_v2_44@2",
            "content": "- - 15-4-Wiss2020-01-16.fsa (Mixed cell line short tandem repeat analysis)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_44",
            "start": 135,
            "end": 208,
            "label": {}
        },
        {
            "ix": "9-660_v2_45@0",
            "content": "Data are available under the terms of the Creative Commons Attribution 4.0 International license (CC-BY 4.0).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_45",
            "start": 0,
            "end": 108,
            "label": {}
        },
        {
            "ix": "9-660_v2_46@0",
            "content": "<REF-1> DIN EN ISO 9001: 2015-11 - Quality management systems. Beuth, 2015. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_46",
            "start": 0,
            "end": 91,
            "label": {}
        },
        {
            "ix": "9-660_v2_47@0",
            "content": "<REF-2> Tackett JL Miller JD : Introduction to the Special Section on Increasing Replicability, Transparency, and Openness in Clinical Psychology. J Abnorm Psychol. 2019 ; 128 ( 6 ): 487 – 492 . 31368726 10.1037/abn0000455",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_47",
            "start": 0,
            "end": 221,
            "label": {}
        },
        {
            "ix": "9-660_v2_48@0",
            "content": "<REF-4> Baker M : Is there a reproducibility crisis? Nature. 2016 ; 533 ( 7604 ): 452 – 454 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_48",
            "start": 0,
            "end": 109,
            "label": {}
        },
        {
            "ix": "9-660_v2_49@0",
            "content": "<REF-5> elabftw.net . [cited 2020 Mar 19]. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_49",
            "start": 0,
            "end": 58,
            "label": {}
        },
        {
            "ix": "9-660_v2_50@0",
            "content": "<REF-6> eLabFTW version 3.4.8 . [cited 2020 May 06]. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_50",
            "start": 0,
            "end": 68,
            "label": {}
        },
        {
            "ix": "9-660_v2_51@0",
            "content": "<REF-7> Vargas-Toscano A Khan D Nickel AC : Robot technology identifies a Parkinsonian therapeutics repurpose to target stem cells of glioblastoma. CNS Oncol. 2020 ; 9 ( 2 ): CNS58 . 32462934 10.2217/cns-2020-0004",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_51",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "9-660_v2_52@0",
            "content": "<REF-8> Wilkinson M Dumontier M Aalbersberg IJJ : The FAIR Guiding Principles for scientific data management and stewardship. Sci Data. 2016 ; 3 : 160018. 26978244 10.1038/sdata.2016.18 4792175",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_52",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "9-660_v2_53@0",
            "content": "<REF-9> Moher D Bouter L Kleinert S : The Hong Kong Principles for Assessing Researchers: Fostering Research Integrity. OSF Reprints. 2019 . 10.31219/osf.io/m9abx",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_53",
            "start": 0,
            "end": 161,
            "label": {}
        },
        {
            "ix": "9-660_v2_54@0",
            "content": "<REF-10> German Research Foundation Guidelines for Safeguarding Good Research Practice, Code of Conduct . Self-published, 2019 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_54",
            "start": 0,
            "end": 144,
            "label": {}
        },
        {
            "ix": "9-660_v2_55@0",
            "content": "<REF-11> Nickel AC : STR Analysis results BTSC 349, BTSC268 and mix of both . [Data set]. Zenodo. 2020 . http://www.doi.org/10.5281/zenodo.3901446",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_55",
            "start": 0,
            "end": 145,
            "label": {}
        },
        {
            "ix": "9-660_v2_56@0",
            "content": "<REF-12> Venkataramani V Tanev DI Strahle C : Glutamatergic Synaptic Input to Glioma Cells Drives Brain Tumour Progression. Nature. 2019 ; 573 ( 7775 ): 532 – 538 . 31534219 10.1038/s41586-019-1564-x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-660_v2_56",
            "start": 0,
            "end": 198,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_1",
            "tgt_ix": "9-660_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_1",
            "tgt_ix": "9-660_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_1",
            "tgt_ix": "9-660_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_1",
            "tgt_ix": "9-660_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_6",
            "tgt_ix": "9-660_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_6",
            "tgt_ix": "9-660_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_6",
            "tgt_ix": "9-660_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_6",
            "tgt_ix": "9-660_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_11",
            "tgt_ix": "9-660_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_11",
            "tgt_ix": "9-660_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_13",
            "tgt_ix": "9-660_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_15",
            "tgt_ix": "9-660_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_15",
            "tgt_ix": "9-660_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_18",
            "tgt_ix": "9-660_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_18",
            "tgt_ix": "9-660_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_21",
            "tgt_ix": "9-660_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_23",
            "tgt_ix": "9-660_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_25",
            "tgt_ix": "9-660_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_27",
            "tgt_ix": "9-660_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_29",
            "tgt_ix": "9-660_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_29",
            "tgt_ix": "9-660_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_29",
            "tgt_ix": "9-660_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_29",
            "tgt_ix": "9-660_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_29",
            "tgt_ix": "9-660_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_34",
            "tgt_ix": "9-660_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_29",
            "tgt_ix": "9-660_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_29",
            "tgt_ix": "9-660_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_38",
            "tgt_ix": "9-660_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_40",
            "tgt_ix": "9-660_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_41",
            "tgt_ix": "9-660_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_41",
            "tgt_ix": "9-660_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_41",
            "tgt_ix": "9-660_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_41",
            "tgt_ix": "9-660_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_1",
            "tgt_ix": "9-660_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_2",
            "tgt_ix": "9-660_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_3",
            "tgt_ix": "9-660_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_4",
            "tgt_ix": "9-660_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_5",
            "tgt_ix": "9-660_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_6",
            "tgt_ix": "9-660_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_7",
            "tgt_ix": "9-660_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_8",
            "tgt_ix": "9-660_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_9",
            "tgt_ix": "9-660_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_10",
            "tgt_ix": "9-660_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_11",
            "tgt_ix": "9-660_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_12",
            "tgt_ix": "9-660_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_13",
            "tgt_ix": "9-660_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_14",
            "tgt_ix": "9-660_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_15",
            "tgt_ix": "9-660_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_17",
            "tgt_ix": "9-660_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_18",
            "tgt_ix": "9-660_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_20",
            "tgt_ix": "9-660_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_21",
            "tgt_ix": "9-660_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_23",
            "tgt_ix": "9-660_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_25",
            "tgt_ix": "9-660_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_27",
            "tgt_ix": "9-660_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_29",
            "tgt_ix": "9-660_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_31",
            "tgt_ix": "9-660_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_34",
            "tgt_ix": "9-660_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_35",
            "tgt_ix": "9-660_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_36",
            "tgt_ix": "9-660_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_37",
            "tgt_ix": "9-660_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_38",
            "tgt_ix": "9-660_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_39",
            "tgt_ix": "9-660_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_40",
            "tgt_ix": "9-660_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_41",
            "tgt_ix": "9-660_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_42",
            "tgt_ix": "9-660_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_43",
            "tgt_ix": "9-660_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_44",
            "tgt_ix": "9-660_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_10",
            "tgt_ix": "9-660_v2_46",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_10",
            "tgt_ix": "9-660_v2_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_10",
            "tgt_ix": "9-660_v2_48",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_37",
            "tgt_ix": "9-660_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_12",
            "tgt_ix": "9-660_v2_14",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_35",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-660_v2_0",
            "tgt_ix": "9-660_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_1",
            "tgt_ix": "9-660_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_2",
            "tgt_ix": "9-660_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_2",
            "tgt_ix": "9-660_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_2",
            "tgt_ix": "9-660_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_2",
            "tgt_ix": "9-660_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_3",
            "tgt_ix": "9-660_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_3",
            "tgt_ix": "9-660_v2_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_3",
            "tgt_ix": "9-660_v2_3@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_3",
            "tgt_ix": "9-660_v2_3@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_3",
            "tgt_ix": "9-660_v2_3@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_3",
            "tgt_ix": "9-660_v2_3@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_4",
            "tgt_ix": "9-660_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_4",
            "tgt_ix": "9-660_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_5",
            "tgt_ix": "9-660_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_6",
            "tgt_ix": "9-660_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_7",
            "tgt_ix": "9-660_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_7",
            "tgt_ix": "9-660_v2_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_7",
            "tgt_ix": "9-660_v2_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_8",
            "tgt_ix": "9-660_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_8",
            "tgt_ix": "9-660_v2_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_8",
            "tgt_ix": "9-660_v2_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_8",
            "tgt_ix": "9-660_v2_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_8",
            "tgt_ix": "9-660_v2_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_9",
            "tgt_ix": "9-660_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_9",
            "tgt_ix": "9-660_v2_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_9",
            "tgt_ix": "9-660_v2_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_10",
            "tgt_ix": "9-660_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_10",
            "tgt_ix": "9-660_v2_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_10",
            "tgt_ix": "9-660_v2_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_10",
            "tgt_ix": "9-660_v2_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_11",
            "tgt_ix": "9-660_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_12",
            "tgt_ix": "9-660_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_13",
            "tgt_ix": "9-660_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_15",
            "tgt_ix": "9-660_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_16",
            "tgt_ix": "9-660_v2_16@14",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_17",
            "tgt_ix": "9-660_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_17",
            "tgt_ix": "9-660_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_17",
            "tgt_ix": "9-660_v2_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_18",
            "tgt_ix": "9-660_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_19",
            "tgt_ix": "9-660_v2_19@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_20",
            "tgt_ix": "9-660_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_20",
            "tgt_ix": "9-660_v2_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_20",
            "tgt_ix": "9-660_v2_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_20",
            "tgt_ix": "9-660_v2_20@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_20",
            "tgt_ix": "9-660_v2_20@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_20",
            "tgt_ix": "9-660_v2_20@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_21",
            "tgt_ix": "9-660_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_22",
            "tgt_ix": "9-660_v2_22@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_23",
            "tgt_ix": "9-660_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_24",
            "tgt_ix": "9-660_v2_24@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_25",
            "tgt_ix": "9-660_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_26@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_26@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_26@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_26@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_26@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_26@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_26",
            "tgt_ix": "9-660_v2_26@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_27",
            "tgt_ix": "9-660_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_28@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_28@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_28@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_28@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_28",
            "tgt_ix": "9-660_v2_28@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_29",
            "tgt_ix": "9-660_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_30@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_30@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_30@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_30@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_30@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_30@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_30@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_30",
            "tgt_ix": "9-660_v2_30@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_31",
            "tgt_ix": "9-660_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_31",
            "tgt_ix": "9-660_v2_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_31",
            "tgt_ix": "9-660_v2_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_31",
            "tgt_ix": "9-660_v2_31@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_31",
            "tgt_ix": "9-660_v2_31@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_31",
            "tgt_ix": "9-660_v2_31@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_31",
            "tgt_ix": "9-660_v2_31@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_31",
            "tgt_ix": "9-660_v2_31@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_32@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_32@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_32@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_32@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_32",
            "tgt_ix": "9-660_v2_32@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_33@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_33@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_33@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_33@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_33@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_33@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_33@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_33@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_33",
            "tgt_ix": "9-660_v2_33@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_34",
            "tgt_ix": "9-660_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_36",
            "tgt_ix": "9-660_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_36",
            "tgt_ix": "9-660_v2_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_36",
            "tgt_ix": "9-660_v2_36@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_36",
            "tgt_ix": "9-660_v2_36@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_37",
            "tgt_ix": "9-660_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_37",
            "tgt_ix": "9-660_v2_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_37",
            "tgt_ix": "9-660_v2_37@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_37",
            "tgt_ix": "9-660_v2_37@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_37",
            "tgt_ix": "9-660_v2_37@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_37",
            "tgt_ix": "9-660_v2_37@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_37",
            "tgt_ix": "9-660_v2_37@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_38",
            "tgt_ix": "9-660_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_39",
            "tgt_ix": "9-660_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_39",
            "tgt_ix": "9-660_v2_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_39",
            "tgt_ix": "9-660_v2_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_40",
            "tgt_ix": "9-660_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_41",
            "tgt_ix": "9-660_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_42",
            "tgt_ix": "9-660_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_42",
            "tgt_ix": "9-660_v2_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_43",
            "tgt_ix": "9-660_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_44",
            "tgt_ix": "9-660_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_44",
            "tgt_ix": "9-660_v2_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_44",
            "tgt_ix": "9-660_v2_44@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_45",
            "tgt_ix": "9-660_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_46",
            "tgt_ix": "9-660_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_47",
            "tgt_ix": "9-660_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_48",
            "tgt_ix": "9-660_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_49",
            "tgt_ix": "9-660_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_50",
            "tgt_ix": "9-660_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_51",
            "tgt_ix": "9-660_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_52",
            "tgt_ix": "9-660_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_53",
            "tgt_ix": "9-660_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_54",
            "tgt_ix": "9-660_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_55",
            "tgt_ix": "9-660_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-660_v2_56",
            "tgt_ix": "9-660_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "9-660_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.24494.2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "An inexpensive and easy-to-implement approach to a Quality Management System for an academic research lab",
        "abstract": "Background: Increasing concerns emerge regarding the limited success in reproducing data and translating research results into applications. This is a major problem for science, society and economy. Driven by industry or scientific networks, several attempts to combat this crisis are initiated. However, only few measures address the applicability and feasibility of implementation of actions into an academic research environment with limited resources. Methods: Here we propose a strategy catalogue aiming for a quality management system suitable for many research labs, on the example of a cell culture focused laboratory. Our proposal is guided by its inexpensiveness and possibility of rapid installation. For this we used eLabFTW, an electronic lab book, as hub for all other components of our Quality Management System (QMS) and digital storage of lab journals. We introduced Standard Operation Procedures (SOPs) as well as a managed bio bank for safer long-term storage of bio samples. Next, we set up a lab meeting as feedback mechanism for the QMS. Finally, we implemented an automated pipeline to be used for example for drug screens. Results : With this effort we want to reduce individual differences in work techniques, to further improve the quality of our results. Although, just recently established, we can already observe positive outcomes in quality of experimental results, improvements in sample and data storage, stakeholder engagement and even promotion of new scientific discoveries. Conclusions: We believe that our experiences can help to establish a road map to increase value and output of preclinical research in academic labs with limited budget and personnel.",
        "contributors": [
            {
                "surname": "Hewera",
                "given-names": "Michael"
            },
            {
                "surname": "Nickel",
                "given-names": "Ann-Christin"
            },
            {
                "surname": "Knipprath",
                "given-names": "Nina"
            },
            {
                "surname": "Muhammad",
                "given-names": "Sajjad"
            },
            {
                "surname": "Fan",
                "given-names": "Xiaolong"
            },
            {
                "surname": "Steiger",
                "given-names": "Hans-Jakob"
            },
            {
                "surname": "Hänggi",
                "given-names": "Daniel"
            },
            {
                "surname": "Kahlert",
                "given-names": "Ulf Dietrich"
            }
        ],
        "url": "https://f1000research.com/articles/9-660/v2/",
        "doc_id": "9-660",
        "version": 2,
        "ix_counter": 309,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}