{
    "nodes": [
        {
            "ix": "1-62_v1_0",
            "content": "F 1 F o ATP synthase a-subunit of Stenotrophomonas sp. DL18 from Indian Soda Lake, Lonar: a brief report",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_2",
            "content": "Lonar Lake, an Indian Soda Lake, is well known for its biodiversity of extremophiles including alkaliphiles. Most of the molecular studies on Lonar Lake alkaliphiles are based on molecular identification by 16S ribosomal RNA along with numerous applications in the biotechnology industry. However, molecular basis of adaptation of these alkaliphiles to high alkaline conditions is incompletely understood. Attempts were made to isolate and identify alkaliphiles from their naturally occurring original habitat, i.e. Lonar Lake, India with high alkaline conditions of pH 10.5. One facultative alkaliphile, Stenotrophomonas species DL18, was studied for F 1 F o ATP synthase a-subunit with reference to alkaliphile-specific domains. Although the a-subunit of Stenotrophomonas DL18 showed significant similarity with neutrophiles, the isolated bacterium is an alkaliphile and optimally grows at pH 10.5.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_4",
            "content": "ATP is the molecular currency for a living cell, which is not only merely growing and dividing but also continuously responding to external environmental stimuli. To sustain life in extreme conditions, microorganisms devise specific mechanisms for their adaptation. Along with other transporter proteins, ATP synthase is widely considered as one of the key molecules for adaptation at alkaline conditions.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_5",
            "content": "Hydrolysis of nucleoside tri-phosphates, specifically ATP, provides the chemical energy to drive a wide variety of cellular reactions. ATP synthases are central to ATP production during oxidative phosphorylation. These are energy-coupling factors and hence called F <REF-1> F o -ATP synthases. The F o integral membrane protein complex (the subscript ‘o’ denotes its inhibition by the drug oligomycin) provides a transmembrane pore for protons, whereas the peripheral protein F <REF-1> (the subscript ‘1’ indicates that it was the first of several factors isolated from mitochondria) is involved in catalysis <REF-1> . F <REF-1> consists of five subunits α <REF-3> β <REF-3> γ <REF-1> δ <REF-1> ε <REF-1> , with a ring of α- and β-subunits alternating around a single γ-subunit <REF-2> . F o is a membrane embedded domain with subunits ab <REF-2> c 10–15 . Out of these subunits, the a -subunit is a stator and c-ring is a rotor ring through which ions (H + or Na + ) are translocated <REF-3> – <REF-6> . Each c -chain from the ring consists of two α-helices traversing the membrane, and the polar loop extends out of the membrane to interact with the γ-and ε-subunits. A cytoplasmic F <REF-1> catalytic domain is connected with a membrane-embedded F o domain by a central (γε) and peripheral (b <REF-2> δ) stalk <REF-2> – <REF-6> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_6",
            "content": "Downhill ion translocation across the membrane through F o causes rotation of the c-ring, which induces conformational changes in the catalytic β-subunit and results in ATP synthesis. The c 11 ring from Ilyobacter tartaricus has Na + ion binding specificity, while the c 13 ring from Bacillus pseudofirmus OF4 and the c 15 ring from Spirulina platensis has H + ion binding specificity <REF-6> . Ion coordination geometry and distances determine the ion specificity. Translocated ions bind to conserved carboxylate of aspartate or glutamate (D/E) in the outer α-helices of c-rings <REF-5> , <REF-6> . However, ions are further coordinated by a network of residues. The inner and outer α-helices are in a staggered position. Out of these, the inner helices are hydrophobic in nature and in contact with the phospholipids, while outer helices are hydrophilic with a -subunit interaction for ion translocation <REF-2> , <REF-6> . The transmembrane electric potential controls the kinetics of rotary motion, which seems to be independent of the ionic gradient <REF-5> . However, alkaliphiles grow at high environmental pH, which poses the thermodynamic problem of synthesizing ATP with ATP synthase. For this, there are some crucial amino acid residue adaptations in the a - and c -subunit solving the problem of proton capture from an alkaline environment and subsequent translocation to the binding sites on the c-ring <REF-6> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_7",
            "content": "Various studies based on the mechanism of proton binding <REF-7> , <REF-8> , through hydronium ion proton retention and transportation for ATP synthesis in the bacterial system including alkaliphiles <REF-9> , <REF-10> suggest the presence of alkaliphile specific conserved amino acid motifs in transmembrane helix-4 (TMH-4) and TMH-5 of the a -subunit and the inner and the outer helix of the c -subunit <REF-3> , <REF-11> – <REF-14> of the ATP synthase F o subunit as well as Na + /H + antiporter <REF-15> and other cation binding proton transporters including multiple drug transporters <REF-6> , <REF-16> . The presence of the above mentioned alkaliphile specific sequences of ATP synthase F o subunit along with Na + /H + antiporters and other multiple drug transporters are the major strategies for pH homeostasis of extremely alkaliphilic species.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_8",
            "content": "Most studies have focused on the proton translocation channel in the a -subunit of ATP synthase. The arginine residue of the a -subunit, which transfers protons to the c -subunit, is conserved in almost all bacterial species <REF-3> . Recent developments in molecular studies of facultative alkaliphiles suggests the presence of a highly conserved A X A X A X A motif in the amino terminal helix and a P XX E XX P motif in the carboxy terminal helix of the ATP synthase c -subunit in Bacillus pseudofirmus OF4, an established facultative alkaliphile <REF-6> , <REF-17> , <REF-18> . However, similar experimental evidence from other geographic locations such as highly alkaline soda lakes need further exploration to understand pH homeostasis in facultative alkaliphiles. This study explores the comparison of the ATP synthase a -subunit of facultative alkaliphilic aerobes isolated from Lonar Lake with established and reported alkaliphiles. The present study deals with the isolation, identification and analysis of alkaliphile specific amino acid motifs in the a -subunit of ATP synthase.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_9",
            "content": "Materials and methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_10",
            "content": "Isolation and culture of bacteria",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_11",
            "content": "Underwater sediment soil samples were collected from 350 meters away from Kamalaja Devi Temple end, Lonar Lake, Buldhana, Maharashtra, India. The initial screening was performed at pH 9.5. After mix culture was obtained by the spread plate method, pure culture of each type of colony was maintained for further studies. Then isolates were further studied in the range of pH 7 to pH 12.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_12",
            "content": "DNA extraction and Polymerase Chain Reaction (PCR)",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_13",
            "content": "Bacterial genomic DNA was isolated by the DNAzol method <REF-19> . DNA quantization and quality control for protein contamination was carried out by spectrophotometric absorbance at A 260 and A 280 . The small subunit ribosomal RNA (16S rRNA) PCR for identification of bacterium was performed with forward primer (16S20F: 5’ATGTTGATCATGGCTCA3’) and reverse primer (16S1540R: 5’AAGGAGGTGATCCAACCGCA 3’) <REF-20> . Briefly, master mix was prepared for 16S rRNA PCR: 10x PCR Rxn Buffer without MgCl 2 (Invitrogen, P/N Y02028B Lot no. WK1B1b, USA), 1mM MgCl 2 (Invitrogen, P/N Y02016B Lot no. WK2B1a, USA), 200 µM dNTP mix (Merck, India), 100 picomoles of each reverse and forward primers (Integrated DNA technologies, USA), 2.5U of Taq Polymerase enzyme (Invitrogen, USA, 11615-010 Lot No. VKRB1E) and nuclease free water (Merck, India) was added to make up a final volume of 100 µl. Following thermal cycling conditions were used for PCR: Initial denaturation at 94°C for 5 min, followed by 30 cycles of denaturation at 94°C for 1 min, primer annealing at 55°C for 1 min and primer extension at 72°C for 2 min. Thirty cycles of PCR were followed by final extension at 72°C for 5 min followed by cooling at 4°C.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_14",
            "content": "ATP synthase F o amplification primers were designed based on S. maltophilia K279a as follows: forward primer Steno atp1F: 5’CCTGGCGGATCCTTAGATCTCCG 3’ and reverse primer Steno atp1R: 5’CAGTGAGGATCCTTAGATCTCCGAGGCCAGCT 3’. Briefly, PCR reaction mixture of 100 µl was prepared as 10x PCR Rxn Buffer (Invitrogen), 50mM MgCl 2 (Invitrogen) 1.8 µl, 10 mM dNTP mix 3.0 µl (Merck), 100 picomoles of each forward and reverse primers (Integrated DNA technologies, USA), 5U Taq DNA polymerase (Invitrogen) with pfu (Chromous biotech, India) and bacterial genomic DNA templates 200 ng, with remaining nuclease free water (Merck, India). The thermal cycling conditions were: initial denaturation at 94°C for 5 min, followed by 30 cycles of denaturation at 94°C for 30s, primer annealing at 55°C for 30s and primer extension at 72°C for 3 min. Final extension was carried out at 72°C for 5 min and stored at 4°C. Results of 16S rRNA and ATP synthase F o amplicons were visualized on 1% agarose gel with 200 ng/ml ethidium bromide (sd fine, India) and results were observed and analyzed with the help of Bio-Rad gel documentation system XR with Bio-Rad Quantity-One 4.6.5 software.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_15",
            "content": "DNA sequencing and analysis",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_16",
            "content": "The 16S rRNA PCR product sequencing was carried out by modified Sanger’s dideoxy chain termination cycle sequencing method <REF-21> . Electropherogram was read by an automated DNA sequencer ( Applied Biosystems ABI3500 XL Genetic Analyzer, Big Dye Terminator version 3.1 Cycle sequencing kit ) for 1.5 kb amplicon of the isolate. The resulting final DNA sequence of isolate was subjected to BLAST analysis on the NCBI web server. The phylogenetic tree of 16S rRNA of the isolate was constructed by using a neighbor-joining (NJ) method with 1000 replicates of bootstrap in MEGA4.1 software <REF-22> . The bootstrap consensus tree inferred from 1000 replicates was selected to represent the evolutionary history of the taxa for 16S rRNA sequence analysis.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_17",
            "content": "Further, the DNA sequencing of the ATP F o subunit of selected isolates was performed by primer walking method. The NCBI Blast server was used for the identification of the ATP synthase a -subunit and the phylogenetic analysis of the a -subunit was carried out with the help of MEGA4.1. The blastx was used to get the amino acid sequence of the a -subunit. The a -subunit of isolate was compared with that of established alkaliphiles, acidophiles and neutrophiles with the help of ClustalW.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_18",
            "content": "Results and discussion",
            "ntype": "title",
            "meta": {
                "section": "3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_19",
            "content": "Bacterial identification",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_20",
            "content": "Across the pH gradient, growth of morphologically different bacterial colonies was observed. Out of these, some bacterial colonies were found with pink and orange pigmentation along with no pigmentation i.e. white colonies. The orange pigmented bacterium was identified as Stenotrophomonas species based on BLAST analysis of 16S rRNA gene sequence and titled as Stenotrophomonas species DL18 (GenBank Accession number: JN995612 ). Stenotrophomonas species DL18 optimally grow at the pH 9.0 to 10.0. However, the pH range of growth was pH 7.0 to 12.0 (Supplementary figure 1) . The Stenotrophomonas species DL18 is known to be an aerobic, facultative alkaliphilic curved rod (Supplementary figure 2) .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_21",
            "content": "Supplementary material figure 1.",
            "ntype": "label",
            "meta": {
                "id": "SF1",
                "caption": "Growth of Stenotrophomonas species DL18 at neutral to alkaline conditions i.e. pH 7.0 to 12.0.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_suppl_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_22",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"SF1\" position=\"float\"> <caption> <title>Growth of <italic>Stenotrophomonas</italic> species DL18 at neutral to alkaline conditions i.e. pH 7.0 to 12.0.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_suppl_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "SF1",
                "caption": "Growth of Stenotrophomonas species DL18 at neutral to alkaline conditions i.e. pH 7.0 to 12.0.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_suppl_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_23",
            "content": "Supplementary material figure 2.",
            "ntype": "label",
            "meta": {
                "id": "SF2",
                "caption": "Scanning Electron Microscope image of Stenotrophomonas species DL18. Left panel 50,000 times magnification, right panel 100,000 times magnification.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_suppl_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_24",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"SF2\" position=\"float\"> <caption> <title>Scanning Electron Microscope image of <italic>Stenotrophomonas</italic> species DL18.</title> <p>Left panel 50,000 times magnification, right panel 100,000 times magnification.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_suppl_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "SF2",
                "caption": "Scanning Electron Microscope image of Stenotrophomonas species DL18. Left panel 50,000 times magnification, right panel 100,000 times magnification.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_suppl_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_25",
            "content": "ATP synthase a -subunit of Stenotrophomonas species DL18",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_26",
            "content": "BLAST analysis of the ATP synthase a -subunit of the Stenotrophomonas species DL 18 suggests maximum identity at the amino acid level (259 identical amino acids from a total of 266 amino acids of Stenotrophomonas species SKA14; GenBank Accession number: ZP_05136035 ). The amino acid residue arginine, which was found to be conserved in almost all bacterial species in the a -subunit, was observed at position 200 (Arg 200 ) (Supplementary figure 3) . Moreover, other amino acids that were conserved in most of the bacteria include Leu 207 , Arg 210 , Leu 211 , Gly 213 , Asn 214 , Gly 218 , Gln 252 , Ala 253 , Phe 255 ( E. coli numbering system for ATP synthase a -subunit) in TMH-4 and TMH-5 and the corresponding amino acids were also found in the Stenotrophomonas species DL 18 in alignment ( Figure 1 , Figure 2 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_27",
            "content": "Supplementary material figure 3.",
            "ntype": "label",
            "meta": {
                "id": "SF3",
                "caption": "Stenotrophomonas species DL18 ATP synthase a -subunit derived by homology modeling: The amino acid sequence of a -subunits was subjected to NCBI blastp and related known structure was obtained. Further, the homology modeling was carried out by using SWISS MODEL using respective reference PDB structure and the modeled structure was visualized by Pymol.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_suppl_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_28",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"SF3\" position=\"float\"> <caption> <title> <italic>Stenotrophomonas</italic> species DL18 ATP synthase <italic>a</italic>-subunit derived by homology modeling: The amino acid sequence of <italic>a</italic>-subunits was subjected to NCBI blastp and related known structure was obtained.</title> <p>Further, the homology modeling was carried out by using SWISS MODEL using respective reference PDB structure and the modeled structure was visualized by Pymol.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_suppl_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "SF3",
                "caption": "Stenotrophomonas species DL18 ATP synthase a -subunit derived by homology modeling: The amino acid sequence of a -subunits was subjected to NCBI blastp and related known structure was obtained. Further, the homology modeling was carried out by using SWISS MODEL using respective reference PDB structure and the modeled structure was visualized by Pymol.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_suppl_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_29",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Complete amino acid sequence of Stenotrophomonas species DL18 ATP synthase a -subunit. The most conserved amino acid residues are shown as bold and underlined.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_30",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Complete amino acid sequence of <italic>Stenotrophomonas</italic> species DL18 ATP synthase <italic>a</italic>-subunit.</title> <p>The most conserved amino acid residues are shown as bold and underlined.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Complete amino acid sequence of Stenotrophomonas species DL18 ATP synthase a -subunit. The most conserved amino acid residues are shown as bold and underlined.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_31",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Alignment of a -subunit of ATP synthase from neutrophiles and alkaliphiles. Conserved sequences are underlined and significant variant residues for channel formation are shown in bold. These residues are mainly from TMH-4 and TMH-5. Bacillus megaterium DSM 319 (GenBank Accession number: YP_003600289 ) grows strictly in neutral pH environments. However, Bacillus clausii KSM K-16 (GenBank Accession number: YP_177349 ) is a reported alkaliphile.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_32",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Alignment of <italic>a</italic>-subunit of ATP synthase from neutrophiles and alkaliphiles.</title> <p>Conserved sequences are underlined and significant variant residues for channel formation are shown in bold. These residues are mainly from TMH-4 and TMH-5.</p> <p> <italic>Bacillus megaterium</italic> DSM 319 (GenBank Accession number: <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.ncbi.nlm.nih.gov/protein/295707214\">YP_003600289</ext-link>) grows strictly in neutral pH environments. However, <italic>Bacillus clausii</italic> KSM K-16 (GenBank Accession number: <ext-link ext-link-type=\"uri\" xlink:href=\"http://www.ncbi.nlm.nih.gov/protein/56965615\">YP_177349</ext-link>) is a reported alkaliphile.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Alignment of a -subunit of ATP synthase from neutrophiles and alkaliphiles. Conserved sequences are underlined and significant variant residues for channel formation are shown in bold. These residues are mainly from TMH-4 and TMH-5. Bacillus megaterium DSM 319 (GenBank Accession number: YP_003600289 ) grows strictly in neutral pH environments. However, Bacillus clausii KSM K-16 (GenBank Accession number: YP_177349 ) is a reported alkaliphile.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_33",
            "content": "Comparison of a -subunit of Stenotrophomonas species DL18 with acidophiles, alkaliphiles and neutrophiles",
            "ntype": "title",
            "meta": {
                "section": "3.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_34",
            "content": "It was observed that the most conserved arginine residue of the a -subunit (Arg 200 of Stenotrophomonas species DL18) was aligned with the expected position of the facultative alkaliphile Bacillus pseudofirmus OF4 (i.e. Arg 172 ; GenBank Accession number: YP_003426326 ). This positively charged Arg 200 plays an elemental role in the function of the F o rotor <REF-3> . Amino acid Lys 180 of Bacillus pseudofirmus OF4 was replaced by Gly 208 in the Stenotrophomonas species DL 18. In addition, a glycine residue was observed at the same position in other alkaliphiles, T. cyclicum (Gly 206 ; GenBank Accession number: YP_004537849 ), and same amino acid family Ala 230 in Theoalkalivibrio species K90mix (GenBank Accession number: YP_003461818 ) as shown in Figure 2 . On the other hand, glycine was also at the same corresponding position in alignment for the acidophiles, A. ferrooxidans (GenBank Accession number: YP_002221206 ), and A. cryptum (GenBank Accession number: YP_001233541 ) (Figure 3) . Lys 180 and corresponding amino acids were located in transmembrane helix-4 ( a TMH-4) in Bacillus pseudofirmus OF4 and other alkaliphiles <REF-23> , <REF-24> . In the Stenotrophomonas species DL 18, a histidine residue, which is conserved in other reference species of the same genus ( S. maltophilia K279a GenBank Accession number: YP_001973793 ; and S . sp. SKA14) and other alkaliphiles T. cyclicum (His244), and Theoalkalivibrio species K90mix (His 262 ), was present at position 240 (His 240 ) (Figure 2) . However, E. coli K12 DH10B (GenBank Accession number: YP_001732559 ), considered as neutrophile, can adapt to slightly alkaline conditions i.e. up to pH 8.0 and this may be due to the presence of His 245 . It was proposed that Gly 120 and Lys 180 form a channel residing within the proton uptake pathway of the a -subunit through which protons pass onto the neighboring c -subunit in Bacillus pseudofirmus OF4 <REF-18> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_35",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "Alignment of a -subunit of ATP synthase from acidophiles, neutrophiles and alkaliphiles. Conserved sequences from TMH-4 and TMH-5 are underlined and significant variant residues for channel formation are shown in bold.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_36",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>Alignment of <italic>a</italic>-subunit of ATP synthase from acidophiles, neutrophiles and alkaliphiles.</title> <p>Conserved sequences from TMH-4 and TMH-5 are underlined and significant variant residues for channel formation are shown in bold.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "Alignment of a -subunit of ATP synthase from acidophiles, neutrophiles and alkaliphiles. Conserved sequences from TMH-4 and TMH-5 are underlined and significant variant residues for channel formation are shown in bold.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/231/7b58b107-c262-4f66-a40f-5aa4c2df4e12_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_37",
            "content": "However, Ala 198 from the Stenotrophomonas species DL 18 and Ala 196 from T. cyclicum were found to correspond with Gly 208 in E. coli and Gly 170 in Bacillus pseudofirmus OF4 in alignment of the a -subunit as shown in Figure 2 . In a similar way, Gly 207 was observed in Stenotrophomonas species DL 18, while in this respective position alanine was found in alkaliphiles and neutrophiles. But both amino acids correspond from the same amino acid family. However, one of the studies reported the His 245 along with the Glu 219 positioning plays a critical role in ion translocation in E. coli <REF-25> , while in Stenotrophomonas species DL 18 these were at His 240 and Glu 209 as shown in Figure 2 .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_38",
            "content": "McMillan et al <REF-25> showed the importance of the residue with a basic side chain along with its pKa value in ATP synthesis linked with alkaline environment. However, these studies were carried out with a mutation study in the Bacillus pseudofirmus OF4 a -subunit, specifically with the position of the residue at 180. These studies included mutations at Lys 180 position as Gly 180 , His 180 and Arg 180 . These mutations showed the ATP synthesis at neutral, neutral to alkaline, and only at alkaline conditions (>pH 8.5), respectively i.e. residue with a strong base, such as lysine or arginine, was ideally appropriate to function at alkaline pH. Since, it was particularly marked for histidine, which has a pKa in a neutral range, it showed significant ATP synthesis activity at pH 9.0. However, exchange mutations at Gly 120 and Lys 180 to Lys 120 and Gly 180 showed ATP synthase activity in Bacillus pseudofirmus OF4. Similar studies in E. coli showed that the positions Gly 218 and His 245 along with G1u 219 had a critical interaction with F o function <REF-26> , <REF-27> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "1-62_v1_39",
            "content": "After comparison with acidophiles, neutrophiles and alkaliphiles, Leu 197 of the Stenotrophomonas species DL 18 was found to be conserved in TMH-4 (Figure 3) . From alignment, Glu 209 of the Stenotrophomonas species DL 18 was conserved in alkaliphiles, neutrophiles and some acidophiles except His 186 Acidiphilium cryptum . In addition, the position of Gly 212 in Bacillus pseudofirmus OF4 corresponds to Ser 212 in E. hirae (neutrophile; GenBank Accession number: YP_006487510 ), His 245 in E. coli and His 240 in the Stenotrophomonas species DL 18 while glutamate in acidophiles, Glu 222 in A. ferrooxidans and Glu 225 in A. cryptum as shown in Figure 3 . This showed that the channel formation may involve a glycine residue along with other residues, specifically acidic, basic and neutral side chain, which play vital roles in ATP synthesis in acidophile, alkaliphiles and neutrophiles. Hence, these residues are found to be critical in channel formation. In the same scenario, the Gly 208 and His 240 may be form the proton translocation channel in Stenotrophomonas species DL 18. Thus the basic side chain residue His 240 and other amino acid residues may be responsible for growth of the Stenotrophomonas species DL 18 at high alkaline pH.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "1-62_v1_0@0",
            "content": "F 1 F o ATP synthase a-subunit of Stenotrophomonas sp. DL18 from Indian Soda Lake, Lonar: a brief report",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_0",
            "start": 0,
            "end": 103,
            "label": {}
        },
        {
            "ix": "1-62_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "1-62_v1_2@0",
            "content": "Lonar Lake, an Indian Soda Lake, is well known for its biodiversity of extremophiles including alkaliphiles.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_2",
            "start": 0,
            "end": 107,
            "label": {}
        },
        {
            "ix": "1-62_v1_2@1",
            "content": "Most of the molecular studies on Lonar Lake alkaliphiles are based on molecular identification by 16S ribosomal RNA along with numerous applications in the biotechnology industry.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_2",
            "start": 109,
            "end": 287,
            "label": {}
        },
        {
            "ix": "1-62_v1_2@2",
            "content": "However, molecular basis of adaptation of these alkaliphiles to high alkaline conditions is incompletely understood.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_2",
            "start": 289,
            "end": 404,
            "label": {}
        },
        {
            "ix": "1-62_v1_2@3",
            "content": "Attempts were made to isolate and identify alkaliphiles from their naturally occurring original habitat, i.e. Lonar Lake, India with high alkaline conditions of pH 10.5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_2",
            "start": 406,
            "end": 574,
            "label": {}
        },
        {
            "ix": "1-62_v1_2@4",
            "content": "One facultative alkaliphile, Stenotrophomonas species DL18, was studied for F 1 F o ATP synthase a-subunit with reference to alkaliphile-specific domains.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_2",
            "start": 576,
            "end": 729,
            "label": {}
        },
        {
            "ix": "1-62_v1_2@5",
            "content": "Although the a-subunit of Stenotrophomonas DL18 showed significant similarity with neutrophiles, the isolated bacterium is an alkaliphile and optimally grows at pH 10.5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_2",
            "start": 731,
            "end": 899,
            "label": {}
        },
        {
            "ix": "1-62_v1_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "1-62_v1_4@0",
            "content": "ATP is the molecular currency for a living cell, which is not only merely growing and dividing but also continuously responding to external environmental stimuli.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_4",
            "start": 0,
            "end": 161,
            "label": {}
        },
        {
            "ix": "1-62_v1_4@1",
            "content": "To sustain life in extreme conditions, microorganisms devise specific mechanisms for their adaptation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_4",
            "start": 163,
            "end": 264,
            "label": {}
        },
        {
            "ix": "1-62_v1_4@2",
            "content": "Along with other transporter proteins, ATP synthase is widely considered as one of the key molecules for adaptation at alkaline conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_4",
            "start": 266,
            "end": 404,
            "label": {}
        },
        {
            "ix": "1-62_v1_5@0",
            "content": "Hydrolysis of nucleoside tri-phosphates, specifically ATP, provides the chemical energy to drive a wide variety of cellular reactions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_5",
            "start": 0,
            "end": 133,
            "label": {}
        },
        {
            "ix": "1-62_v1_5@1",
            "content": "ATP synthases are central to ATP production during oxidative phosphorylation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_5",
            "start": 135,
            "end": 211,
            "label": {}
        },
        {
            "ix": "1-62_v1_5@2",
            "content": "These are energy-coupling factors and hence called F <REF-1> F o -ATP synthases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_5",
            "start": 213,
            "end": 292,
            "label": {}
        },
        {
            "ix": "1-62_v1_5@3",
            "content": "The F o integral membrane protein complex (the subscript ‘o’ denotes its inhibition by the drug oligomycin) provides a transmembrane pore for protons, whereas the peripheral protein F <REF-1> (the subscript ‘1’ indicates that it was the first of several factors isolated from mitochondria) is involved in catalysis <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_5",
            "start": 294,
            "end": 617,
            "label": {}
        },
        {
            "ix": "1-62_v1_5@4",
            "content": "F <REF-1> consists of five subunits α <REF-3> β <REF-3> γ <REF-1> δ <REF-1> ε <REF-1> , with a ring of α- and β-subunits alternating around a single γ-subunit <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_5",
            "start": 619,
            "end": 786,
            "label": {}
        },
        {
            "ix": "1-62_v1_5@5",
            "content": "F o is a membrane embedded domain with subunits ab <REF-2> c 10–15 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_5",
            "start": 788,
            "end": 855,
            "label": {}
        },
        {
            "ix": "1-62_v1_5@6",
            "content": "Out of these subunits, the a -subunit is a stator and c-ring is a rotor ring through which ions (H + or Na + ) are translocated <REF-3> – <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_5",
            "start": 857,
            "end": 1003,
            "label": {}
        },
        {
            "ix": "1-62_v1_5@7",
            "content": "Each c -chain from the ring consists of two α-helices traversing the membrane, and the polar loop extends out of the membrane to interact with the γ-and ε-subunits.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_5",
            "start": 1005,
            "end": 1168,
            "label": {}
        },
        {
            "ix": "1-62_v1_5@8",
            "content": "A cytoplasmic F <REF-1> catalytic domain is connected with a membrane-embedded F o domain by a central (γε) and peripheral (b <REF-2> δ) stalk <REF-2> – <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_5",
            "start": 1170,
            "end": 1331,
            "label": {}
        },
        {
            "ix": "1-62_v1_6@0",
            "content": "Downhill ion translocation across the membrane through F o causes rotation of the c-ring, which induces conformational changes in the catalytic β-subunit and results in ATP synthesis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_6",
            "start": 0,
            "end": 182,
            "label": {}
        },
        {
            "ix": "1-62_v1_6@1",
            "content": "The c 11 ring from Ilyobacter tartaricus has Na + ion binding specificity, while the c 13 ring from Bacillus pseudofirmus OF4 and the c 15 ring from Spirulina platensis has H + ion binding specificity <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_6",
            "start": 184,
            "end": 393,
            "label": {}
        },
        {
            "ix": "1-62_v1_6@2",
            "content": "Ion coordination geometry and distances determine the ion specificity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_6",
            "start": 395,
            "end": 464,
            "label": {}
        },
        {
            "ix": "1-62_v1_6@3",
            "content": "Translocated ions bind to conserved carboxylate of aspartate or glutamate (D/E) in the outer α-helices of c-rings <REF-5> , <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_6",
            "start": 466,
            "end": 598,
            "label": {}
        },
        {
            "ix": "1-62_v1_6@4",
            "content": "However, ions are further coordinated by a network of residues.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_6",
            "start": 600,
            "end": 662,
            "label": {}
        },
        {
            "ix": "1-62_v1_6@5",
            "content": "The inner and outer α-helices are in a staggered position.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_6",
            "start": 664,
            "end": 721,
            "label": {}
        },
        {
            "ix": "1-62_v1_6@6",
            "content": "Out of these, the inner helices are hydrophobic in nature and in contact with the phospholipids, while outer helices are hydrophilic with a -subunit interaction for ion translocation <REF-2> , <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_6",
            "start": 723,
            "end": 924,
            "label": {}
        },
        {
            "ix": "1-62_v1_6@7",
            "content": "The transmembrane electric potential controls the kinetics of rotary motion, which seems to be independent of the ionic gradient <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_6",
            "start": 926,
            "end": 1063,
            "label": {}
        },
        {
            "ix": "1-62_v1_6@8",
            "content": "However, alkaliphiles grow at high environmental pH, which poses the thermodynamic problem of synthesizing ATP with ATP synthase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_6",
            "start": 1065,
            "end": 1193,
            "label": {}
        },
        {
            "ix": "1-62_v1_6@9",
            "content": "For this, there are some crucial amino acid residue adaptations in the a - and c -subunit solving the problem of proton capture from an alkaline environment and subsequent translocation to the binding sites on the c-ring <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_6",
            "start": 1195,
            "end": 1424,
            "label": {}
        },
        {
            "ix": "1-62_v1_7@0",
            "content": "Various studies based on the mechanism of proton binding <REF-7> , <REF-8> , through hydronium ion proton retention and transportation for ATP synthesis in the bacterial system including alkaliphiles <REF-9> , <REF-10> suggest the presence of alkaliphile specific conserved amino acid motifs in transmembrane helix-4 (TMH-4) and TMH-5 of the a -subunit and the inner and the outer helix of the c -subunit <REF-3> , <REF-11> – <REF-14> of the ATP synthase F o subunit as well as Na + /H + antiporter <REF-15> and other cation binding proton transporters including multiple drug transporters <REF-6> , <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_7",
            "start": 0,
            "end": 609,
            "label": {}
        },
        {
            "ix": "1-62_v1_7@1",
            "content": "The presence of the above mentioned alkaliphile specific sequences of ATP synthase F o subunit along with Na + /H + antiporters and other multiple drug transporters are the major strategies for pH homeostasis of extremely alkaliphilic species.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_7",
            "start": 611,
            "end": 853,
            "label": {}
        },
        {
            "ix": "1-62_v1_8@0",
            "content": "Most studies have focused on the proton translocation channel in the a -subunit of ATP synthase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_8",
            "start": 0,
            "end": 95,
            "label": {}
        },
        {
            "ix": "1-62_v1_8@1",
            "content": "The arginine residue of the a -subunit, which transfers protons to the c -subunit, is conserved in almost all bacterial species <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_8",
            "start": 97,
            "end": 233,
            "label": {}
        },
        {
            "ix": "1-62_v1_8@2",
            "content": "Recent developments in molecular studies of facultative alkaliphiles suggests the presence of a highly conserved A X A X A X A motif in the amino terminal helix and a P XX E XX P motif in the carboxy terminal helix of the ATP synthase c -subunit in Bacillus pseudofirmus OF4, an established facultative alkaliphile <REF-6> , <REF-17> , <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_8",
            "start": 235,
            "end": 580,
            "label": {}
        },
        {
            "ix": "1-62_v1_8@3",
            "content": "However, similar experimental evidence from other geographic locations such as highly alkaline soda lakes need further exploration to understand pH homeostasis in facultative alkaliphiles.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_8",
            "start": 582,
            "end": 769,
            "label": {}
        },
        {
            "ix": "1-62_v1_8@4",
            "content": "This study explores the comparison of the ATP synthase a -subunit of facultative alkaliphilic aerobes isolated from Lonar Lake with established and reported alkaliphiles.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_8",
            "start": 771,
            "end": 940,
            "label": {}
        },
        {
            "ix": "1-62_v1_8@5",
            "content": "The present study deals with the isolation, identification and analysis of alkaliphile specific amino acid motifs in the a -subunit of ATP synthase.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_8",
            "start": 942,
            "end": 1089,
            "label": {}
        },
        {
            "ix": "1-62_v1_9@0",
            "content": "Materials and methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_9",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "1-62_v1_10@0",
            "content": "Isolation and culture of bacteria",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_10",
            "start": 0,
            "end": 32,
            "label": {}
        },
        {
            "ix": "1-62_v1_11@0",
            "content": "Underwater sediment soil samples were collected from 350 meters away from Kamalaja Devi Temple end, Lonar Lake, Buldhana, Maharashtra, India.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_11",
            "start": 0,
            "end": 140,
            "label": {}
        },
        {
            "ix": "1-62_v1_11@1",
            "content": "The initial screening was performed at pH 9.5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_11",
            "start": 142,
            "end": 187,
            "label": {}
        },
        {
            "ix": "1-62_v1_11@2",
            "content": "After mix culture was obtained by the spread plate method, pure culture of each type of colony was maintained for further studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_11",
            "start": 189,
            "end": 318,
            "label": {}
        },
        {
            "ix": "1-62_v1_11@3",
            "content": "Then isolates were further studied in the range of pH 7 to pH 12.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_11",
            "start": 320,
            "end": 384,
            "label": {}
        },
        {
            "ix": "1-62_v1_12@0",
            "content": "DNA extraction and Polymerase Chain Reaction (PCR)",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_12",
            "start": 0,
            "end": 49,
            "label": {}
        },
        {
            "ix": "1-62_v1_13@0",
            "content": "Bacterial genomic DNA was isolated by the DNAzol method <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_13",
            "start": 0,
            "end": 65,
            "label": {}
        },
        {
            "ix": "1-62_v1_13@1",
            "content": "DNA quantization and quality control for protein contamination was carried out by spectrophotometric absorbance at A 260 and A 280 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_13",
            "start": 67,
            "end": 198,
            "label": {}
        },
        {
            "ix": "1-62_v1_13@2",
            "content": "The small subunit ribosomal RNA (16S rRNA) PCR for identification of bacterium was performed with forward primer (16S20F: 5’ATGTTGATCATGGCTCA3’) and reverse primer (16S1540R: 5’AAGGAGGTGATCCAACCGCA 3’) <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_13",
            "start": 200,
            "end": 411,
            "label": {}
        },
        {
            "ix": "1-62_v1_13@3",
            "content": "Briefly, master mix was prepared for 16S rRNA PCR: 10x PCR Rxn Buffer without MgCl 2 (Invitrogen, P/N Y02028B Lot no. WK1B1b, USA), 1mM MgCl 2 (Invitrogen, P/N Y02016B Lot no. WK2B1a, USA), 200 µM dNTP mix (Merck, India), 100 picomoles of each reverse and forward primers (Integrated DNA technologies, USA), 2.5U of Taq Polymerase enzyme (Invitrogen, USA, 11615-010 Lot No. VKRB1E) and nuclease free water (Merck, India) was added to make up a final volume of 100 µl.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_13",
            "start": 413,
            "end": 879,
            "label": {}
        },
        {
            "ix": "1-62_v1_13@4",
            "content": "Following thermal cycling conditions were used for PCR: Initial denaturation at 94°C for 5 min, followed by 30 cycles of denaturation at 94°C for 1 min, primer annealing at 55°C for 1 min and primer extension at 72°C for 2 min.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_13",
            "start": 881,
            "end": 1107,
            "label": {}
        },
        {
            "ix": "1-62_v1_13@5",
            "content": "Thirty cycles of PCR were followed by final extension at 72°C for 5 min followed by cooling at 4°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_13",
            "start": 1109,
            "end": 1207,
            "label": {}
        },
        {
            "ix": "1-62_v1_14@0",
            "content": "ATP synthase F o amplification primers were designed based on S. maltophilia K279a as follows: forward primer Steno atp1F: 5’CCTGGCGGATCCTTAGATCTCCG 3’ and reverse primer Steno atp1R: 5’CAGTGAGGATCCTTAGATCTCCGAGGCCAGCT 3’.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_14",
            "start": 0,
            "end": 221,
            "label": {}
        },
        {
            "ix": "1-62_v1_14@1",
            "content": "Briefly, PCR reaction mixture of 100 µl was prepared as 10x PCR Rxn Buffer (Invitrogen), 50mM MgCl 2 (Invitrogen) 1.8 µl, 10 mM dNTP mix 3.0 µl (Merck), 100 picomoles of each forward and reverse primers (Integrated DNA technologies, USA), 5U Taq DNA polymerase (Invitrogen) with pfu (Chromous biotech, India) and bacterial genomic DNA templates 200 ng, with remaining nuclease free water (Merck, India).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_14",
            "start": 223,
            "end": 625,
            "label": {}
        },
        {
            "ix": "1-62_v1_14@2",
            "content": "The thermal cycling conditions were: initial denaturation at 94°C for 5 min, followed by 30 cycles of denaturation at 94°C for 30s, primer annealing at 55°C for 30s and primer extension at 72°C for 3 min.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_14",
            "start": 627,
            "end": 830,
            "label": {}
        },
        {
            "ix": "1-62_v1_14@3",
            "content": "Final extension was carried out at 72°C for 5 min and stored at 4°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_14",
            "start": 832,
            "end": 899,
            "label": {}
        },
        {
            "ix": "1-62_v1_14@4",
            "content": "Results of 16S rRNA and ATP synthase F o amplicons were visualized on 1% agarose gel with 200 ng/ml ethidium bromide (sd fine, India) and results were observed and analyzed with the help of Bio-Rad gel documentation system XR with Bio-Rad Quantity-One 4.6.5 software.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_14",
            "start": 901,
            "end": 1167,
            "label": {}
        },
        {
            "ix": "1-62_v1_15@0",
            "content": "DNA sequencing and analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_15",
            "start": 0,
            "end": 26,
            "label": {}
        },
        {
            "ix": "1-62_v1_16@0",
            "content": "The 16S rRNA PCR product sequencing was carried out by modified Sanger’s dideoxy chain termination cycle sequencing method <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_16",
            "start": 0,
            "end": 132,
            "label": {}
        },
        {
            "ix": "1-62_v1_16@1",
            "content": "Electropherogram was read by an automated DNA sequencer ( Applied Biosystems ABI3500 XL Genetic Analyzer, Big Dye Terminator version 3.1 Cycle sequencing kit ) for 1.5 kb amplicon of the isolate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_16",
            "start": 134,
            "end": 328,
            "label": {}
        },
        {
            "ix": "1-62_v1_16@2",
            "content": "The resulting final DNA sequence of isolate was subjected to BLAST analysis on the NCBI web server.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_16",
            "start": 330,
            "end": 428,
            "label": {}
        },
        {
            "ix": "1-62_v1_16@3",
            "content": "The phylogenetic tree of 16S rRNA of the isolate was constructed by using a neighbor-joining (NJ) method with 1000 replicates of bootstrap in MEGA4.1 software <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_16",
            "start": 430,
            "end": 598,
            "label": {}
        },
        {
            "ix": "1-62_v1_16@4",
            "content": "The bootstrap consensus tree inferred from 1000 replicates was selected to represent the evolutionary history of the taxa for 16S rRNA sequence analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_16",
            "start": 600,
            "end": 752,
            "label": {}
        },
        {
            "ix": "1-62_v1_17@0",
            "content": "Further, the DNA sequencing of the ATP F o subunit of selected isolates was performed by primer walking method.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_17",
            "start": 0,
            "end": 110,
            "label": {}
        },
        {
            "ix": "1-62_v1_17@1",
            "content": "The NCBI Blast server was used for the identification of the ATP synthase a -subunit and the phylogenetic analysis of the a -subunit was carried out with the help of MEGA4.1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_17",
            "start": 112,
            "end": 285,
            "label": {}
        },
        {
            "ix": "1-62_v1_17@2",
            "content": "The blastx was used to get the amino acid sequence of the a -subunit.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_17",
            "start": 287,
            "end": 355,
            "label": {}
        },
        {
            "ix": "1-62_v1_17@3",
            "content": "The a -subunit of isolate was compared with that of established alkaliphiles, acidophiles and neutrophiles with the help of ClustalW.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_17",
            "start": 357,
            "end": 489,
            "label": {}
        },
        {
            "ix": "1-62_v1_18@0",
            "content": "Results and discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_18",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "1-62_v1_19@0",
            "content": "Bacterial identification",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_19",
            "start": 0,
            "end": 23,
            "label": {}
        },
        {
            "ix": "1-62_v1_20@0",
            "content": "Across the pH gradient, growth of morphologically different bacterial colonies was observed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_20",
            "start": 0,
            "end": 91,
            "label": {}
        },
        {
            "ix": "1-62_v1_20@1",
            "content": "Out of these, some bacterial colonies were found with pink and orange pigmentation along with no pigmentation i.e. white colonies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_20",
            "start": 93,
            "end": 222,
            "label": {}
        },
        {
            "ix": "1-62_v1_20@2",
            "content": "The orange pigmented bacterium was identified as Stenotrophomonas species based on BLAST analysis of 16S rRNA gene sequence and titled as Stenotrophomonas species DL18 (GenBank Accession number: JN995612 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_20",
            "start": 224,
            "end": 429,
            "label": {}
        },
        {
            "ix": "1-62_v1_20@3",
            "content": "Stenotrophomonas species DL18 optimally grow at the pH 9.0 to 10.0.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_20",
            "start": 431,
            "end": 497,
            "label": {}
        },
        {
            "ix": "1-62_v1_20@4",
            "content": "However, the pH range of growth was pH 7.0 to 12.0 (Supplementary figure 1) .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_20",
            "start": 499,
            "end": 575,
            "label": {}
        },
        {
            "ix": "1-62_v1_20@5",
            "content": "The Stenotrophomonas species DL18 is known to be an aerobic, facultative alkaliphilic curved rod (Supplementary figure 2) .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_20",
            "start": 577,
            "end": 699,
            "label": {}
        },
        {
            "ix": "1-62_v1_21@0",
            "content": "Supplementary material figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_21",
            "start": 0,
            "end": 31,
            "label": {}
        },
        {
            "ix": "1-62_v1_23@0",
            "content": "Supplementary material figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_23",
            "start": 0,
            "end": 31,
            "label": {}
        },
        {
            "ix": "1-62_v1_25@0",
            "content": "ATP synthase a -subunit of Stenotrophomonas species DL18",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_25",
            "start": 0,
            "end": 55,
            "label": {}
        },
        {
            "ix": "1-62_v1_26@0",
            "content": "BLAST analysis of the ATP synthase a -subunit of the Stenotrophomonas species DL 18 suggests maximum identity at the amino acid level (259 identical amino acids from a total of 266 amino acids of Stenotrophomonas species SKA14; GenBank Accession number: ZP_05136035 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_26",
            "start": 0,
            "end": 267,
            "label": {}
        },
        {
            "ix": "1-62_v1_26@1",
            "content": "The amino acid residue arginine, which was found to be conserved in almost all bacterial species in the a -subunit, was observed at position 200 (Arg 200 ) (Supplementary figure 3) .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_26",
            "start": 269,
            "end": 450,
            "label": {}
        },
        {
            "ix": "1-62_v1_26@2",
            "content": "Moreover, other amino acids that were conserved in most of the bacteria include Leu 207 , Arg 210 , Leu 211 , Gly 213 , Asn 214 , Gly 218 , Gln 252 , Ala 253 , Phe 255 ( E. coli numbering system for ATP synthase a -subunit) in TMH-4 and TMH-5 and the corresponding amino acids were also found in the Stenotrophomonas species DL 18 in alignment ( Figure 1 , Figure 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_26",
            "start": 452,
            "end": 819,
            "label": {}
        },
        {
            "ix": "1-62_v1_27@0",
            "content": "Supplementary material figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_27",
            "start": 0,
            "end": 31,
            "label": {}
        },
        {
            "ix": "1-62_v1_29@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_29",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "1-62_v1_31@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_31",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "1-62_v1_33@0",
            "content": "Comparison of a -subunit of Stenotrophomonas species DL18 with acidophiles, alkaliphiles and neutrophiles",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_33",
            "start": 0,
            "end": 104,
            "label": {}
        },
        {
            "ix": "1-62_v1_34@0",
            "content": "It was observed that the most conserved arginine residue of the a -subunit (Arg 200 of Stenotrophomonas species DL18) was aligned with the expected position of the facultative alkaliphile Bacillus pseudofirmus OF4 (i.e. Arg 172 ; GenBank Accession number: YP_003426326 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_34",
            "start": 0,
            "end": 270,
            "label": {}
        },
        {
            "ix": "1-62_v1_34@1",
            "content": "This positively charged Arg 200 plays an elemental role in the function of the F o rotor <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_34",
            "start": 272,
            "end": 369,
            "label": {}
        },
        {
            "ix": "1-62_v1_34@2",
            "content": "Amino acid Lys 180 of Bacillus pseudofirmus OF4 was replaced by Gly 208 in the Stenotrophomonas species DL 18.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_34",
            "start": 371,
            "end": 480,
            "label": {}
        },
        {
            "ix": "1-62_v1_34@3",
            "content": "In addition, a glycine residue was observed at the same position in other alkaliphiles, T. cyclicum (Gly 206 ; GenBank Accession number: YP_004537849 ), and same amino acid family Ala 230 in Theoalkalivibrio species K90mix (GenBank Accession number: YP_003461818 ) as shown in Figure 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_34",
            "start": 482,
            "end": 768,
            "label": {}
        },
        {
            "ix": "1-62_v1_34@4",
            "content": "On the other hand, glycine was also at the same corresponding position in alignment for the acidophiles, A. ferrooxidans (GenBank Accession number: YP_002221206 ), and A. cryptum (GenBank Accession number: YP_001233541 ) (Figure",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_34",
            "start": 770,
            "end": 997,
            "label": {}
        },
        {
            "ix": "1-62_v1_34@5",
            "content": "3) .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_34",
            "start": 999,
            "end": 1002,
            "label": {}
        },
        {
            "ix": "1-62_v1_34@6",
            "content": "Lys 180 and corresponding amino acids were located in transmembrane helix-4 ( a TMH-4) in Bacillus pseudofirmus OF4 and other alkaliphiles <REF-23> , <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_34",
            "start": 1004,
            "end": 1163,
            "label": {}
        },
        {
            "ix": "1-62_v1_34@7",
            "content": "In the Stenotrophomonas species DL 18, a histidine residue, which is conserved in other reference species of the same genus ( S. maltophilia K279a GenBank Accession number: YP_001973793 ; and S . sp. SKA14) and other alkaliphiles T. cyclicum (His244), and Theoalkalivibrio species K90mix (His 262 ), was present at position 240 (His 240 ) (Figure 2) .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_34",
            "start": 1165,
            "end": 1515,
            "label": {}
        },
        {
            "ix": "1-62_v1_34@8",
            "content": "However, E. coli K12 DH10B (GenBank Accession number: YP_001732559 ), considered as neutrophile, can adapt to slightly alkaline conditions i.e. up to pH 8.0 and this may be due to the presence of His 245 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_34",
            "start": 1517,
            "end": 1721,
            "label": {}
        },
        {
            "ix": "1-62_v1_34@9",
            "content": "It was proposed that Gly 120 and Lys 180 form a channel residing within the proton uptake pathway of the a -subunit through which protons pass onto the neighboring c -subunit in Bacillus pseudofirmus OF4 <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_34",
            "start": 1723,
            "end": 1936,
            "label": {}
        },
        {
            "ix": "1-62_v1_35@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_35",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "1-62_v1_37@0",
            "content": "However, Ala 198 from the Stenotrophomonas species DL 18 and Ala 196 from T. cyclicum were found to correspond with Gly 208 in E. coli and Gly 170 in Bacillus pseudofirmus OF4 in alignment of the a -subunit as shown in Figure 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_37",
            "start": 0,
            "end": 228,
            "label": {}
        },
        {
            "ix": "1-62_v1_37@1",
            "content": "In a similar way, Gly 207 was observed in Stenotrophomonas species DL 18, while in this respective position alanine was found in alkaliphiles and neutrophiles.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_37",
            "start": 230,
            "end": 388,
            "label": {}
        },
        {
            "ix": "1-62_v1_37@2",
            "content": "But both amino acids correspond from the same amino acid family.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_37",
            "start": 390,
            "end": 453,
            "label": {}
        },
        {
            "ix": "1-62_v1_37@3",
            "content": "However, one of the studies reported the His 245 along with the Glu 219 positioning plays a critical role in ion translocation in E. coli <REF-25> , while in Stenotrophomonas species DL 18 these were at His 240 and Glu 209 as shown in Figure 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_37",
            "start": 455,
            "end": 699,
            "label": {}
        },
        {
            "ix": "1-62_v1_38@0",
            "content": "McMillan et al <REF-25> showed the importance of the residue with a basic side chain along with its pKa value in ATP synthesis linked with alkaline environment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_38",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "1-62_v1_38@1",
            "content": "However, these studies were carried out with a mutation study in the Bacillus pseudofirmus OF4 a -subunit, specifically with the position of the residue at 180.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_38",
            "start": 161,
            "end": 320,
            "label": {}
        },
        {
            "ix": "1-62_v1_38@2",
            "content": "These studies included mutations at Lys 180 position as Gly 180 , His 180 and Arg 180 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_38",
            "start": 322,
            "end": 408,
            "label": {}
        },
        {
            "ix": "1-62_v1_38@3",
            "content": "These mutations showed the ATP synthesis at neutral, neutral to alkaline, and only at alkaline conditions (>pH 8.5), respectively i.e. residue with a strong base, such as lysine or arginine, was ideally appropriate to function at alkaline pH. Since, it was particularly marked for histidine, which has a pKa in a neutral range, it showed significant ATP synthesis activity at pH 9.0.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_38",
            "start": 410,
            "end": 792,
            "label": {}
        },
        {
            "ix": "1-62_v1_38@4",
            "content": "However, exchange mutations at Gly 120 and Lys 180 to Lys 120 and Gly 180 showed ATP synthase activity in Bacillus pseudofirmus OF4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_38",
            "start": 794,
            "end": 925,
            "label": {}
        },
        {
            "ix": "1-62_v1_38@5",
            "content": "Similar studies in E. coli showed that the positions Gly 218 and His 245 along with G1u 219 had a critical interaction with F o function <REF-26> , <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_38",
            "start": 927,
            "end": 1084,
            "label": {}
        },
        {
            "ix": "1-62_v1_39@0",
            "content": "After comparison with acidophiles, neutrophiles and alkaliphiles, Leu 197 of the Stenotrophomonas species DL 18 was found to be conserved in TMH-4 (Figure 3) .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_39",
            "start": 0,
            "end": 158,
            "label": {}
        },
        {
            "ix": "1-62_v1_39@1",
            "content": "From alignment, Glu 209 of the Stenotrophomonas species DL 18 was conserved in alkaliphiles, neutrophiles and some acidophiles except His 186 Acidiphilium cryptum .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_39",
            "start": 160,
            "end": 323,
            "label": {}
        },
        {
            "ix": "1-62_v1_39@2",
            "content": "In addition, the position of Gly 212 in Bacillus pseudofirmus OF4 corresponds to Ser 212 in E. hirae (neutrophile; GenBank Accession number: YP_006487510 ), His 245 in E. coli and His 240 in the Stenotrophomonas species DL 18 while glutamate in acidophiles, Glu 222 in A. ferrooxidans and Glu 225 in A. cryptum as shown in Figure 3 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_39",
            "start": 325,
            "end": 657,
            "label": {}
        },
        {
            "ix": "1-62_v1_39@3",
            "content": "This showed that the channel formation may involve a glycine residue along with other residues, specifically acidic, basic and neutral side chain, which play vital roles in ATP synthesis in acidophile, alkaliphiles and neutrophiles.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_39",
            "start": 659,
            "end": 890,
            "label": {}
        },
        {
            "ix": "1-62_v1_39@4",
            "content": "Hence, these residues are found to be critical in channel formation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_39",
            "start": 892,
            "end": 959,
            "label": {}
        },
        {
            "ix": "1-62_v1_39@5",
            "content": "In the same scenario, the Gly 208 and His 240 may be form the proton translocation channel in Stenotrophomonas species DL 18.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_39",
            "start": 961,
            "end": 1085,
            "label": {}
        },
        {
            "ix": "1-62_v1_39@6",
            "content": "Thus the basic side chain residue His 240 and other amino acid residues may be responsible for growth of the Stenotrophomonas species DL 18 at high alkaline pH.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "1-62_v1_39",
            "start": 1087,
            "end": 1246,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "1-62_v1_0",
            "tgt_ix": "1-62_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_1",
            "tgt_ix": "1-62_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_0",
            "tgt_ix": "1-62_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_3",
            "tgt_ix": "1-62_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_3",
            "tgt_ix": "1-62_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_3",
            "tgt_ix": "1-62_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_3",
            "tgt_ix": "1-62_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_3",
            "tgt_ix": "1-62_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_0",
            "tgt_ix": "1-62_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_9",
            "tgt_ix": "1-62_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_10",
            "tgt_ix": "1-62_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_9",
            "tgt_ix": "1-62_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_12",
            "tgt_ix": "1-62_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_12",
            "tgt_ix": "1-62_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_9",
            "tgt_ix": "1-62_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_15",
            "tgt_ix": "1-62_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_15",
            "tgt_ix": "1-62_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_0",
            "tgt_ix": "1-62_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_18",
            "tgt_ix": "1-62_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_19",
            "tgt_ix": "1-62_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_19",
            "tgt_ix": "1-62_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_21",
            "tgt_ix": "1-62_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_19",
            "tgt_ix": "1-62_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_23",
            "tgt_ix": "1-62_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_18",
            "tgt_ix": "1-62_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_25",
            "tgt_ix": "1-62_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_25",
            "tgt_ix": "1-62_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_27",
            "tgt_ix": "1-62_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_25",
            "tgt_ix": "1-62_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_29",
            "tgt_ix": "1-62_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_25",
            "tgt_ix": "1-62_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_31",
            "tgt_ix": "1-62_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_18",
            "tgt_ix": "1-62_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_33",
            "tgt_ix": "1-62_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_33",
            "tgt_ix": "1-62_v1_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_35",
            "tgt_ix": "1-62_v1_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_33",
            "tgt_ix": "1-62_v1_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_33",
            "tgt_ix": "1-62_v1_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_33",
            "tgt_ix": "1-62_v1_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_0",
            "tgt_ix": "1-62_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_1",
            "tgt_ix": "1-62_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_2",
            "tgt_ix": "1-62_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_3",
            "tgt_ix": "1-62_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_4",
            "tgt_ix": "1-62_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_5",
            "tgt_ix": "1-62_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_7",
            "tgt_ix": "1-62_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_8",
            "tgt_ix": "1-62_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_9",
            "tgt_ix": "1-62_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_10",
            "tgt_ix": "1-62_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_11",
            "tgt_ix": "1-62_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_12",
            "tgt_ix": "1-62_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_13",
            "tgt_ix": "1-62_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_14",
            "tgt_ix": "1-62_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_15",
            "tgt_ix": "1-62_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_16",
            "tgt_ix": "1-62_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_17",
            "tgt_ix": "1-62_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_18",
            "tgt_ix": "1-62_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_19",
            "tgt_ix": "1-62_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_20",
            "tgt_ix": "1-62_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_21",
            "tgt_ix": "1-62_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_22",
            "tgt_ix": "1-62_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_23",
            "tgt_ix": "1-62_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_24",
            "tgt_ix": "1-62_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_25",
            "tgt_ix": "1-62_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_26",
            "tgt_ix": "1-62_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_27",
            "tgt_ix": "1-62_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_28",
            "tgt_ix": "1-62_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_29",
            "tgt_ix": "1-62_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_30",
            "tgt_ix": "1-62_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_31",
            "tgt_ix": "1-62_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_32",
            "tgt_ix": "1-62_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_33",
            "tgt_ix": "1-62_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_35",
            "tgt_ix": "1-62_v1_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_36",
            "tgt_ix": "1-62_v1_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_37",
            "tgt_ix": "1-62_v1_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_38",
            "tgt_ix": "1-62_v1_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_20",
            "tgt_ix": "1-62_v1_22",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_20",
            "tgt_ix": "1-62_v1_24",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_26",
            "tgt_ix": "1-62_v1_28",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_26",
            "tgt_ix": "1-62_v1_30",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_26",
            "tgt_ix": "1-62_v1_32",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_36",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "1-62_v1_0",
            "tgt_ix": "1-62_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_1",
            "tgt_ix": "1-62_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_2",
            "tgt_ix": "1-62_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_2",
            "tgt_ix": "1-62_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_2",
            "tgt_ix": "1-62_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_2",
            "tgt_ix": "1-62_v1_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_2",
            "tgt_ix": "1-62_v1_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_2",
            "tgt_ix": "1-62_v1_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_3",
            "tgt_ix": "1-62_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_4",
            "tgt_ix": "1-62_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_4",
            "tgt_ix": "1-62_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_4",
            "tgt_ix": "1-62_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_5",
            "tgt_ix": "1-62_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_5",
            "tgt_ix": "1-62_v1_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_5",
            "tgt_ix": "1-62_v1_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_5",
            "tgt_ix": "1-62_v1_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_5",
            "tgt_ix": "1-62_v1_5@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_5",
            "tgt_ix": "1-62_v1_5@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_5",
            "tgt_ix": "1-62_v1_5@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_5",
            "tgt_ix": "1-62_v1_5@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_5",
            "tgt_ix": "1-62_v1_5@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_6@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_6@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_6@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_6@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_6@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_6",
            "tgt_ix": "1-62_v1_6@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_7",
            "tgt_ix": "1-62_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_7",
            "tgt_ix": "1-62_v1_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_8",
            "tgt_ix": "1-62_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_8",
            "tgt_ix": "1-62_v1_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_8",
            "tgt_ix": "1-62_v1_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_8",
            "tgt_ix": "1-62_v1_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_8",
            "tgt_ix": "1-62_v1_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_8",
            "tgt_ix": "1-62_v1_8@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_9",
            "tgt_ix": "1-62_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_10",
            "tgt_ix": "1-62_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_11",
            "tgt_ix": "1-62_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_11",
            "tgt_ix": "1-62_v1_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_11",
            "tgt_ix": "1-62_v1_11@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_11",
            "tgt_ix": "1-62_v1_11@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_12",
            "tgt_ix": "1-62_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_13",
            "tgt_ix": "1-62_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_13",
            "tgt_ix": "1-62_v1_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_13",
            "tgt_ix": "1-62_v1_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_13",
            "tgt_ix": "1-62_v1_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_13",
            "tgt_ix": "1-62_v1_13@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_13",
            "tgt_ix": "1-62_v1_13@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_14",
            "tgt_ix": "1-62_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_14",
            "tgt_ix": "1-62_v1_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_14",
            "tgt_ix": "1-62_v1_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_14",
            "tgt_ix": "1-62_v1_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_14",
            "tgt_ix": "1-62_v1_14@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_15",
            "tgt_ix": "1-62_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_16",
            "tgt_ix": "1-62_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_16",
            "tgt_ix": "1-62_v1_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_16",
            "tgt_ix": "1-62_v1_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_16",
            "tgt_ix": "1-62_v1_16@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_16",
            "tgt_ix": "1-62_v1_16@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_17",
            "tgt_ix": "1-62_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_17",
            "tgt_ix": "1-62_v1_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_17",
            "tgt_ix": "1-62_v1_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_17",
            "tgt_ix": "1-62_v1_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_18",
            "tgt_ix": "1-62_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_19",
            "tgt_ix": "1-62_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_20",
            "tgt_ix": "1-62_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_20",
            "tgt_ix": "1-62_v1_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_20",
            "tgt_ix": "1-62_v1_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_20",
            "tgt_ix": "1-62_v1_20@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_20",
            "tgt_ix": "1-62_v1_20@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_20",
            "tgt_ix": "1-62_v1_20@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_21",
            "tgt_ix": "1-62_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_23",
            "tgt_ix": "1-62_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_25",
            "tgt_ix": "1-62_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_26",
            "tgt_ix": "1-62_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_26",
            "tgt_ix": "1-62_v1_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_26",
            "tgt_ix": "1-62_v1_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_27",
            "tgt_ix": "1-62_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_29",
            "tgt_ix": "1-62_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_31",
            "tgt_ix": "1-62_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_33",
            "tgt_ix": "1-62_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_34@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_34@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_34@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_34@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_34@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_34@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_34@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_34",
            "tgt_ix": "1-62_v1_34@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_35",
            "tgt_ix": "1-62_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_37",
            "tgt_ix": "1-62_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_37",
            "tgt_ix": "1-62_v1_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_37",
            "tgt_ix": "1-62_v1_37@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_37",
            "tgt_ix": "1-62_v1_37@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_38",
            "tgt_ix": "1-62_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_38",
            "tgt_ix": "1-62_v1_38@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_38",
            "tgt_ix": "1-62_v1_38@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_38",
            "tgt_ix": "1-62_v1_38@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_38",
            "tgt_ix": "1-62_v1_38@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_38",
            "tgt_ix": "1-62_v1_38@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_39",
            "tgt_ix": "1-62_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_39",
            "tgt_ix": "1-62_v1_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_39",
            "tgt_ix": "1-62_v1_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_39",
            "tgt_ix": "1-62_v1_39@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_39",
            "tgt_ix": "1-62_v1_39@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_39",
            "tgt_ix": "1-62_v1_39@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "1-62_v1_39",
            "tgt_ix": "1-62_v1_39@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "1-62_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.1-62.v1",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/3.0/",
        "title": "F\n                     1 F\n                     o ATP synthase a-subunit of \n                     Stenotrophomonas  sp. DL18 from Indian Soda Lake, Lonar: a brief report",
        "abstract": "Lonar Lake, an Indian Soda Lake, is well known for its biodiversity of extremophiles including alkaliphiles. Most of the molecular studies on Lonar Lake alkaliphiles are based on molecular identification by 16S ribosomal RNA along with numerous applications in the biotechnology industry. However, molecular basis of adaptation of these alkaliphiles to high alkaline conditions is incompletely understood. Attempts were made to isolate and identify alkaliphiles from their naturally occurring original habitat, i.e. Lonar Lake, India with high alkaline conditions of pH 10.5. One facultative alkaliphile, Stenotrophomonas species DL18, was studied for F 1 F o ATP synthase a-subunit with reference to alkaliphile-specific domains. Although the a-subunit of Stenotrophomonas DL18 showed significant similarity with neutrophiles, the isolated bacterium is an alkaliphile and optimally grows at pH 10.5.",
        "contributors": [
            {
                "surname": "Lingojwar",
                "given-names": "Devendra"
            },
            {
                "surname": "Jadhav",
                "given-names": "Ravikant"
            },
            {
                "surname": "Gawai",
                "given-names": "Kachru"
            }
        ],
        "url": "https://f1000research.com/articles/1-62/v1/",
        "doc_id": "1-62",
        "version": 1,
        "ix_counter": 192,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}