{
    "nodes": [
        {
            "ix": "7-1891_v2_0",
            "content": "Factors associated with the utilization of long-acting reversible contraceptives among family planning clients at the Pameungpeuk Rural Hospital, Indonesia",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_2",
            "content": "Background : Uncontrolled population development can prompt an assortment of populace issues and can be one of the reasons for increasing maternal death rates. The utilization of contraceptives in Indonesia was progressively dominated by injectable contraceptives and pill contraceptives in 2015 (52.21% and 24.36%, respectively). However, the rate of termination of the use of short-acting contraceptives by family planning clients was higher than other methods, therefore the use of short-acting contraceptives is less efficient than long acting reversible contraceptives (LARCs) for longer term spacing because it is easy to skip a treatment for economic or other reasons, which can result in unintended pregnancy. Therefore, the National Family Planning Program in Indonesia is encouraging the use of LARCs to control population growth. Pameungpeuk is a region which has the second largest population, with the highest total fertility rate in South-West Java. The proportion of active users of LARCs in Pameungpeuk is very low (10.66%). This study aimed to analyze factors associated with the utilization of LARCs among family planning clients at the Pameungpeuk Rural Hospital.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_3",
            "content": "Methods : This study design was cross-sectional with systematic random sampling. The sample group in this study was 84 family planning clients. We performed statistical analyses using chi-square test.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_4",
            "content": "Results : We found significant associations between the age of women (p=0.024), the cost of contraception (p=0.022), knowledge (p=0.042), beliefs (p=0.002), skill of health workers (p=0.008) and support from health workers (p=0.014). However, education (p=0.212), family income (p=0.087), attitude (p=0.593), exposure to information on LARCs (p=0.378), support from partners (p=0.094), support from friends (p=0.414) and the support of community leaders (p=0.367) had no significant association with the utilization of LARCs.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_5",
            "content": "Conclusions : These findings highlight a critical need for improved education among family planning clients at the Pameungpeuk rural hospital regarding the use of LARCs for both medical and elective reasons.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_6",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_7",
            "content": "According to the World Population Data Sheet (2013), Indonesia is the fourth most populous country in the world, with a population estimate of 249 million. Among Association of South East Asian Nations (ASEAN) countries, Indonesia has both the largest area and largest population. In terms of birth rate, Indonesia is far above the 9 other member countries with a total fertility rate (TFR) of 2.6, while the average TFR of ASEAN countries is 2.4 <REF-1> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_8",
            "content": "Increased and uncontrolled population growth can be one of the reasons behind increasing maternal death rates. Demographic and Health Survey (DHS) information from 2007 set up the Indonesian maternal death rates as 228 deaths for every 100,000 live births <REF-2> . It is estimated that the global maternal death rates will be 195 deaths per 100,000 live births, while the proportion of maternal death in females reproductive age (PMDF) estimated will be 264–285 deaths per 100,000 live births in 2015 <REF-3> . The maternal death rate in Indonesia is high, and was recently estimated as 126 deaths per 100,000 live births by the World Bank . As an effort to improve maternal health and also achieve the fifth Millennium Development Goal, it required a reduction in maternal death by 9.5% every year from 2005 to 2015, but in reality this goal was not achieved between 2005–2008 <REF-3> , <REF-4> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_9",
            "content": "Low contraceptive use is associated with high maternal morbidity and mortality rates, unwanted pregnancies, short birth interval and higher risk of obstetric and newborn complications <REF-5> . One of the Indonesian government’s efforts to reduce population growth and its associated problems, including high mortality rates, are family planning programs promoting contraceptive use, which educate patients and clients regarding family planning and contraception itself <REF-4> . Based on data from the WHO, compared to other ASEAN countries, the use of contraceptives in Indonesia (61% of the population) already exceeds the ASEAN average (58.1%). However, it is still lower than that in Vietnam (78%), Cambodia (79%) and Thailand (80%) <REF-6> . Based on data from the DHS (2012), the use of contraception in Indonesia is dominated by injectable contraceptives (32%) and the pill (14%).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_10",
            "content": "In 2010–2014, the National Family Planning Program in Indonesia directed more efforts towards promoting the use of long-acting reversible contraceptives (LARCs). LARCs are methods of contraception that are known to be highly effective, as they can provide protection from the risk of pregnancy for a period of up to 10 years, depending on the type used <REF-6> , <REF-7> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_11",
            "content": "The advantages of using long-term contraceptive methods are their convenience, comparatively low cost over time and predominant effectiveness in preventing pregnancy compared to short-acting methods. LARCs include implants, intra uterine devices (IUDs), male operation methods (MOPs) and female operation methods (MOWs) <REF-8> . The use of LARCs is proposed as an important strategy to reverse undesirable maternal health consequences in developing countries <REF-9> , <REF-10> . Use of injectable has been predominantly high while IUD utilize has rapidly low in developing countries <REF-11> , <REF-12> . Based on data from the DHS (2012), the proportion of LARC users in Indonesia declined between 1994 and 2012. In 2012, the total number of LARC users was 10.6%, while the national target was 27.5% <REF-6> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_12",
            "content": "Based on the 2015 results of the State Ministry for Population and National Family Planning Coordinating Board (BKKBN), contraceptive use in Indonesia is increasingly dominated by short-acting contraceptives such as injectables (52.21%) and the pill (24.36%). The total number of LARC users in 2015 was (18.17%), while the majority used short-acting contraceptives (81.83%) <REF-13> . In BKKBN 2017 shown that the realization of modern contraceptive prevalence rate such as use of female sterilization (MOW), male sterilization (MOP), pill, IUD, injection, implant KB (Implant) and condoms on 2017 is 57.6% of the target of 60.9% or achievement of 94.58%. Furthermore, the realization of unmet need which is defined as the percentage of married women who do not want to have more children but do not use contraception in 2017 is 17.5%, so that the achievement is 58.63%. Moreover, the percentage of active contraceptive participants using LARCs was 21.5% of the target of 21.7% or achievement of 99.07%. Additionally, the realization of contraceptive discontinuation rate in 2017 is 22.3% of the target of 25.3% or achievement of 88.14% <REF-14> . Pameungpeuk is a region with the second largest population, and has the highest TFR in South-West Java. The proportion of active users of LARCs in Pameungpeuk is also considerably low (10.66%) <REF-15> , <REF-16> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_13",
            "content": "There are many factors that influence the lack of availability and access to LARCs method. These factors include fertility, lack of knowledge and other reasons related to methods that can act as barriers to the use of LARCs <REF-17> . The factors than can inhibit access to the use of LARCs are higher costs for individuals, lack of trained health providers, short acting methods are widely available in rural areas, long distance to the clinic or hospital and medical barriers <REF-18> , <REF-19> . Some people have negative beliefs and misunderstanding about LARCs, additionally the lack of knowledge and skills of health workers can also influence access to the use of LARCs methods <REF-20> , <REF-21> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_14",
            "content": "Factors that are suspected to be related to the utilization of LARCs are age, education, family income, cost of contraception, knowledge, beliefs, attitude of the family planning client, exposure to information on LARCs, contraceptive related skills, support from partners, friends, health workers, and also support from leaders in the community. There are, to our knowledge, no studies that have documented the factors associated with the lack of use of LARCs in the Pameungpeuk region. This study therefore aims to assess the factors associated with the utilization of LARC methods among family planning clients in the Pameungpeuk Rural Hospital, West Java, Indonesia.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_15",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_16",
            "content": "Study design",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_17",
            "content": "This was a hospital-based cross-sectional study. Eligible study participants were women seeking family planning services during the study period from the 15 th of October, 2015 to the 15 th of February 2016 at the Pameungpeuk Rural Hospital, which is a health institution that serves over 6000 annual pregnancies in the south of Garut, West Java Province, Indonesia.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_18",
            "content": "Data collection",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_19",
            "content": "An interviewer-administered questionnaire <REF-22> was used to collect data for this study. The questionnaire sought information on demographic characteristics, socio-economic status, reproductive history and utilization of modern contraception. Questionnaire items were developed to assess factors associated with the utilization of LARC methods, and included knowledge, beliefs, attitude, exposure to information on LARCs, skills of the health workers, and support from partners, friends, health workers and community leaders. We also sought to foster awareness among midwives and nurses who administer family planning services at the health institution and were asked to administer questionnaires; they were sensitized to the purpose and objectives of the study, and how to administer the questionnaire.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_20",
            "content": "The instrument used in this study was a questionnaire containing questions related to factors associated with the utilization of long-acting reversible contraceptives in the Pameungpeuk Rural Hospital work area. The questionnaire consisted of questions about the behavior of use LARCs methods, knowledge, beliefs, attitudes, exposure to information on LARCs, skills of health workers, support of partner, support of friends, support of health workers, and support of community leaders <REF-22> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_21",
            "content": "Participants",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "sec-type": "subjects",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_22",
            "content": "The interviewer-administered questionnaire <REF-22> was conducted with consenting consecutive clients as they accessed family planning services until the desired sample size was achieved. The study used a simple random sampling technique to avoid bias. The inclusion and exclusion criteria were as follows: women between 15–49 years who attended the family planning clinic at the Pameungpeuk Rural Hospital from the 15 th of October, 2015 to the 15 th of February, 2016. Those who did not give consent, those who could not respond to the interview questionnaire or those who incompletely filled out the questionnaire were excluded. The sample size for the study was calculated using the prevalence of contraceptive use in Pameungpeuk (12% for the rural region) from the Indonesian DHS 2013 report. The formula below was used:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_23",
            "content": "n = ( Z 2 p q ) / d 2",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_24",
            "content": "Where n is the minimum sample size, Z is the standard normal deviation, set at 1.96, p is the prevalence of contraceptive use in the region (0.12), q is 1- p (0.88). The degree of accuracy was set at 0.05. The sample size was calculated to be 84 women of reproductive age.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_25",
            "content": "Statistical analysis",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_26",
            "content": "After all the necessary data was collected, the data was coded on pre-arranged coding sheets by the principal investigator. Statistical analyses and data entry were performed using the Statistical Package for the Social Sciences (SPSS), version 20.0. We performed statistical analyses using a chi-square test. Descriptive analysis was used to describe the study sample and the results are presented in tables.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_27",
            "content": "Ethical consideration",
            "ntype": "title",
            "meta": {
                "section": "2.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_28",
            "content": "This study was approved by The Ethics Committee of Faculty of Medicine, University of Indonesia under number 245/UN2.F1/ETIK/2015. The research proposal was submitted and reviewed by the Research Committee, whereby permission was granted to conduct the research. A written letter of consent was submitted to the health institution to seek permission to conduct this study, which was also granted. Privacy and confidentiality of the clients’ information was observed through the use of data collection with coded identification numbers. Written informed consent was obtained from all participants prior to participation.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_29",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_30",
            "content": "Socio-demographic characteristics",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_31",
            "content": "A total of 84 family planning clients at the Pameungpeuk rural hospital participated in this study. As shown in Table 1 , the majority of participants were more than 30 years old (61.90%). More than half of participants had their first marriage and first childbirth between the ages of 20 and 30 years (55.95% and 63.10%, respectively). Most of the participants had a low level of education, i.e. not beyond graduation from elementary school (32.14%). A majority of participants were Muslim (96.42%). In addition, more than half of participants (69.05%) had a low family income (i.e. a monthly income of less than 200 USD), and they thought that cost of contraceptives in Pameungpeuk was quite expensive (53.58%). Utilization of modern contraceptives at the Pameungpeuk rural hospital was dominated by the use of short-acting contraceptives (Non-LARCs), namely injectable contraceptives (59.52%) and pills (15.47%), while the use of LARCs was just less than 30% [IUD (16.66%) and implant (8.33%)]. ( Table 1 )",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_32",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Socio-demographic characteristics of family planning clients at the Pameungpeuk Rural Hospital.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_33",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Socio-demographic characteristics of family planning clients at the Pameungpeuk Rural Hospital.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" valign=\"top\">Variable</th> <th align=\"center\" valign=\"top\">N</th> <th align=\"center\" valign=\"top\">(%)</th> </tr> </thead> <tbody> <tr> <td align=\"left\" valign=\"top\"> <bold>Age</bold> </td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">&lt; 20 years old</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">(0)</td> </tr> <tr> <td align=\"left\" valign=\"top\">20&#8211;30 years old </td> <td align=\"center\" valign=\"top\">32</td> <td align=\"center\" valign=\"top\">(38.10)</td> </tr> <tr> <td align=\"left\" valign=\"top\">&gt; 30 years old </td> <td align=\"center\" valign=\"top\">52</td> <td align=\"center\" valign=\"top\">(61.90)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Age of first marriage</bold> </td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">&lt; 20 years old</td> <td align=\"center\" valign=\"top\">30</td> <td align=\"center\" valign=\"top\">(35.71)</td> </tr> <tr> <td align=\"left\" valign=\"top\">20&#8211;30 years old </td> <td align=\"center\" valign=\"top\">47</td> <td align=\"center\" valign=\"top\">(55.95)</td> </tr> <tr> <td align=\"left\" valign=\"top\">&gt; 30 years old </td> <td align=\"center\" valign=\"top\">7</td> <td align=\"center\" valign=\"top\">(8.34)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Age of first childbirth</bold> </td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">&lt; 20 years old</td> <td align=\"center\" valign=\"top\">26</td> <td align=\"center\" valign=\"top\">(30.95)</td> </tr> <tr> <td align=\"left\" valign=\"top\">20&#8211;30 years old </td> <td align=\"center\" valign=\"top\">53</td> <td align=\"center\" valign=\"top\">(63.10)</td> </tr> <tr> <td align=\"left\" valign=\"top\">&gt;30 years old </td> <td align=\"center\" valign=\"top\">5</td> <td align=\"center\" valign=\"top\">(5.95)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Education</bold> </td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">No education</td> <td align=\"center\" valign=\"top\">10</td> <td align=\"center\" valign=\"top\">(11.90)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Graduate of elementary school</td> <td align=\"center\" valign=\"top\">27</td> <td align=\"center\" valign=\"top\">(32.14)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Graduate of junior high school </td> <td align=\"center\" valign=\"top\">23</td> <td align=\"center\" valign=\"top\">(27.38)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Graduate of senior high school</td> <td align=\"center\" valign=\"top\">20</td> <td align=\"center\" valign=\"top\">(23.80)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Graduate of college</td> <td align=\"center\" valign=\"top\">4</td> <td align=\"center\" valign=\"top\">(4.78)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Religion</bold> </td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Islam</td> <td align=\"center\" valign=\"top\">81</td> <td align=\"center\" valign=\"top\">(96.42)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Non-Islam </td> <td align=\"center\" valign=\"top\">3</td> <td align=\"center\" valign=\"top\">(3.57)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Family Income</bold> </td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">High income (&gt;200 USD per month)</td> <td align=\"center\" valign=\"top\">26</td> <td align=\"center\" valign=\"top\">(30.95)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Low income (&lt;200 USD per month )</td> <td align=\"center\" valign=\"top\">58</td> <td align=\"center\" valign=\"top\">(69.05)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Cost of Contraception</bold> </td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Inexpensive </td> <td align=\"center\" valign=\"top\">39</td> <td align=\"center\" valign=\"top\">(46.42)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Expensive </td> <td align=\"center\" valign=\"top\">45</td> <td align=\"center\" valign=\"top\">(53.58)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Use of Modern contraception</bold> </td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>LARCs</bold> </td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">IUD </td> <td align=\"center\" valign=\"top\">14</td> <td align=\"center\" valign=\"top\">(16.66)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Implants </td> <td align=\"center\" valign=\"top\">7</td> <td align=\"center\" valign=\"top\">(8.33)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Sterilization (female)</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">(0)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Sterilization (male)</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">(0)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Non-LARCs</bold> </td> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Injection </td> <td align=\"center\" valign=\"top\">50</td> <td align=\"center\" valign=\"top\">(59.52)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Pill</td> <td align=\"center\" valign=\"top\">13</td> <td align=\"center\" valign=\"top\">(15.47)</td> </tr> <tr> <td align=\"left\" valign=\"top\">Condom</td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">(0)</td> </tr> <tr> <td align=\"left\" valign=\"top\">LAM </td> <td align=\"center\" valign=\"top\">0</td> <td align=\"center\" valign=\"top\">(0)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Total</bold> </td> <td align=\"center\" valign=\"top\"> <bold>84</bold> </td> <td align=\"center\" valign=\"top\"> <bold>(100)</bold> </td> </tr> </tbody> </table> <table-wrap-foot> <fn> <p>LARCs, long-acting reversible contraceptives; LAM, lactational amenorrhea method.</p> </fn> </table-wrap-foot> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Socio-demographic characteristics of family planning clients at the Pameungpeuk Rural Hospital.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_34",
            "content": "Factors associated with the utilization of LARCS among family planning clients at the Pameungpeuk Rural Hospital",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_35",
            "content": "Factors that are suspected to be related to the utilization of LARCs were age, education, family income, cost of contraception, knowledge, beliefs, attitude of the family planning client, exposure to information about LARCs, contraceptive-related skills and support from partners, friends, health workers and leaders in the community. As shown in Table 2 , the results of a bivariate analysis of factors revealed that age, cost of contraception, knowledge, beliefs, skills of health workers, and support from health workers were variables that were significantly associated with the utilization of LARCs. Based on the results of chi-square statistical analyses, of the 13 variables suspected as factors associated with utilization of LARCs, only 6 variables were significantly associated with the utilization of LARCs, and were as follows: age (p=0.024), cost of contraception (p=0.022), knowledge (p=0.042), beliefs (p=0.002), skills of health workers (p=0.008) and support from health workers (p=0.014). The other 7 variables, namely education, family income, attitude, exposure to information about LARCs, support of partners, friends and community leaders, were not significant associated with the utilization of LARCs at the Pameungpeuk Rural Hospital ( Table 2 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_36",
            "content": "Table 2.",
            "ntype": "label",
            "meta": {
                "id": "T2",
                "caption": "Bivariate analysis of factors associated with the utilization of long-acting reversible contraceptives (LARCs) among family planning clients at the Pameungpeuk Rural Hospital.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_37",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T2\" position=\"anchor\"> <caption> <title>Bivariate analysis of factors associated with the utilization of long-acting reversible contraceptives (LARCs) among family planning clients at the Pameungpeuk Rural Hospital.</title> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\" rowspan=\"2\" valign=\"top\">Variables</th> <th align=\"center\" colspan=\"2\" valign=\"top\">Utilization of <break/>contraceptives</th> <th align=\"center\" colspan=\"2\" valign=\"top\">Total</th> <th align=\"center\" rowspan=\"2\" valign=\"top\">p-value</th> </tr> <tr> <th align=\"center\" valign=\"top\">LARCs</th> <th align=\"center\" valign=\"top\">Non-LARCs</th> <th align=\"center\" valign=\"top\">N</th> <th align=\"center\" valign=\"top\">%</th> </tr> </thead> <tbody> <tr> <td align=\"left\" valign=\"top\"> <bold>Age</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">20&#8211;30 years old </td> <td align=\"center\" valign=\"top\">15</td> <td align=\"center\" valign=\"top\">17</td> <td align=\"center\" valign=\"top\">32</td> <td align=\"center\" valign=\"top\">(38.09)</td> <td align=\"center\" valign=\"top\">0.024</td> </tr> <tr> <td align=\"left\" valign=\"top\">&gt;30 years old </td> <td align=\"center\" valign=\"top\">6</td> <td align=\"center\" valign=\"top\">46</td> <td align=\"center\" valign=\"top\">52</td> <td align=\"center\" valign=\"top\">(61.90)</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Education</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">High education </td> <td align=\"center\" valign=\"top\">5</td> <td align=\"center\" valign=\"top\">19</td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">(28.57)</td> <td align=\"center\" valign=\"top\">0.212</td> </tr> <tr> <td align=\"left\" valign=\"top\">Low education</td> <td align=\"center\" valign=\"top\">16</td> <td align=\"center\" valign=\"top\">44</td> <td align=\"center\" valign=\"top\">60</td> <td align=\"center\" valign=\"top\">(71.42)</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Family income</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">High income </td> <td align=\"center\" valign=\"top\">7</td> <td align=\"center\" valign=\"top\">19</td> <td align=\"center\" valign=\"top\">26</td> <td align=\"center\" valign=\"top\">(30.95)</td> <td align=\"center\" valign=\"top\">0.087</td> </tr> <tr> <td align=\"left\" valign=\"top\">Low income </td> <td align=\"center\" valign=\"top\">14</td> <td align=\"center\" valign=\"top\">44</td> <td align=\"center\" valign=\"top\">58</td> <td align=\"center\" valign=\"top\">(69.04)</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Cost of contraception</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Inexpensive</td> <td align=\"center\" valign=\"top\">9</td> <td align=\"center\" valign=\"top\">30</td> <td align=\"center\" valign=\"top\">39</td> <td align=\"center\" valign=\"top\">(46.42)</td> <td align=\"center\" valign=\"top\">0.022</td> </tr> <tr> <td align=\"left\" valign=\"top\">Expensive </td> <td align=\"center\" valign=\"top\">12</td> <td align=\"center\" valign=\"top\">33</td> <td align=\"center\" valign=\"top\">45</td> <td align=\"center\" valign=\"top\">(53.57)</td> <td/> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Knowledge</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Good</td> <td align=\"center\" valign=\"top\">13</td> <td align=\"center\" valign=\"top\">23</td> <td align=\"center\" valign=\"top\">36</td> <td align=\"center\" valign=\"top\">(42.85)</td> <td align=\"center\" rowspan=\"2\" valign=\"top\">0.042</td> </tr> <tr> <td align=\"left\" valign=\"top\">Bad</td> <td align=\"center\" valign=\"top\">8</td> <td align=\"center\" valign=\"top\">40</td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">(57.14)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Beliefs</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Positive</td> <td align=\"center\" valign=\"top\">16</td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">40</td> <td align=\"center\" valign=\"top\">(47.61)</td> <td align=\"center\" rowspan=\"2\" valign=\"top\">0.002</td> </tr> <tr> <td align=\"left\" valign=\"top\">Negative</td> <td align=\"center\" valign=\"top\">5</td> <td align=\"center\" valign=\"top\">39</td> <td align=\"center\" valign=\"top\">44</td> <td align=\"center\" valign=\"top\">(52.38)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Attitude</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Positive</td> <td align=\"center\" valign=\"top\">6</td> <td align=\"center\" valign=\"top\">22</td> <td align=\"center\" valign=\"top\">28</td> <td align=\"center\" valign=\"top\">(33.33)</td> <td align=\"center\" rowspan=\"2\" valign=\"top\">0.593</td> </tr> <tr> <td align=\"left\" valign=\"top\">Negative</td> <td align=\"center\" valign=\"top\">15</td> <td align=\"center\" valign=\"top\">41</td> <td align=\"center\" valign=\"top\">56</td> <td align=\"center\" valign=\"top\">(66.66)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Exposure to information on LARCs</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Exposed</td> <td align=\"center\" valign=\"top\">9</td> <td align=\"center\" valign=\"top\">34</td> <td align=\"center\" valign=\"top\">43</td> <td align=\"center\" valign=\"top\">(51.19)</td> <td align=\"center\" rowspan=\"2\" valign=\"top\">0.378</td> </tr> <tr> <td align=\"left\" valign=\"top\">Non-exposed</td> <td align=\"center\" valign=\"top\">12</td> <td align=\"center\" valign=\"top\">29</td> <td align=\"center\" valign=\"top\">41</td> <td align=\"center\" valign=\"top\">(48.80)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Skills of health workers</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Skilled</td> <td align=\"center\" valign=\"top\">17</td> <td align=\"center\" valign=\"top\">30</td> <td align=\"center\" valign=\"top\">47</td> <td align=\"center\" valign=\"top\">(55.95)</td> <td align=\"center\" rowspan=\"2\" valign=\"top\">0.008</td> </tr> <tr> <td align=\"left\" valign=\"top\">Unskilled</td> <td align=\"center\" valign=\"top\">4</td> <td align=\"center\" valign=\"top\">33</td> <td align=\"center\" valign=\"top\">37</td> <td align=\"center\" valign=\"top\">(44.04)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Support of partner</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Supported</td> <td align=\"center\" valign=\"top\">12</td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">60</td> <td align=\"center\" valign=\"top\">(71.42)</td> <td align=\"center\" rowspan=\"2\" valign=\"top\">0.094</td> </tr> <tr> <td align=\"left\" valign=\"top\">Not supported</td> <td align=\"center\" valign=\"top\">9</td> <td align=\"center\" valign=\"top\">15</td> <td align=\"center\" valign=\"top\">24</td> <td align=\"center\" valign=\"top\">(28.57)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Support of friends</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Supported</td> <td align=\"center\" valign=\"top\">13</td> <td align=\"center\" valign=\"top\">45</td> <td align=\"center\" valign=\"top\">58</td> <td align=\"center\" valign=\"top\">(69.04)</td> <td align=\"center\" rowspan=\"2\" valign=\"top\">0.414</td> </tr> <tr> <td align=\"left\" valign=\"top\">Not supported</td> <td align=\"center\" valign=\"top\">8</td> <td align=\"center\" valign=\"top\">18</td> <td align=\"center\" valign=\"top\">26</td> <td align=\"center\" valign=\"top\">(30.95)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Support of health workers</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Supported</td> <td align=\"center\" valign=\"top\">10</td> <td align=\"center\" valign=\"top\">48</td> <td align=\"center\" valign=\"top\">58</td> <td align=\"center\" valign=\"top\">(69.04)</td> <td align=\"center\" rowspan=\"2\" valign=\"top\">0.014</td> </tr> <tr> <td align=\"left\" valign=\"top\">Not supported</td> <td align=\"center\" valign=\"top\">11</td> <td align=\"center\" valign=\"top\">15</td> <td align=\"center\" valign=\"top\">26</td> <td align=\"center\" valign=\"top\">(30.95)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Support of community leaders</bold> </td> <td/> <td/> <td/> <td/> <td/> </tr> <tr> <td align=\"left\" valign=\"top\">Supported</td> <td align=\"center\" valign=\"top\">10</td> <td align=\"center\" valign=\"top\">23</td> <td align=\"center\" valign=\"top\">33</td> <td align=\"center\" valign=\"top\">(39.28)</td> <td align=\"center\" rowspan=\"2\" valign=\"top\">0.367</td> </tr> <tr> <td align=\"left\" valign=\"top\">Not supported</td> <td align=\"center\" valign=\"top\">11</td> <td align=\"center\" valign=\"top\">40</td> <td align=\"center\" valign=\"top\">51</td> <td align=\"center\" valign=\"top\">(60.71)</td> </tr> <tr> <td align=\"left\" valign=\"top\"> <bold>Total</bold> </td> <td align=\"center\" valign=\"top\"> <bold>21</bold> </td> <td align=\"center\" valign=\"top\"> <bold>63</bold> </td> <td align=\"center\" valign=\"top\"> <bold>84</bold> </td> <td align=\"center\" valign=\"top\"> <bold>(100)</bold> </td> <td/> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T2",
                "caption": "Bivariate analysis of factors associated with the utilization of long-acting reversible contraceptives (LARCs) among family planning clients at the Pameungpeuk Rural Hospital.",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_38",
            "content": "<supplementary-material xmlns:xlink=\"http://www.w3.org/1999/xlink\" xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" id=\"DS0\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/datasets/15755/ab0f8059-3f0c-49c0-b6e6-203b6301ecfb_Revised_Raw_Data_15755.xlsx\"> <label>Dataset 1. All raw data and demographic information obtained from subject during the present study</label> <caption> <p> <ext-link ext-link-type=\"uri\" xlink:href=\"https://dx.doi.org/10.5256/f1000research.15755.d228026\">https://dx.doi.org/10.5256/f1000research.15755.d228026</ext-link> </p> </caption> </supplementary-material>",
            "ntype": "supplementary-material",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_39",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_40",
            "content": "This study reveals a relationship between maternal age and LARC utilization. At <20 years or >30 years, family planning participants generally prefer high-effectiveness contraceptives such as the IUD, pill, or injections. These findings are consistent with previous research conducted by Tunnisa et al . and by Soppeng et al . in Pangkep, who found a relationship between maternal age and type of contraceptive use <REF-23> , <REF-24> . The results of this study are also consistent with those of Ama et al ., who conducted a study in Botswana and found that the age of respondents is significantly associated with contraceptive use <REF-25> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_41",
            "content": "The results of our data analysis show that there is no relationship between educational level and LARC use among family planning clients. This suggests that a high level of education does not affect the participants’ decision of which type of contraception to use; respondents with both low and high levels of education are aware of the importance and benefits of contraception, and have been likely made aware by health workers or other sources. The results of this study are also consistent with research conducted by Wa Ode in Pasarwajo, Buton, Indonesia, which found no relationship between the level of education and contraceptive use <REF-26> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_42",
            "content": "The income of a family is closely related to their attitude towards contraceptive use; a family’s income is one of the factors that influences their acceptance towards, and the decision to use, new contraceptive innovations. Our results showed that respondents who used LARC and non-LARC contraceptive methods were mainly low-income. Among non-LARC users, only a small percentage had high incomes. This indicates that the desire of couples to accept family planning is still high, despite their low income, as in terms of cost, non-LARC contraceptives tend to be cheaper than LARCs. In this study, there was no significant relationship between family income and LARC contraceptive use (p=0.087). It can therefore be assumed that the level of family income does not affect the purchasing power of respondents to buy contraceptives. This research is inconsistent with research conducted by Maiharti et al ., who found a significant relationship between family income and the use of contraceptive methods <REF-27> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_43",
            "content": "Our results show that there was a significant relationship between the cost of contraception and the use of hormonal contraception. Thus it can be said that the costs incurred for contraceptives are related to the choice of which contraception to use; the cost of non-LARCs tends to be less than that of LARCs. This study was consistent with research conducted by Aryanti et al ., which showed a relationship between contraceptive costs and contraceptive selection <REF-28> . The results of this study are also in accordance with research conducted by Fienalia et al . at the Pancoranmas Health Center, Depok, which found a relationship between the affordability of contraceptive costs and the use of LARCs <REF-29> . This study was done before the new National Health Insurance Scheme was rolled out and widely available. National health insurance has in recent years, overcome many of the cost barriers to contraceptive use, including use of LARCs. Hartanto et al . found that there was a correlation between the use of contraceptive with support from husband or their partner <REF-30> . Under ideal circumstances, couples should jointly choose the best method of contraception, mutually cooperate in their use, jointly pay for their expenses and take into account any dangerous side-effects. The results of statistical analyses showed no relationship between a partner’s support and the use of LARCs. Therefore, it can be assumed that a partners’ support does not affect the choice of the woman to seek family planning services and to continuously use contraceptives. This study was inconsistent with research conducted by Rizali et al ., which found a relationship between support from the partner and the use of pill-based contraceptives <REF-31> . This research is also inconsistent with a study conducted by Setyawati in the Mamojang district of Makassar City, Indonesia, which found that support from the partner will encourage participation in family planning <REF-32> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_44",
            "content": "The results of our statistical analysis indicate that there is a relationship between the information provided by health-care personnel and the use of LARCs. This means that family planning clients already have information regarding contraceptive use from other sources. Others sources are from doctors, books, schools, television or friends. Our results showed that family planning LARC users were more likely to have not received information from family planning officers, while non-LARC users were more likely to have received information from family planning officers. This shows the lack of information dissemination from family planning officers to the community, or the lack of active support from health workers at the Pameungpeuk hospital towards the use of LARC methods, with the end result being a lack of information among the public. Based on information from one midwife who served in the family planning service, it is suspected that the health officer in charge is less active in conducting counseling regarding family planning by LARC methods. This research was consistent with Siddik et al ., which found that there is a relationship between information dissemination and support from the family planning officers with the choice of contraceptive method. This is also consistent with research conducted by Rizali in the Mattoangin district of Makassar City, Indonesia, which showed a relationship between information dissemination by family planning officers and contraceptive use <REF-31> , <REF-33> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_45",
            "content": "Conclusions",
            "ntype": "title",
            "meta": {
                "section": "5",
                "sec-type": "conclusions",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_46",
            "content": "This study found a significant relationship between LARC use and the age of women (p=0.024), cost of contraception (p=0.022), knowledge (p=0.042), beliefs (p=0.002), skills of health workers (p=0.008) and support from health workers (p=0.014). Education (p=0.212), family income (p=0.087), attitude (p=0.593), exposure to information about LARCs (p=0.378), support from partner (p=0.094), support from friends (p=0.414) and support from community leaders (p=0.367) all had no significant relationship with LARC utilization. Therefore, improving the skills of health workers related to contraception needs to be developed, besides that family planning acceptors are expected to play an active role in any activities related to contraception as well, especially in the use of long-term contraceptive methods at Pameungpeuk rural hospitals. Related sectors should seek to increase community knowledge regarding contraception and clarify of myths regarding the use of long-term contraceptive methods.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_47",
            "content": "These findings highlight a critical need to improve partners’ understanding of the importance of using LARC methods, to support females in the use of contraception. This also requires increased knowledge dissemination by health-care workers. We recommended that family planning officers improve counseling to mothers and encourage them to remain active contraception users. They must also aid in the community’s understanding of the importance of contraceptive use, especially the utilization of long-term contraceptive methods.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_48",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_49",
            "content": "Dataset 1. All raw data and demographic information obtained from subject during the present study. DOI: https://doi.org/10.5256/f1000research.15755.d228026 <REF-34> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_50",
            "content": "Extended data",
            "ntype": "title",
            "meta": {
                "section": "6.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_51",
            "content": "Extended data contains the questionnaire (Bahasa and English versions) and how data were measured: https://doi.org/10.6084/m9.figshare.9734561.v2 <REF-22> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_52",
            "content": "<REF-1> prb.org [Internet]. Washington (DC) : Population Reference Bureau; [cited 2018 May 11]. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_53",
            "content": "<REF-2> dhsprogram.com [Internet]. USA: USAID, The DHS Program (Demographic and Health Surveys) . [cited 2018 May 11]. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_54",
            "content": "<REF-3> Bappenas : Rancang Bangun: Percepatan Penurunan Angka Kematian Ibu Untuk Mencapai Sasaran Millennium Development Goals . Jakarta: Kementerian Perencanaan Pembangunan Nasional/Badan Perencanaan Pembangunan Nasional (Bappenas). 2007 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_55",
            "content": "<REF-4> Ministry of Health, Indonesia : Strategies to Accelerate the Reduction of MMR . Jakarta: Ministry of Health. 1998 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_56",
            "content": "<REF-5> Nalwadda G Mirembe F Byamugisha J : Persistent high fertility in Uganda: young people recount obstacles and enabling factors to use of contraceptives. BMC Public Health. 2010 ; 10 : 530 . 20813069 10.1186/1471-2458-10-530 2940919",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_57",
            "content": "<REF-6> State Ministry for Population and National Family Planning Coordinating Board (BKKBN) : Basic Information: Family Planning Movement, Prosperous Family Development . Jakarta, Indonesia: BKKBN, 2012 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_58",
            "content": "<REF-7> State Ministry for Population and National Family Planning Coordinating Board (BKKBN) : Basic Information: Family Planning Movement, Prosperous Family Development . Jakarta, Indonesia: BKKBN, 2010 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_59",
            "content": "<REF-8> World Health Organization : From Evidence to Policy: Expanding Access to Family Planning: Strategies to increase use of long-acting and permanent contraception . Geneva, Switzerland: World Health Organization; 2012 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_60",
            "content": "<REF-9> UN : Contraceptive Commodities for Women’s Health, in Key Data and Findings . New York: United Nations Commission on Life-Saving Commodities for Women and Children, 2012 ; 1 – 29 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_61",
            "content": "<REF-10> Anguzu R Tweheyo R Sekandi JN : Knowledge and attitudes towards use of long acting reversible contraceptives among women of reproductive age in Lubaga division, Kampala district, Uganda. BMC Res Notes. 2014 ; 7 ( 1 ): 153 . 24636154 10.1186/1756-0500-7-153 3985592",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_62",
            "content": "<REF-11> Darroch JE Singh S : Trends in contraceptive need and use in developing countries in 2003, 2008, and 2012: an analysis of national surveys. Lancet. 2013 ; 381 ( 9879 ): 1756 – 1762 . 23683642 10.1016/S0140-6736(13)60597-8",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_63",
            "content": "<REF-12> Bertrand JT Sullivan TM Knowles EA : Contraceptive method skew and shifts in method mix in low- and middle-income countries. Int Perspect Sex Reprod Health. 2014 ; 40 ( 3 ): 144 – 153 . 25271650 10.1363/4014414",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_64",
            "content": "<REF-13> Wijayanti N Thaweesit S Sunpuwan M : Contraceptive use among married adolescent women in Indonesia. J Health Res. 2015 ; 29 ( 5 ): 323 – 31 . 10.14456/jhr.2015.22",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_65",
            "content": "<REF-14> State Ministry for Population and National Family Planning Coordinating Board (BKKBN) : Basic Information: Family Planning Movement, Prosperous Family Development . Jakarta, Indonesia: BKKBN, 2017 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_66",
            "content": "<REF-15> Ministry of Internal Affairs : Rencana Pembangunan Jangka Menengah Daerah Kabupaten Garut tahun 2014-2019 (Medium-Term Development Plan for Garut District in 2014-2019). Garut: District Government Regulation of Garut No.3; 2014; 2014. Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_67",
            "content": "<REF-16> Biro Pusat Statistik Kabupaten Garut (Central Bureau of Statistic Garut) : Survey Potensial Desa (PODES), Biannual Report . BPS, Garut. 2016 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_68",
            "content": "<REF-17> Mbizvo MT Phillips SJ : Family planning: choices and challenges for developing countries. Best Pract Res Clin Obstet Gynaecol. 2014 ; 28 ( 6 ): 931 – 43 . 24957693 10.1016/j.bpobgyn.2014.04.014",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_69",
            "content": "<REF-18> Alemayehu M Belachew T Tilahun T : Factors associated with utilization of long acting and permanent contraceptive methods among married women of reproductive age in Mekelle town, Tigray region, north Ethiopia. BMC Pregnancy Childbirth. 2012 ; 12 ( 1 ): 6 . 22280163 10.1186/1471-2393-12-6 3297532",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_70",
            "content": "<REF-19> Bulto GA Zewdie TA Beyen TK : Demand for long acting and permanent contraceptive methods and associated factors among married women of reproductive age group in Debre Markos Town, North West Ethiopia. BMC Womens Health. 2014 ; 14 ( 1 ): 46 . 24625360 10.1186/1472-6874-14-46 3975156",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_71",
            "content": "<REF-20> Ravenholt AS Sulzbach S Banke K : Assessing The Commercial Viability of Long-Acting And Permanent Contraceptive Methods . 2009 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_72",
            "content": "<REF-21> Osei I Birungi H Addico G : What happened to the IUD in Ghana? Afr J Reprod Health. 2005 ; 9 ( 2 ): 76 – 91 . 16485588 10.2307/3583464",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_73",
            "content": "<REF-22> Kemal A : Supplementary files for \"Factors associated with the utilization of long-acting reversible contraceptives among family planning clients at the Pameungpeuk Rural Hospital, Indonesia\". figshare. Dataset. 2019 . http://www.doi.org/10.6084/m9.figshare.9734561.v2",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_74",
            "content": "<REF-23> Tunnisa R : Faktor-Faktor yang Berhubungan dengan Pemilihan Alat Kontrasepsi di Wilayah Kerja Puskesmas Takalala Kecamatan Marioriwawo Kecamatan Soppeng Tahun 2010 (Skripsi) . Fakultas Kesehatan Masyarakat Universitas Hasanuddin, Makassar. 2010 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_75",
            "content": "<REF-24> Zainuddin E : Faktor yang Berhubungan dengan Pemilihan Metode Kontrasepsi Efektif Terpilih (MKET) Pada Akseptor KB di Kelurahan Tonasa Kecamatan Balocci Kabupaten Pangkep Tahun 2012 (Skripsi) . Fakultas Kesehatan Masyarakat Universitas Hasanuddin, Makassar. 2012 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_76",
            "content": "<REF-25> Ama NO Oucho JO : A Multivariate Approach to Determinant of Contraceptive Use Among Migrants and Refugees in Bostwana. Jurnal of Family Welfare. 2007 ; 53 ( 2 ): 26 – 42 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_77",
            "content": "<REF-26> Arliana WOD Sarake M Seweng A : Faktor yang Berhubungan dengan Penggunaan Metode Kontrasepsi Hormonal Pada Akseptor KB di Kelurahan Pasarwajo Kecamatan Pasarwajo Kabupaten Buton Sulawesi Tenggara. (Skripsi) . 2013 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_78",
            "content": "<REF-27> Maiharti : Hubungan Tingkat Pengetahuan, Pendidikan dan Pendapatan dengan Penggunaan Metode Kontrasepsi Pada PUS di Kecamatan Jenu dan Kecamatan Jatirogo Kabupaten Tuban (Skripsi) . Universitas Negeri Surabaya, Surabaya. 2012 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_79",
            "content": "<REF-28> Aryanti : Faktor-Faktor yang Berhubungan dengan Pemilihan Kontrasepsi Tubektomi di Kelurahan Jongaya Kecamatan Tamalate Kota Makassar Tahun 2010 (Skripsi) . Fakultas Kesehatan Masyarakat Universitas Hasanuddin, Makassar. 2010 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_80",
            "content": "<REF-29> Fienalia RA : Faktor-Faktor yang Berhubungan dengan Pemilihan Metode Kontrasepsi Jangka Panjang (MKJP) di Wilayah Kerja Puskesmas Pancoran Mas Kota Depok Tahun 2012 (Skripsi) . Fakultas Kesehatan Masyarakat Universiatas, Indonesia, Jakarta. 2011 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_81",
            "content": "<REF-30> Hartanto H : Keluarga Berencana dan Kontrasepsi . Jakarta: Pustaka Sinar Harapan. 2004 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_82",
            "content": "<REF-31> Rizali MI Ikhsan M Salmah AU : Faktor yang Berhubungan Dengan Pemilihan Metode Kontrasepsi Suntik di Kelurahan Mattoangin Kecamatan Mariso Kota Makassar. Media Kesehatan Masyarakat Indonesia. 2016 ; 9 ( 3 ): 176 – 83 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_83",
            "content": "<REF-32> Setiawaty L : Faktor-Faktor yang Berhubungan dengan Pemilihan Jenis Kontrasepsi Pil di Kecamatan Mamojang Kota Makassar Tahun 2006 (Skripsi) . Fakultas Kesehatan Masyarakat Universitas Hasanuddin, Makassar. 2007 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_84",
            "content": "<REF-33> Siddik, Fajrita D Hasnawati : Faktor yang Berhubungan dengan Pengambilan Keputusan Wanita Usia Subur (WUS) untuk BerKB IUD di Poli Kebidanan RSAL DR. MINTOHARDJO (Skripsi) . Universitas Pembangunan Nasional Veteran, Jakarta. 2009 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "7-1891_v2_85",
            "content": "<REF-34> Harzif AK Mariana A Malik DM : Dataset 1 in: Factors associated with the utilization of long-acting reversible contraceptives among family planning clients at the Pameungpeuk Rural Hospital, Indonesia. F1000Research. 2018 . http://www.doi.org/10.5256/f1000research.15755.d228026",
            "ntype": "ref",
            "meta": {
                "id": "ref-34",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "7-1891_v2_0@0",
            "content": "Factors associated with the utilization of long-acting reversible contraceptives among family planning clients at the Pameungpeuk Rural Hospital, Indonesia",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_0",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "7-1891_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-1891_v2_2@0",
            "content": "Background : Uncontrolled population development can prompt an assortment of populace issues and can be one of the reasons for increasing maternal death rates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_2",
            "start": 0,
            "end": 158,
            "label": {}
        },
        {
            "ix": "7-1891_v2_2@1",
            "content": "The utilization of contraceptives in Indonesia was progressively dominated by injectable contraceptives and pill contraceptives in 2015 (52.21% and 24.36%, respectively).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_2",
            "start": 160,
            "end": 329,
            "label": {}
        },
        {
            "ix": "7-1891_v2_2@2",
            "content": "However, the rate of termination of the use of short-acting contraceptives by family planning clients was higher than other methods, therefore the use of short-acting contraceptives is less efficient than long acting reversible contraceptives (LARCs) for longer term spacing because it is easy to skip a treatment for economic or other reasons, which can result in unintended pregnancy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_2",
            "start": 331,
            "end": 716,
            "label": {}
        },
        {
            "ix": "7-1891_v2_2@3",
            "content": "Therefore, the National Family Planning Program in Indonesia is encouraging the use of LARCs to control population growth.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_2",
            "start": 718,
            "end": 839,
            "label": {}
        },
        {
            "ix": "7-1891_v2_2@4",
            "content": "Pameungpeuk is a region which has the second largest population, with the highest total fertility rate in South-West Java.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_2",
            "start": 841,
            "end": 962,
            "label": {}
        },
        {
            "ix": "7-1891_v2_2@5",
            "content": "The proportion of active users of LARCs in Pameungpeuk is very low (10.66%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_2",
            "start": 964,
            "end": 1039,
            "label": {}
        },
        {
            "ix": "7-1891_v2_2@6",
            "content": "This study aimed to analyze factors associated with the utilization of LARCs among family planning clients at the Pameungpeuk Rural Hospital.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_2",
            "start": 1041,
            "end": 1181,
            "label": {}
        },
        {
            "ix": "7-1891_v2_3@0",
            "content": "Methods : This study design was cross-sectional with systematic random sampling.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_3",
            "start": 0,
            "end": 79,
            "label": {}
        },
        {
            "ix": "7-1891_v2_3@1",
            "content": "The sample group in this study was 84 family planning clients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_3",
            "start": 81,
            "end": 142,
            "label": {}
        },
        {
            "ix": "7-1891_v2_3@2",
            "content": "We performed statistical analyses using chi-square test.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_3",
            "start": 144,
            "end": 199,
            "label": {}
        },
        {
            "ix": "7-1891_v2_4@0",
            "content": "Results : We found significant associations between the age of women (p=0.024), the cost of contraception (p=0.022), knowledge (p=0.042), beliefs (p=0.002), skill of health workers (p=0.008) and support from health workers (p=0.014).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_4",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "7-1891_v2_4@1",
            "content": "However, education (p=0.212), family income (p=0.087), attitude (p=0.593), exposure to information on LARCs (p=0.378), support from partners (p=0.094), support from friends (p=0.414) and the support of community leaders (p=0.367) had no significant association with the utilization of LARCs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_4",
            "start": 234,
            "end": 524,
            "label": {}
        },
        {
            "ix": "7-1891_v2_5@0",
            "content": "Conclusions : These findings highlight a critical need for improved education among family planning clients at the Pameungpeuk rural hospital regarding the use of LARCs for both medical and elective reasons.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_5",
            "start": 0,
            "end": 206,
            "label": {}
        },
        {
            "ix": "7-1891_v2_6@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_6",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "7-1891_v2_7@0",
            "content": "According to the World Population Data Sheet (2013), Indonesia is the fourth most populous country in the world, with a population estimate of 249 million.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_7",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "7-1891_v2_7@1",
            "content": "Among Association of South East Asian Nations (ASEAN) countries, Indonesia has both the largest area and largest population.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_7",
            "start": 156,
            "end": 279,
            "label": {}
        },
        {
            "ix": "7-1891_v2_7@2",
            "content": "In terms of birth rate, Indonesia is far above the 9 other member countries with a total fertility rate (TFR) of 2.6, while the average TFR of ASEAN countries is 2.4 <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_7",
            "start": 281,
            "end": 455,
            "label": {}
        },
        {
            "ix": "7-1891_v2_8@0",
            "content": "Increased and uncontrolled population growth can be one of the reasons behind increasing maternal death rates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_8",
            "start": 0,
            "end": 109,
            "label": {}
        },
        {
            "ix": "7-1891_v2_8@1",
            "content": "Demographic and Health Survey (DHS) information from 2007 set up the Indonesian maternal death rates as 228 deaths for every 100,000 live births <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_8",
            "start": 111,
            "end": 264,
            "label": {}
        },
        {
            "ix": "7-1891_v2_8@2",
            "content": "It is estimated that the global maternal death rates will be 195 deaths per 100,000 live births, while the proportion of maternal death in females reproductive age (PMDF) estimated will be 264–285 deaths per 100,000 live births in 2015 <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_8",
            "start": 266,
            "end": 510,
            "label": {}
        },
        {
            "ix": "7-1891_v2_8@3",
            "content": "The maternal death rate in Indonesia is high, and was recently estimated as 126 deaths per 100,000 live births by the World Bank .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_8",
            "start": 512,
            "end": 641,
            "label": {}
        },
        {
            "ix": "7-1891_v2_8@4",
            "content": "As an effort to improve maternal health and also achieve the fifth Millennium Development Goal, it required a reduction in maternal death by 9.5% every year from 2005 to 2015, but in reality this goal was not achieved between 2005–2008 <REF-3> , <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_8",
            "start": 643,
            "end": 897,
            "label": {}
        },
        {
            "ix": "7-1891_v2_9@0",
            "content": "Low contraceptive use is associated with high maternal morbidity and mortality rates, unwanted pregnancies, short birth interval and higher risk of obstetric and newborn complications <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_9",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "7-1891_v2_9@1",
            "content": "One of the Indonesian government’s efforts to reduce population growth and its associated problems, including high mortality rates, are family planning programs promoting contraceptive use, which educate patients and clients regarding family planning and contraception itself <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_9",
            "start": 194,
            "end": 478,
            "label": {}
        },
        {
            "ix": "7-1891_v2_9@2",
            "content": "Based on data from the WHO, compared to other ASEAN countries, the use of contraceptives in Indonesia (61% of the population) already exceeds the ASEAN average (58.1%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_9",
            "start": 480,
            "end": 647,
            "label": {}
        },
        {
            "ix": "7-1891_v2_9@3",
            "content": "However, it is still lower than that in Vietnam (78%), Cambodia (79%) and Thailand (80%) <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_9",
            "start": 649,
            "end": 746,
            "label": {}
        },
        {
            "ix": "7-1891_v2_9@4",
            "content": "Based on data from the DHS (2012), the use of contraception in Indonesia is dominated by injectable contraceptives (32%) and the pill (14%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_9",
            "start": 748,
            "end": 887,
            "label": {}
        },
        {
            "ix": "7-1891_v2_10@0",
            "content": "In 2010–2014, the National Family Planning Program in Indonesia directed more efforts towards promoting the use of long-acting reversible contraceptives (LARCs).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_10",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "7-1891_v2_10@1",
            "content": "LARCs are methods of contraception that are known to be highly effective, as they can provide protection from the risk of pregnancy for a period of up to 10 years, depending on the type used <REF-6> , <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_10",
            "start": 162,
            "end": 371,
            "label": {}
        },
        {
            "ix": "7-1891_v2_11@0",
            "content": "The advantages of using long-term contraceptive methods are their convenience, comparatively low cost over time and predominant effectiveness in preventing pregnancy compared to short-acting methods.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_11",
            "start": 0,
            "end": 198,
            "label": {}
        },
        {
            "ix": "7-1891_v2_11@1",
            "content": "LARCs include implants, intra uterine devices (IUDs), male operation methods (MOPs) and female operation methods (MOWs) <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_11",
            "start": 200,
            "end": 328,
            "label": {}
        },
        {
            "ix": "7-1891_v2_11@2",
            "content": "The use of LARCs is proposed as an important strategy to reverse undesirable maternal health consequences in developing countries <REF-9> , <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_11",
            "start": 330,
            "end": 479,
            "label": {}
        },
        {
            "ix": "7-1891_v2_11@3",
            "content": "Use of injectable has been predominantly high while IUD utilize has rapidly low in developing countries <REF-11> , <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_11",
            "start": 481,
            "end": 605,
            "label": {}
        },
        {
            "ix": "7-1891_v2_11@4",
            "content": "Based on data from the DHS (2012), the proportion of LARC users in Indonesia declined between 1994 and 2012.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_11",
            "start": 607,
            "end": 714,
            "label": {}
        },
        {
            "ix": "7-1891_v2_11@5",
            "content": "In 2012, the total number of LARC users was 10.6%, while the national target was 27.5% <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_11",
            "start": 716,
            "end": 811,
            "label": {}
        },
        {
            "ix": "7-1891_v2_12@0",
            "content": "Based on the 2015 results of the State Ministry for Population and National Family Planning Coordinating Board (BKKBN), contraceptive use in Indonesia is increasingly dominated by short-acting contraceptives such as injectables (52.21%) and the pill (24.36%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_12",
            "start": 0,
            "end": 258,
            "label": {}
        },
        {
            "ix": "7-1891_v2_12@1",
            "content": "The total number of LARC users in 2015 was (18.17%), while the majority used short-acting contraceptives (81.83%) <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_12",
            "start": 260,
            "end": 383,
            "label": {}
        },
        {
            "ix": "7-1891_v2_12@2",
            "content": "In BKKBN 2017 shown that the realization of modern contraceptive prevalence rate such as use of female sterilization (MOW), male sterilization (MOP), pill, IUD, injection, implant KB (Implant) and condoms on 2017 is 57.6% of the target of 60.9% or achievement of 94.58%.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_12",
            "start": 385,
            "end": 654,
            "label": {}
        },
        {
            "ix": "7-1891_v2_12@3",
            "content": "Furthermore, the realization of unmet need which is defined as the percentage of married women who do not want to have more children but do not use contraception in 2017 is 17.5%, so that the achievement is 58.63%.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_12",
            "start": 656,
            "end": 869,
            "label": {}
        },
        {
            "ix": "7-1891_v2_12@4",
            "content": "Moreover, the percentage of active contraceptive participants using LARCs was 21.5% of the target of 21.7% or achievement of 99.07%.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_12",
            "start": 871,
            "end": 1002,
            "label": {}
        },
        {
            "ix": "7-1891_v2_12@5",
            "content": "Additionally, the realization of contraceptive discontinuation rate in 2017 is 22.3% of the target of 25.3% or achievement of 88.14% <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_12",
            "start": 1004,
            "end": 1146,
            "label": {}
        },
        {
            "ix": "7-1891_v2_12@6",
            "content": "Pameungpeuk is a region with the second largest population, and has the highest TFR in South-West Java.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_12",
            "start": 1148,
            "end": 1250,
            "label": {}
        },
        {
            "ix": "7-1891_v2_12@7",
            "content": "The proportion of active users of LARCs in Pameungpeuk is also considerably low (10.66%) <REF-15> , <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_12",
            "start": 1252,
            "end": 1361,
            "label": {}
        },
        {
            "ix": "7-1891_v2_13@0",
            "content": "There are many factors that influence the lack of availability and access to LARCs method.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_13",
            "start": 0,
            "end": 89,
            "label": {}
        },
        {
            "ix": "7-1891_v2_13@1",
            "content": "These factors include fertility, lack of knowledge and other reasons related to methods that can act as barriers to the use of LARCs <REF-17> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_13",
            "start": 91,
            "end": 233,
            "label": {}
        },
        {
            "ix": "7-1891_v2_13@2",
            "content": "The factors than can inhibit access to the use of LARCs are higher costs for individuals, lack of trained health providers, short acting methods are widely available in rural areas, long distance to the clinic or hospital and medical barriers <REF-18> , <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_13",
            "start": 235,
            "end": 498,
            "label": {}
        },
        {
            "ix": "7-1891_v2_13@3",
            "content": "Some people have negative beliefs and misunderstanding about LARCs, additionally the lack of knowledge and skills of health workers can also influence access to the use of LARCs methods <REF-20> , <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_13",
            "start": 500,
            "end": 706,
            "label": {}
        },
        {
            "ix": "7-1891_v2_14@0",
            "content": "Factors that are suspected to be related to the utilization of LARCs are age, education, family income, cost of contraception, knowledge, beliefs, attitude of the family planning client, exposure to information on LARCs, contraceptive related skills, support from partners, friends, health workers, and also support from leaders in the community.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_14",
            "start": 0,
            "end": 345,
            "label": {}
        },
        {
            "ix": "7-1891_v2_14@1",
            "content": "There are, to our knowledge, no studies that have documented the factors associated with the lack of use of LARCs in the Pameungpeuk region.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_14",
            "start": 347,
            "end": 486,
            "label": {}
        },
        {
            "ix": "7-1891_v2_14@2",
            "content": "This study therefore aims to assess the factors associated with the utilization of LARC methods among family planning clients in the Pameungpeuk Rural Hospital, West Java, Indonesia.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_14",
            "start": 488,
            "end": 669,
            "label": {}
        },
        {
            "ix": "7-1891_v2_15@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_15",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "7-1891_v2_16@0",
            "content": "Study design",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_16",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "7-1891_v2_17@0",
            "content": "This was a hospital-based cross-sectional study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_17",
            "start": 0,
            "end": 47,
            "label": {}
        },
        {
            "ix": "7-1891_v2_17@1",
            "content": "Eligible study participants were women seeking family planning services during the study period from the 15 th of October, 2015 to the 15 th of February 2016 at the Pameungpeuk Rural Hospital, which is a health institution that serves over 6000 annual pregnancies in the south of Garut, West Java Province, Indonesia.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_17",
            "start": 49,
            "end": 365,
            "label": {}
        },
        {
            "ix": "7-1891_v2_18@0",
            "content": "Data collection",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_18",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "7-1891_v2_19@0",
            "content": "An interviewer-administered questionnaire <REF-22> was used to collect data for this study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_19",
            "start": 0,
            "end": 90,
            "label": {}
        },
        {
            "ix": "7-1891_v2_19@1",
            "content": "The questionnaire sought information on demographic characteristics, socio-economic status, reproductive history and utilization of modern contraception.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_19",
            "start": 92,
            "end": 244,
            "label": {}
        },
        {
            "ix": "7-1891_v2_19@2",
            "content": "Questionnaire items were developed to assess factors associated with the utilization of LARC methods, and included knowledge, beliefs, attitude, exposure to information on LARCs, skills of the health workers, and support from partners, friends, health workers and community leaders.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_19",
            "start": 246,
            "end": 527,
            "label": {}
        },
        {
            "ix": "7-1891_v2_19@3",
            "content": "We also sought to foster awareness among midwives and nurses who administer family planning services at the health institution and were asked to administer questionnaires; they were sensitized to the purpose and objectives of the study, and how to administer the questionnaire.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_19",
            "start": 529,
            "end": 805,
            "label": {}
        },
        {
            "ix": "7-1891_v2_20@0",
            "content": "The instrument used in this study was a questionnaire containing questions related to factors associated with the utilization of long-acting reversible contraceptives in the Pameungpeuk Rural Hospital work area.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_20",
            "start": 0,
            "end": 210,
            "label": {}
        },
        {
            "ix": "7-1891_v2_20@1",
            "content": "The questionnaire consisted of questions about the behavior of use LARCs methods, knowledge, beliefs, attitudes, exposure to information on LARCs, skills of health workers, support of partner, support of friends, support of health workers, and support of community leaders <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_20",
            "start": 212,
            "end": 494,
            "label": {}
        },
        {
            "ix": "7-1891_v2_21@0",
            "content": "Participants",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_21",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "7-1891_v2_22@0",
            "content": "The interviewer-administered questionnaire <REF-22> was conducted with consenting consecutive clients as they accessed family planning services until the desired sample size was achieved.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_22",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "7-1891_v2_22@1",
            "content": "The study used a simple random sampling technique to avoid bias.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_22",
            "start": 188,
            "end": 251,
            "label": {}
        },
        {
            "ix": "7-1891_v2_22@2",
            "content": "The inclusion and exclusion criteria were as follows: women between 15–49 years who attended the family planning clinic at the Pameungpeuk Rural Hospital from the 15 th of October, 2015 to the 15 th of February, 2016.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_22",
            "start": 253,
            "end": 469,
            "label": {}
        },
        {
            "ix": "7-1891_v2_22@3",
            "content": "Those who did not give consent, those who could not respond to the interview questionnaire or those who incompletely filled out the questionnaire were excluded.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_22",
            "start": 471,
            "end": 630,
            "label": {}
        },
        {
            "ix": "7-1891_v2_22@4",
            "content": "The sample size for the study was calculated using the prevalence of contraceptive use in Pameungpeuk (12% for the rural region) from the Indonesian DHS 2013 report.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_22",
            "start": 632,
            "end": 796,
            "label": {}
        },
        {
            "ix": "7-1891_v2_22@5",
            "content": "The formula below was used:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_22",
            "start": 798,
            "end": 824,
            "label": {}
        },
        {
            "ix": "7-1891_v2_23@0",
            "content": "n = ( Z 2 p q ) / d 2",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_23",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "7-1891_v2_24@0",
            "content": "Where n is the minimum sample size, Z is the standard normal deviation, set at 1.96, p is the prevalence of contraceptive use in the region (0.12), q is 1- p (0.88).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_24",
            "start": 0,
            "end": 164,
            "label": {}
        },
        {
            "ix": "7-1891_v2_24@1",
            "content": "The degree of accuracy was set at 0.05.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_24",
            "start": 166,
            "end": 204,
            "label": {}
        },
        {
            "ix": "7-1891_v2_24@2",
            "content": "The sample size was calculated to be 84 women of reproductive age.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_24",
            "start": 206,
            "end": 271,
            "label": {}
        },
        {
            "ix": "7-1891_v2_25@0",
            "content": "Statistical analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_25",
            "start": 0,
            "end": 19,
            "label": {}
        },
        {
            "ix": "7-1891_v2_26@0",
            "content": "After all the necessary data was collected, the data was coded on pre-arranged coding sheets by the principal investigator.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_26",
            "start": 0,
            "end": 122,
            "label": {}
        },
        {
            "ix": "7-1891_v2_26@1",
            "content": "Statistical analyses and data entry were performed using the Statistical Package for the Social Sciences (SPSS), version 20.0.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_26",
            "start": 124,
            "end": 249,
            "label": {}
        },
        {
            "ix": "7-1891_v2_26@2",
            "content": "We performed statistical analyses using a chi-square test.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_26",
            "start": 251,
            "end": 308,
            "label": {}
        },
        {
            "ix": "7-1891_v2_26@3",
            "content": "Descriptive analysis was used to describe the study sample and the results are presented in tables.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_26",
            "start": 310,
            "end": 408,
            "label": {}
        },
        {
            "ix": "7-1891_v2_27@0",
            "content": "Ethical consideration",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_27",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "7-1891_v2_28@0",
            "content": "This study was approved by The Ethics Committee of Faculty of Medicine, University of Indonesia under number 245/UN2.F1/ETIK/2015.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_28",
            "start": 0,
            "end": 129,
            "label": {}
        },
        {
            "ix": "7-1891_v2_28@1",
            "content": "The research proposal was submitted and reviewed by the Research Committee, whereby permission was granted to conduct the research.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_28",
            "start": 131,
            "end": 261,
            "label": {}
        },
        {
            "ix": "7-1891_v2_28@2",
            "content": "A written letter of consent was submitted to the health institution to seek permission to conduct this study, which was also granted.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_28",
            "start": 263,
            "end": 395,
            "label": {}
        },
        {
            "ix": "7-1891_v2_28@3",
            "content": "Privacy and confidentiality of the clients’ information was observed through the use of data collection with coded identification numbers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_28",
            "start": 397,
            "end": 534,
            "label": {}
        },
        {
            "ix": "7-1891_v2_28@4",
            "content": "Written informed consent was obtained from all participants prior to participation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_28",
            "start": 536,
            "end": 618,
            "label": {}
        },
        {
            "ix": "7-1891_v2_29@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_29",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "7-1891_v2_30@0",
            "content": "Socio-demographic characteristics",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_30",
            "start": 0,
            "end": 32,
            "label": {}
        },
        {
            "ix": "7-1891_v2_31@0",
            "content": "A total of 84 family planning clients at the Pameungpeuk rural hospital participated in this study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_31",
            "start": 0,
            "end": 98,
            "label": {}
        },
        {
            "ix": "7-1891_v2_31@1",
            "content": "As shown in Table 1 , the majority of participants were more than 30 years old (61.90%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_31",
            "start": 100,
            "end": 187,
            "label": {}
        },
        {
            "ix": "7-1891_v2_31@2",
            "content": "More than half of participants had their first marriage and first childbirth between the ages of 20 and 30 years (55.95% and 63.10%, respectively).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_31",
            "start": 189,
            "end": 335,
            "label": {}
        },
        {
            "ix": "7-1891_v2_31@3",
            "content": "Most of the participants had a low level of education, i.e. not beyond graduation from elementary school (32.14%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_31",
            "start": 337,
            "end": 450,
            "label": {}
        },
        {
            "ix": "7-1891_v2_31@4",
            "content": "A majority of participants were Muslim (96.42%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_31",
            "start": 452,
            "end": 499,
            "label": {}
        },
        {
            "ix": "7-1891_v2_31@5",
            "content": "In addition, more than half of participants (69.05%) had a low family income (i.e. a monthly income of less than 200 USD), and they thought that cost of contraceptives in Pameungpeuk was quite expensive (53.58%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_31",
            "start": 501,
            "end": 712,
            "label": {}
        },
        {
            "ix": "7-1891_v2_31@6",
            "content": "Utilization of modern contraceptives at the Pameungpeuk rural hospital was dominated by the use of short-acting contraceptives (Non-LARCs), namely injectable contraceptives (59.52%) and pills (15.47%), while the use of LARCs was just less than 30% [IUD (16.66%) and implant (8.33%)].",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_31",
            "start": 714,
            "end": 996,
            "label": {}
        },
        {
            "ix": "7-1891_v2_31@7",
            "content": "( Table 1 )",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_31",
            "start": 998,
            "end": 1008,
            "label": {}
        },
        {
            "ix": "7-1891_v2_32@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_32",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-1891_v2_34@0",
            "content": "Factors associated with the utilization of LARCS among family planning clients at the Pameungpeuk Rural Hospital",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_34",
            "start": 0,
            "end": 111,
            "label": {}
        },
        {
            "ix": "7-1891_v2_35@0",
            "content": "Factors that are suspected to be related to the utilization of LARCs were age, education, family income, cost of contraception, knowledge, beliefs, attitude of the family planning client, exposure to information about LARCs, contraceptive-related skills and support from partners, friends, health workers and leaders in the community.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_35",
            "start": 0,
            "end": 333,
            "label": {}
        },
        {
            "ix": "7-1891_v2_35@1",
            "content": "As shown in Table 2 , the results of a bivariate analysis of factors revealed that age, cost of contraception, knowledge, beliefs, skills of health workers, and support from health workers were variables that were significantly associated with the utilization of LARCs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_35",
            "start": 335,
            "end": 603,
            "label": {}
        },
        {
            "ix": "7-1891_v2_35@2",
            "content": "Based on the results of chi-square statistical analyses, of the 13 variables suspected as factors associated with utilization of LARCs, only 6 variables were significantly associated with the utilization of LARCs, and were as follows: age (p=0.024), cost of contraception (p=0.022), knowledge (p=0.042), beliefs (p=0.002), skills of health workers (p=0.008) and support from health workers (p=0.014).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_35",
            "start": 605,
            "end": 1004,
            "label": {}
        },
        {
            "ix": "7-1891_v2_35@3",
            "content": "The other 7 variables, namely education, family income, attitude, exposure to information about LARCs, support of partners, friends and community leaders, were not significant associated with the utilization of LARCs at the Pameungpeuk Rural Hospital ( Table 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_35",
            "start": 1006,
            "end": 1268,
            "label": {}
        },
        {
            "ix": "7-1891_v2_36@0",
            "content": "Table 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_36",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "7-1891_v2_39@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_39",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "7-1891_v2_40@0",
            "content": "This study reveals a relationship between maternal age and LARC utilization.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_40",
            "start": 0,
            "end": 75,
            "label": {}
        },
        {
            "ix": "7-1891_v2_40@1",
            "content": "At <20 years or >30 years, family planning participants generally prefer high-effectiveness contraceptives such as the IUD, pill, or injections.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_40",
            "start": 77,
            "end": 220,
            "label": {}
        },
        {
            "ix": "7-1891_v2_40@2",
            "content": "These findings are consistent with previous research conducted by Tunnisa et al . and by Soppeng et al .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_40",
            "start": 222,
            "end": 325,
            "label": {}
        },
        {
            "ix": "7-1891_v2_40@3",
            "content": "in Pangkep, who found a relationship between maternal age and type of contraceptive use <REF-23> , <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_40",
            "start": 327,
            "end": 435,
            "label": {}
        },
        {
            "ix": "7-1891_v2_40@4",
            "content": "The results of this study are also consistent with those of Ama et al ., who conducted a study in Botswana and found that the age of respondents is significantly associated with contraceptive use <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_40",
            "start": 437,
            "end": 642,
            "label": {}
        },
        {
            "ix": "7-1891_v2_41@0",
            "content": "The results of our data analysis show that there is no relationship between educational level and LARC use among family planning clients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_41",
            "start": 0,
            "end": 136,
            "label": {}
        },
        {
            "ix": "7-1891_v2_41@1",
            "content": "This suggests that a high level of education does not affect the participants’ decision of which type of contraception to use; respondents with both low and high levels of education are aware of the importance and benefits of contraception, and have been likely made aware by health workers or other sources.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_41",
            "start": 138,
            "end": 445,
            "label": {}
        },
        {
            "ix": "7-1891_v2_41@2",
            "content": "The results of this study are also consistent with research conducted by Wa Ode in Pasarwajo, Buton, Indonesia, which found no relationship between the level of education and contraceptive use <REF-26> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_41",
            "start": 447,
            "end": 649,
            "label": {}
        },
        {
            "ix": "7-1891_v2_42@0",
            "content": "The income of a family is closely related to their attitude towards contraceptive use; a family’s income is one of the factors that influences their acceptance towards, and the decision to use, new contraceptive innovations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_42",
            "start": 0,
            "end": 223,
            "label": {}
        },
        {
            "ix": "7-1891_v2_42@1",
            "content": "Our results showed that respondents who used LARC and non-LARC contraceptive methods were mainly low-income.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_42",
            "start": 225,
            "end": 332,
            "label": {}
        },
        {
            "ix": "7-1891_v2_42@2",
            "content": "Among non-LARC users, only a small percentage had high incomes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_42",
            "start": 334,
            "end": 396,
            "label": {}
        },
        {
            "ix": "7-1891_v2_42@3",
            "content": "This indicates that the desire of couples to accept family planning is still high, despite their low income, as in terms of cost, non-LARC contraceptives tend to be cheaper than LARCs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_42",
            "start": 398,
            "end": 581,
            "label": {}
        },
        {
            "ix": "7-1891_v2_42@4",
            "content": "In this study, there was no significant relationship between family income and LARC contraceptive use (p=0.087).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_42",
            "start": 583,
            "end": 694,
            "label": {}
        },
        {
            "ix": "7-1891_v2_42@5",
            "content": "It can therefore be assumed that the level of family income does not affect the purchasing power of respondents to buy contraceptives.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_42",
            "start": 696,
            "end": 829,
            "label": {}
        },
        {
            "ix": "7-1891_v2_42@6",
            "content": "This research is inconsistent with research conducted by Maiharti et al ., who found a significant relationship between family income and the use of contraceptive methods <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_42",
            "start": 831,
            "end": 1011,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@0",
            "content": "Our results show that there was a significant relationship between the cost of contraception and the use of hormonal contraception.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 0,
            "end": 130,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@1",
            "content": "Thus it can be said that the costs incurred for contraceptives are related to the choice of which contraception to use; the cost of non-LARCs tends to be less than that of LARCs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 132,
            "end": 309,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@2",
            "content": "This study was consistent with research conducted by Aryanti et al ., which showed a relationship between contraceptive costs and contraceptive selection <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 311,
            "end": 474,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@3",
            "content": "The results of this study are also in accordance with research conducted by Fienalia et al .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 476,
            "end": 567,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@4",
            "content": "at the Pancoranmas Health Center, Depok, which found a relationship between the affordability of contraceptive costs and the use of LARCs <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 569,
            "end": 716,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@5",
            "content": "This study was done before the new National Health Insurance Scheme was rolled out and widely available.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 718,
            "end": 821,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@6",
            "content": "National health insurance has in recent years, overcome many of the cost barriers to contraceptive use, including use of LARCs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 823,
            "end": 949,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@7",
            "content": "Hartanto et al . found that there was a correlation between the use of contraceptive with support from husband or their partner <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 951,
            "end": 1088,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@8",
            "content": "Under ideal circumstances, couples should jointly choose the best method of contraception, mutually cooperate in their use, jointly pay for their expenses and take into account any dangerous side-effects.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 1090,
            "end": 1293,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@9",
            "content": "The results of statistical analyses showed no relationship between a partner’s support and the use of LARCs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 1295,
            "end": 1402,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@10",
            "content": "Therefore, it can be assumed that a partners’ support does not affect the choice of the woman to seek family planning services and to continuously use contraceptives.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 1404,
            "end": 1569,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@11",
            "content": "This study was inconsistent with research conducted by Rizali et al ., which found a relationship between support from the partner and the use of pill-based contraceptives <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 1571,
            "end": 1752,
            "label": {}
        },
        {
            "ix": "7-1891_v2_43@12",
            "content": "This research is also inconsistent with a study conducted by Setyawati in the Mamojang district of Makassar City, Indonesia, which found that support from the partner will encourage participation in family planning <REF-32> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_43",
            "start": 1754,
            "end": 1978,
            "label": {}
        },
        {
            "ix": "7-1891_v2_44@0",
            "content": "The results of our statistical analysis indicate that there is a relationship between the information provided by health-care personnel and the use of LARCs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_44",
            "start": 0,
            "end": 156,
            "label": {}
        },
        {
            "ix": "7-1891_v2_44@1",
            "content": "This means that family planning clients already have information regarding contraceptive use from other sources.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_44",
            "start": 158,
            "end": 269,
            "label": {}
        },
        {
            "ix": "7-1891_v2_44@2",
            "content": "Others sources are from doctors, books, schools, television or friends.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_44",
            "start": 271,
            "end": 341,
            "label": {}
        },
        {
            "ix": "7-1891_v2_44@3",
            "content": "Our results showed that family planning LARC users were more likely to have not received information from family planning officers, while non-LARC users were more likely to have received information from family planning officers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_44",
            "start": 343,
            "end": 571,
            "label": {}
        },
        {
            "ix": "7-1891_v2_44@4",
            "content": "This shows the lack of information dissemination from family planning officers to the community, or the lack of active support from health workers at the Pameungpeuk hospital towards the use of LARC methods, with the end result being a lack of information among the public.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_44",
            "start": 573,
            "end": 845,
            "label": {}
        },
        {
            "ix": "7-1891_v2_44@5",
            "content": "Based on information from one midwife who served in the family planning service, it is suspected that the health officer in charge is less active in conducting counseling regarding family planning by LARC methods.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_44",
            "start": 847,
            "end": 1059,
            "label": {}
        },
        {
            "ix": "7-1891_v2_44@6",
            "content": "This research was consistent with Siddik et al ., which found that there is a relationship between information dissemination and support from the family planning officers with the choice of contraceptive method.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_44",
            "start": 1061,
            "end": 1271,
            "label": {}
        },
        {
            "ix": "7-1891_v2_44@7",
            "content": "This is also consistent with research conducted by Rizali in the Mattoangin district of Makassar City, Indonesia, which showed a relationship between information dissemination by family planning officers and contraceptive use <REF-31> , <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_44",
            "start": 1273,
            "end": 1519,
            "label": {}
        },
        {
            "ix": "7-1891_v2_45@0",
            "content": "Conclusions",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_45",
            "start": 0,
            "end": 10,
            "label": {}
        },
        {
            "ix": "7-1891_v2_46@0",
            "content": "This study found a significant relationship between LARC use and the age of women (p=0.024), cost of contraception (p=0.022), knowledge (p=0.042), beliefs (p=0.002), skills of health workers (p=0.008) and support from health workers (p=0.014).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_46",
            "start": 0,
            "end": 242,
            "label": {}
        },
        {
            "ix": "7-1891_v2_46@1",
            "content": "Education (p=0.212), family income (p=0.087), attitude (p=0.593), exposure to information about LARCs (p=0.378), support from partner (p=0.094), support from friends (p=0.414) and support from community leaders (p=0.367) all had no significant relationship with LARC utilization.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_46",
            "start": 244,
            "end": 522,
            "label": {}
        },
        {
            "ix": "7-1891_v2_46@2",
            "content": "Therefore, improving the skills of health workers related to contraception needs to be developed, besides that family planning acceptors are expected to play an active role in any activities related to contraception as well, especially in the use of long-term contraceptive methods at Pameungpeuk rural hospitals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_46",
            "start": 524,
            "end": 836,
            "label": {}
        },
        {
            "ix": "7-1891_v2_46@3",
            "content": "Related sectors should seek to increase community knowledge regarding contraception and clarify of myths regarding the use of long-term contraceptive methods.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_46",
            "start": 838,
            "end": 995,
            "label": {}
        },
        {
            "ix": "7-1891_v2_47@0",
            "content": "These findings highlight a critical need to improve partners’ understanding of the importance of using LARC methods, to support females in the use of contraception.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_47",
            "start": 0,
            "end": 163,
            "label": {}
        },
        {
            "ix": "7-1891_v2_47@1",
            "content": "This also requires increased knowledge dissemination by health-care workers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_47",
            "start": 165,
            "end": 240,
            "label": {}
        },
        {
            "ix": "7-1891_v2_47@2",
            "content": "We recommended that family planning officers improve counseling to mothers and encourage them to remain active contraception users.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_47",
            "start": 242,
            "end": 372,
            "label": {}
        },
        {
            "ix": "7-1891_v2_47@3",
            "content": "They must also aid in the community’s understanding of the importance of contraceptive use, especially the utilization of long-term contraceptive methods.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_47",
            "start": 374,
            "end": 527,
            "label": {}
        },
        {
            "ix": "7-1891_v2_48@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_48",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "7-1891_v2_49@0",
            "content": "Dataset 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_49",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "7-1891_v2_49@1",
            "content": "All raw data and demographic information obtained from subject during the present study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_49",
            "start": 11,
            "end": 98,
            "label": {}
        },
        {
            "ix": "7-1891_v2_49@2",
            "content": "DOI: https://doi.org/10.5256/f1000research.15755.d228026 <REF-34> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_49",
            "start": 100,
            "end": 166,
            "label": {}
        },
        {
            "ix": "7-1891_v2_50@0",
            "content": "Extended data",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_50",
            "start": 0,
            "end": 12,
            "label": {}
        },
        {
            "ix": "7-1891_v2_51@0",
            "content": "Extended data contains the questionnaire (Bahasa and English versions) and how data were measured: https://doi.org/10.6084/m9.figshare.9734561.v2 <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_51",
            "start": 0,
            "end": 155,
            "label": {}
        },
        {
            "ix": "7-1891_v2_52@0",
            "content": "<REF-1> prb.org [Internet]. Washington (DC) : Population Reference Bureau; [cited 2018 May 11]. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_52",
            "start": 0,
            "end": 111,
            "label": {}
        },
        {
            "ix": "7-1891_v2_53@0",
            "content": "<REF-2> dhsprogram.com [Internet]. USA: USAID, The DHS Program (Demographic and Health Surveys) . [cited 2018 May 11]. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_53",
            "start": 0,
            "end": 134,
            "label": {}
        },
        {
            "ix": "7-1891_v2_54@0",
            "content": "<REF-3> Bappenas : Rancang Bangun: Percepatan Penurunan Angka Kematian Ibu Untuk Mencapai Sasaran Millennium Development Goals . Jakarta: Kementerian Perencanaan Pembangunan Nasional/Badan Perencanaan Pembangunan Nasional (Bappenas). 2007 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_54",
            "start": 0,
            "end": 256,
            "label": {}
        },
        {
            "ix": "7-1891_v2_55@0",
            "content": "<REF-4> Ministry of Health, Indonesia : Strategies to Accelerate the Reduction of MMR . Jakarta: Ministry of Health. 1998 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_55",
            "start": 0,
            "end": 122,
            "label": {}
        },
        {
            "ix": "7-1891_v2_56@0",
            "content": "<REF-5> Nalwadda G Mirembe F Byamugisha J : Persistent high fertility in Uganda: young people recount obstacles and enabling factors to use of contraceptives. BMC Public Health. 2010 ; 10 : 530 . 20813069 10.1186/1471-2458-10-530 2940919",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_56",
            "start": 0,
            "end": 236,
            "label": {}
        },
        {
            "ix": "7-1891_v2_57@0",
            "content": "<REF-6> State Ministry for Population and National Family Planning Coordinating Board (BKKBN) : Basic Information: Family Planning Movement, Prosperous Family Development . Jakarta, Indonesia: BKKBN, 2012 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_57",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "7-1891_v2_58@0",
            "content": "<REF-7> State Ministry for Population and National Family Planning Coordinating Board (BKKBN) : Basic Information: Family Planning Movement, Prosperous Family Development . Jakarta, Indonesia: BKKBN, 2010 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_58",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "7-1891_v2_59@0",
            "content": "<REF-8> World Health Organization : From Evidence to Policy: Expanding Access to Family Planning: Strategies to increase use of long-acting and permanent contraception . Geneva, Switzerland: World Health Organization; 2012 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_59",
            "start": 0,
            "end": 240,
            "label": {}
        },
        {
            "ix": "7-1891_v2_60@0",
            "content": "<REF-9> UN : Contraceptive Commodities for Women’s Health, in Key Data and Findings . New York: United Nations Commission on Life-Saving Commodities for Women and Children, 2012 ; 1 – 29 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_60",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "7-1891_v2_61@0",
            "content": "<REF-10> Anguzu R Tweheyo R Sekandi JN : Knowledge and attitudes towards use of long acting reversible contraceptives among women of reproductive age in Lubaga division, Kampala district, Uganda. BMC Res Notes. 2014 ; 7 ( 1 ): 153 . 24636154 10.1186/1756-0500-7-153 3985592",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_61",
            "start": 0,
            "end": 272,
            "label": {}
        },
        {
            "ix": "7-1891_v2_62@0",
            "content": "<REF-11> Darroch JE Singh S : Trends in contraceptive need and use in developing countries in 2003, 2008, and 2012: an analysis of national surveys. Lancet. 2013 ; 381 ( 9879 ): 1756 – 1762 . 23683642 10.1016/S0140-6736(13)60597-8",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_62",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "7-1891_v2_63@0",
            "content": "<REF-12> Bertrand JT Sullivan TM Knowles EA : Contraceptive method skew and shifts in method mix in low- and middle-income countries. Int Perspect Sex Reprod Health. 2014 ; 40 ( 3 ): 144 – 153 . 25271650 10.1363/4014414",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_63",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "7-1891_v2_64@0",
            "content": "<REF-13> Wijayanti N Thaweesit S Sunpuwan M : Contraceptive use among married adolescent women in Indonesia. J Health Res. 2015 ; 29 ( 5 ): 323 – 31 . 10.14456/jhr.2015.22",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_64",
            "start": 0,
            "end": 170,
            "label": {}
        },
        {
            "ix": "7-1891_v2_65@0",
            "content": "<REF-14> State Ministry for Population and National Family Planning Coordinating Board (BKKBN) : Basic Information: Family Planning Movement, Prosperous Family Development . Jakarta, Indonesia: BKKBN, 2017 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_65",
            "start": 0,
            "end": 206,
            "label": {}
        },
        {
            "ix": "7-1891_v2_66@0",
            "content": "<REF-15> Ministry of Internal Affairs : Rencana Pembangunan Jangka Menengah Daerah Kabupaten Garut tahun 2014-2019 (Medium-Term Development Plan for Garut District in 2014-2019). Garut: District Government Regulation of Garut No.3; 2014; 2014. Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_66",
            "start": 0,
            "end": 259,
            "label": {}
        },
        {
            "ix": "7-1891_v2_67@0",
            "content": "<REF-16> Biro Pusat Statistik Kabupaten Garut (Central Bureau of Statistic Garut) : Survey Potensial Desa (PODES), Biannual Report . BPS, Garut. 2016 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_67",
            "start": 0,
            "end": 150,
            "label": {}
        },
        {
            "ix": "7-1891_v2_68@0",
            "content": "<REF-17> Mbizvo MT Phillips SJ : Family planning: choices and challenges for developing countries. Best Pract Res Clin Obstet Gynaecol. 2014 ; 28 ( 6 ): 931 – 43 . 24957693 10.1016/j.bpobgyn.2014.04.014",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_68",
            "start": 0,
            "end": 201,
            "label": {}
        },
        {
            "ix": "7-1891_v2_69@0",
            "content": "<REF-18> Alemayehu M Belachew T Tilahun T : Factors associated with utilization of long acting and permanent contraceptive methods among married women of reproductive age in Mekelle town, Tigray region, north Ethiopia. BMC Pregnancy Childbirth. 2012 ; 12 ( 1 ): 6 . 22280163 10.1186/1471-2393-12-6 3297532",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_69",
            "start": 0,
            "end": 304,
            "label": {}
        },
        {
            "ix": "7-1891_v2_70@0",
            "content": "<REF-19> Bulto GA Zewdie TA Beyen TK : Demand for long acting and permanent contraceptive methods and associated factors among married women of reproductive age group in Debre Markos Town, North West Ethiopia. BMC Womens Health. 2014 ; 14 ( 1 ): 46 . 24625360 10.1186/1472-6874-14-46 3975156",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_70",
            "start": 0,
            "end": 290,
            "label": {}
        },
        {
            "ix": "7-1891_v2_71@0",
            "content": "<REF-20> Ravenholt AS Sulzbach S Banke K : Assessing The Commercial Viability of Long-Acting And Permanent Contraceptive Methods . 2009 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_71",
            "start": 0,
            "end": 153,
            "label": {}
        },
        {
            "ix": "7-1891_v2_72@0",
            "content": "<REF-21> Osei I Birungi H Addico G : What happened to the IUD in Ghana? Afr J Reprod Health. 2005 ; 9 ( 2 ): 76 – 91 . 16485588 10.2307/3583464",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_72",
            "start": 0,
            "end": 142,
            "label": {}
        },
        {
            "ix": "7-1891_v2_73@0",
            "content": "<REF-22> Kemal A : Supplementary files for \"Factors associated with the utilization of long-acting reversible contraceptives among family planning clients at the Pameungpeuk Rural Hospital, Indonesia\". figshare. Dataset. 2019 . http://www.doi.org/10.6084/m9.figshare.9734561.v2",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_73",
            "start": 0,
            "end": 276,
            "label": {}
        },
        {
            "ix": "7-1891_v2_74@0",
            "content": "<REF-23> Tunnisa R : Faktor-Faktor yang Berhubungan dengan Pemilihan Alat Kontrasepsi di Wilayah Kerja Puskesmas Takalala Kecamatan Marioriwawo Kecamatan Soppeng Tahun 2010 (Skripsi) . Fakultas Kesehatan Masyarakat Universitas Hasanuddin, Makassar. 2010 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_74",
            "start": 0,
            "end": 254,
            "label": {}
        },
        {
            "ix": "7-1891_v2_75@0",
            "content": "<REF-24> Zainuddin E : Faktor yang Berhubungan dengan Pemilihan Metode Kontrasepsi Efektif Terpilih (MKET) Pada Akseptor KB di Kelurahan Tonasa Kecamatan Balocci Kabupaten Pangkep Tahun 2012 (Skripsi) . Fakultas Kesehatan Masyarakat Universitas Hasanuddin, Makassar. 2012 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_75",
            "start": 0,
            "end": 289,
            "label": {}
        },
        {
            "ix": "7-1891_v2_76@0",
            "content": "<REF-25> Ama NO Oucho JO : A Multivariate Approach to Determinant of Contraceptive Use Among Migrants and Refugees in Bostwana. Jurnal of Family Welfare. 2007 ; 53 ( 2 ): 26 – 42 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_76",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "7-1891_v2_77@0",
            "content": "<REF-26> Arliana WOD Sarake M Seweng A : Faktor yang Berhubungan dengan Penggunaan Metode Kontrasepsi Hormonal Pada Akseptor KB di Kelurahan Pasarwajo Kecamatan Pasarwajo Kabupaten Buton Sulawesi Tenggara. (Skripsi) . 2013 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_77",
            "start": 0,
            "end": 240,
            "label": {}
        },
        {
            "ix": "7-1891_v2_78@0",
            "content": "<REF-27> Maiharti : Hubungan Tingkat Pengetahuan, Pendidikan dan Pendapatan dengan Penggunaan Metode Kontrasepsi Pada PUS di Kecamatan Jenu dan Kecamatan Jatirogo Kabupaten Tuban (Skripsi) . Universitas Negeri Surabaya, Surabaya. 2012 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_78",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "7-1891_v2_79@0",
            "content": "<REF-28> Aryanti : Faktor-Faktor yang Berhubungan dengan Pemilihan Kontrasepsi Tubektomi di Kelurahan Jongaya Kecamatan Tamalate Kota Makassar Tahun 2010 (Skripsi) . Fakultas Kesehatan Masyarakat Universitas Hasanuddin, Makassar. 2010 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_79",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "7-1891_v2_80@0",
            "content": "<REF-29> Fienalia RA : Faktor-Faktor yang Berhubungan dengan Pemilihan Metode Kontrasepsi Jangka Panjang (MKJP) di Wilayah Kerja Puskesmas Pancoran Mas Kota Depok Tahun 2012 (Skripsi) . Fakultas Kesehatan Masyarakat Universiatas, Indonesia, Jakarta. 2011 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_80",
            "start": 0,
            "end": 255,
            "label": {}
        },
        {
            "ix": "7-1891_v2_81@0",
            "content": "<REF-30> Hartanto H : Keluarga Berencana dan Kontrasepsi . Jakarta: Pustaka Sinar Harapan. 2004 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_81",
            "start": 0,
            "end": 113,
            "label": {}
        },
        {
            "ix": "7-1891_v2_82@0",
            "content": "<REF-31> Rizali MI Ikhsan M Salmah AU : Faktor yang Berhubungan Dengan Pemilihan Metode Kontrasepsi Suntik di Kelurahan Mattoangin Kecamatan Mariso Kota Makassar. Media Kesehatan Masyarakat Indonesia. 2016 ; 9 ( 3 ): 176 – 83 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_82",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "7-1891_v2_83@0",
            "content": "<REF-32> Setiawaty L : Faktor-Faktor yang Berhubungan dengan Pemilihan Jenis Kontrasepsi Pil di Kecamatan Mamojang Kota Makassar Tahun 2006 (Skripsi) . Fakultas Kesehatan Masyarakat Universitas Hasanuddin, Makassar. 2007 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_83",
            "start": 0,
            "end": 221,
            "label": {}
        },
        {
            "ix": "7-1891_v2_84@0",
            "content": "<REF-33> Siddik, Fajrita D Hasnawati : Faktor yang Berhubungan dengan Pengambilan Keputusan Wanita Usia Subur (WUS) untuk BerKB IUD di Poli Kebidanan RSAL DR. MINTOHARDJO (Skripsi) . Universitas Pembangunan Nasional Veteran, Jakarta. 2009 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_84",
            "start": 0,
            "end": 239,
            "label": {}
        },
        {
            "ix": "7-1891_v2_85@0",
            "content": "<REF-34> Harzif AK Mariana A Malik DM : Dataset 1 in: Factors associated with the utilization of long-acting reversible contraceptives among family planning clients at the Pameungpeuk Rural Hospital, Indonesia. F1000Research. 2018 . http://www.doi.org/10.5256/f1000research.15755.d228026",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "7-1891_v2_85",
            "start": 0,
            "end": 286,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "7-1891_v2_0",
            "tgt_ix": "7-1891_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_1",
            "tgt_ix": "7-1891_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_1",
            "tgt_ix": "7-1891_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_1",
            "tgt_ix": "7-1891_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_1",
            "tgt_ix": "7-1891_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_0",
            "tgt_ix": "7-1891_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_6",
            "tgt_ix": "7-1891_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_6",
            "tgt_ix": "7-1891_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_6",
            "tgt_ix": "7-1891_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_6",
            "tgt_ix": "7-1891_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_6",
            "tgt_ix": "7-1891_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_6",
            "tgt_ix": "7-1891_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_6",
            "tgt_ix": "7-1891_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_6",
            "tgt_ix": "7-1891_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_0",
            "tgt_ix": "7-1891_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_15",
            "tgt_ix": "7-1891_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_16",
            "tgt_ix": "7-1891_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_15",
            "tgt_ix": "7-1891_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_18",
            "tgt_ix": "7-1891_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_18",
            "tgt_ix": "7-1891_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_15",
            "tgt_ix": "7-1891_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_21",
            "tgt_ix": "7-1891_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_21",
            "tgt_ix": "7-1891_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_21",
            "tgt_ix": "7-1891_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_15",
            "tgt_ix": "7-1891_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_25",
            "tgt_ix": "7-1891_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_15",
            "tgt_ix": "7-1891_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_27",
            "tgt_ix": "7-1891_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_0",
            "tgt_ix": "7-1891_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_29",
            "tgt_ix": "7-1891_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_30",
            "tgt_ix": "7-1891_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_30",
            "tgt_ix": "7-1891_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_32",
            "tgt_ix": "7-1891_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_29",
            "tgt_ix": "7-1891_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_34",
            "tgt_ix": "7-1891_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_34",
            "tgt_ix": "7-1891_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_36",
            "tgt_ix": "7-1891_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_34",
            "tgt_ix": "7-1891_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_0",
            "tgt_ix": "7-1891_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_39",
            "tgt_ix": "7-1891_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_39",
            "tgt_ix": "7-1891_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_39",
            "tgt_ix": "7-1891_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_39",
            "tgt_ix": "7-1891_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_39",
            "tgt_ix": "7-1891_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_0",
            "tgt_ix": "7-1891_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_45",
            "tgt_ix": "7-1891_v2_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_45",
            "tgt_ix": "7-1891_v2_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_0",
            "tgt_ix": "7-1891_v2_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_48",
            "tgt_ix": "7-1891_v2_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_48",
            "tgt_ix": "7-1891_v2_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_50",
            "tgt_ix": "7-1891_v2_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_0",
            "tgt_ix": "7-1891_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_1",
            "tgt_ix": "7-1891_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_2",
            "tgt_ix": "7-1891_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_3",
            "tgt_ix": "7-1891_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_4",
            "tgt_ix": "7-1891_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_5",
            "tgt_ix": "7-1891_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_6",
            "tgt_ix": "7-1891_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_7",
            "tgt_ix": "7-1891_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_8",
            "tgt_ix": "7-1891_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_9",
            "tgt_ix": "7-1891_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_10",
            "tgt_ix": "7-1891_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_13",
            "tgt_ix": "7-1891_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_14",
            "tgt_ix": "7-1891_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_15",
            "tgt_ix": "7-1891_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_16",
            "tgt_ix": "7-1891_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_17",
            "tgt_ix": "7-1891_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_18",
            "tgt_ix": "7-1891_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_19",
            "tgt_ix": "7-1891_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_20",
            "tgt_ix": "7-1891_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_21",
            "tgt_ix": "7-1891_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_22",
            "tgt_ix": "7-1891_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_23",
            "tgt_ix": "7-1891_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_24",
            "tgt_ix": "7-1891_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_25",
            "tgt_ix": "7-1891_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_26",
            "tgt_ix": "7-1891_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_27",
            "tgt_ix": "7-1891_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_28",
            "tgt_ix": "7-1891_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_29",
            "tgt_ix": "7-1891_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_30",
            "tgt_ix": "7-1891_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_31",
            "tgt_ix": "7-1891_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_32",
            "tgt_ix": "7-1891_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_33",
            "tgt_ix": "7-1891_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_34",
            "tgt_ix": "7-1891_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_35",
            "tgt_ix": "7-1891_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_36",
            "tgt_ix": "7-1891_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_37",
            "tgt_ix": "7-1891_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_38",
            "tgt_ix": "7-1891_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_39",
            "tgt_ix": "7-1891_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_40",
            "tgt_ix": "7-1891_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_41",
            "tgt_ix": "7-1891_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_42",
            "tgt_ix": "7-1891_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_44",
            "tgt_ix": "7-1891_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_45",
            "tgt_ix": "7-1891_v2_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_46",
            "tgt_ix": "7-1891_v2_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_47",
            "tgt_ix": "7-1891_v2_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_48",
            "tgt_ix": "7-1891_v2_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_49",
            "tgt_ix": "7-1891_v2_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_50",
            "tgt_ix": "7-1891_v2_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_7",
            "tgt_ix": "7-1891_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_8",
            "tgt_ix": "7-1891_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_8",
            "tgt_ix": "7-1891_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_8",
            "tgt_ix": "7-1891_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_9",
            "tgt_ix": "7-1891_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_9",
            "tgt_ix": "7-1891_v2_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_10",
            "tgt_ix": "7-1891_v2_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_13",
            "tgt_ix": "7-1891_v2_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_13",
            "tgt_ix": "7-1891_v2_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_13",
            "tgt_ix": "7-1891_v2_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_13",
            "tgt_ix": "7-1891_v2_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_13",
            "tgt_ix": "7-1891_v2_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_19",
            "tgt_ix": "7-1891_v2_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_40",
            "tgt_ix": "7-1891_v2_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_40",
            "tgt_ix": "7-1891_v2_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_40",
            "tgt_ix": "7-1891_v2_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_41",
            "tgt_ix": "7-1891_v2_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_42",
            "tgt_ix": "7-1891_v2_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_44",
            "tgt_ix": "7-1891_v2_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_49",
            "tgt_ix": "7-1891_v2_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_31",
            "tgt_ix": "7-1891_v2_33",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_35",
            "tgt_ix": "7-1891_v2_37",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "7-1891_v2_0",
            "tgt_ix": "7-1891_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_1",
            "tgt_ix": "7-1891_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_2",
            "tgt_ix": "7-1891_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_2",
            "tgt_ix": "7-1891_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_2",
            "tgt_ix": "7-1891_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_2",
            "tgt_ix": "7-1891_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_2",
            "tgt_ix": "7-1891_v2_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_2",
            "tgt_ix": "7-1891_v2_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_2",
            "tgt_ix": "7-1891_v2_2@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_3",
            "tgt_ix": "7-1891_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_3",
            "tgt_ix": "7-1891_v2_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_3",
            "tgt_ix": "7-1891_v2_3@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_4",
            "tgt_ix": "7-1891_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_4",
            "tgt_ix": "7-1891_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_5",
            "tgt_ix": "7-1891_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_6",
            "tgt_ix": "7-1891_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_7",
            "tgt_ix": "7-1891_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_7",
            "tgt_ix": "7-1891_v2_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_7",
            "tgt_ix": "7-1891_v2_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_8",
            "tgt_ix": "7-1891_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_8",
            "tgt_ix": "7-1891_v2_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_8",
            "tgt_ix": "7-1891_v2_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_8",
            "tgt_ix": "7-1891_v2_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_8",
            "tgt_ix": "7-1891_v2_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_9",
            "tgt_ix": "7-1891_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_9",
            "tgt_ix": "7-1891_v2_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_9",
            "tgt_ix": "7-1891_v2_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_9",
            "tgt_ix": "7-1891_v2_9@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_9",
            "tgt_ix": "7-1891_v2_9@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_10",
            "tgt_ix": "7-1891_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_10",
            "tgt_ix": "7-1891_v2_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_11@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_11@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_11@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_11",
            "tgt_ix": "7-1891_v2_11@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_12@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_12@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_12@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_12@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_12",
            "tgt_ix": "7-1891_v2_12@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_13",
            "tgt_ix": "7-1891_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_13",
            "tgt_ix": "7-1891_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_13",
            "tgt_ix": "7-1891_v2_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_13",
            "tgt_ix": "7-1891_v2_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_14",
            "tgt_ix": "7-1891_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_14",
            "tgt_ix": "7-1891_v2_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_14",
            "tgt_ix": "7-1891_v2_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_15",
            "tgt_ix": "7-1891_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_16",
            "tgt_ix": "7-1891_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_17",
            "tgt_ix": "7-1891_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_17",
            "tgt_ix": "7-1891_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_18",
            "tgt_ix": "7-1891_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_19",
            "tgt_ix": "7-1891_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_19",
            "tgt_ix": "7-1891_v2_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_19",
            "tgt_ix": "7-1891_v2_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_19",
            "tgt_ix": "7-1891_v2_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_20",
            "tgt_ix": "7-1891_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_20",
            "tgt_ix": "7-1891_v2_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_21",
            "tgt_ix": "7-1891_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_22",
            "tgt_ix": "7-1891_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_22",
            "tgt_ix": "7-1891_v2_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_22",
            "tgt_ix": "7-1891_v2_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_22",
            "tgt_ix": "7-1891_v2_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_22",
            "tgt_ix": "7-1891_v2_22@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_22",
            "tgt_ix": "7-1891_v2_22@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_23",
            "tgt_ix": "7-1891_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_24",
            "tgt_ix": "7-1891_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_24",
            "tgt_ix": "7-1891_v2_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_24",
            "tgt_ix": "7-1891_v2_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_25",
            "tgt_ix": "7-1891_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_26",
            "tgt_ix": "7-1891_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_26",
            "tgt_ix": "7-1891_v2_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_26",
            "tgt_ix": "7-1891_v2_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_26",
            "tgt_ix": "7-1891_v2_26@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_27",
            "tgt_ix": "7-1891_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_28",
            "tgt_ix": "7-1891_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_28",
            "tgt_ix": "7-1891_v2_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_28",
            "tgt_ix": "7-1891_v2_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_28",
            "tgt_ix": "7-1891_v2_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_28",
            "tgt_ix": "7-1891_v2_28@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_29",
            "tgt_ix": "7-1891_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_30",
            "tgt_ix": "7-1891_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_31",
            "tgt_ix": "7-1891_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_31",
            "tgt_ix": "7-1891_v2_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_31",
            "tgt_ix": "7-1891_v2_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_31",
            "tgt_ix": "7-1891_v2_31@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_31",
            "tgt_ix": "7-1891_v2_31@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_31",
            "tgt_ix": "7-1891_v2_31@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_31",
            "tgt_ix": "7-1891_v2_31@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_31",
            "tgt_ix": "7-1891_v2_31@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_32",
            "tgt_ix": "7-1891_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_34",
            "tgt_ix": "7-1891_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_35",
            "tgt_ix": "7-1891_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_35",
            "tgt_ix": "7-1891_v2_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_35",
            "tgt_ix": "7-1891_v2_35@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_35",
            "tgt_ix": "7-1891_v2_35@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_36",
            "tgt_ix": "7-1891_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_39",
            "tgt_ix": "7-1891_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_40",
            "tgt_ix": "7-1891_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_40",
            "tgt_ix": "7-1891_v2_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_40",
            "tgt_ix": "7-1891_v2_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_40",
            "tgt_ix": "7-1891_v2_40@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_40",
            "tgt_ix": "7-1891_v2_40@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_41",
            "tgt_ix": "7-1891_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_41",
            "tgt_ix": "7-1891_v2_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_41",
            "tgt_ix": "7-1891_v2_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_42",
            "tgt_ix": "7-1891_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_42",
            "tgt_ix": "7-1891_v2_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_42",
            "tgt_ix": "7-1891_v2_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_42",
            "tgt_ix": "7-1891_v2_42@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_42",
            "tgt_ix": "7-1891_v2_42@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_42",
            "tgt_ix": "7-1891_v2_42@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_42",
            "tgt_ix": "7-1891_v2_42@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_43",
            "tgt_ix": "7-1891_v2_43@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_44",
            "tgt_ix": "7-1891_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_44",
            "tgt_ix": "7-1891_v2_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_44",
            "tgt_ix": "7-1891_v2_44@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_44",
            "tgt_ix": "7-1891_v2_44@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_44",
            "tgt_ix": "7-1891_v2_44@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_44",
            "tgt_ix": "7-1891_v2_44@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_44",
            "tgt_ix": "7-1891_v2_44@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_44",
            "tgt_ix": "7-1891_v2_44@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_45",
            "tgt_ix": "7-1891_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_46",
            "tgt_ix": "7-1891_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_46",
            "tgt_ix": "7-1891_v2_46@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_46",
            "tgt_ix": "7-1891_v2_46@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_46",
            "tgt_ix": "7-1891_v2_46@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_47",
            "tgt_ix": "7-1891_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_47",
            "tgt_ix": "7-1891_v2_47@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_47",
            "tgt_ix": "7-1891_v2_47@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_47",
            "tgt_ix": "7-1891_v2_47@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_48",
            "tgt_ix": "7-1891_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_49",
            "tgt_ix": "7-1891_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_49",
            "tgt_ix": "7-1891_v2_49@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_49",
            "tgt_ix": "7-1891_v2_49@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_50",
            "tgt_ix": "7-1891_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_51",
            "tgt_ix": "7-1891_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_52",
            "tgt_ix": "7-1891_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_53",
            "tgt_ix": "7-1891_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_54",
            "tgt_ix": "7-1891_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_55",
            "tgt_ix": "7-1891_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_56",
            "tgt_ix": "7-1891_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_57",
            "tgt_ix": "7-1891_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_58",
            "tgt_ix": "7-1891_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_59",
            "tgt_ix": "7-1891_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_60",
            "tgt_ix": "7-1891_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_61",
            "tgt_ix": "7-1891_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_62",
            "tgt_ix": "7-1891_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_63",
            "tgt_ix": "7-1891_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_64",
            "tgt_ix": "7-1891_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_65",
            "tgt_ix": "7-1891_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_66",
            "tgt_ix": "7-1891_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_67",
            "tgt_ix": "7-1891_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_68",
            "tgt_ix": "7-1891_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_69",
            "tgt_ix": "7-1891_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_70",
            "tgt_ix": "7-1891_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_71",
            "tgt_ix": "7-1891_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_72",
            "tgt_ix": "7-1891_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_73",
            "tgt_ix": "7-1891_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_74",
            "tgt_ix": "7-1891_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_75",
            "tgt_ix": "7-1891_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_76",
            "tgt_ix": "7-1891_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_77",
            "tgt_ix": "7-1891_v2_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_78",
            "tgt_ix": "7-1891_v2_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_79",
            "tgt_ix": "7-1891_v2_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_80",
            "tgt_ix": "7-1891_v2_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_81",
            "tgt_ix": "7-1891_v2_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_82",
            "tgt_ix": "7-1891_v2_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_83",
            "tgt_ix": "7-1891_v2_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_84",
            "tgt_ix": "7-1891_v2_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "7-1891_v2_85",
            "tgt_ix": "7-1891_v2_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "7-1891_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.15755.2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Factors associated with the utilization of long-acting reversible contraceptives among family planning clients at the Pameungpeuk Rural Hospital, Indonesia",
        "abstract": "Background : Uncontrolled population development can prompt an assortment of populace issues and can be one of the reasons for increasing maternal death rates. The utilization of contraceptives in Indonesia was progressively dominated by injectable contraceptives and pill contraceptives in 2015 (52.21% and 24.36%, respectively). However, the rate of termination of the use of short-acting contraceptives by family planning clients was higher than other methods, therefore the use of short-acting contraceptives is less efficient than long acting reversible contraceptives (LARCs) for longer term spacing because it is easy to skip a treatment for economic or other reasons, which can result in unintended pregnancy. Therefore, the National Family Planning Program in Indonesia is encouraging the use of LARCs to control population growth. Pameungpeuk is a region which has the second largest population, with the highest total fertility rate in South-West Java. The proportion of active users of LARCs in Pameungpeuk is very low (10.66%). This study aimed to analyze factors associated with the utilization of LARCs among family planning clients at the Pameungpeuk Rural Hospital. Methods : This study design was cross-sectional with systematic random sampling. The sample group in this study was 84 family planning clients. We performed statistical analyses using chi-square test. Results : We found significant associations between the age of women (p=0.024), the cost of contraception (p=0.022), knowledge (p=0.042), beliefs (p=0.002), skill of health workers (p=0.008) and support from health workers (p=0.014). However, education (p=0.212), family income (p=0.087), attitude (p=0.593), exposure to information on LARCs (p=0.378), support from partners (p=0.094), support from friends (p=0.414) and the support of community leaders (p=0.367) had no significant association with the utilization of LARCs. Conclusions : These findings highlight a critical need for improved education among family planning clients at the Pameungpeuk rural hospital regarding the use of LARCs for both medical and elective reasons.",
        "contributors": [
            {
                "surname": "Harzif",
                "given-names": "Achmad Kemal"
            },
            {
                "surname": "Mariana",
                "given-names": "Ana"
            },
            {
                "surname": "Malik",
                "given-names": "Devi Marischa"
            },
            {
                "surname": "Silvia",
                "given-names": "Melisa"
            },
            {
                "surname": "Lovita",
                "given-names": "Bara Tracy"
            }
        ],
        "url": "https://f1000research.com/articles/7-1891/v2/",
        "doc_id": "7-1891",
        "version": 2,
        "ix_counter": 359,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}