{
    "nodes": [
        {
            "ix": "4-76_v1_0",
            "content": "Challenges and opportunities for early-career Teaching-Focussed academics in the biosciences",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_2",
            "content": "Twenty-seven percent of academics in UK Higher Education (HE) are in Teaching-Focussed positions, making major contributions to undergraduate programmes in an era of high student expectations when it comes to teaching quality. However, institutional support for Teaching-Focussed academics is often limited, both in terms of peer networking and opportunities for career development. As four early-career stage Teaching-Focussed academics working in a variety of institutions, we explore what motivated our choices to make teaching our primary academic activity, and the challenges that we have faced in doing so. In addition to highlighting the need for universities to fully recognise the achievements of teaching staff, we discuss the role that the various biosciences learned societies have in supporting Teaching-Focussed academics. We identify that there is a need for the learned societies to come together and pool their expertise in this area. The fragmented nature of the Teaching-Focussed academic community means that clear sources of national support are needed in order to best enable the next generation of bioscience educators to reach their full potential.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_4",
            "content": "There are 1.8 million undergraduates studying in UK universities, with Biological Sciences students accounting for 10.3% of the undergraduate population ( The Higher Education Statistics Agency, HESA, 2013 ). Students place a high value on teaching quality; scores for overall satisfaction in the National Student Survey are most strongly correlated with the scores for quality of learning and teaching ( Buckley, 2012 ). Undergraduates expect that their experience of higher education represents value for money, and want to be taught in small-scale classes by experienced and qualified teaching staff ( Kandiko & Mawer, 2013 ). Providing high quality teaching is a therefore a significant component of Biology departments, many of whom rely on Teaching-Focussed academics to deliver aspects of their undergraduate programmes. At the Society for Experimental Biology (SEB) Education Meeting in December 2014, a major theme that emerged was the challenges facing those at the early stages of their teaching careers. Many of the difficulties faced by Teaching-Focussed academics have been well documented ( Cashmore & Ramsden, 2009 ; Cashmore et al. , 2013 ; Locke, 2014 ; Young, 2006 ). Here we present our experiences as early-career teaching orientated academics in a range of UK Higher Education (HE) institutions to explore both the challenges and opportunities of working in teaching roles.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_5",
            "content": "Teaching-Focussed academics are employed on a range of different bases; some are on Teaching-Focussed contracts and are responsible just for covering a given number of hours of contact time, but an increasing number are on Teaching and Scholarship contracts, with an explicit part of their role being to advance understanding of teaching and learning. The HESA includes Teaching-Focussed academics in their surveys of academic staff (note that the HESA uses the term Teaching-Only), revealing that those on Teaching-Focussed contracts represent around 25% of all academic staff, rising to 50% of staff in pre-1992 universities that are not members of the Russell Group ( HESA, 2013 ; Locke, 2014 ). The employment profiles of Teaching-Focussed academics are significantly different to those on Teaching and Research or research-only contracts. There are roughly equal proportions of male (48%) and female (51%) Teaching-Focussed academics, contrasting with Teaching and Research where there is a gender bias (60% male). Teaching-Focussed roles are primarily filled by academics on part time, fixed term contracts; only 18% have a full time open ended contract, compared with 74.5% of those on Teaching and Research contracts (see Figure 1 ). While 12% of academic staff are on zero-hours contracts, this number rises to 47% of Teaching-Focussed staff ( University and College Union, 2013 ). A large proportion of those with responsibility for delivering undergraduate programmes therefore have limited job security. This is perhaps symptomatic of a wider conflict within HE teaching; universities are relying on Teaching-Focussed contracts to fulfil their teaching requirements, yet at an institutional level there is often little support for those in Teaching-Focussed roles to become established members of the academic community.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_6",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Teaching-Focussed positions are dominated by part time, fixed term contracts, with a larger proportion of female (F) academics than Teaching and Research Roles which are male (M)-dominated. Area of boxes represents number of individuals. Data from HESA, 2012–3 .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/6681/1467722f-cfaa-4ffd-b40b-78a768ed6fe8_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_7",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Teaching-Focussed positions are dominated by part time, fixed term contracts, with a larger proportion of female (F) academics than Teaching and Research Roles which are male (M)-dominated.</title> <p>Area of boxes represents number of individuals. Data from <ext-link ext-link-type=\"uri\" xlink:href=\"https://www.hesa.ac.uk/sfr209\">HESA, 2012&#8211;3</ext-link>.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/6681/1467722f-cfaa-4ffd-b40b-78a768ed6fe8_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Teaching-Focussed positions are dominated by part time, fixed term contracts, with a larger proportion of female (F) academics than Teaching and Research Roles which are male (M)-dominated. Area of boxes represents number of individuals. Data from HESA, 2012–3 .",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/6681/1467722f-cfaa-4ffd-b40b-78a768ed6fe8_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_8",
            "content": "Why have Teaching-Focussed academics?",
            "ntype": "title",
            "meta": {
                "section": "2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_9",
            "content": "When preparing this article all of us described experiencing a bias in careers advice we had received, with a heavy focus on the traditional research dominated model of academia. One of us commented “ When I finished my PhD I went to a careers event in 2005 [where] I was told there was no such thing a job for those who only wanted to teach at University and yet here I am with a permanent Teaching-Focussed contract 8 years later ”. Teaching-Focussed academics take a diversity of routes towards their roles; some move into teaching at later career stages, but we represent a group of academics who have actively chosen to focus on teaching at an early-career stage having recognised we have the skills and passion for it. As such, we have much to offer our respective institutions, independent of the type of university we work in.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_10",
            "content": "In having teaching and learning as a primary focus we have opportunity to consider which teaching methods are most likely to cultivate curiosity, motivation and independence in learners. In our experience, staff employed on Teaching-Focussed contracts are more likely to explore the pedagogical literature and adopt evidence-based best practice compared to staff for whom teaching is only a small part of their role. Teaching-Focussed staff therefore represent a powerful force to embed student-centred learning across the whole range of academic institutions. Our enthusiasm for understanding learning and teaching makes us an intellectual and practical asset for colleagues whose research dominates their time. We can help them to develop their understanding of pedagogical philosophies and theories, suggest different learning activities, observe their work and act as critical friends or mentors, providing a springboard for their own transformation into self-reflective educators.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_11",
            "content": "Challenges in establishing a Teaching-Focussed academic career",
            "ntype": "title",
            "meta": {
                "section": "3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_12",
            "content": "While all early-career academics face significant challenges, there are unique challenges to early-career Teaching-Focussed academics that are easily overlooked. Teaching is influenced by differing drivers from research, which may result in early-career teachers having reduced choice in setting the scope of their activities compared to their research equivalents. The teaching agenda is often set by more senior staff, leaving less flexibility for early-career individuals to teach the subjects that they find the most intellectually stimulating. Funding for teaching is more restricted and less transparently advertised than research fellowships and grants, leaving those on Teaching-Focussed contracts at a disadvantage when external funding success is a promotion criterion. Teaching outputs may also not be transferrable between institutions due to copyright ownership issues, therefore making sharing good practice and demonstrating impact more difficult than for equivalent research outputs.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_13",
            "content": "The barriers faced by early-career teachers are often in acquiring and maintaining a job in the first place (as indicated by the significant number of teaching staff on part-time and/or fixed-term contracts; Figure 1 ). Unlike research which has a well-defined (though not necessarily flawless) path to lectureship, currently there appears to be no clear route to a teaching dominant academic role in the sciences within most UK academic institutions, although some have created Teaching-Focussed career paths (e.g. University of Bristol). Most advertised teaching fellow positions require a PhD and teaching experience, but the opportunities to gain teaching experience and/or training during a PhD or post-doctoral position are mixed and often limited, with supervisors prioritising the publication of papers over the development of non-research skills. For those combining teaching and research at early career stages, teaching commitments mean that it may not be possible to achieve the same quantity or impact of research publications, creating a barrier to progressing to the more prevalent research-teaching posts or returning to research-only positions. In contrast, research staff retain the opportunity to move sideways to teaching at any stage in their career because the importance of demonstrating high-impact teaching, and recruiting on that basis, is not yet universally recognised ( High Level Group on the Modernisation of Higher Education, 2013 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_14",
            "content": "Teaching is typically organised according to research departments, leaving Teaching-Focussed positions a relative rarity within a research-dominated environment. While cross-disciplinary teaching support networks do exist within many institutions, their form and membership can be nebulous and lack prominence. This means that we have to look further afield to find a group of peers with whom we can discuss pedagogical concepts and their applications, compared to our research-focussed colleagues. The vocabulary and style of pedagogical literature can be quite different than that of bioscience, and the lack of immediate peers can make engaging with the literature more challenging. Not only does this make current research harder to interpret and implement, but it acts as a hurdle to preparing manuscripts when authors are less clear about the expectations of journal editors and their audience; something which we experienced ourselves when writing this paper. These factors can lead to a feeling of isolation amongst Teaching-Focussed academics, which several of us have experienced during our careers (see case studies) and which can be frustrating and demoralising.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_15",
            "content": "For those that are successful in acquiring a permanent contract the challenges continue. It has been long documented that teaching in HE is deemed a low status activity ( High Level Group on the Modernisation of Higher Education, 2013 ; Young, 2006 ). Recently though, and particularly with the changes to student finance in England and Wales, reward and recognition for teaching and related activities has been put under the spotlight across the HE sector ( Cashmore & Ramsden, 2009 ; Cashmore et al. , 2013 ). The Academy of Medical Sciences, The Physiological Society, Heads of University Biosciences and the Society of Biology recently published a survey of over 250 bioscience academics from a range of institutions, career stages and contract types ( Academy of Medical Sciences et al. , 2014 ). Only 57% of respondents reported that their institution has a clear strategy for evaluating staff teaching contributions. Furthermore, 55% of respondents indicated scepticism that teaching is considered equally to research in professorial promotions, with an additional 24% stating that professorial promotions based on teaching achievement were not possible at their institution.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_16",
            "content": "Support structures for those in teaching positions",
            "ntype": "title",
            "meta": {
                "section": "4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_17",
            "content": "What support structures exist for bioscientists who embark on Teaching-Focussed careers in Higher Education? An increasing number of Universities now offer accredited Postgraduate Certificates in Teaching in Higher Education courses or equivalents. However, these courses can be difficult to access for the large numbers of teaching dominant staff on part-time and/or fixed term contracts, those who do have time allocated for continuing professional development (CPD) in their positions, or are in institutions who do not offer this support. There is therefore a need for professional development at a national level; in the past this has been provided by the Higher Education Academy who made available a wealth of resources, primarily through the Centre for Bioscience. Withdrawal of government funding in recent years has unfortunately resulted in the loss of the Subject Centre in 2011 and the Biosciences discipline lead in 2014. The HEA does maintain however a role in providing professional recognition for teaching through the UK Professional Standards Framework ( Turner et al. , 2013 ), and also provides accreditation for courses and training schemes.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_18",
            "content": "All academics can attest to the value of professional networks, which are often established at the early-career stage at conferences. However, what happens to these networks if you take a different academic path and you find yourself just as interested in how to educate others in your science as the science itself? It is here that the Teaching-Focussed academic can risk becoming an island, with restricted funding, losing those opportunities for renewed inspiration and sharing of good practice. This is especially true of those early in their career that have not yet established links across institutions. With the HEA no longer offering subject-specific support, an obvious alternative are the learned societies, who have always played an important role in providing networking opportunities for academics. Education meetings run by organisations such as SEB are hugely important in providing Teaching-Focussed academics to meet and exchange ideas; none of the authors of this piece knew each other before attending SEB meetings. Learned societies also have a valuable role to play in filling the gap in terms of external mechanisms of validation; for example, the Society of Biology has taken over the HEA funded HE Bioscience Teacher of the Year award.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_19",
            "content": "Discussions on supporting bioscience teaching at both the SEB education meeting (2014) and at a recent HEA Biosciences meeting (University of Newcastle, 2014) have included the fact that the learned societies for biology in the UK are very fragmented. The Society of Biology, The Society for Experimental Biology, The Physiological Society, The Biochemical Society, The British Ecological Society and others all have Education sections. While having separate societies makes sense for research activities, the challenges facing educators in the different areas of bioscience are quite similar. For the early-career bioscience teacher it can be unclear which society is the natural ‘home’ for them, and belonging to all societies would be prohibitively expensive. This contrasts with the support provided to Teaching-Focussed staff in the physical sciences, where the Institute of Physics or the Royal Society of Chemistry have central roles in coordinating educational activities.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_20",
            "content": "Opportunities and future prospects - a supportive network with learned societies?",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_21",
            "content": "In the absence of the HEA as a national body to support biosciences teaching, we feel there is a need for learned societies to come together and organise interdisciplinary events on the theme of education and outreach. Learned societies combining their efforts in terms of education would allow expertise of different organisations to be shared more easily, and provide a clearer sense of identity for Teaching-Focussed academics. At the SEB meeting (December 2014), we discussed whether educational meetings should be integrated within society-wide meetings or whether meetings should be specialised on education, perhaps across several learned societies. The advantage for removing the segregation between “research” and “teaching” academics, may be to improve the status of teaching and spread good practice further than simply “preaching to the choir”. The advantage of more specialist education meetings is that common themes often arise in learning and teaching across a wide variety of disciplines, as seen by the attendance of physicists at the SEB meeting. Subject-specific meetings may therefore lose the chance to learn from pedagogical advances in other disciplines.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_22",
            "content": "Societies also have a potential role in supporting the development of junior academics through mentoring, which is one intervention that has been shown to improve career prospects ( Eby et al. , 2008 ). Currently there is no formal mentoring process in the wider HE bioscience community; an informal community of practise exists via the HEA’s Bioscience PedR JISC email list and conferences. The education committees of the learned societies could potentially take an active role in supporting the next generation of bioscience educators by coordinating mentoring relationships, which would be invaluable to those in institutions without an existing community of Teaching-Focussed academics. The British Ecological Society already has a successful mentoring scheme for female ecologists; an equivalent scheme hosted by the combined learned societies could result in real gains in supporting Teaching-Focussed academics.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_23",
            "content": "The role of education committees on learned societies are also expanding. As one of us noted, “ In my 5 years on the British Ecological Society Education, Training and Careers Committee, the emphasis of the committee changed from one that predominantly focussed on increasing the impact of teaching ecology in schools by working with teachers and policy makers to an ever expanding portfolio that now includes internships for undergraduates, outreach work at music festivals and supporting lecturers in delivering innovative field teaching ”. If learned societies can continue to expand their reach beyond the traditional research domain, they will play an important part in fostering a collaborative approach to teaching in higher education, and concurrently support the teaching careers of early career academics.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_24",
            "content": "In conclusion, early-career Teaching-Focussed academics make valuable contributions to bioscience departments, and institutions should be enabling these academics to achieve their full potential, both in terms of their immediate teaching responsibilities to their students and their long term career progression. There is wide variation in the support universities provide, with some institutions nurturing a high quality environment for teaching staff, while others lag behind. However, even with the best possible local institutional support, the fragmented nature of the Teaching-Focussed community means that national organisations are essential to bring otherwise isolated individuals together. As the HEA is unlikely to fund subject-specific initiatives again without a major increase in funding, it falls to the learned societies to provide cross-institutional support for Teaching-Focussed academics, particularly through providing bioscience education conferences. Presenting at education-focussed sessions enables sharing of good practice, external validation of teaching activities, and ultimately, as this article demonstrates, opportunity for new collaborations. As one of us noted, “ I never planned my route through academia or imagined myself as an educator; it is through my involvement in learned societies that I have met the key people that allowed me to see that there is no “one-size-fits-all” concept of an academic ”.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_25",
            "content": "Case study 1: Sarah Gretton, University of Leicester",
            "ntype": "title",
            "meta": {
                "section": "6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_26",
            "content": "‘I started my career in academia initially in a technical post, followed by a PhD and then a post-doctoral research position, all at Russell group institutions. I was fortunate during my PhD to have the opportunity to demonstrate in laboratory sessions and take tutorials. Unfortunately, during my post-doctoral post the opportunities to teach didn’t arise and I started considering carefully what I enjoyed and realised I found communicating biology far more fulfilling than spending my time in a fairly solitary capacity focused on a narrow, detailed research area. Despite publishing a handful of papers I decided not to embark on another research position and applied and acquired an hourly- paid lecturing position at a Post-92 institution and a fixed-term, part-time Teaching Fellow contract at my current institution.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_27",
            "content": "My experience at these two intuitions differed quite significantly. The hourly paid post did not provide any training/mentoring and I really felt thrown in at the deep end. In contrast at my current institution I was observed early on in my practise and embarked on a PG Cert in Academic Practice in Higher Education and was encouraged to develop new resources and initiatives. For these reasons at the start of the following academic year I took on more teaching at my current institution rather than the Post-92 institution, despite it being a much longer commute. After 3 and half years juggling temporary and part-time positions, I was given an open-ended Teaching Fellow contract.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_28",
            "content": "I have been very fortunate at my current institution, as there is a small but thriving community of Natural Scientists interested in the scholarship of teaching and learning who meet regularly. I have been mentored by incredibly supportive line managers experienced in HE education, who have found funding for me to attend educational conferences. This has been very formative in my practice, and has given me the support and confidence to successfully bid for teaching grants, present and publish my educational research. Last year I received a university teaching award and now I lead our college research theme into teaching and learning.’",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_29",
            "content": "Case study 2: Lucy Tallents, University of Oxford",
            "ntype": "title",
            "meta": {
                "section": "7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_30",
            "content": "‘I have a standard fixed-term postdoctoral (research) contract, although my role is 100% teaching and technical assistance. I’m passionate about wildlife conservation, and believe that my conservation impact will be greater through developing the capacity of in-country nationals rather than doing my own research. During my Masters and PhD I trained wildlife conservation professionals in field and analytical skills, tutored fellow PhD students and post-docs, and demonstrated in undergraduate statistics labs. For my first post-doc I was tasked to develop a post-graduate diploma in conservation research skills. I rapidly realised that I didn’t have sufficient understanding of curriculum design, how to structure engaging learning activities, and how to effectively assess student learning, let alone the process of getting a new course approved by my institution. I joined a CPD course in learning and teaching run by the University of Oxford’s Learning Institute and was lucky to be mentored by an inspirational educator, Dr Chris Trevitt, who has since left Oxford. He supported me to submit a portfolio to the HEA to gain recognition as a Fellow. It was challenging to do this alongside creating my course and then teaching it almost single-handedly, but the exposure to pedagogical theory and the opportunity to discuss ideas and applications with my peers was invaluable.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_31",
            "content": "After relying on this local support at a crucial time, I lost contact with my peers as our career paths diverged, and I now feel quite isolated both within my research group and the wider institution. This is especially true now that my focus has switched to online learning, which is less familiar to colleagues both within my research discipline and those who teach in other fields. While I have seen increasing support and training put in place for those who are new to teaching, I think that a gap still exists in support for early/mid-career teaching professionals. I’m keen to explore ways to connect people who are interested in student-centred teaching, and are figuring out how to navigate a Teaching-Focussed career path.’",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_32",
            "content": "Case study 3: Katharine Hubbard, University of Cambridge",
            "ntype": "title",
            "meta": {
                "section": "8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_33",
            "content": "‘I have been passionate about teaching from the earliest days of my academic career. During my PhD I did large amounts of small group teaching and laboratory class demonstration, and created a number of resources to support teaching within my department. I then did a post-doc at the University of California, San Diego, however I really missed the contact with undergraduates. Despite having a strong publication record, I realised my strengths were in teaching and this is what I wanted to spend my career doing. I came back to the UK and spent 2 years teaching for the University on an informal freelance basis, where the lack of job security was very stressful. I was then appointed to a Teaching By-Fellowship at Churchill College, and was appointed to my current Teaching-Focussed role within the Department of Plant Sciences on a full time, fixed term basis 2 years ago.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_34",
            "content": "In my current job I find that my contributions to my college, department and inter-departmental teaching are highly valued at a personal level, including by the current Head of Department and other senior academics, but that in terms of the institution I am very much a ‘square peg in a round hole’. I am the only early-career Teaching-Focussed academic in biological sciences, which often feels very isolated as I lack immediate peer support. Getting good career advice is difficult as there are few who understand the Teaching-Focussed route. The University is currently debating whether there should be a formal career structure for those on Teaching-Focussed contracts, but at present career development opportunities are unclear. I love teaching in HE and I achieve some of the highest student feedback in my department, but the isolation is challenging. Meeting other Teaching-Focussed academics at conferences has been invaluable to me, as I have made connections with others who care about teaching and learning in a way that I don’t have within my local institution.’",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_35",
            "content": "Case study 4: Katherine Jones, Bangor University",
            "ntype": "title",
            "meta": {
                "section": "9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_36",
            "content": "‘My journey into lecturing was not something I planned but the result of a rather slow identification of my own strengths and interests, combined with the rather more dull need to remain employed. This led to me working in eight universities in three countries in just one decade. After 6 years in Cambridge and Oxford, I started my first post-doctoral position in Canada, thinking only of research; an extension of my PhD when I had viewed teaching as an enjoyable side-activity that I only engaged in when I needed money or had time for a bit of “CV building”. At the end of this post-doc, unemployment looming, a colleague in my research area encouraged me to teach research skills at a research institute in Nigeria for 6 months. This proved a pivotal turning point in my career, and I realised then that teaching could have as much impact as research. The freedom my Nigerian students gave me to experiment with my own teaching style, has also proved invaluable in my lectureship, where I have had confidence to take risks in teaching and innovate.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_37",
            "content": "After my time in Nigeria, I returned to post-doctoral life, punctuating contracts with some Open University teaching that again cemented my desire to teach. Keeping research active enabled me (to the surprise of most people, including myself) to obtain a short-term lectureship at my current institution. It was here, that I took a risk. I decided to go against my research-led job contract, ignore advice of most senior staff, except the open-minded head of school at the time, and decided to love my job and ignore my h-index. I loved teaching, so that’s what I mostly did. This risk paid off, since my institution has begun, like many UK universities to value teaching more, and my department has been supportive of my move to a more Teaching-Focussed contract, whilst keeping a job contract that is now permanent rather than fixed-term. I am not sure my career route would have been for everyone (the constant moving was stressful), but I would say that you can’t simply copy the career routes of older staff - higher education is in constant flux, so the strength to calculate your own trajectory is important, although this is not without risk.’",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_38",
            "content": "Academy of Medical Sciences . Improving the status and valuation of teaching in the careers of UK academics . Academy of Medical Sciences, The Physiological Society, Heads of University Biosciences and the Society of Biology, 2014 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_39",
            "content": "Buckley A : National Student Survey: Analysis of national results for 2011 . York, The Higher Education Academy, 2012 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_40",
            "content": "Cashmore A Cane C Cane R : Rebalancing promotion in the HE sector: is teaching excellence being rewarded? Genetics Education Networking for Innovation and Excellence: the UK’s Centre for Excellence in Teaching and Learning in Genetics (GENIE CETL), University of Leicester, The Higher Education Academy, 2013 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_41",
            "content": "Cashmore A Ramsden P : Reward and recognition in higher education: Institutional policies and their implementation. The Higher Education Academy and the Genetics Education Networking for Innovation and Excellence (GENIE) CETL, University of Leicester, 2009 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_42",
            "content": "Eby LT Allen TD Evans SC : Does Mentoring Matter? A Multidisciplinary Meta-Analysis Comparing Mentored and Non-Mentored Individuals. J Vocat Behav. 2008 ; 72 ( 2 ): 254 – 267 . 19343074 10.1016/j.jvb.2007.04.005 2352144",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_43",
            "content": "High Level Group on the Modernisation of Higher Education . Report to the European Commission on improving the quality of teaching and learning in Europe’s higher education institutions . 2013 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_44",
            "content": "Kandiko CB Mawer M : Student Expectations and Perceptions of Higher Education. London: King’s Learning Institute, 2013 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_45",
            "content": "Locke W : Shifting academic careers: implications for enhancing professionalism in teaching and supporting learning. The Higher Education Academy, 2014 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_46",
            "content": "The Higher Education Statistics Agency. Data for 2012/13, 2013 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_47",
            "content": "Turner N Oliver M McKenna C : Measuring the impact of the UK Professional Standards Framework for Teaching and Supporting Learning (UKPSF) . The Higher Education Academy, 2013 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_48",
            "content": "University and College Union . The Use of Zero Hours Contracts in Further and Higher Education . 2013 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "4-76_v1_49",
            "content": "Young P : Out of balance: Lecturers’ perceptions of differential status and rewards in relation to teaching and research. Teaching in Higher Education. 2006 ; 11 ( 2 ): 191 – 202 . 10.1080/13562510500527727",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "4-76_v1_0@0",
            "content": "Challenges and opportunities for early-career Teaching-Focussed academics in the biosciences",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_0",
            "start": 0,
            "end": 91,
            "label": {}
        },
        {
            "ix": "4-76_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "4-76_v1_2@0",
            "content": "Twenty-seven percent of academics in UK Higher Education (HE) are in Teaching-Focussed positions, making major contributions to undergraduate programmes in an era of high student expectations when it comes to teaching quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_2",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "4-76_v1_2@1",
            "content": "However, institutional support for Teaching-Focussed academics is often limited, both in terms of peer networking and opportunities for career development.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_2",
            "start": 227,
            "end": 381,
            "label": {}
        },
        {
            "ix": "4-76_v1_2@2",
            "content": "As four early-career stage Teaching-Focussed academics working in a variety of institutions, we explore what motivated our choices to make teaching our primary academic activity, and the challenges that we have faced in doing so.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_2",
            "start": 383,
            "end": 611,
            "label": {}
        },
        {
            "ix": "4-76_v1_2@3",
            "content": "In addition to highlighting the need for universities to fully recognise the achievements of teaching staff, we discuss the role that the various biosciences learned societies have in supporting Teaching-Focussed academics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_2",
            "start": 613,
            "end": 835,
            "label": {}
        },
        {
            "ix": "4-76_v1_2@4",
            "content": "We identify that there is a need for the learned societies to come together and pool their expertise in this area.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_2",
            "start": 837,
            "end": 950,
            "label": {}
        },
        {
            "ix": "4-76_v1_2@5",
            "content": "The fragmented nature of the Teaching-Focussed academic community means that clear sources of national support are needed in order to best enable the next generation of bioscience educators to reach their full potential.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_2",
            "start": 952,
            "end": 1171,
            "label": {}
        },
        {
            "ix": "4-76_v1_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "4-76_v1_4@0",
            "content": "There are 1.8 million undergraduates studying in UK universities, with Biological Sciences students accounting for 10.3% of the undergraduate population ( The Higher Education Statistics Agency, HESA, 2013 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_4",
            "start": 0,
            "end": 207,
            "label": {}
        },
        {
            "ix": "4-76_v1_4@1",
            "content": "Students place a high value on teaching quality; scores for overall satisfaction in the National Student Survey are most strongly correlated with the scores for quality of learning and teaching ( Buckley, 2012 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_4",
            "start": 209,
            "end": 420,
            "label": {}
        },
        {
            "ix": "4-76_v1_4@2",
            "content": "Undergraduates expect that their experience of higher education represents value for money, and want to be taught in small-scale classes by experienced and qualified teaching staff ( Kandiko & Mawer, 2013 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_4",
            "start": 422,
            "end": 628,
            "label": {}
        },
        {
            "ix": "4-76_v1_4@3",
            "content": "Providing high quality teaching is a therefore a significant component of Biology departments, many of whom rely on Teaching-Focussed academics to deliver aspects of their undergraduate programmes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_4",
            "start": 630,
            "end": 826,
            "label": {}
        },
        {
            "ix": "4-76_v1_4@4",
            "content": "At the Society for Experimental Biology (SEB) Education Meeting in December 2014, a major theme that emerged was the challenges facing those at the early stages of their teaching careers.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_4",
            "start": 828,
            "end": 1014,
            "label": {}
        },
        {
            "ix": "4-76_v1_4@5",
            "content": "Many of the difficulties faced by Teaching-Focussed academics have been well documented ( Cashmore & Ramsden, 2009 ; Cashmore et al. , 2013 ; Locke, 2014 ; Young, 2006 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_4",
            "start": 1016,
            "end": 1185,
            "label": {}
        },
        {
            "ix": "4-76_v1_4@6",
            "content": "Here we present our experiences as early-career teaching orientated academics in a range of UK Higher Education (HE) institutions to explore both the challenges and opportunities of working in teaching roles.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_4",
            "start": 1187,
            "end": 1394,
            "label": {}
        },
        {
            "ix": "4-76_v1_5@0",
            "content": "Teaching-Focussed academics are employed on a range of different bases; some are on Teaching-Focussed contracts and are responsible just for covering a given number of hours of contact time, but an increasing number are on Teaching and Scholarship contracts, with an explicit part of their role being to advance understanding of teaching and learning.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_5",
            "start": 0,
            "end": 350,
            "label": {}
        },
        {
            "ix": "4-76_v1_5@1",
            "content": "The HESA includes Teaching-Focussed academics in their surveys of academic staff (note that the HESA uses the term Teaching-Only), revealing that those on Teaching-Focussed contracts represent around 25% of all academic staff, rising to 50% of staff in pre-1992 universities that are not members of the Russell Group ( HESA, 2013 ; Locke, 2014 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_5",
            "start": 352,
            "end": 697,
            "label": {}
        },
        {
            "ix": "4-76_v1_5@2",
            "content": "The employment profiles of Teaching-Focussed academics are significantly different to those on Teaching and Research or research-only contracts.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_5",
            "start": 699,
            "end": 842,
            "label": {}
        },
        {
            "ix": "4-76_v1_5@3",
            "content": "There are roughly equal proportions of male (48%) and female (51%) Teaching-Focussed academics, contrasting with Teaching and Research where there is a gender bias (60% male).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_5",
            "start": 844,
            "end": 1018,
            "label": {}
        },
        {
            "ix": "4-76_v1_5@4",
            "content": "Teaching-Focussed roles are primarily filled by academics on part time, fixed term contracts; only 18% have a full time open ended contract, compared with 74.5% of those on Teaching and Research contracts (see Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_5",
            "start": 1020,
            "end": 1240,
            "label": {}
        },
        {
            "ix": "4-76_v1_5@5",
            "content": "While 12% of academic staff are on zero-hours contracts, this number rises to 47% of Teaching-Focussed staff ( University and College Union, 2013 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_5",
            "start": 1242,
            "end": 1389,
            "label": {}
        },
        {
            "ix": "4-76_v1_5@6",
            "content": "A large proportion of those with responsibility for delivering undergraduate programmes therefore have limited job security.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_5",
            "start": 1391,
            "end": 1514,
            "label": {}
        },
        {
            "ix": "4-76_v1_5@7",
            "content": "This is perhaps symptomatic of a wider conflict within HE teaching; universities are relying on Teaching-Focussed contracts to fulfil their teaching requirements, yet at an institutional level there is often little support for those in Teaching-Focussed roles to become established members of the academic community.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_5",
            "start": 1516,
            "end": 1831,
            "label": {}
        },
        {
            "ix": "4-76_v1_6@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_6",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "4-76_v1_8@0",
            "content": "Why have Teaching-Focussed academics?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_8",
            "start": 0,
            "end": 36,
            "label": {}
        },
        {
            "ix": "4-76_v1_9@0",
            "content": "When preparing this article all of us described experiencing a bias in careers advice we had received, with a heavy focus on the traditional research dominated model of academia.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_9",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "4-76_v1_9@1",
            "content": "One of us commented “ When I finished my PhD I went to a careers event in 2005 [where] I was told there was no such thing a job for those who only wanted to teach at University and yet here I am with a permanent Teaching-Focussed contract 8 years later ”.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_9",
            "start": 179,
            "end": 433,
            "label": {}
        },
        {
            "ix": "4-76_v1_9@2",
            "content": "Teaching-Focussed academics take a diversity of routes towards their roles; some move into teaching at later career stages, but we represent a group of academics who have actively chosen to focus on teaching at an early-career stage having recognised we have the skills and passion for it.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_9",
            "start": 435,
            "end": 723,
            "label": {}
        },
        {
            "ix": "4-76_v1_9@3",
            "content": "As such, we have much to offer our respective institutions, independent of the type of university we work in.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_9",
            "start": 725,
            "end": 833,
            "label": {}
        },
        {
            "ix": "4-76_v1_10@0",
            "content": "In having teaching and learning as a primary focus we have opportunity to consider which teaching methods are most likely to cultivate curiosity, motivation and independence in learners.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_10",
            "start": 0,
            "end": 185,
            "label": {}
        },
        {
            "ix": "4-76_v1_10@1",
            "content": "In our experience, staff employed on Teaching-Focussed contracts are more likely to explore the pedagogical literature and adopt evidence-based best practice compared to staff for whom teaching is only a small part of their role.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_10",
            "start": 187,
            "end": 415,
            "label": {}
        },
        {
            "ix": "4-76_v1_10@2",
            "content": "Teaching-Focussed staff therefore represent a powerful force to embed student-centred learning across the whole range of academic institutions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_10",
            "start": 417,
            "end": 559,
            "label": {}
        },
        {
            "ix": "4-76_v1_10@3",
            "content": "Our enthusiasm for understanding learning and teaching makes us an intellectual and practical asset for colleagues whose research dominates their time.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_10",
            "start": 561,
            "end": 711,
            "label": {}
        },
        {
            "ix": "4-76_v1_10@4",
            "content": "We can help them to develop their understanding of pedagogical philosophies and theories, suggest different learning activities, observe their work and act as critical friends or mentors, providing a springboard for their own transformation into self-reflective educators.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_10",
            "start": 713,
            "end": 984,
            "label": {}
        },
        {
            "ix": "4-76_v1_11@0",
            "content": "Challenges in establishing a Teaching-Focussed academic career",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_11",
            "start": 0,
            "end": 61,
            "label": {}
        },
        {
            "ix": "4-76_v1_12@0",
            "content": "While all early-career academics face significant challenges, there are unique challenges to early-career Teaching-Focussed academics that are easily overlooked.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_12",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "4-76_v1_12@1",
            "content": "Teaching is influenced by differing drivers from research, which may result in early-career teachers having reduced choice in setting the scope of their activities compared to their research equivalents.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_12",
            "start": 162,
            "end": 364,
            "label": {}
        },
        {
            "ix": "4-76_v1_12@2",
            "content": "The teaching agenda is often set by more senior staff, leaving less flexibility for early-career individuals to teach the subjects that they find the most intellectually stimulating.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_12",
            "start": 366,
            "end": 547,
            "label": {}
        },
        {
            "ix": "4-76_v1_12@3",
            "content": "Funding for teaching is more restricted and less transparently advertised than research fellowships and grants, leaving those on Teaching-Focussed contracts at a disadvantage when external funding success is a promotion criterion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_12",
            "start": 549,
            "end": 778,
            "label": {}
        },
        {
            "ix": "4-76_v1_12@4",
            "content": "Teaching outputs may also not be transferrable between institutions due to copyright ownership issues, therefore making sharing good practice and demonstrating impact more difficult than for equivalent research outputs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_12",
            "start": 780,
            "end": 998,
            "label": {}
        },
        {
            "ix": "4-76_v1_13@0",
            "content": "The barriers faced by early-career teachers are often in acquiring and maintaining a job in the first place (as indicated by the significant number of teaching staff on part-time and/or fixed-term contracts; Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_13",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "4-76_v1_13@1",
            "content": "Unlike research which has a well-defined (though not necessarily flawless) path to lectureship, currently there appears to be no clear route to a teaching dominant academic role in the sciences within most UK academic institutions, although some have created Teaching-Focussed career paths (e.g. University of Bristol).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_13",
            "start": 220,
            "end": 538,
            "label": {}
        },
        {
            "ix": "4-76_v1_13@2",
            "content": "Most advertised teaching fellow positions require a PhD and teaching experience, but the opportunities to gain teaching experience and/or training during a PhD or post-doctoral position are mixed and often limited, with supervisors prioritising the publication of papers over the development of non-research skills.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_13",
            "start": 540,
            "end": 854,
            "label": {}
        },
        {
            "ix": "4-76_v1_13@3",
            "content": "For those combining teaching and research at early career stages, teaching commitments mean that it may not be possible to achieve the same quantity or impact of research publications, creating a barrier to progressing to the more prevalent research-teaching posts or returning to research-only positions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_13",
            "start": 856,
            "end": 1160,
            "label": {}
        },
        {
            "ix": "4-76_v1_13@4",
            "content": "In contrast, research staff retain the opportunity to move sideways to teaching at any stage in their career because the importance of demonstrating high-impact teaching, and recruiting on that basis, is not yet universally recognised ( High Level Group on the Modernisation of Higher Education, 2013 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_13",
            "start": 1162,
            "end": 1464,
            "label": {}
        },
        {
            "ix": "4-76_v1_14@0",
            "content": "Teaching is typically organised according to research departments, leaving Teaching-Focussed positions a relative rarity within a research-dominated environment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_14",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "4-76_v1_14@1",
            "content": "While cross-disciplinary teaching support networks do exist within many institutions, their form and membership can be nebulous and lack prominence.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_14",
            "start": 162,
            "end": 309,
            "label": {}
        },
        {
            "ix": "4-76_v1_14@2",
            "content": "This means that we have to look further afield to find a group of peers with whom we can discuss pedagogical concepts and their applications, compared to our research-focussed colleagues.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_14",
            "start": 311,
            "end": 497,
            "label": {}
        },
        {
            "ix": "4-76_v1_14@3",
            "content": "The vocabulary and style of pedagogical literature can be quite different than that of bioscience, and the lack of immediate peers can make engaging with the literature more challenging.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_14",
            "start": 499,
            "end": 684,
            "label": {}
        },
        {
            "ix": "4-76_v1_14@4",
            "content": "Not only does this make current research harder to interpret and implement, but it acts as a hurdle to preparing manuscripts when authors are less clear about the expectations of journal editors and their audience; something which we experienced ourselves when writing this paper.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_14",
            "start": 686,
            "end": 965,
            "label": {}
        },
        {
            "ix": "4-76_v1_14@5",
            "content": "These factors can lead to a feeling of isolation amongst Teaching-Focussed academics, which several of us have experienced during our careers (see case studies) and which can be frustrating and demoralising.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_14",
            "start": 967,
            "end": 1173,
            "label": {}
        },
        {
            "ix": "4-76_v1_15@0",
            "content": "For those that are successful in acquiring a permanent contract the challenges continue.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_15",
            "start": 0,
            "end": 87,
            "label": {}
        },
        {
            "ix": "4-76_v1_15@1",
            "content": "It has been long documented that teaching in HE is deemed a low status activity ( High Level Group on the Modernisation of Higher Education, 2013 ; Young, 2006 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_15",
            "start": 89,
            "end": 250,
            "label": {}
        },
        {
            "ix": "4-76_v1_15@2",
            "content": "Recently though, and particularly with the changes to student finance in England and Wales, reward and recognition for teaching and related activities has been put under the spotlight across the HE sector ( Cashmore & Ramsden, 2009 ; Cashmore et al. , 2013 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_15",
            "start": 252,
            "end": 510,
            "label": {}
        },
        {
            "ix": "4-76_v1_15@3",
            "content": "The Academy of Medical Sciences, The Physiological Society, Heads of University Biosciences and the Society of Biology recently published a survey of over 250 bioscience academics from a range of institutions, career stages and contract types ( Academy of Medical Sciences et al. , 2014 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_15",
            "start": 512,
            "end": 800,
            "label": {}
        },
        {
            "ix": "4-76_v1_15@4",
            "content": "Only 57% of respondents reported that their institution has a clear strategy for evaluating staff teaching contributions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_15",
            "start": 802,
            "end": 922,
            "label": {}
        },
        {
            "ix": "4-76_v1_15@5",
            "content": "Furthermore, 55% of respondents indicated scepticism that teaching is considered equally to research in professorial promotions, with an additional 24% stating that professorial promotions based on teaching achievement were not possible at their institution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_15",
            "start": 924,
            "end": 1181,
            "label": {}
        },
        {
            "ix": "4-76_v1_16@0",
            "content": "Support structures for those in teaching positions",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_16",
            "start": 0,
            "end": 49,
            "label": {}
        },
        {
            "ix": "4-76_v1_17@0",
            "content": "What support structures exist for bioscientists who embark on Teaching-Focussed careers in Higher Education?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_17",
            "start": 0,
            "end": 107,
            "label": {}
        },
        {
            "ix": "4-76_v1_17@1",
            "content": "An increasing number of Universities now offer accredited Postgraduate Certificates in Teaching in Higher Education courses or equivalents.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_17",
            "start": 109,
            "end": 247,
            "label": {}
        },
        {
            "ix": "4-76_v1_17@2",
            "content": "However, these courses can be difficult to access for the large numbers of teaching dominant staff on part-time and/or fixed term contracts, those who do have time allocated for continuing professional development (CPD) in their positions, or are in institutions who do not offer this support.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_17",
            "start": 249,
            "end": 541,
            "label": {}
        },
        {
            "ix": "4-76_v1_17@3",
            "content": "There is therefore a need for professional development at a national level; in the past this has been provided by the Higher Education Academy who made available a wealth of resources, primarily through the Centre for Bioscience.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_17",
            "start": 543,
            "end": 771,
            "label": {}
        },
        {
            "ix": "4-76_v1_17@4",
            "content": "Withdrawal of government funding in recent years has unfortunately resulted in the loss of the Subject Centre in 2011 and the Biosciences discipline lead in 2014.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_17",
            "start": 773,
            "end": 934,
            "label": {}
        },
        {
            "ix": "4-76_v1_17@5",
            "content": "The HEA does maintain however a role in providing professional recognition for teaching through the UK Professional Standards Framework ( Turner et al. , 2013 ), and also provides accreditation for courses and training schemes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_17",
            "start": 936,
            "end": 1162,
            "label": {}
        },
        {
            "ix": "4-76_v1_18@0",
            "content": "All academics can attest to the value of professional networks, which are often established at the early-career stage at conferences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_18",
            "start": 0,
            "end": 132,
            "label": {}
        },
        {
            "ix": "4-76_v1_18@1",
            "content": "However, what happens to these networks if you take a different academic path and you find yourself just as interested in how to educate others in your science as the science itself? It is here that the Teaching-Focussed academic can risk becoming an island, with restricted funding, losing those opportunities for renewed inspiration and sharing of good practice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_18",
            "start": 134,
            "end": 497,
            "label": {}
        },
        {
            "ix": "4-76_v1_18@2",
            "content": "This is especially true of those early in their career that have not yet established links across institutions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_18",
            "start": 499,
            "end": 609,
            "label": {}
        },
        {
            "ix": "4-76_v1_18@3",
            "content": "With the HEA no longer offering subject-specific support, an obvious alternative are the learned societies, who have always played an important role in providing networking opportunities for academics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_18",
            "start": 611,
            "end": 811,
            "label": {}
        },
        {
            "ix": "4-76_v1_18@4",
            "content": "Education meetings run by organisations such as SEB are hugely important in providing Teaching-Focussed academics to meet and exchange ideas; none of the authors of this piece knew each other before attending SEB meetings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_18",
            "start": 813,
            "end": 1034,
            "label": {}
        },
        {
            "ix": "4-76_v1_18@5",
            "content": "Learned societies also have a valuable role to play in filling the gap in terms of external mechanisms of validation; for example, the Society of Biology has taken over the HEA funded HE Bioscience Teacher of the Year award.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_18",
            "start": 1036,
            "end": 1259,
            "label": {}
        },
        {
            "ix": "4-76_v1_19@0",
            "content": "Discussions on supporting bioscience teaching at both the SEB education meeting (2014) and at a recent HEA Biosciences meeting (University of Newcastle, 2014) have included the fact that the learned societies for biology in the UK are very fragmented.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_19",
            "start": 0,
            "end": 250,
            "label": {}
        },
        {
            "ix": "4-76_v1_19@1",
            "content": "The Society of Biology, The Society for Experimental Biology, The Physiological Society, The Biochemical Society, The British Ecological Society and others all have Education sections.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_19",
            "start": 252,
            "end": 435,
            "label": {}
        },
        {
            "ix": "4-76_v1_19@2",
            "content": "While having separate societies makes sense for research activities, the challenges facing educators in the different areas of bioscience are quite similar.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_19",
            "start": 437,
            "end": 592,
            "label": {}
        },
        {
            "ix": "4-76_v1_19@3",
            "content": "For the early-career bioscience teacher it can be unclear which society is the natural ‘home’ for them, and belonging to all societies would be prohibitively expensive.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_19",
            "start": 594,
            "end": 761,
            "label": {}
        },
        {
            "ix": "4-76_v1_19@4",
            "content": "This contrasts with the support provided to Teaching-Focussed staff in the physical sciences, where the Institute of Physics or the Royal Society of Chemistry have central roles in coordinating educational activities.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_19",
            "start": 763,
            "end": 979,
            "label": {}
        },
        {
            "ix": "4-76_v1_20@0",
            "content": "Opportunities and future prospects - a supportive network with learned societies?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_20",
            "start": 0,
            "end": 80,
            "label": {}
        },
        {
            "ix": "4-76_v1_21@0",
            "content": "In the absence of the HEA as a national body to support biosciences teaching, we feel there is a need for learned societies to come together and organise interdisciplinary events on the theme of education and outreach.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_21",
            "start": 0,
            "end": 217,
            "label": {}
        },
        {
            "ix": "4-76_v1_21@1",
            "content": "Learned societies combining their efforts in terms of education would allow expertise of different organisations to be shared more easily, and provide a clearer sense of identity for Teaching-Focussed academics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_21",
            "start": 219,
            "end": 429,
            "label": {}
        },
        {
            "ix": "4-76_v1_21@2",
            "content": "At the SEB meeting (December 2014), we discussed whether educational meetings should be integrated within society-wide meetings or whether meetings should be specialised on education, perhaps across several learned societies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_21",
            "start": 431,
            "end": 655,
            "label": {}
        },
        {
            "ix": "4-76_v1_21@3",
            "content": "The advantage for removing the segregation between “research” and “teaching” academics, may be to improve the status of teaching and spread good practice further than simply “preaching to the choir”.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_21",
            "start": 657,
            "end": 855,
            "label": {}
        },
        {
            "ix": "4-76_v1_21@4",
            "content": "The advantage of more specialist education meetings is that common themes often arise in learning and teaching across a wide variety of disciplines, as seen by the attendance of physicists at the SEB meeting.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_21",
            "start": 857,
            "end": 1064,
            "label": {}
        },
        {
            "ix": "4-76_v1_21@5",
            "content": "Subject-specific meetings may therefore lose the chance to learn from pedagogical advances in other disciplines.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_21",
            "start": 1066,
            "end": 1177,
            "label": {}
        },
        {
            "ix": "4-76_v1_22@0",
            "content": "Societies also have a potential role in supporting the development of junior academics through mentoring, which is one intervention that has been shown to improve career prospects ( Eby et al. , 2008 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_22",
            "start": 0,
            "end": 201,
            "label": {}
        },
        {
            "ix": "4-76_v1_22@1",
            "content": "Currently there is no formal mentoring process in the wider HE bioscience community; an informal community of practise exists via the HEA’s Bioscience PedR JISC email list and conferences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_22",
            "start": 203,
            "end": 390,
            "label": {}
        },
        {
            "ix": "4-76_v1_22@2",
            "content": "The education committees of the learned societies could potentially take an active role in supporting the next generation of bioscience educators by coordinating mentoring relationships, which would be invaluable to those in institutions without an existing community of Teaching-Focussed academics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_22",
            "start": 392,
            "end": 690,
            "label": {}
        },
        {
            "ix": "4-76_v1_22@3",
            "content": "The British Ecological Society already has a successful mentoring scheme for female ecologists; an equivalent scheme hosted by the combined learned societies could result in real gains in supporting Teaching-Focussed academics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_22",
            "start": 692,
            "end": 918,
            "label": {}
        },
        {
            "ix": "4-76_v1_23@0",
            "content": "The role of education committees on learned societies are also expanding.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_23",
            "start": 0,
            "end": 72,
            "label": {}
        },
        {
            "ix": "4-76_v1_23@1",
            "content": "As one of us noted, “ In my 5 years on the British Ecological Society Education, Training and Careers Committee, the emphasis of the committee changed from one that predominantly focussed on increasing the impact of teaching ecology in schools by working with teachers and policy makers to an ever expanding portfolio that now includes internships for undergraduates, outreach work at music festivals and supporting lecturers in delivering innovative field teaching ”.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_23",
            "start": 74,
            "end": 541,
            "label": {}
        },
        {
            "ix": "4-76_v1_23@2",
            "content": "If learned societies can continue to expand their reach beyond the traditional research domain, they will play an important part in fostering a collaborative approach to teaching in higher education, and concurrently support the teaching careers of early career academics.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_23",
            "start": 543,
            "end": 814,
            "label": {}
        },
        {
            "ix": "4-76_v1_24@0",
            "content": "In conclusion, early-career Teaching-Focussed academics make valuable contributions to bioscience departments, and institutions should be enabling these academics to achieve their full potential, both in terms of their immediate teaching responsibilities to their students and their long term career progression.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_24",
            "start": 0,
            "end": 311,
            "label": {}
        },
        {
            "ix": "4-76_v1_24@1",
            "content": "There is wide variation in the support universities provide, with some institutions nurturing a high quality environment for teaching staff, while others lag behind.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_24",
            "start": 313,
            "end": 477,
            "label": {}
        },
        {
            "ix": "4-76_v1_24@2",
            "content": "However, even with the best possible local institutional support, the fragmented nature of the Teaching-Focussed community means that national organisations are essential to bring otherwise isolated individuals together.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_24",
            "start": 479,
            "end": 698,
            "label": {}
        },
        {
            "ix": "4-76_v1_24@3",
            "content": "As the HEA is unlikely to fund subject-specific initiatives again without a major increase in funding, it falls to the learned societies to provide cross-institutional support for Teaching-Focussed academics, particularly through providing bioscience education conferences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_24",
            "start": 700,
            "end": 972,
            "label": {}
        },
        {
            "ix": "4-76_v1_24@4",
            "content": "Presenting at education-focussed sessions enables sharing of good practice, external validation of teaching activities, and ultimately, as this article demonstrates, opportunity for new collaborations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_24",
            "start": 974,
            "end": 1174,
            "label": {}
        },
        {
            "ix": "4-76_v1_24@5",
            "content": "As one of us noted, “ I never planned my route through academia or imagined myself as an educator; it is through my involvement in learned societies that I have met the key people that allowed me to see that there is no “one-size-fits-all” concept of an academic ”.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_24",
            "start": 1176,
            "end": 1440,
            "label": {}
        },
        {
            "ix": "4-76_v1_25@0",
            "content": "Case study 1: Sarah Gretton, University of Leicester",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_25",
            "start": 0,
            "end": 51,
            "label": {}
        },
        {
            "ix": "4-76_v1_26@0",
            "content": "‘I started my career in academia initially in a technical post, followed by a PhD and then a post-doctoral research position, all at Russell group institutions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_26",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "4-76_v1_26@1",
            "content": "I was fortunate during my PhD to have the opportunity to demonstrate in laboratory sessions and take tutorials.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_26",
            "start": 161,
            "end": 271,
            "label": {}
        },
        {
            "ix": "4-76_v1_26@2",
            "content": "Unfortunately, during my post-doctoral post the opportunities to teach didn’t arise and I started considering carefully what I enjoyed and realised I found communicating biology far more fulfilling than spending my time in a fairly solitary capacity focused on a narrow, detailed research area.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_26",
            "start": 273,
            "end": 566,
            "label": {}
        },
        {
            "ix": "4-76_v1_26@3",
            "content": "Despite publishing a handful of papers I decided not to embark on another research position and applied and acquired an hourly- paid lecturing position at a Post-92 institution and a fixed-term, part-time Teaching Fellow contract at my current institution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_26",
            "start": 568,
            "end": 823,
            "label": {}
        },
        {
            "ix": "4-76_v1_27@0",
            "content": "My experience at these two intuitions differed quite significantly.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_27",
            "start": 0,
            "end": 66,
            "label": {}
        },
        {
            "ix": "4-76_v1_27@1",
            "content": "The hourly paid post did not provide any training/mentoring and I really felt thrown in at the deep end.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_27",
            "start": 68,
            "end": 171,
            "label": {}
        },
        {
            "ix": "4-76_v1_27@2",
            "content": "In contrast at my current institution I was observed early on in my practise and embarked on a PG Cert in Academic Practice in Higher Education and was encouraged to develop new resources and initiatives.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_27",
            "start": 173,
            "end": 376,
            "label": {}
        },
        {
            "ix": "4-76_v1_27@3",
            "content": "For these reasons at the start of the following academic year I took on more teaching at my current institution rather than the Post-92 institution, despite it being a much longer commute.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_27",
            "start": 378,
            "end": 565,
            "label": {}
        },
        {
            "ix": "4-76_v1_27@4",
            "content": "After 3 and half years juggling temporary and part-time positions, I was given an open-ended Teaching Fellow contract.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_27",
            "start": 567,
            "end": 684,
            "label": {}
        },
        {
            "ix": "4-76_v1_28@0",
            "content": "I have been very fortunate at my current institution, as there is a small but thriving community of Natural Scientists interested in the scholarship of teaching and learning who meet regularly.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_28",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "4-76_v1_28@1",
            "content": "I have been mentored by incredibly supportive line managers experienced in HE education, who have found funding for me to attend educational conferences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_28",
            "start": 194,
            "end": 346,
            "label": {}
        },
        {
            "ix": "4-76_v1_28@2",
            "content": "This has been very formative in my practice, and has given me the support and confidence to successfully bid for teaching grants, present and publish my educational research.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_28",
            "start": 348,
            "end": 521,
            "label": {}
        },
        {
            "ix": "4-76_v1_28@3",
            "content": "Last year I received a university teaching award and now I lead our college research theme into teaching and learning.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_28",
            "start": 523,
            "end": 640,
            "label": {}
        },
        {
            "ix": "4-76_v1_28@4",
            "content": "’",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_28",
            "start": 641,
            "end": 641,
            "label": {}
        },
        {
            "ix": "4-76_v1_29@0",
            "content": "Case study 2: Lucy Tallents, University of Oxford",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_29",
            "start": 0,
            "end": 48,
            "label": {}
        },
        {
            "ix": "4-76_v1_30@0",
            "content": "‘I have a standard fixed-term postdoctoral (research) contract, although my role is 100% teaching and technical assistance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_30",
            "start": 0,
            "end": 122,
            "label": {}
        },
        {
            "ix": "4-76_v1_30@1",
            "content": "I’m passionate about wildlife conservation, and believe that my conservation impact will be greater through developing the capacity of in-country nationals rather than doing my own research.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_30",
            "start": 124,
            "end": 313,
            "label": {}
        },
        {
            "ix": "4-76_v1_30@2",
            "content": "During my Masters and PhD I trained wildlife conservation professionals in field and analytical skills, tutored fellow PhD students and post-docs, and demonstrated in undergraduate statistics labs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_30",
            "start": 315,
            "end": 511,
            "label": {}
        },
        {
            "ix": "4-76_v1_30@3",
            "content": "For my first post-doc I was tasked to develop a post-graduate diploma in conservation research skills.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_30",
            "start": 513,
            "end": 614,
            "label": {}
        },
        {
            "ix": "4-76_v1_30@4",
            "content": "I rapidly realised that I didn’t have sufficient understanding of curriculum design, how to structure engaging learning activities, and how to effectively assess student learning, let alone the process of getting a new course approved by my institution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_30",
            "start": 616,
            "end": 868,
            "label": {}
        },
        {
            "ix": "4-76_v1_30@5",
            "content": "I joined a CPD course in learning and teaching run by the University of Oxford’s Learning Institute and was lucky to be mentored by an inspirational educator, Dr Chris Trevitt, who has since left Oxford.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_30",
            "start": 870,
            "end": 1072,
            "label": {}
        },
        {
            "ix": "4-76_v1_30@6",
            "content": "He supported me to submit a portfolio to the HEA to gain recognition as a Fellow.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_30",
            "start": 1074,
            "end": 1154,
            "label": {}
        },
        {
            "ix": "4-76_v1_30@7",
            "content": "It was challenging to do this alongside creating my course and then teaching it almost single-handedly, but the exposure to pedagogical theory and the opportunity to discuss ideas and applications with my peers was invaluable.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_30",
            "start": 1156,
            "end": 1381,
            "label": {}
        },
        {
            "ix": "4-76_v1_31@0",
            "content": "After relying on this local support at a crucial time, I lost contact with my peers as our career paths diverged, and I now feel quite isolated both within my research group and the wider institution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_31",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "4-76_v1_31@1",
            "content": "This is especially true now that my focus has switched to online learning, which is less familiar to colleagues both within my research discipline and those who teach in other fields.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_31",
            "start": 201,
            "end": 383,
            "label": {}
        },
        {
            "ix": "4-76_v1_31@2",
            "content": "While I have seen increasing support and training put in place for those who are new to teaching, I think that a gap still exists in support for early/mid-career teaching professionals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_31",
            "start": 385,
            "end": 569,
            "label": {}
        },
        {
            "ix": "4-76_v1_31@3",
            "content": "I’m keen to explore ways to connect people who are interested in student-centred teaching, and are figuring out how to navigate a Teaching-Focussed career path.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_31",
            "start": 571,
            "end": 730,
            "label": {}
        },
        {
            "ix": "4-76_v1_31@4",
            "content": "’",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_31",
            "start": 731,
            "end": 731,
            "label": {}
        },
        {
            "ix": "4-76_v1_32@0",
            "content": "Case study 3: Katharine Hubbard, University of Cambridge",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_32",
            "start": 0,
            "end": 55,
            "label": {}
        },
        {
            "ix": "4-76_v1_33@0",
            "content": "‘I have been passionate about teaching from the earliest days of my academic career.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_33",
            "start": 0,
            "end": 83,
            "label": {}
        },
        {
            "ix": "4-76_v1_33@1",
            "content": "During my PhD I did large amounts of small group teaching and laboratory class demonstration, and created a number of resources to support teaching within my department. I then did a post-doc at the University of California, San Diego, however I really missed the contact with undergraduates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_33",
            "start": 85,
            "end": 376,
            "label": {}
        },
        {
            "ix": "4-76_v1_33@2",
            "content": "Despite having a strong publication record, I realised my strengths were in teaching and this is what I wanted to spend my career doing. I came back to the UK and spent 2 years teaching for the University on an informal freelance basis, where the lack of job security was very stressful.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_33",
            "start": 378,
            "end": 664,
            "label": {}
        },
        {
            "ix": "4-76_v1_33@3",
            "content": "I was then appointed to a Teaching By-Fellowship at Churchill College, and was appointed to my current Teaching-Focussed role within the Department of Plant Sciences on a full time, fixed term basis 2 years ago.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_33",
            "start": 666,
            "end": 876,
            "label": {}
        },
        {
            "ix": "4-76_v1_34@0",
            "content": "In my current job I find that my contributions to my college, department and inter-departmental teaching are highly valued at a personal level, including by the current Head of Department and other senior academics, but that in terms of the institution I am very much a ‘square peg in a round hole’. I am the only early-career Teaching-Focussed academic in biological sciences, which often feels very isolated as I lack immediate peer support.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_34",
            "start": 0,
            "end": 442,
            "label": {}
        },
        {
            "ix": "4-76_v1_34@1",
            "content": "Getting good career advice is difficult as there are few who understand the Teaching-Focussed route.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_34",
            "start": 444,
            "end": 543,
            "label": {}
        },
        {
            "ix": "4-76_v1_34@2",
            "content": "The University is currently debating whether there should be a formal career structure for those on Teaching-Focussed contracts, but at present career development opportunities are unclear.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_34",
            "start": 545,
            "end": 733,
            "label": {}
        },
        {
            "ix": "4-76_v1_34@3",
            "content": "I love teaching in HE and I achieve some of the highest student feedback in my department, but the isolation is challenging.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_34",
            "start": 735,
            "end": 858,
            "label": {}
        },
        {
            "ix": "4-76_v1_34@4",
            "content": "Meeting other Teaching-Focussed academics at conferences has been invaluable to me, as I have made connections with others who care about teaching and learning in a way that I don’t have within my local institution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_34",
            "start": 860,
            "end": 1074,
            "label": {}
        },
        {
            "ix": "4-76_v1_34@5",
            "content": "’",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_34",
            "start": 1075,
            "end": 1075,
            "label": {}
        },
        {
            "ix": "4-76_v1_35@0",
            "content": "Case study 4: Katherine Jones, Bangor University",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_35",
            "start": 0,
            "end": 47,
            "label": {}
        },
        {
            "ix": "4-76_v1_36@0",
            "content": "‘My journey into lecturing was not something I planned but the result of a rather slow identification of my own strengths and interests, combined with the rather more dull need to remain employed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_36",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "4-76_v1_36@1",
            "content": "This led to me working in eight universities in three countries in just one decade.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_36",
            "start": 197,
            "end": 279,
            "label": {}
        },
        {
            "ix": "4-76_v1_36@2",
            "content": "After 6 years in Cambridge and Oxford, I started my first post-doctoral position in Canada, thinking only of research; an extension of my PhD when I had viewed teaching as an enjoyable side-activity that I only engaged in when I needed money or had time for a bit of “CV building”.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_36",
            "start": 281,
            "end": 561,
            "label": {}
        },
        {
            "ix": "4-76_v1_36@3",
            "content": "At the end of this post-doc, unemployment looming, a colleague in my research area encouraged me to teach research skills at a research institute in Nigeria for 6 months.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_36",
            "start": 563,
            "end": 732,
            "label": {}
        },
        {
            "ix": "4-76_v1_36@4",
            "content": "This proved a pivotal turning point in my career, and I realised then that teaching could have as much impact as research.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_36",
            "start": 734,
            "end": 855,
            "label": {}
        },
        {
            "ix": "4-76_v1_36@5",
            "content": "The freedom my Nigerian students gave me to experiment with my own teaching style, has also proved invaluable in my lectureship, where I have had confidence to take risks in teaching and innovate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_36",
            "start": 857,
            "end": 1052,
            "label": {}
        },
        {
            "ix": "4-76_v1_37@0",
            "content": "After my time in Nigeria, I returned to post-doctoral life, punctuating contracts with some Open University teaching that again cemented my desire to teach.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_37",
            "start": 0,
            "end": 155,
            "label": {}
        },
        {
            "ix": "4-76_v1_37@1",
            "content": "Keeping research active enabled me (to the surprise of most people, including myself) to obtain a short-term lectureship at my current institution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_37",
            "start": 157,
            "end": 303,
            "label": {}
        },
        {
            "ix": "4-76_v1_37@2",
            "content": "It was here, that I took a risk.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_37",
            "start": 305,
            "end": 336,
            "label": {}
        },
        {
            "ix": "4-76_v1_37@3",
            "content": "I decided to go against my research-led job contract, ignore advice of most senior staff, except the open-minded head of school at the time, and decided to love my job and ignore my h-index.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_37",
            "start": 338,
            "end": 527,
            "label": {}
        },
        {
            "ix": "4-76_v1_37@4",
            "content": "I loved teaching, so that’s what I mostly did.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_37",
            "start": 529,
            "end": 574,
            "label": {}
        },
        {
            "ix": "4-76_v1_37@5",
            "content": "This risk paid off, since my institution has begun, like many UK universities to value teaching more, and my department has been supportive of my move to a more Teaching-Focussed contract, whilst keeping a job contract that is now permanent rather than fixed-term.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_37",
            "start": 576,
            "end": 839,
            "label": {}
        },
        {
            "ix": "4-76_v1_37@6",
            "content": "I am not sure my career route would have been for everyone (the constant moving was stressful), but I would say that you can’t simply copy the career routes of older staff - higher education is in constant flux, so the strength to calculate your own trajectory is important, although this is not without risk.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_37",
            "start": 841,
            "end": 1149,
            "label": {}
        },
        {
            "ix": "4-76_v1_37@7",
            "content": "’",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_37",
            "start": 1150,
            "end": 1150,
            "label": {}
        },
        {
            "ix": "4-76_v1_38@0",
            "content": "Academy of Medical Sciences . Improving the status and valuation of teaching in the careers of UK academics . Academy of Medical Sciences, The Physiological Society, Heads of University Biosciences and the Society of Biology, 2014 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_38",
            "start": 0,
            "end": 248,
            "label": {}
        },
        {
            "ix": "4-76_v1_39@0",
            "content": "Buckley A : National Student Survey: Analysis of national results for 2011 . York, The Higher Education Academy, 2012 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_39",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "4-76_v1_40@0",
            "content": "Cashmore A Cane C Cane R : Rebalancing promotion in the HE sector: is teaching excellence being rewarded? Genetics Education Networking for Innovation and Excellence: the UK’s Centre for Excellence in Teaching and Learning in Genetics (GENIE CETL), University of Leicester, The Higher Education Academy, 2013 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_40",
            "start": 0,
            "end": 326,
            "label": {}
        },
        {
            "ix": "4-76_v1_41@0",
            "content": "Cashmore A Ramsden P : Reward and recognition in higher education: Institutional policies and their implementation. The Higher Education Academy and the Genetics Education Networking for Innovation and Excellence (GENIE) CETL, University of Leicester, 2009 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_41",
            "start": 0,
            "end": 274,
            "label": {}
        },
        {
            "ix": "4-76_v1_42@0",
            "content": "Eby LT Allen TD Evans SC : Does Mentoring Matter? A Multidisciplinary Meta-Analysis Comparing Mentored and Non-Mentored Individuals. J Vocat Behav. 2008 ; 72 ( 2 ): 254 – 267 . 19343074 10.1016/j.jvb.2007.04.005 2352144",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_42",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "4-76_v1_43@0",
            "content": "High Level Group on the Modernisation of Higher Education . Report to the European Commission on improving the quality of teaching and learning in Europe’s higher education institutions . 2013 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_43",
            "start": 0,
            "end": 210,
            "label": {}
        },
        {
            "ix": "4-76_v1_44@0",
            "content": "Kandiko CB Mawer M : Student Expectations and Perceptions of Higher Education. London: King’s Learning Institute, 2013 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_44",
            "start": 0,
            "end": 136,
            "label": {}
        },
        {
            "ix": "4-76_v1_45@0",
            "content": "Locke W : Shifting academic careers: implications for enhancing professionalism in teaching and supporting learning. The Higher Education Academy, 2014 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_45",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "4-76_v1_46@0",
            "content": "The Higher Education Statistics Agency. Data for 2012/13, 2013 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_46",
            "start": 0,
            "end": 80,
            "label": {}
        },
        {
            "ix": "4-76_v1_47@0",
            "content": "Turner N Oliver M McKenna C : Measuring the impact of the UK Professional Standards Framework for Teaching and Supporting Learning (UKPSF) . The Higher Education Academy, 2013 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_47",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "4-76_v1_48@0",
            "content": "University and College Union . The Use of Zero Hours Contracts in Further and Higher Education . 2013 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_48",
            "start": 0,
            "end": 119,
            "label": {}
        },
        {
            "ix": "4-76_v1_49@0",
            "content": "Young P : Out of balance: Lecturers’ perceptions of differential status and rewards in relation to teaching and research. Teaching in Higher Education. 2006 ; 11 ( 2 ): 191 – 202 . 10.1080/13562510500527727",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "4-76_v1_49",
            "start": 0,
            "end": 205,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_1",
            "tgt_ix": "4-76_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_3",
            "tgt_ix": "4-76_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_3",
            "tgt_ix": "4-76_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_3",
            "tgt_ix": "4-76_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_6",
            "tgt_ix": "4-76_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_8",
            "tgt_ix": "4-76_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_8",
            "tgt_ix": "4-76_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_11",
            "tgt_ix": "4-76_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_11",
            "tgt_ix": "4-76_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_11",
            "tgt_ix": "4-76_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_11",
            "tgt_ix": "4-76_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_16",
            "tgt_ix": "4-76_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_16",
            "tgt_ix": "4-76_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_16",
            "tgt_ix": "4-76_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_20",
            "tgt_ix": "4-76_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_20",
            "tgt_ix": "4-76_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_20",
            "tgt_ix": "4-76_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_20",
            "tgt_ix": "4-76_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_25",
            "tgt_ix": "4-76_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_25",
            "tgt_ix": "4-76_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_25",
            "tgt_ix": "4-76_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_29",
            "tgt_ix": "4-76_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_29",
            "tgt_ix": "4-76_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_32",
            "tgt_ix": "4-76_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_32",
            "tgt_ix": "4-76_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_35",
            "tgt_ix": "4-76_v1_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_35",
            "tgt_ix": "4-76_v1_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_1",
            "tgt_ix": "4-76_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_2",
            "tgt_ix": "4-76_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_3",
            "tgt_ix": "4-76_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_6",
            "tgt_ix": "4-76_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_7",
            "tgt_ix": "4-76_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_8",
            "tgt_ix": "4-76_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_9",
            "tgt_ix": "4-76_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_10",
            "tgt_ix": "4-76_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_11",
            "tgt_ix": "4-76_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_12",
            "tgt_ix": "4-76_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_13",
            "tgt_ix": "4-76_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_14",
            "tgt_ix": "4-76_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_15",
            "tgt_ix": "4-76_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_16",
            "tgt_ix": "4-76_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_17",
            "tgt_ix": "4-76_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_18",
            "tgt_ix": "4-76_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_19",
            "tgt_ix": "4-76_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_20",
            "tgt_ix": "4-76_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_21",
            "tgt_ix": "4-76_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_22",
            "tgt_ix": "4-76_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_23",
            "tgt_ix": "4-76_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_24",
            "tgt_ix": "4-76_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_25",
            "tgt_ix": "4-76_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_26",
            "tgt_ix": "4-76_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_27",
            "tgt_ix": "4-76_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_28",
            "tgt_ix": "4-76_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_29",
            "tgt_ix": "4-76_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_30",
            "tgt_ix": "4-76_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_31",
            "tgt_ix": "4-76_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_32",
            "tgt_ix": "4-76_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_33",
            "tgt_ix": "4-76_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_34",
            "tgt_ix": "4-76_v1_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_35",
            "tgt_ix": "4-76_v1_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_36",
            "tgt_ix": "4-76_v1_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_15",
            "tgt_ix": "4-76_v1_38",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_39",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_40",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_41",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_22",
            "tgt_ix": "4-76_v1_42",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_13",
            "tgt_ix": "4-76_v1_43",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_44",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_45",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_46",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_17",
            "tgt_ix": "4-76_v1_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_48",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_7",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "4-76_v1_0",
            "tgt_ix": "4-76_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_1",
            "tgt_ix": "4-76_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_2",
            "tgt_ix": "4-76_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_2",
            "tgt_ix": "4-76_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_2",
            "tgt_ix": "4-76_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_2",
            "tgt_ix": "4-76_v1_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_2",
            "tgt_ix": "4-76_v1_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_2",
            "tgt_ix": "4-76_v1_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_3",
            "tgt_ix": "4-76_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_4",
            "tgt_ix": "4-76_v1_4@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_5@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_5@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_5@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_5",
            "tgt_ix": "4-76_v1_5@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_6",
            "tgt_ix": "4-76_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_8",
            "tgt_ix": "4-76_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_9",
            "tgt_ix": "4-76_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_9",
            "tgt_ix": "4-76_v1_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_9",
            "tgt_ix": "4-76_v1_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_9",
            "tgt_ix": "4-76_v1_9@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_10",
            "tgt_ix": "4-76_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_10",
            "tgt_ix": "4-76_v1_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_10",
            "tgt_ix": "4-76_v1_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_10",
            "tgt_ix": "4-76_v1_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_10",
            "tgt_ix": "4-76_v1_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_11",
            "tgt_ix": "4-76_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_12",
            "tgt_ix": "4-76_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_12",
            "tgt_ix": "4-76_v1_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_12",
            "tgt_ix": "4-76_v1_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_12",
            "tgt_ix": "4-76_v1_12@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_12",
            "tgt_ix": "4-76_v1_12@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_13",
            "tgt_ix": "4-76_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_13",
            "tgt_ix": "4-76_v1_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_13",
            "tgt_ix": "4-76_v1_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_13",
            "tgt_ix": "4-76_v1_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_13",
            "tgt_ix": "4-76_v1_13@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_14",
            "tgt_ix": "4-76_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_14",
            "tgt_ix": "4-76_v1_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_14",
            "tgt_ix": "4-76_v1_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_14",
            "tgt_ix": "4-76_v1_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_14",
            "tgt_ix": "4-76_v1_14@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_14",
            "tgt_ix": "4-76_v1_14@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_15",
            "tgt_ix": "4-76_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_15",
            "tgt_ix": "4-76_v1_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_15",
            "tgt_ix": "4-76_v1_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_15",
            "tgt_ix": "4-76_v1_15@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_15",
            "tgt_ix": "4-76_v1_15@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_15",
            "tgt_ix": "4-76_v1_15@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_16",
            "tgt_ix": "4-76_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_17",
            "tgt_ix": "4-76_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_17",
            "tgt_ix": "4-76_v1_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_17",
            "tgt_ix": "4-76_v1_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_17",
            "tgt_ix": "4-76_v1_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_17",
            "tgt_ix": "4-76_v1_17@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_17",
            "tgt_ix": "4-76_v1_17@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_18",
            "tgt_ix": "4-76_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_18",
            "tgt_ix": "4-76_v1_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_18",
            "tgt_ix": "4-76_v1_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_18",
            "tgt_ix": "4-76_v1_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_18",
            "tgt_ix": "4-76_v1_18@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_18",
            "tgt_ix": "4-76_v1_18@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_19",
            "tgt_ix": "4-76_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_19",
            "tgt_ix": "4-76_v1_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_19",
            "tgt_ix": "4-76_v1_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_19",
            "tgt_ix": "4-76_v1_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_19",
            "tgt_ix": "4-76_v1_19@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_20",
            "tgt_ix": "4-76_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_21",
            "tgt_ix": "4-76_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_21",
            "tgt_ix": "4-76_v1_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_21",
            "tgt_ix": "4-76_v1_21@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_21",
            "tgt_ix": "4-76_v1_21@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_21",
            "tgt_ix": "4-76_v1_21@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_21",
            "tgt_ix": "4-76_v1_21@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_22",
            "tgt_ix": "4-76_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_22",
            "tgt_ix": "4-76_v1_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_22",
            "tgt_ix": "4-76_v1_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_22",
            "tgt_ix": "4-76_v1_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_23",
            "tgt_ix": "4-76_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_23",
            "tgt_ix": "4-76_v1_23@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_23",
            "tgt_ix": "4-76_v1_23@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_24",
            "tgt_ix": "4-76_v1_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_24",
            "tgt_ix": "4-76_v1_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_24",
            "tgt_ix": "4-76_v1_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_24",
            "tgt_ix": "4-76_v1_24@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_24",
            "tgt_ix": "4-76_v1_24@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_24",
            "tgt_ix": "4-76_v1_24@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_25",
            "tgt_ix": "4-76_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_26",
            "tgt_ix": "4-76_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_26",
            "tgt_ix": "4-76_v1_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_26",
            "tgt_ix": "4-76_v1_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_26",
            "tgt_ix": "4-76_v1_26@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_27",
            "tgt_ix": "4-76_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_27",
            "tgt_ix": "4-76_v1_27@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_27",
            "tgt_ix": "4-76_v1_27@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_27",
            "tgt_ix": "4-76_v1_27@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_27",
            "tgt_ix": "4-76_v1_27@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_28",
            "tgt_ix": "4-76_v1_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_28",
            "tgt_ix": "4-76_v1_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_28",
            "tgt_ix": "4-76_v1_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_28",
            "tgt_ix": "4-76_v1_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_28",
            "tgt_ix": "4-76_v1_28@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_29",
            "tgt_ix": "4-76_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_30",
            "tgt_ix": "4-76_v1_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_30",
            "tgt_ix": "4-76_v1_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_30",
            "tgt_ix": "4-76_v1_30@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_30",
            "tgt_ix": "4-76_v1_30@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_30",
            "tgt_ix": "4-76_v1_30@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_30",
            "tgt_ix": "4-76_v1_30@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_30",
            "tgt_ix": "4-76_v1_30@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_30",
            "tgt_ix": "4-76_v1_30@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_31",
            "tgt_ix": "4-76_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_31",
            "tgt_ix": "4-76_v1_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_31",
            "tgt_ix": "4-76_v1_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_31",
            "tgt_ix": "4-76_v1_31@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_31",
            "tgt_ix": "4-76_v1_31@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_32",
            "tgt_ix": "4-76_v1_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_33",
            "tgt_ix": "4-76_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_33",
            "tgt_ix": "4-76_v1_33@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_33",
            "tgt_ix": "4-76_v1_33@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_33",
            "tgt_ix": "4-76_v1_33@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_34",
            "tgt_ix": "4-76_v1_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_34",
            "tgt_ix": "4-76_v1_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_34",
            "tgt_ix": "4-76_v1_34@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_34",
            "tgt_ix": "4-76_v1_34@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_34",
            "tgt_ix": "4-76_v1_34@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_34",
            "tgt_ix": "4-76_v1_34@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_35",
            "tgt_ix": "4-76_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_36",
            "tgt_ix": "4-76_v1_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_36",
            "tgt_ix": "4-76_v1_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_36",
            "tgt_ix": "4-76_v1_36@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_36",
            "tgt_ix": "4-76_v1_36@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_36",
            "tgt_ix": "4-76_v1_36@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_36",
            "tgt_ix": "4-76_v1_36@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_37",
            "tgt_ix": "4-76_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_37",
            "tgt_ix": "4-76_v1_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_37",
            "tgt_ix": "4-76_v1_37@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_37",
            "tgt_ix": "4-76_v1_37@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_37",
            "tgt_ix": "4-76_v1_37@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_37",
            "tgt_ix": "4-76_v1_37@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_37",
            "tgt_ix": "4-76_v1_37@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_37",
            "tgt_ix": "4-76_v1_37@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_38",
            "tgt_ix": "4-76_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_39",
            "tgt_ix": "4-76_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_40",
            "tgt_ix": "4-76_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_41",
            "tgt_ix": "4-76_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_42",
            "tgt_ix": "4-76_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_43",
            "tgt_ix": "4-76_v1_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_44",
            "tgt_ix": "4-76_v1_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_45",
            "tgt_ix": "4-76_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_46",
            "tgt_ix": "4-76_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_47",
            "tgt_ix": "4-76_v1_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_48",
            "tgt_ix": "4-76_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "4-76_v1_49",
            "tgt_ix": "4-76_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "4-76_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.6227.1",
        "atype": "opinion-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Challenges and opportunities for early-career Teaching-Focussed academics in the biosciences",
        "abstract": "Twenty-seven percent of academics in UK Higher Education (HE) are in Teaching-Focussed positions, making major contributions to undergraduate programmes in an era of high student expectations when it comes to teaching quality. However, institutional support for Teaching-Focussed academics is often limited, both in terms of peer networking and opportunities for career development. As four early-career stage Teaching-Focussed academics working in a variety of institutions, we explore what motivated our choices to make teaching our primary academic activity, and the challenges that we have faced in doing so. In addition to highlighting the need for universities to fully recognise the achievements of teaching staff, we discuss the role that the various biosciences learned societies have in supporting Teaching-Focussed academics. We identify that there is a need for the learned societies to come together and pool their expertise in this area. The fragmented nature of the Teaching-Focussed academic community means that clear sources of national support are needed in order to best enable the next generation of bioscience educators to reach their full potential.",
        "contributors": [
            {
                "surname": "Hubbard",
                "given-names": "Katharine"
            },
            {
                "surname": "Gretton",
                "given-names": "Sarah"
            },
            {
                "surname": "Jones",
                "given-names": "Katherine"
            },
            {
                "surname": "Tallents",
                "given-names": "Lucy"
            }
        ],
        "url": "https://f1000research.com/articles/4-76/v1/",
        "doc_id": "4-76",
        "version": 1,
        "ix_counter": 262,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}