{
    "nodes": [
        {
            "ix": "8-1681_v1_0",
            "content": "Comparison of human population receptive field estimates between scanners and the effect of temporal filtering",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_2",
            "content": "Background: Population receptive field (pRF) analysis with functional magnetic resonance imaging (fMRI) is an increasingly popular method for mapping visual field representations and estimating the spatial selectivity of voxels in human visual cortex. However, the multitude of experimental setups and processing methods used makes comparisons of results between studies difficult.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_3",
            "content": "Methods: Here, we compared pRF maps acquired in the same three individuals using comparable scanning parameters on a 1.5 and a 3 Tesla scanner located in two different countries. We also tested the effect of low-pass filtering of the time series on pRF estimates.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_4",
            "content": "Results: As expected, the signal-to-noise ratio for the 3 Tesla data was superior; critically, however, estimates of pRF size and cortical magnification did not reveal any systematic differences between the sites. Unsurprisingly, low-pass filtering enhanced goodness-of-fit, presumably by removing high-frequency noise. However, there was no substantial increase in the number of voxels containing meaningful retinotopic signals after low-pass filtering. Importantly, filtering also increased estimates of pRF size in the early visual areas which could substantially skew interpretations of spatial tuning properties.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_5",
            "content": "Conclusion: Our results therefore suggest that pRF estimates are generally comparable between scanners of different field strengths, but temporal filtering should be used with caution.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_6",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_7",
            "content": "Population receptive field analysis with functional magnetic resonance imaging (fMRI) has become a popular method in the toolbox of visual neuroscience. It has not only been used for mapping cortical organization <REF-1> – <REF-3> , but also to study spatial integration in the visual cortex <REF-4> , <REF-5> , reveal the effects of attention on visual processing <REF-6> – <REF-10> , show differences in patients and special populations <REF-11> – <REF-15> and for reconstructing the neural signature of perceptual processes <REF-16> – <REF-20> . The most wide-spread technique involves fitting a two-dimensional symmetric Gaussian model of the pRF to the time series of each voxel in visual cortex responding to a set of stimuli <REF-1> . Estimates of pRF position and size reflect an aggregate of the position preferences and sizes of thousands of neuronal receptive fields of the cells within the imaging voxel, and also incorporates extra-classical receptive field interactions. Further, in fMRI, as underlying neuronal activity is inferred through neurovascular coupling, pRF measurements are affected by hemodynamic factors (although it has been shown that pRFs estimated from fMRI data have a close correspondence with receptive field properties in electrophysiological experiments <REF-1> , <REF-21> , <REF-22> but see also <REF-23> ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_8",
            "content": "The indirect nature of estimating pRFs from fMRI data suggests therefore that there could be considerable variability in derived measurements. Direct test-retest evaluations with the same experimental setup have shown that pRF mapping experiments are robust and repeatable <REF-24> – <REF-26> . However, for different experimental setups, for instance, in terms of the magnetic field strength and the particular pulse sequence used to acquire fMRI data the comparability has not been assessed. The signal-to-noise ratio of MRI is proportional to voxel volume and the strength of the static magnetic field <REF-27> , and hence pRF measurements at higher magnetic field strength might be more accurate. However, the temporal resolution (or repetition time, TR, of image acquisition), directly affects the contribution of different noise frequencies and the contribution of physiological nuisance factors like respiration or cardiac pulsation. Noise in fMRI data therefore has multiple contributions (physiological, thermal and system related) and the relationship between the temporal signal to noise ratio (TSNR) in a fMRI time course has a non-linear relationship with static SNR <REF-28> , i.e. gains in static SNR, from for example increased field strength, may not translate to proportional gains in TSNR due to a limit where physiological noise dominates.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_9",
            "content": "Here, we conducted pRF mapping on three individuals using identical TR and voxel size on a 1.5 Tesla (1.5T) scanner in London, United Kingdom and a 3 Tesla (3T) scanner in Auckland, New Zealand. Critically, our aim was not to test the effect of magnetic field strength alone, but rather to compare pRF estimates from typical methods used at each scanning facility that also includes a different field strength. Thus, our findings should reflect a relatively conservative estimate of the variability of pRF parameters under comparable conditions at the two sites.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_10",
            "content": "Typical pRF studies evaluate the goodness-of-fit of the pRF model by means of the coefficient of determination (R 2 ) of the correlation between the observed and predicted time series. This measure, however, strongly depends on the temporal resolution of the signal acquisition. In our recent experiments we have used an accelerated multiband sequence with 1 s TR <REF-25> , <REF-29> – <REF-32> . At this temporal resolution, there is a considerable contribution of high-frequency noise to the signal ( Figure 1 ). Since our analysis does not typically involve any temporal filtering beyond linear detrending (essentially, a wide-bandwidth high-pass filter removing only very low frequencies that are attributed to slow drifts in the signal), this probably explains why the overall R 2 in our studies is comparably low compared to those reported by others who use more standard fMRI TRs of 2–3 s. We therefore conducted an analysis comparing pRF parameters obtained using our standard analysis (minimal filtering), to filtering with two low-pass filters that approximate longer TR acquisition.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_11",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Low-pass filtering the time series improves goodness-of-fit quantified by R 2 . The same predicted time series (red curves) is shown overlaid on the unfiltered time series ( A ), and low-pass filtered time series with kernel 1 s ( B ) or 2 s ( C ). R 2 is substantially larger for the filtered time series because high-frequency noise has been removed.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_12",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Low-pass filtering the time series improves goodness-of-fit quantified by R <sup>2</sup>.</title> <p>The same predicted time series (red curves) is shown overlaid on the unfiltered time series ( <bold>A</bold>), and low-pass filtered time series with kernel 1 s ( <bold>B</bold>) or 2 s ( <bold>C</bold>). R <sup>2</sup> is substantially larger for the filtered time series because high-frequency noise has been removed.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Low-pass filtering the time series improves goodness-of-fit quantified by R 2 . The same predicted time series (red curves) is shown overlaid on the unfiltered time series ( A ), and low-pass filtered time series with kernel 1 s ( B ) or 2 s ( C ). R 2 is substantially larger for the filtered time series because high-frequency noise has been removed.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_13",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_14",
            "content": "Participants",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "sec-type": "subjects",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_15",
            "content": "We recruited three healthy adult volunteers (2 female, 1 left-handed, aged 30, 39 and 47) from our pool of repeat participants in functional brain imaging studies in London, United Kingdom. An important criterion for their participation was that they would also visit Auckland, New Zealand, within a few months after the first scan in London. Generally, we could only include participants with normal or corrected-to-normal visual acuity (contact lenses only), and no history of eye disease or neurological, neurodevelopmental or neuropsychiatric disorders. Moreover, they could have no other contraindications to magnetic resonance imaging (e.g. claustrophobia, metal implants). All participants gave written informed consent to take part and henceforth referred to as P1, P2, and P3. All procedures were approved by local ethics review boards at University College London (fMRI/2012/007) and the University of Auckland (017477).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_16",
            "content": "Procedure",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_17",
            "content": "Participants were scanned twice with a pRF mapping protocol. The first scan took place inside a MAGNETOM Avanto 1.5T MRI scanner (Siemens Healthcare, Erlangen, Germany) at the Birkbeck/UCL Centre for NeuroImaging (BUCNI) in the Experimental Psychology department of University College London, United Kingdom (henceforth referred to as London site). The second scan took place several months later in a MAGNETOM Skyra 3T MRI scanner (Siemens Healthcare, Erlangen, Germany) at the Centre for Advanced Magnetic Resonance Imaging (CAMRI) in the Faculty of Medical & Health Sciences of the University of Auckland, New Zealand (henceforth referred to as Auckland site). In both scans, participants were scanned with six runs for pRF mapping lasting 4 min 20 s each during which functional echo-planar images were acquired. Moreover, at both centres a structural T1 weighted brain image was acquired although the structural image from the second scan (at 3T) was not used in any further analysis. During the scans, participants were instructed to remain as still as possible and fixate continuously on a small dot in the centre of the screen. They were instructed to press a button whenever the fixation dot changed colour.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_18",
            "content": "Stimuli",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_19",
            "content": "Stimuli were generated and presented using MATLAB (Mathworks; Version R2017a, 9.2.0.538062) and Psychtoolbox (Version 3.0.14) <REF-33> at a resolution of 1920 * 1080. At both sites, the screen subtended 34° by 19° of visual angle. Stimuli were presented on a screen at the back of the bore via a mirror mounted on the head coil. At the London site, stimuli were projected onto a screen in the back of the bore while in the Auckland site stimuli were presented on an MRI compatible 32’’ widescreen LCD (Cambridge Research Systems Ltd).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_20",
            "content": "At both sites, the stimuli generated were matched, and comprised bars containing a dynamic high-contrast ripple pattern as used in previous studies <REF-6> , <REF-13> , <REF-15> , <REF-22> on a uniform grey background. Bars traversed the visual field in a regular sequence (e.g. from the bottom to the top), jumping by 0.38° every second. Each sweep of the bar lasted 25 s and so there were 25 jumps of the bar. Each run started with a sweep from the bottom to the top and then the sweep direction was rotated by 45° clockwise on the next sweep. There were thus eight sweeps covering a complete rotation. After the fourth and eighth sweep, a 25 s baseline period (no bars) was presented.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_21",
            "content": "Bars were always 0.53° wide and at the longest (when crossing the centre of the visual field) subtended the full screen height, but because they were presented only within a circular region (diameter: 19°, i.e. the height of the screen) they were accordingly shorter at the start and end of each sweep. The outer edge of the ripple stimulus was smoothed by ramping it down to zero over 0.1°. Similarly, the stimulus contrast ramped down to zero from 0.53° to 0.43° eccentricity, thus creating a blank hole around fixation.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_22",
            "content": "A blue dot (diameter: 0.09°) was present in the centre of the screen throughout each scanning run. The whole run was divided into 200 ms epochs. At each epoch, there was a 0.01 probability that the dot could change colour to purple with the constraint that no such colour changes could occur in a row. Participants were instructed to fixate the dot and press a button on a magnetic resonance-compatible button box whenever it changed colour. In addition, a radar screen pattern comprising low-contrast radial and concentric lines around fixation was presented at all times to aid fixation compliance (see <REF-25> ). The fixation dot and radar screen pattern were also presented during the baseline period.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_23",
            "content": "Prior to each run, we collected 10 dummy volumes to allow ample time for steady-state magnetisation to be reached. During this time, only the fixation dot was presented on a blank grey screen.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_24",
            "content": "Scanning parameters",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_25",
            "content": "At both sites, we used a 32-channel head coil where we removed the front elements because it impeded the view of the stimulus. This resulted in 20 effective channels covering the back and the sides of the head. Six pRF mapping runs of 260 T2*-weighted image volumes were acquired (including the 10 dummy volumes). We used 36 transverse slices angled to be approximately parallel to the calcarine sulcus (planned using the T1-weighted anatomical image). At both sites, we used an accelerated multiband sequence <REF-34> , <REF-35> at 2.3 mm isotropic voxel resolution, field of view 96x96, and a TR of 1 s. At the London site, the scan had an echo time (TE) of 55 ms, flip angle of 75°, and a multiband/ slice acceleration factor of 4 and rBW 1628 Hz/pixel. At the Auckland site, the scan had a TE of 30 ms, flip angle of 62 o , a multiband/slice acceleration factor of 3, an in-plane/parallel imaging acceleration factor of 2 and rBW was 1680 Hz/Px. After acquiring the functional data at the London site, the front portion of the coil was put back on to ensure maximal signal-to-noise levels for collecting a structural scan (a T1-weighted anatomical magnetization-prepared rapid acquisition with gradient echo scan with a 1 mm isotropic voxel size and full brain coverage).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_26",
            "content": "Data preprocessing",
            "ntype": "title",
            "meta": {
                "section": "2.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_27",
            "content": "Functional data were preprocessed in SPM12 (Wellcome Centre for Human NeuroImaging; Version 6906). The first 10 dummy volumes were removed. Then we performed mean bias intensity correction, realignment and unwarping of motion-induced distortions, and coregistration to the structural scan acquired at the London site using default parameters in SPM12. Using FreeSurfer (Version 6.0.0) we further used the structural scan for automatic segmentation and reconstruction as a three-dimensional surface mesh of the pial and grey-white matter boundaries <REF-36> , <REF-37> . The grey-white matter surface was then further inflated into a smooth model and a spherical model.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_28",
            "content": "All further analysis was conducted using our custom SamSrf 6 toolbox <REF-38> . Functional data were projected from volume space to the surface mesh by finding the nearest voxel located halfway between each vertex in the pial and grey-white matter surface mesh. The time series at each vertex was then linearly detrended and z-standardized before being averaged across the six runs at each scanning site.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_29",
            "content": "For the temporal filtering analysis, we then further convolved the time series of each vertex with a Gaussian filter with standard deviation of 1 or 2 s, respectively.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_30",
            "content": "pRF modelling",
            "ntype": "title",
            "meta": {
                "section": "2.6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_31",
            "content": "We modelled pRFs as a symmetric, two-dimensional Gaussian defined by x 0 and y 0 , the Cartesian coordinates of the pRF centre in visual space, and the standard deviation of the Gaussian, σ, as a measure of the pRF size. The pRF model predicted the neural response at each TR of the scan by calculating the overlap of the mapping stimulus with this Gaussian pRF profile. A binary mask of 100-by-100 pixels indicated where the stimulus appeared on the screen for each time point. The neural responses were then determined by multiplying each frame of the stimulus mask with the pRF profile and summing over the 10,000 pixels. Subsequently, the time series was convolved with a canonical hemodynamic response function determined from previous empirical data <REF-6> and z-standardized.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_32",
            "content": "The pRF parameters at each vertex were fit using a two-stage procedure. First, we applied a coarse fit which involved an extensive grid search by correlating the actually observed time series against a set of 7650 predicted time series derived from a combination of x 0 , y 0 , and σ covering the plausible range for each parameter (see <REF-25> , <REF-29> ). The parameters giving rise to the maximal correlation were then retained for the second stage, the fine fit, provided the squared correlation, R 2 , exceeded 0.01. The fine fit entailed an optimization procedure <REF-39> , <REF-40> to refine the three pRF parameters to further maximize the correlation between observed and predicted time series. Subsequently, we used linear regression between the observed and predicted time series to fit the amplitude, β 1 , and the baseline intercept, β 0 . Up until this point, all analyses used raw data without any smoothing or interpolation. However, we then applied a Gaussian smoothing kernel (full width at half maximum = 3 mm) to the final pRF parameter maps on the spherical surface mesh. These smooth maps were used for visualization purposes and delineation of the visual areas. Moreover, they are necessary for calculating the local cortical magnification factor (CMF; Harvey and Dumoulin <REF-41> ) because it requires a smooth visual field map without gaps and scatter. For this we determined the cortical neighbours of each vertex and calculated the area subtended by the polygon formed by their pRF centres. The same procedure was used to determine the cortical surface area (calculation performed by FreeSurfer). To calculate the CMF, we then divided the square root of cortical area by the square root of visual area.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_33",
            "content": "In addition, for the data comparing the London and Auckland sites we also calculated the noise ceiling as an estimate of the maximum goodness-of-fit that could theoretically be achieved from the data of each voxel. For this, we split the six pRF mapping runs from each site into even and odd numbered runs and averaged them separately. We then calculated the Pearson correlation between these split time series, r obs ’, and used the Spearman-Brown prophecy formula <REF-42> , <REF-43> to determine, r obs , the expected reliability for the average of all six runs:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_34",
            "content": "r o b s = 2 r o b s ′ 1   +   r o b s ′",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_35",
            "content": "The theoretical maximum observable correlation between the predicted and observed time series, ρ o , for each voxel is given by the square root of this correlation <REF-44> because",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_36",
            "content": "ρ o = ρ h r p r e d r o b s",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_37",
            "content": "where r pred is the reliability of the predictors, which is 1, and we assume the hypothetical correlation between the observed and predicted time series, ρ h , also to be 1. The noise ceiling, the maximum observable goodness-of-fit ρ o 2 is therefore equal to r obs .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_38",
            "content": "Further analysis",
            "ntype": "title",
            "meta": {
                "section": "2.7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_39",
            "content": "We manually delineated visual areas V1-V4 and V3A using smoothed maps from the London site by determining the borders between regions from the polar angle reversals <REF-45> and then also applied these delineations to the maps generated in Auckland. For each region of interest (ROIs) we then extracted pRF data and binned them into eccentricity bands 1° in width, starting from 0.5° and increasing up to 9.5°. For each bin, we then calculated the mean pRF size, and the median CMF, R 2 , noise ceiling ρ o 2 , or the normalized goodness-of-fit, that is R 2 divided by ρ o 2 . To bootstrap the dispersion of these summary statistics, we resampled the data in each bin 1000 times with replacement and determined the central 95% of this bootstrap distribution as a confidence interval. To avoid the inclusion of artifactual data, for pRF size and CMF we only included data from voxels where R 2 exceeded 0.15.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_40",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_41",
            "content": "Comparison between scanning sites",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_42",
            "content": "We first compared visual field maps from the two sites, London 1.5T and Auckland 3T, by visual inspection. Figure 2 shows polar angle and eccentricity maps of the left hemisphere of one participant from both sites. It is immediately apparent that more voxels survive statistical thresholding (R 2 >0.1) for the 3T data. The cortical territory occupied by visual field maps is somewhat more extensive and more complete. Nevertheless, the orderly organization of V1-V4, V3A, as well as regions in the LO complex is clearly visible in both scans, and their borders are very similar. We further quantified the map similarity by calculating correlations across all voxels above threshold in both scans (circular correlation for polar angle, Spearman’s ρ correlation for eccentricity). This showed that the polar angle maps were well correlated for two participants (P1: 0.71; P2: 0.71) although the correlation was not as strong in the final participant (P3: 0.44). Eccentricity maps were strongly correlated in all three participants (P1: 0.70; P2: 0.75; P3: 0.67).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_43",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Polar angle ( A ) and eccentricity ( B ) maps of one participant from the London 1.5T site (left) and the Auckland 3T site (right) displayed on a spherical model of the left hemisphere. Colour wheels denote the pseudo-colour code for visual field maps. No smoothing or interpolation was applied to the mapping data. Voxels were thresholded at R 2 >0.1. In A, the position of the visual regions have been labelled for reference. The greyscale indicates the cortical folding pattern.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_44",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <p>Polar angle ( <bold>A</bold>) and eccentricity ( <bold>B</bold>) maps of one participant from the London 1.5T site (left) and the Auckland 3T site (right) displayed on a spherical model of the left hemisphere. Colour wheels denote the pseudo-colour code for visual field maps. No smoothing or interpolation was applied to the mapping data. Voxels were thresholded at R <sup>2</sup>&gt;0.1. In A, the position of the visual regions have been labelled for reference. The greyscale indicates the cortical folding pattern.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Polar angle ( A ) and eccentricity ( B ) maps of one participant from the London 1.5T site (left) and the Auckland 3T site (right) displayed on a spherical model of the left hemisphere. Colour wheels denote the pseudo-colour code for visual field maps. No smoothing or interpolation was applied to the mapping data. Voxels were thresholded at R 2 >0.1. In A, the position of the visual regions have been labelled for reference. The greyscale indicates the cortical folding pattern.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_45",
            "content": "Next, we compared pRF size using 1° wide eccentricity bands to bin the data from each site and then calculating the mean for each bin. We observed that pRF size consistently increased across eccentricities and also along the visual pathway as expected. But crucially, while pRF size varied somewhat between sites, this difference was not systematic across the three participants or the five regions of interest ( Figure 3A ). In V4 and V3A there was somewhat greater variance at some eccentricities, likely due to the smaller size of these regions compared to V1-V3. Overall, pRF sizes were, however, very similar between sites. Similarly, the median cortical magnification factor (CMF) showed the expected exponential decrease from the central to the peripheral visual field. CMF curves were very comparable for the two sites ( Figure 3B ), except for somewhat greater CMF at 3T in V1 and V2 in the very central visual field of participants P2 and P3.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_46",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "Mean population receptive field (pRF) size ( A ) and median cortical magnification factor CMF ( B ) binned into eccentricity bands for the London 1.5T site (red) and the Auckland 3T site (black). Panels in columns show different visual regions. Panels in rows show the three participants. Error bars denote 95% confidence intervals based on bootstrapping.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_47",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <p>Mean population receptive field (pRF) size ( <bold>A</bold>) and median cortical magnification factor CMF ( <bold>B</bold>) binned into eccentricity bands for the London 1.5T site (red) and the Auckland 3T site (black). Panels in columns show different visual regions. Panels in rows show the three participants. Error bars denote 95% confidence intervals based on bootstrapping.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "Mean population receptive field (pRF) size ( A ) and median cortical magnification factor CMF ( B ) binned into eccentricity bands for the London 1.5T site (red) and the Auckland 3T site (black). Panels in columns show different visual regions. Panels in rows show the three participants. Error bars denote 95% confidence intervals based on bootstrapping.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_48",
            "content": "We then repeated this analysis for the goodness-of-fit of the pRF model across eccentricities ( Figure 4A ). This showed that in V1 and V2 goodness-of-fit was notably greater for the Auckland 3T site than the London 1.5T site in all 3 participants. In higher extrastriate regions, the pattern of results was less clear, although at least for P3 goodness-of-fit was greater also in V3 and V4 (although note that in V4 for P1 very little data with very low model fits was present beyond 6° eccentricity in the Auckland data). In V3A, the model fits at both were similar, but generally lower than in the other regions and with greater variability. However, this was presumably largely driven by the overall signal-to-noise ratio. When we normalized model fits relative to the noise ceiling, ρ o 2 , the maximum goodness-of-fit that could theoretically be achieved given the data from each site, we found no systematic difference in goodness-of-fit between sites ( Figure 3B ). The curves mostly overlapped for P1 and P2 except in V1 where the London data outperformed the Auckland data. In contrast, for P3 normalized model fits for the Auckland site outperformed the London site in all regions except V3A. The noise ceiling itself was consistently higher for the Auckland data than the London data ( Figure 4C ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_49",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Median goodness-of-fit ( A ), normalized goodness-of-fit ( B ), and noise ceiling ( C ) binned into eccentricity bands for the London 1.5T site (red) and the Auckland 3T site (black). Panels in columns show different visual regions. Panels in rows show the three participants. Error bars denote 95% confidence intervals based on bootstrapping.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_50",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <p>Median goodness-of-fit ( <bold>A</bold>), normalized goodness-of-fit ( <bold>B</bold>), and noise ceiling ( <bold>C</bold>) binned into eccentricity bands for the London 1.5T site (red) and the Auckland 3T site (black). Panels in columns show different visual regions. Panels in rows show the three participants. Error bars denote 95% confidence intervals based on bootstrapping.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Median goodness-of-fit ( A ), normalized goodness-of-fit ( B ), and noise ceiling ( C ) binned into eccentricity bands for the London 1.5T site (red) and the Auckland 3T site (black). Panels in columns show different visual regions. Panels in rows show the three participants. Error bars denote 95% confidence intervals based on bootstrapping.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_51",
            "content": "Effect of temporal filtering",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_52",
            "content": "Goodness-of-fit of the modelled time course derived from pRF estimates and the measured fMRI time course are typically quantified by R 2 . However, the pRF model does not account for the high frequency noise observed in fast temporal resolution acquisitions like the 1 s TR we used here, which therefore likely results in lower R 2 values. Theoretically, high frequency signals could be removed from the data and thus the model fits artifactually improved ( Figure 1 ). We therefore reanalysed the data from the 3T site after temporal low-pass filtering the time series of each voxel by convolving it with a Gaussian kernel of either 1 s or 2 s standard deviation (e.g. Figures 1B and 1C , respectively).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_53",
            "content": "Figure 5 shows visual field maps from the left hemisphere of one participant using the raw data and those after low-pass filtering. A very similar map structure is apparent in all three images. There are, however, also a lot of noise voxels surviving thresholding (R 2 >0.1) outside the general visual field maps. Conversely, while filtering filled in a few missing voxels within the maps, filtering did not affect the overall structure and did not increase the cortical territory of the responsive region.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_54",
            "content": "Figure 5.",
            "ntype": "label",
            "meta": {
                "id": "f5",
                "caption": "Polar angle maps of one participant from the Auckland 3T site displayed on a spherical model of the left hemisphere. Colour wheels denote the pseudo-colour code for visual field maps. No smoothing or interpolation was applied to the mapping data. Voxels were thresholded at R 2 >0.1. The position of the visual regions have been labelled for reference. The greyscale indicates the cortical folding pattern. A. Unfiltered data. B. Low-pass filtered with kernel 1 s. C. Low-pass filtered with kernel 2 s.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_55",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f5\" position=\"float\"> <caption> <title>Polar angle maps of one participant from the Auckland 3T site displayed on a spherical model of the left hemisphere.</title> <p>Colour wheels denote the pseudo-colour code for visual field maps. No smoothing or interpolation was applied to the mapping data. Voxels were thresholded at R <sup>2</sup>&gt;0.1. The position of the visual regions have been labelled for reference. The greyscale indicates the cortical folding pattern. A. Unfiltered data. B. Low-pass filtered with kernel 1 s. C. Low-pass filtered with kernel 2 s.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure5.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f5",
                "caption": "Polar angle maps of one participant from the Auckland 3T site displayed on a spherical model of the left hemisphere. Colour wheels denote the pseudo-colour code for visual field maps. No smoothing or interpolation was applied to the mapping data. Voxels were thresholded at R 2 >0.1. The position of the visual regions have been labelled for reference. The greyscale indicates the cortical folding pattern. A. Unfiltered data. B. Low-pass filtered with kernel 1 s. C. Low-pass filtered with kernel 2 s.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_56",
            "content": "Next, we quantified mean pRF size and compared this for the three data sets ( Figure 6A ). In the early areas V1-V3, pRF size is consistently greater for the filtered time series, especially at the longer kernel of 2 s. In V4 and V3A, pRF size remained relatively similar between conditions. We also quantified the median goodness-of-fit of the pRF model ( Figure 6B ) and observed consistently greater model fits for both the low-pass filtered time series in V1 to V4. A similar pattern could be seen in V3A but results were generally more variable, especially in P1.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_57",
            "content": "Figure 6.",
            "ntype": "label",
            "meta": {
                "id": "f6",
                "caption": "Mean population receptive field (pRF) size ( A ) and median goodness-of-fit ( B ) binned into eccentricity bands for the Auckland data without filtering (black), and low-pass filtering with kernel 1 s (blue) and 2 s (green). Panels in columns show different visual regions. Panels in rows show the three participants. Error bars denote 95% confidence intervals based on bootstrapping.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure6.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_58",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f6\" position=\"float\"> <caption> <p>Mean population receptive field (pRF) size ( <bold>A</bold>) and median goodness-of-fit ( <bold>B</bold>) binned into eccentricity bands for the Auckland data without filtering (black), and low-pass filtering with kernel 1 s (blue) and 2 s (green). Panels in columns show different visual regions. Panels in rows show the three participants. Error bars denote 95% confidence intervals based on bootstrapping.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure6.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f6",
                "caption": "Mean population receptive field (pRF) size ( A ) and median goodness-of-fit ( B ) binned into eccentricity bands for the Auckland data without filtering (black), and low-pass filtering with kernel 1 s (blue) and 2 s (green). Panels in columns show different visual regions. Panels in rows show the three participants. Error bars denote 95% confidence intervals based on bootstrapping.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/22528/606283e5-490e-49a8-9dd8-087e8d574cb4_figure6.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_59",
            "content": "Raw results are available from Open Science Framework as Underlying data <REF-46> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_60",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "3.3",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_61",
            "content": "Here, we compared pRF mapping data acquired using the same stimuli and participants and under comparable conditions at two sites, a 1.5T scanner in London, United Kingdom, and a 3T scanner (by the same vendor) in Auckland, New Zealand. Generally, pRF model fits were better in the Auckland data, probably in large part because of the approximately double signal-to-noise ratio from the greater static magnetic field. However, despite this difference in accuracy of data fitting, we found that visual field maps and actual estimates of pRF size and local cortical magnification were very similar between the two sites.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_62",
            "content": "Although the London data were always acquired first, this is unlikely to explain our findings. All our participants were familiar with the fMRI environment, including undertaking previous pRF mapping studies. Therefore, it is unlikely that there should have been substantial training effects that could for example have changed the amount of head motion or fixation compliance between sessions. The exact parameters of the pulse sequences used and general differences in the image quality of the two scanners could of course also be contributing factors to inter-site differences. We did not apply any correction of distortions caused by the static magnetic field <REF-47> to either site data. Moreover, the exact slice positioning, and thus how the voxel grid resolved the grey matter, may also have differed between sites. Relevant to this, in our previous work quantifying the test-retest reliability of pRF maps we found that reliability was greater for scanning sessions in close succession on the same day than for sessions on different days <REF-25> . This could have been caused by fluctuations in the scanner hardware itself but also relate to differences in head position at set up. While in both cases participants were removed from the scanner between the repeat sessions, it is highly likely that positioning was more similar for the sessions conducted on the same day.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_63",
            "content": "While we took painstaking steps to match the visual displays at the two sites as closely as possible, due to constraints of the experimental setup there may have been small differences between the stimuli presented. In London, images were projected onto a screen and this necessitated focussing and scaling the projected image to be of the exact size. The image in London may have been somewhat blurrier and the viewing angle more variable than in Auckland where we used a clear liquid crystal display that was always placed at the exact same position at the back of the bore. Naturally, the exact viewing angle of the stimuli also depends on the viewing distance and there may have been subtle variation between the sites although this is unlikely to have produced any systematic differences.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_64",
            "content": "Nevertheless, the general extent of the visually responsive area of cortex containing clear retinotopic maps was very comparable across the sites, as were estimates of spatial tuning and cortical magnification. Therefore, we conclude that pRF estimates are very robust across scanning sites, even when using different magnetic field strengths.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_65",
            "content": "At the short TR of 1 s as used in our study, noise contributes high-frequency signals to the fMRI response that are irrelevant to the sluggish blood oxygen level dependent activity the pRF model seeks to characterize. This explains why the model fits in most of our studies are relatively low compared to those reported in the literature using more conventional TRs. We therefore also sought to test what effect temporal low-pass filtering had on pRF parameter estimates. Unsurprisingly, low-pass filtering enhanced the goodness-of-fit of pRF models. However, while this filled in a few gaps in the maps it largely boosted the number of noise voxels outside the visually responsive cortex.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_66",
            "content": "Crucially, low-pass filtering also generally enlarged estimates of pRF size in the early visual regions V1-V3 while data in higher regions were mostly unaffected. The pRF size estimates for the unfiltered data accord well with previous research and what one would expect from electrophysiological recordings <REF-1> , <REF-21> , <REF-22> , <REF-41> . Therefore, the pRF sizes of the filtered data presumably reflect an overestimate that seems unrealistically high (e.g. for P2 mean pRF size in central V1 was close to 2° for the most heavily filtered data).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_67",
            "content": "The reason why filtering increased pRF sizes in early areas is probably the fact that filtering blurred together signals from stimuli presented close in time (proximal bar positions were presented only a few seconds apart). In the early regions where pRFs are small this would therefore be modelled as a larger pRF, whereas in higher areas in which pRFs are large enough to encompass adjacent bar positions this should not affect estimates of pRF size. A slower stimulus design where each bar position is stimulated for 2-3 s, or a random instead of an ordered stimulus sequence, could probably counteract this problem but this would come at the expense of longer scanning durations. In any case, for our standard design using 1 s TR low-pass filtering clearly has no practical advantages because it does not appear to fundamentally improve map quality and skews pRF size estimates in the early visual areas.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_68",
            "content": "Since we only tested three participants in this study, our analyses were not designed to detect subtle differences between the scanner environments or small effects of temporal filtering. Retinotopic maps and pRF data are highly replicable <REF-25> and can also be used for case studies on individuals. We were therefore most interested in how consistent results are across all three participants. Our descriptive analysis of the data included bootstrapped confidence intervals, which permit an inference about the statistical evidence in each participant, and thus each individual participant essentially constitutes a replication.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_69",
            "content": "In summary, our results show that pRF mapping with fast 1 s TR produces similar and reliable results on different scanners, even using different magnetic field strengths. It would be interesting to conduct a similar comparison between 3T and 7T scans as these are becoming increasingly commonplace.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_70",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "3.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_71",
            "content": "Open Science Framework: pRF data comparison between London 1.5T & Auckland 3T. https://doi.org/10.17605/OSF.IO/WX4HP <REF-46> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_72",
            "content": "This project contains Lon-Akl.zip, which itself contains underlying data for each participant in folders 30fl, 39mr and 47fr. These files each contain the following underlying data:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_73",
            "content": "- anatomy (the model of the subject's brain anatomy).\n- prf_bucni (functional MRI data (pRF maps) from London).\n- prf_camri (functional MRI data (pRF maps) from Auckland).\n- ROIs (delineation (FreeSurfer label files) for the visual areas).",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_74",
            "content": "Data are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_75",
            "content": "<REF-1> Dumoulin SO Wandell BA : Population receptive field estimates in human visual cortex. NeuroImage. 2008 ; 39 ( 2 ): 647 – 660 . 17977024 10.1016/j.neuroimage.2007.09.034 3073038",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_76",
            "content": "<REF-3> Winawer J Horiguchi H Sayres RA : Mapping hV4 and ventral occipital cortex: the venous eclipse. J Vis. 2010 ; 10 ( 5 ): 1 . 20616143 10.1167/10.5.1 3033222",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_77",
            "content": "<REF-4> Dumoulin SO Hess RF May KA : Contour extracting networks in early extrastriate cortex. J Vis. 2014 ; 14 ( 5 ): 18 . 24879865 10.1167/14.5.18",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_78",
            "content": "<REF-5> Harvey BM Dumoulin SO : Visual motion transforms visual space representations similarly throughout the human visual hierarchy. NeuroImage. 2016 ; 127 : 173 – 185 . 26666897 10.1016/j.neuroimage.2015.11.070",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_79",
            "content": "<REF-6> de Haas B Schwarzkopf DS Anderson EJ : Perceptual load affects spatial tuning of neuronal populations in human early visual cortex. Curr Biol. 2014 ; 24 ( 2 ): R66 – 67 . 24456976 10.1016/j.cub.2013.11.061 3928995",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_80",
            "content": "<REF-10> Vo VA Sprague TC Serences JT : Spatial Tuning Shifts Increase the Discriminability and Fidelity of Population Codes in Visual Cortex. J Neurosci. 2017 ; 37 ( 12 ): 3386 – 3401 . 28242794 10.1523/JNEUROSCI.3484-16.2017 5373124",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_81",
            "content": "<REF-11> Levin N Dumoulin SO Winawer J : Cortical maps and white matter tracts following long period of visual deprivation and retinal image restoration. Neuron. 2010 ; 65 ( 1 ): 21 – 31 . 20152110 10.1016/j.neuron.2009.12.006 2948651",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_82",
            "content": "<REF-13> Schwarzkopf DS Anderson EJ de Haas B : Larger extrastriate population receptive fields in autism spectrum disorders. J Neurosci. 2014 ; 34 ( 7 ): 2713 – 2724 . 24523560 10.1523/JNEUROSCI.4416-13.2014 3921434",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_83",
            "content": "<REF-15> Anderson EJ Tibber MS Schwarzkopf DS : Visual Population Receptive Fields in People with Schizophrenia Have Reduced Inhibitory Surrounds. J Neurosci. 2017 ; 37 ( 6 ): 1546 – 1556 . 28025253 10.1523/JNEUROSCI.3620-15.2016 5299570",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_84",
            "content": "<REF-16> Kok P de Lange FP : Shape perception simultaneously up- and downregulates neural activity in the primary visual cortex. Curr Biol. 2014 ; 24 ( 13 ): 1531 – 1535 . 24980501 10.1016/j.cub.2014.05.042",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_85",
            "content": "<REF-20> Senden M Emmerling TC van Hoof R : Reconstructing imagined letters from early visual cortex reveals tight topographic correspondence between visual mental imagery and perception. Brain Struct Funct. 2019 ; 224 ( 3 ): 1167 – 1183 . 30637491 10.1007/s00429-019-01828-6 6499877",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_86",
            "content": "<REF-21> Winawer J Rauschecker AM Parvizi J : Population receptive fields in human visual cortex measured with subdural electrodes. J Vis. 2011 ; 11 : 1196 . 10.1167/11.11.1196",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_87",
            "content": "<REF-22> Alvarez I de Haas BA Clark CA : Comparing different stimulus configurations for population receptive field mapping in human fMRI. Front Hum Neurosci. 2015 ; 9 : 96 . 25750620 10.3389/fnhum.2015.00096 4335485",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_88",
            "content": "<REF-23> Keliris GA Li Q Papanikolaou A : Estimating average single-neuron visual receptive field sizes by fMRI. Proc Natl Acad Sci U S A. 2019 ; 116 ( 13 ): 6425 – 6434 . 30867291 10.1073/pnas.1809612116 6442598",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_89",
            "content": "<REF-24> Senden M Reithler J Gijsen S : Evaluating population receptive field estimation frameworks in terms of robustness and reproducibility. PLoS One. 2014 ; 9 ( 12 ): e114054 . 25463652 10.1371/journal.pone.0114054 4252088",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_90",
            "content": "<REF-25> van Dijk JA de Haas B Moutsiana C : Intersession reliability of population receptive field estimates. NeuroImage. 2016 ; 143 : 293 – 303 . 27620984 10.1016/j.neuroimage.2016.09.013 5139984",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_91",
            "content": "<REF-26> Benson NC Jamison KW Arcaro MJ : The Human Connectome Project 7 Tesla retinotopy dataset: Description and population receptive field analysis. J Vis. 2018 ; 18 ( 13 ): 23 . 30593068 10.1167/18.13.23 6314247",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_92",
            "content": "<REF-27> Edelstein WA Glover GH Hardy CJ : The intrinsic signal-to-noise ratio in NMR imaging. Magn Reson Med. 1986 ; 3 ( 4 ): 604 – 618 . 3747821 10.1002/mrm.1910030413",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_93",
            "content": "<REF-28> Murphy K Bodurka J Bandettini PA : How long to scan? The relationship between fMRI temporal signal to noise ratio and necessary scan duration. NeuroImage. 2007 ; 34 ( 2 ): 565 – 574 . 17126038 10.1016/j.neuroimage.2006.09.032 2223273",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_94",
            "content": "<REF-29> Moutsiana C de Haas B Papageorgiou A : Cortical idiosyncrasies predict the perception of object size. Nat Commun. 2016 ; 7 : 12110. 27357864 10.1038/ncomms12110 4931347",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_95",
            "content": "<REF-32> Hughes AE Greenwood JA Finlayson NJ : Population receptive field estimates for motion-defined stimuli. NeuroImage. 2019 ; 199 : 245 – 260 . 31158480 10.1016/j.neuroimage.2019.05.068 6693563",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_96",
            "content": "<REF-33> Brainard DH : The Psychophysics Toolbox. Spat Vis. 1997 ; 10 ( 4 ): 433 – 6 . 9176952 10.1163/156856897X00357",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_97",
            "content": "<REF-34> Breuer FA Blaimer M Heidemann RM : Controlled aliasing in parallel imaging results in higher acceleration (CAIPIRINHA) for multi-slice imaging. Magn Reson Med. 2005 ; 53 ( 3 ): 684 – 691 . 15723404 10.1002/mrm.20401",
            "ntype": "ref",
            "meta": {
                "id": "ref-34",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_98",
            "content": "<REF-35> Moeller S Yacoub E Olman CA : Multiband multislice GE-EPI at 7 tesla, with 16-fold acceleration using partial parallel imaging with application to high spatial and temporal whole-brain fMRI. Magn Reson Med. 2010 ; 63 ( 5 ): 1144 – 1153 . 20432285 10.1002/mrm.22361 2906244",
            "ntype": "ref",
            "meta": {
                "id": "ref-35",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_99",
            "content": "<REF-36> Dale AM Fischl B Sereno MI : Cortical surface-based analysis. I. Segmentation and surface reconstruction. NeuroImage. 1999 ; 9 ( 2 ): 179 – 194 . 9931268 10.1006/nimg.1998.0395",
            "ntype": "ref",
            "meta": {
                "id": "ref-36",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_100",
            "content": "<REF-37> Fischl B Sereno MI Dale AM : Cortical surface-based analysis. II: Inflation, flattening, and a surface-based coordinate system. NeuroImage. 1999 ; 9 ( 2 ): 195 – 207 . 9931269 10.1006/nimg.1998.0396",
            "ntype": "ref",
            "meta": {
                "id": "ref-37",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_101",
            "content": "<REF-38> Schwarzkopf DS de Haas B Alvarez I : SamSrf 6 - Toolbox for pRF modelling. Open Science Framework. 2018 . 10.17605/OSF.IO/2RGSM",
            "ntype": "ref",
            "meta": {
                "id": "ref-38",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_102",
            "content": "<REF-39> Nelder JA Mead R : A Simplex Method for Function Minimization. Comput J. 1965 ; 7 ( 4 ): 308 – 313 . 10.1093/comjnl/7.4.308",
            "ntype": "ref",
            "meta": {
                "id": "ref-39",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_103",
            "content": "<REF-40> Lagarias J Reeds J Wright M : Convergence properties of the Nelder—Mead simplex method in low dimensions. SIAM J Optim. 1998 ; 9 ( 1 ): 112 – 147 . 10.1137/S1052623496303470",
            "ntype": "ref",
            "meta": {
                "id": "ref-40",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_104",
            "content": "<REF-41> Harvey BM Dumoulin SO : The relationship between cortical magnification factor and population receptive field size in human visual cortex: constancies in cortical architecture. J Neurosci. 2011 ; 31 ( 38 ): 13604 – 13612 . 21940451 10.1523/JNEUROSCI.2572-11.2011 6623292",
            "ntype": "ref",
            "meta": {
                "id": "ref-41",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_105",
            "content": "<REF-42> Brown W : Some Experimental Results in the Correlation of Mental Abilities1. Brit J Psychol. 1910 ; 3 ( 3 ): 296 – 322 . 10.1111/j.2044-8295.1910.tb00207.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-42",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_106",
            "content": "<REF-43> Spearman C : Correlation Calculated from Faulty Data. Brit J Psychol. 1910 ; 3 ( 3 ): 271 – 295 . 10.1111/j.2044-8295.1910.tb00206.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-43",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_107",
            "content": "<REF-44> Spearman C : The Proof and Measurement of Association between Two Things. Am J Psychol. 1904 ; 15 ( 1 ): 72 – 101 . 10.2307/1412159",
            "ntype": "ref",
            "meta": {
                "id": "ref-44",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_108",
            "content": "<REF-45> Sereno MI Dale AM Reppas JB : Borders of multiple visual areas in humans revealed by functional magnetic resonance imaging. Science. 1995 ; 268 ( 5212 ): 889 – 893 . 7754376 10.1126/science.7754376",
            "ntype": "ref",
            "meta": {
                "id": "ref-45",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_109",
            "content": "<REF-46> Schwarzkopf D Morgan C : pRF data comparison between London 1.5T & Auckland 3T . 2019 . http://www.doi.org/10.17605/OSF.IO/WX4HP",
            "ntype": "ref",
            "meta": {
                "id": "ref-46",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "8-1681_v1_110",
            "content": "<REF-47> Hutton C Bork A Josephs O : Image distortion correction in fMRI: A quantitative evaluation. NeuroImage. 2002 ; 16 ( 1 ): 217 – 240 . 11969330 10.1006/nimg.2001.1054",
            "ntype": "ref",
            "meta": {
                "id": "ref-47",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "8-1681_v1_0@0",
            "content": "Comparison of human population receptive field estimates between scanners and the effect of temporal filtering",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_0",
            "start": 0,
            "end": 109,
            "label": {}
        },
        {
            "ix": "8-1681_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "8-1681_v1_2@0",
            "content": "Background: Population receptive field (pRF) analysis with functional magnetic resonance imaging (fMRI) is an increasingly popular method for mapping visual field representations and estimating the spatial selectivity of voxels in human visual cortex.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_2",
            "start": 0,
            "end": 250,
            "label": {}
        },
        {
            "ix": "8-1681_v1_2@1",
            "content": "However, the multitude of experimental setups and processing methods used makes comparisons of results between studies difficult.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_2",
            "start": 252,
            "end": 380,
            "label": {}
        },
        {
            "ix": "8-1681_v1_3@0",
            "content": "Methods: Here, we compared pRF maps acquired in the same three individuals using comparable scanning parameters on a 1.5 and a 3 Tesla scanner located in two different countries.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_3",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "8-1681_v1_3@1",
            "content": "We also tested the effect of low-pass filtering of the time series on pRF estimates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_3",
            "start": 179,
            "end": 262,
            "label": {}
        },
        {
            "ix": "8-1681_v1_4@0",
            "content": "Results: As expected, the signal-to-noise ratio for the 3 Tesla data was superior; critically, however, estimates of pRF size and cortical magnification did not reveal any systematic differences between the sites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_4",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "8-1681_v1_4@1",
            "content": "Unsurprisingly, low-pass filtering enhanced goodness-of-fit, presumably by removing high-frequency noise.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_4",
            "start": 214,
            "end": 318,
            "label": {}
        },
        {
            "ix": "8-1681_v1_4@2",
            "content": "However, there was no substantial increase in the number of voxels containing meaningful retinotopic signals after low-pass filtering.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_4",
            "start": 320,
            "end": 453,
            "label": {}
        },
        {
            "ix": "8-1681_v1_4@3",
            "content": "Importantly, filtering also increased estimates of pRF size in the early visual areas which could substantially skew interpretations of spatial tuning properties.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_4",
            "start": 455,
            "end": 616,
            "label": {}
        },
        {
            "ix": "8-1681_v1_5@0",
            "content": "Conclusion: Our results therefore suggest that pRF estimates are generally comparable between scanners of different field strengths, but temporal filtering should be used with caution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_5",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "8-1681_v1_6@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_6",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "8-1681_v1_7@0",
            "content": "Population receptive field analysis with functional magnetic resonance imaging (fMRI) has become a popular method in the toolbox of visual neuroscience.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_7",
            "start": 0,
            "end": 151,
            "label": {}
        },
        {
            "ix": "8-1681_v1_7@1",
            "content": "It has not only been used for mapping cortical organization <REF-1> – <REF-3> , but also to study spatial integration in the visual cortex <REF-4> , <REF-5> , reveal the effects of attention on visual processing <REF-6> – <REF-10> , show differences in patients and special populations <REF-11> – <REF-15> and for reconstructing the neural signature of perceptual processes <REF-16> – <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_7",
            "start": 153,
            "end": 547,
            "label": {}
        },
        {
            "ix": "8-1681_v1_7@2",
            "content": "The most wide-spread technique involves fitting a two-dimensional symmetric Gaussian model of the pRF to the time series of each voxel in visual cortex responding to a set of stimuli <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_7",
            "start": 549,
            "end": 740,
            "label": {}
        },
        {
            "ix": "8-1681_v1_7@3",
            "content": "Estimates of pRF position and size reflect an aggregate of the position preferences and sizes of thousands of neuronal receptive fields of the cells within the imaging voxel, and also incorporates extra-classical receptive field interactions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_7",
            "start": 742,
            "end": 983,
            "label": {}
        },
        {
            "ix": "8-1681_v1_7@4",
            "content": "Further, in fMRI, as underlying neuronal activity is inferred through neurovascular coupling, pRF measurements are affected by hemodynamic factors (although it has been shown that pRFs estimated from fMRI data have a close correspondence with receptive field properties in electrophysiological experiments <REF-1> , <REF-21> , <REF-22> but see also <REF-23> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_7",
            "start": 985,
            "end": 1344,
            "label": {}
        },
        {
            "ix": "8-1681_v1_8@0",
            "content": "The indirect nature of estimating pRFs from fMRI data suggests therefore that there could be considerable variability in derived measurements.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_8",
            "start": 0,
            "end": 141,
            "label": {}
        },
        {
            "ix": "8-1681_v1_8@1",
            "content": "Direct test-retest evaluations with the same experimental setup have shown that pRF mapping experiments are robust and repeatable <REF-24> – <REF-26> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_8",
            "start": 143,
            "end": 293,
            "label": {}
        },
        {
            "ix": "8-1681_v1_8@2",
            "content": "However, for different experimental setups, for instance, in terms of the magnetic field strength and the particular pulse sequence used to acquire fMRI data the comparability has not been assessed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_8",
            "start": 295,
            "end": 492,
            "label": {}
        },
        {
            "ix": "8-1681_v1_8@3",
            "content": "The signal-to-noise ratio of MRI is proportional to voxel volume and the strength of the static magnetic field <REF-27> , and hence pRF measurements at higher magnetic field strength might be more accurate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_8",
            "start": 494,
            "end": 699,
            "label": {}
        },
        {
            "ix": "8-1681_v1_8@4",
            "content": "However, the temporal resolution (or repetition time, TR, of image acquisition), directly affects the contribution of different noise frequencies and the contribution of physiological nuisance factors like respiration or cardiac pulsation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_8",
            "start": 701,
            "end": 939,
            "label": {}
        },
        {
            "ix": "8-1681_v1_8@5",
            "content": "Noise in fMRI data therefore has multiple contributions (physiological, thermal and system related) and the relationship between the temporal signal to noise ratio (TSNR) in a fMRI time course has a non-linear relationship with static SNR <REF-28> , i.e. gains in static SNR, from for example increased field strength, may not translate to proportional gains in TSNR due to a limit where physiological noise dominates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_8",
            "start": 941,
            "end": 1358,
            "label": {}
        },
        {
            "ix": "8-1681_v1_9@0",
            "content": "Here, we conducted pRF mapping on three individuals using identical TR and voxel size on a 1.5 Tesla (1.5T) scanner in London, United Kingdom and a 3 Tesla (3T) scanner in Auckland, New Zealand. Critically, our aim was not to test the effect of magnetic field strength alone, but rather to compare pRF estimates from typical methods used at each scanning facility that also includes a different field strength.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_9",
            "start": 0,
            "end": 409,
            "label": {}
        },
        {
            "ix": "8-1681_v1_9@1",
            "content": "Thus, our findings should reflect a relatively conservative estimate of the variability of pRF parameters under comparable conditions at the two sites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_9",
            "start": 411,
            "end": 561,
            "label": {}
        },
        {
            "ix": "8-1681_v1_10@0",
            "content": "Typical pRF studies evaluate the goodness-of-fit of the pRF model by means of the coefficient of determination (R 2 ) of the correlation between the observed and predicted time series.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_10",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "8-1681_v1_10@1",
            "content": "This measure, however, strongly depends on the temporal resolution of the signal acquisition.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_10",
            "start": 185,
            "end": 277,
            "label": {}
        },
        {
            "ix": "8-1681_v1_10@2",
            "content": "In our recent experiments we have used an accelerated multiband sequence with 1 s TR <REF-25> , <REF-29> – <REF-32> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_10",
            "start": 279,
            "end": 395,
            "label": {}
        },
        {
            "ix": "8-1681_v1_10@3",
            "content": "At this temporal resolution, there is a considerable contribution of high-frequency noise to the signal ( Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_10",
            "start": 397,
            "end": 513,
            "label": {}
        },
        {
            "ix": "8-1681_v1_10@4",
            "content": "Since our analysis does not typically involve any temporal filtering beyond linear detrending (essentially, a wide-bandwidth high-pass filter removing only very low frequencies that are attributed to slow drifts in the signal), this probably explains why the overall R 2 in our studies is comparably low compared to those reported by others who use more standard fMRI TRs of 2–3 s.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_10",
            "start": 515,
            "end": 895,
            "label": {}
        },
        {
            "ix": "8-1681_v1_10@5",
            "content": "We therefore conducted an analysis comparing pRF parameters obtained using our standard analysis (minimal filtering), to filtering with two low-pass filters that approximate longer TR acquisition.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_10",
            "start": 897,
            "end": 1092,
            "label": {}
        },
        {
            "ix": "8-1681_v1_11@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_11",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "8-1681_v1_13@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_13",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "8-1681_v1_14@0",
            "content": "Participants",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_14",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "8-1681_v1_15@0",
            "content": "We recruited three healthy adult volunteers (2 female, 1 left-handed, aged 30, 39 and 47) from our pool of repeat participants in functional brain imaging studies in London, United Kingdom.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_15",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "8-1681_v1_15@1",
            "content": "An important criterion for their participation was that they would also visit Auckland, New Zealand, within a few months after the first scan in London.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_15",
            "start": 190,
            "end": 341,
            "label": {}
        },
        {
            "ix": "8-1681_v1_15@2",
            "content": "Generally, we could only include participants with normal or corrected-to-normal visual acuity (contact lenses only), and no history of eye disease or neurological, neurodevelopmental or neuropsychiatric disorders.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_15",
            "start": 343,
            "end": 556,
            "label": {}
        },
        {
            "ix": "8-1681_v1_15@3",
            "content": "Moreover, they could have no other contraindications to magnetic resonance imaging (e.g. claustrophobia, metal implants).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_15",
            "start": 558,
            "end": 678,
            "label": {}
        },
        {
            "ix": "8-1681_v1_15@4",
            "content": "All participants gave written informed consent to take part and henceforth referred to as P1, P2, and P3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_15",
            "start": 680,
            "end": 784,
            "label": {}
        },
        {
            "ix": "8-1681_v1_15@5",
            "content": "All procedures were approved by local ethics review boards at University College London (fMRI/2012/007) and the University of Auckland (017477).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_15",
            "start": 786,
            "end": 929,
            "label": {}
        },
        {
            "ix": "8-1681_v1_16@0",
            "content": "Procedure",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_16",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "8-1681_v1_17@0",
            "content": "Participants were scanned twice with a pRF mapping protocol.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_17",
            "start": 0,
            "end": 59,
            "label": {}
        },
        {
            "ix": "8-1681_v1_17@1",
            "content": "The first scan took place inside a MAGNETOM Avanto 1.5T MRI scanner (Siemens Healthcare, Erlangen, Germany) at the Birkbeck/UCL Centre for NeuroImaging (BUCNI) in the Experimental Psychology department of University College London, United Kingdom (henceforth referred to as London site).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_17",
            "start": 61,
            "end": 347,
            "label": {}
        },
        {
            "ix": "8-1681_v1_17@2",
            "content": "The second scan took place several months later in a MAGNETOM Skyra 3T MRI scanner (Siemens Healthcare, Erlangen, Germany) at the Centre for Advanced Magnetic Resonance Imaging (CAMRI) in the Faculty of Medical & Health Sciences of the University of Auckland, New Zealand (henceforth referred to as Auckland site).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_17",
            "start": 349,
            "end": 662,
            "label": {}
        },
        {
            "ix": "8-1681_v1_17@3",
            "content": "In both scans, participants were scanned with six runs for pRF mapping lasting 4 min 20 s each during which functional echo-planar images were acquired.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_17",
            "start": 664,
            "end": 815,
            "label": {}
        },
        {
            "ix": "8-1681_v1_17@4",
            "content": "Moreover, at both centres a structural T1 weighted brain image was acquired although the structural image from the second scan (at 3T) was not used in any further analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_17",
            "start": 817,
            "end": 988,
            "label": {}
        },
        {
            "ix": "8-1681_v1_17@5",
            "content": "During the scans, participants were instructed to remain as still as possible and fixate continuously on a small dot in the centre of the screen.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_17",
            "start": 990,
            "end": 1134,
            "label": {}
        },
        {
            "ix": "8-1681_v1_17@6",
            "content": "They were instructed to press a button whenever the fixation dot changed colour.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_17",
            "start": 1136,
            "end": 1215,
            "label": {}
        },
        {
            "ix": "8-1681_v1_18@0",
            "content": "Stimuli",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_18",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "8-1681_v1_19@0",
            "content": "Stimuli were generated and presented using MATLAB (Mathworks; Version R2017a, 9.2.0.538062) and Psychtoolbox (Version 3.0.14) <REF-33> at a resolution of 1920 * 1080.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_19",
            "start": 0,
            "end": 165,
            "label": {}
        },
        {
            "ix": "8-1681_v1_19@1",
            "content": "At both sites, the screen subtended 34° by 19° of visual angle.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_19",
            "start": 167,
            "end": 229,
            "label": {}
        },
        {
            "ix": "8-1681_v1_19@2",
            "content": "Stimuli were presented on a screen at the back of the bore via a mirror mounted on the head coil.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_19",
            "start": 231,
            "end": 327,
            "label": {}
        },
        {
            "ix": "8-1681_v1_19@3",
            "content": "At the London site, stimuli were projected onto a screen in the back of the bore while in the Auckland site stimuli were presented on an MRI compatible 32’’ widescreen LCD (Cambridge Research Systems Ltd).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_19",
            "start": 329,
            "end": 533,
            "label": {}
        },
        {
            "ix": "8-1681_v1_20@0",
            "content": "At both sites, the stimuli generated were matched, and comprised bars containing a dynamic high-contrast ripple pattern as used in previous studies <REF-6> , <REF-13> , <REF-15> , <REF-22> on a uniform grey background.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_20",
            "start": 0,
            "end": 217,
            "label": {}
        },
        {
            "ix": "8-1681_v1_20@1",
            "content": "Bars traversed the visual field in a regular sequence (e.g. from the bottom to the top), jumping by 0.38° every second.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_20",
            "start": 219,
            "end": 337,
            "label": {}
        },
        {
            "ix": "8-1681_v1_20@2",
            "content": "Each sweep of the bar lasted 25 s and so there were 25 jumps of the bar.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_20",
            "start": 339,
            "end": 410,
            "label": {}
        },
        {
            "ix": "8-1681_v1_20@3",
            "content": "Each run started with a sweep from the bottom to the top and then the sweep direction was rotated by 45° clockwise on the next sweep.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_20",
            "start": 412,
            "end": 544,
            "label": {}
        },
        {
            "ix": "8-1681_v1_20@4",
            "content": "There were thus eight sweeps covering a complete rotation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_20",
            "start": 546,
            "end": 603,
            "label": {}
        },
        {
            "ix": "8-1681_v1_20@5",
            "content": "After the fourth and eighth sweep, a 25 s baseline period (no bars) was presented.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_20",
            "start": 605,
            "end": 686,
            "label": {}
        },
        {
            "ix": "8-1681_v1_21@0",
            "content": "Bars were always 0.53° wide and at the longest (when crossing the centre of the visual field) subtended the full screen height, but because they were presented only within a circular region (diameter: 19°, i.e. the height of the screen) they were accordingly shorter at the start and end of each sweep.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_21",
            "start": 0,
            "end": 301,
            "label": {}
        },
        {
            "ix": "8-1681_v1_21@1",
            "content": "The outer edge of the ripple stimulus was smoothed by ramping it down to zero over 0.1°.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_21",
            "start": 303,
            "end": 390,
            "label": {}
        },
        {
            "ix": "8-1681_v1_21@2",
            "content": "Similarly, the stimulus contrast ramped down to zero from 0.53° to 0.43° eccentricity, thus creating a blank hole around fixation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_21",
            "start": 392,
            "end": 521,
            "label": {}
        },
        {
            "ix": "8-1681_v1_22@0",
            "content": "A blue dot (diameter: 0.09°) was present in the centre of the screen throughout each scanning run.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_22",
            "start": 0,
            "end": 97,
            "label": {}
        },
        {
            "ix": "8-1681_v1_22@1",
            "content": "The whole run was divided into 200 ms epochs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_22",
            "start": 99,
            "end": 143,
            "label": {}
        },
        {
            "ix": "8-1681_v1_22@2",
            "content": "At each epoch, there was a 0.01 probability that the dot could change colour to purple with the constraint that no such colour changes could occur in a row.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_22",
            "start": 145,
            "end": 300,
            "label": {}
        },
        {
            "ix": "8-1681_v1_22@3",
            "content": "Participants were instructed to fixate the dot and press a button on a magnetic resonance-compatible button box whenever it changed colour.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_22",
            "start": 302,
            "end": 440,
            "label": {}
        },
        {
            "ix": "8-1681_v1_22@4",
            "content": "In addition, a radar screen pattern comprising low-contrast radial and concentric lines around fixation was presented at all times to aid fixation compliance (see <REF-25> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_22",
            "start": 442,
            "end": 615,
            "label": {}
        },
        {
            "ix": "8-1681_v1_22@5",
            "content": "The fixation dot and radar screen pattern were also presented during the baseline period.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_22",
            "start": 617,
            "end": 705,
            "label": {}
        },
        {
            "ix": "8-1681_v1_23@0",
            "content": "Prior to each run, we collected 10 dummy volumes to allow ample time for steady-state magnetisation to be reached.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_23",
            "start": 0,
            "end": 113,
            "label": {}
        },
        {
            "ix": "8-1681_v1_23@1",
            "content": "During this time, only the fixation dot was presented on a blank grey screen.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_23",
            "start": 115,
            "end": 191,
            "label": {}
        },
        {
            "ix": "8-1681_v1_24@0",
            "content": "Scanning parameters",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_24",
            "start": 0,
            "end": 18,
            "label": {}
        },
        {
            "ix": "8-1681_v1_25@0",
            "content": "At both sites, we used a 32-channel head coil where we removed the front elements because it impeded the view of the stimulus.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_25",
            "start": 0,
            "end": 125,
            "label": {}
        },
        {
            "ix": "8-1681_v1_25@1",
            "content": "This resulted in 20 effective channels covering the back and the sides of the head.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_25",
            "start": 127,
            "end": 209,
            "label": {}
        },
        {
            "ix": "8-1681_v1_25@2",
            "content": "Six pRF mapping runs of 260 T2*-weighted image volumes were acquired (including the 10 dummy volumes).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_25",
            "start": 211,
            "end": 312,
            "label": {}
        },
        {
            "ix": "8-1681_v1_25@3",
            "content": "We used 36 transverse slices angled to be approximately parallel to the calcarine sulcus (planned using the T1-weighted anatomical image).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_25",
            "start": 314,
            "end": 451,
            "label": {}
        },
        {
            "ix": "8-1681_v1_25@4",
            "content": "At both sites, we used an accelerated multiband sequence <REF-34> , <REF-35> at 2.3 mm isotropic voxel resolution, field of view 96x96, and a TR of 1 s.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_25",
            "start": 453,
            "end": 604,
            "label": {}
        },
        {
            "ix": "8-1681_v1_25@5",
            "content": "At the London site, the scan had an echo time (TE) of 55 ms, flip angle of 75°, and a multiband/ slice acceleration factor of 4 and rBW 1628 Hz/pixel.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_25",
            "start": 606,
            "end": 755,
            "label": {}
        },
        {
            "ix": "8-1681_v1_25@6",
            "content": "At the Auckland site, the scan had a TE of 30 ms, flip angle of 62 o , a multiband/slice acceleration factor of 3, an in-plane/parallel imaging acceleration factor of 2 and rBW was 1680 Hz/Px.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_25",
            "start": 757,
            "end": 948,
            "label": {}
        },
        {
            "ix": "8-1681_v1_25@7",
            "content": "After acquiring the functional data at the London site, the front portion of the coil was put back on to ensure maximal signal-to-noise levels for collecting a structural scan (a T1-weighted anatomical magnetization-prepared rapid acquisition with gradient echo scan with a 1 mm isotropic voxel size and full brain coverage).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_25",
            "start": 950,
            "end": 1274,
            "label": {}
        },
        {
            "ix": "8-1681_v1_26@0",
            "content": "Data preprocessing",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_26",
            "start": 0,
            "end": 17,
            "label": {}
        },
        {
            "ix": "8-1681_v1_27@0",
            "content": "Functional data were preprocessed in SPM12 (Wellcome Centre for Human NeuroImaging; Version 6906).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_27",
            "start": 0,
            "end": 97,
            "label": {}
        },
        {
            "ix": "8-1681_v1_27@1",
            "content": "The first 10 dummy volumes were removed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_27",
            "start": 99,
            "end": 138,
            "label": {}
        },
        {
            "ix": "8-1681_v1_27@2",
            "content": "Then we performed mean bias intensity correction, realignment and unwarping of motion-induced distortions, and coregistration to the structural scan acquired at the London site using default parameters in SPM12.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_27",
            "start": 140,
            "end": 350,
            "label": {}
        },
        {
            "ix": "8-1681_v1_27@3",
            "content": "Using FreeSurfer (Version 6.0.0) we further used the structural scan for automatic segmentation and reconstruction as a three-dimensional surface mesh of the pial and grey-white matter boundaries <REF-36> , <REF-37> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_27",
            "start": 352,
            "end": 568,
            "label": {}
        },
        {
            "ix": "8-1681_v1_27@4",
            "content": "The grey-white matter surface was then further inflated into a smooth model and a spherical model.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_27",
            "start": 570,
            "end": 667,
            "label": {}
        },
        {
            "ix": "8-1681_v1_28@0",
            "content": "All further analysis was conducted using our custom SamSrf 6 toolbox <REF-38> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_28",
            "start": 0,
            "end": 78,
            "label": {}
        },
        {
            "ix": "8-1681_v1_28@1",
            "content": "Functional data were projected from volume space to the surface mesh by finding the nearest voxel located halfway between each vertex in the pial and grey-white matter surface mesh.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_28",
            "start": 80,
            "end": 260,
            "label": {}
        },
        {
            "ix": "8-1681_v1_28@2",
            "content": "The time series at each vertex was then linearly detrended and z-standardized before being averaged across the six runs at each scanning site.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_28",
            "start": 262,
            "end": 403,
            "label": {}
        },
        {
            "ix": "8-1681_v1_29@0",
            "content": "For the temporal filtering analysis, we then further convolved the time series of each vertex with a Gaussian filter with standard deviation of 1 or 2 s, respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_29",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "8-1681_v1_30@0",
            "content": "pRF modelling",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_30",
            "start": 0,
            "end": 12,
            "label": {}
        },
        {
            "ix": "8-1681_v1_31@0",
            "content": "We modelled pRFs as a symmetric, two-dimensional Gaussian defined by x 0 and y 0 , the Cartesian coordinates of the pRF centre in visual space, and the standard deviation of the Gaussian, σ, as a measure of the pRF size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_31",
            "start": 0,
            "end": 219,
            "label": {}
        },
        {
            "ix": "8-1681_v1_31@1",
            "content": "The pRF model predicted the neural response at each TR of the scan by calculating the overlap of the mapping stimulus with this Gaussian pRF profile.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_31",
            "start": 221,
            "end": 369,
            "label": {}
        },
        {
            "ix": "8-1681_v1_31@2",
            "content": "A binary mask of 100-by-100 pixels indicated where the stimulus appeared on the screen for each time point.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_31",
            "start": 371,
            "end": 477,
            "label": {}
        },
        {
            "ix": "8-1681_v1_31@3",
            "content": "The neural responses were then determined by multiplying each frame of the stimulus mask with the pRF profile and summing over the 10,000 pixels.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_31",
            "start": 479,
            "end": 623,
            "label": {}
        },
        {
            "ix": "8-1681_v1_31@4",
            "content": "Subsequently, the time series was convolved with a canonical hemodynamic response function determined from previous empirical data <REF-6> and z-standardized.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_31",
            "start": 625,
            "end": 782,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@0",
            "content": "The pRF parameters at each vertex were fit using a two-stage procedure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 0,
            "end": 70,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@1",
            "content": "First, we applied a coarse fit which involved an extensive grid search by correlating the actually observed time series against a set of 7650 predicted time series derived from a combination of x 0 , y 0 , and σ covering the plausible range for each parameter (see <REF-25> , <REF-29> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 72,
            "end": 358,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@2",
            "content": "The parameters giving rise to the maximal correlation were then retained for the second stage, the fine fit, provided the squared correlation, R 2 , exceeded 0.01.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 360,
            "end": 522,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@3",
            "content": "The fine fit entailed an optimization procedure <REF-39> , <REF-40> to refine the three pRF parameters to further maximize the correlation between observed and predicted time series.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 524,
            "end": 705,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@4",
            "content": "Subsequently, we used linear regression between the observed and predicted time series to fit the amplitude, β 1 , and the baseline intercept, β 0 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 707,
            "end": 854,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@5",
            "content": "Up until this point, all analyses used raw data without any smoothing or interpolation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 856,
            "end": 942,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@6",
            "content": "However, we then applied a Gaussian smoothing kernel (full width at half maximum = 3 mm) to the final pRF parameter maps on the spherical surface mesh.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 944,
            "end": 1094,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@7",
            "content": "These smooth maps were used for visualization purposes and delineation of the visual areas.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 1096,
            "end": 1186,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@8",
            "content": "Moreover, they are necessary for calculating the local cortical magnification factor (CMF; Harvey and Dumoulin <REF-41> ) because it requires a smooth visual field map without gaps and scatter.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 1188,
            "end": 1380,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@9",
            "content": "For this we determined the cortical neighbours of each vertex and calculated the area subtended by the polygon formed by their pRF centres.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 1382,
            "end": 1520,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@10",
            "content": "The same procedure was used to determine the cortical surface area (calculation performed by FreeSurfer).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 1522,
            "end": 1626,
            "label": {}
        },
        {
            "ix": "8-1681_v1_32@11",
            "content": "To calculate the CMF, we then divided the square root of cortical area by the square root of visual area.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_32",
            "start": 1628,
            "end": 1732,
            "label": {}
        },
        {
            "ix": "8-1681_v1_33@0",
            "content": "In addition, for the data comparing the London and Auckland sites we also calculated the noise ceiling as an estimate of the maximum goodness-of-fit that could theoretically be achieved from the data of each voxel.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_33",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "8-1681_v1_33@1",
            "content": "For this, we split the six pRF mapping runs from each site into even and odd numbered runs and averaged them separately.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_33",
            "start": 215,
            "end": 334,
            "label": {}
        },
        {
            "ix": "8-1681_v1_33@2",
            "content": "We then calculated the Pearson correlation between these split time series, r obs ’, and used the Spearman-Brown prophecy formula <REF-42> , <REF-43> to determine, r obs , the expected reliability for the average of all six runs:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_33",
            "start": 336,
            "end": 564,
            "label": {}
        },
        {
            "ix": "8-1681_v1_34@0",
            "content": "r o b s = 2 r o b s ′ 1   +   r o b s ′",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_34",
            "start": 0,
            "end": 38,
            "label": {}
        },
        {
            "ix": "8-1681_v1_35@0",
            "content": "The theoretical maximum observable correlation between the predicted and observed time series, ρ o , for each voxel is given by the square root of this correlation <REF-44> because",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_35",
            "start": 0,
            "end": 179,
            "label": {}
        },
        {
            "ix": "8-1681_v1_36@0",
            "content": "ρ o = ρ h r p r e d r o b s",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_36",
            "start": 0,
            "end": 26,
            "label": {}
        },
        {
            "ix": "8-1681_v1_37@0",
            "content": "where r pred is the reliability of the predictors, which is 1, and we assume the hypothetical correlation between the observed and predicted time series, ρ h , also to be 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_37",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "8-1681_v1_37@1",
            "content": "The noise ceiling, the maximum observable goodness-of-fit ρ o 2 is therefore equal to r obs .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_37",
            "start": 174,
            "end": 266,
            "label": {}
        },
        {
            "ix": "8-1681_v1_38@0",
            "content": "Further analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_38",
            "start": 0,
            "end": 15,
            "label": {}
        },
        {
            "ix": "8-1681_v1_39@0",
            "content": "We manually delineated visual areas V1-V4 and V3A using smoothed maps from the London site by determining the borders between regions from the polar angle reversals <REF-45> and then also applied these delineations to the maps generated in Auckland.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_39",
            "start": 0,
            "end": 248,
            "label": {}
        },
        {
            "ix": "8-1681_v1_39@1",
            "content": "For each region of interest (ROIs) we then extracted pRF data and binned them into eccentricity bands 1° in width, starting from 0.5° and increasing up to 9.5°.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_39",
            "start": 250,
            "end": 409,
            "label": {}
        },
        {
            "ix": "8-1681_v1_39@2",
            "content": "For each bin, we then calculated the mean pRF size, and the median CMF, R 2 , noise ceiling ρ o 2 , or the normalized goodness-of-fit, that is R 2 divided by ρ o 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_39",
            "start": 411,
            "end": 575,
            "label": {}
        },
        {
            "ix": "8-1681_v1_39@3",
            "content": "To bootstrap the dispersion of these summary statistics, we resampled the data in each bin 1000 times with replacement and determined the central 95% of this bootstrap distribution as a confidence interval.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_39",
            "start": 577,
            "end": 782,
            "label": {}
        },
        {
            "ix": "8-1681_v1_39@4",
            "content": "To avoid the inclusion of artifactual data, for pRF size and CMF we only included data from voxels where R 2 exceeded 0.15.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_39",
            "start": 784,
            "end": 906,
            "label": {}
        },
        {
            "ix": "8-1681_v1_40@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_40",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "8-1681_v1_41@0",
            "content": "Comparison between scanning sites",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_41",
            "start": 0,
            "end": 32,
            "label": {}
        },
        {
            "ix": "8-1681_v1_42@0",
            "content": "We first compared visual field maps from the two sites, London 1.5T and Auckland 3T, by visual inspection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_42",
            "start": 0,
            "end": 105,
            "label": {}
        },
        {
            "ix": "8-1681_v1_42@1",
            "content": "Figure 2 shows polar angle and eccentricity maps of the left hemisphere of one participant from both sites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_42",
            "start": 107,
            "end": 213,
            "label": {}
        },
        {
            "ix": "8-1681_v1_42@2",
            "content": "It is immediately apparent that more voxels survive statistical thresholding (R 2 >0.1) for the 3T data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_42",
            "start": 215,
            "end": 318,
            "label": {}
        },
        {
            "ix": "8-1681_v1_42@3",
            "content": "The cortical territory occupied by visual field maps is somewhat more extensive and more complete.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_42",
            "start": 320,
            "end": 417,
            "label": {}
        },
        {
            "ix": "8-1681_v1_42@4",
            "content": "Nevertheless, the orderly organization of V1-V4, V3A, as well as regions in the LO complex is clearly visible in both scans, and their borders are very similar.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_42",
            "start": 419,
            "end": 578,
            "label": {}
        },
        {
            "ix": "8-1681_v1_42@5",
            "content": "We further quantified the map similarity by calculating correlations across all voxels above threshold in both scans (circular correlation for polar angle, Spearman’s ρ correlation for eccentricity).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_42",
            "start": 580,
            "end": 778,
            "label": {}
        },
        {
            "ix": "8-1681_v1_42@6",
            "content": "This showed that the polar angle maps were well correlated for two participants (P1: 0.71; P2: 0.71) although the correlation was not as strong in the final participant (P3: 0.44).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_42",
            "start": 780,
            "end": 959,
            "label": {}
        },
        {
            "ix": "8-1681_v1_42@7",
            "content": "Eccentricity maps were strongly correlated in all three participants (P1: 0.70; P2: 0.75; P3: 0.67).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_42",
            "start": 961,
            "end": 1060,
            "label": {}
        },
        {
            "ix": "8-1681_v1_43@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_43",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "8-1681_v1_45@0",
            "content": "Next, we compared pRF size using 1° wide eccentricity bands to bin the data from each site and then calculating the mean for each bin.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_45",
            "start": 0,
            "end": 133,
            "label": {}
        },
        {
            "ix": "8-1681_v1_45@1",
            "content": "We observed that pRF size consistently increased across eccentricities and also along the visual pathway as expected. But crucially, while pRF size varied somewhat between sites, this difference was not systematic across the three participants or the five regions of interest ( Figure 3A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_45",
            "start": 135,
            "end": 424,
            "label": {}
        },
        {
            "ix": "8-1681_v1_45@2",
            "content": "In V4 and V3A there was somewhat greater variance at some eccentricities, likely due to the smaller size of these regions compared to V1-V3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_45",
            "start": 426,
            "end": 565,
            "label": {}
        },
        {
            "ix": "8-1681_v1_45@3",
            "content": "Overall, pRF sizes were, however, very similar between sites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_45",
            "start": 567,
            "end": 627,
            "label": {}
        },
        {
            "ix": "8-1681_v1_45@4",
            "content": "Similarly, the median cortical magnification factor (CMF) showed the expected exponential decrease from the central to the peripheral visual field.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_45",
            "start": 629,
            "end": 775,
            "label": {}
        },
        {
            "ix": "8-1681_v1_45@5",
            "content": "CMF curves were very comparable for the two sites ( Figure 3B ), except for somewhat greater CMF at 3T in V1 and V2 in the very central visual field of participants P2 and P3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_45",
            "start": 777,
            "end": 951,
            "label": {}
        },
        {
            "ix": "8-1681_v1_46@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_46",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "8-1681_v1_48@0",
            "content": "We then repeated this analysis for the goodness-of-fit of the pRF model across eccentricities ( Figure 4A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_48",
            "start": 0,
            "end": 107,
            "label": {}
        },
        {
            "ix": "8-1681_v1_48@1",
            "content": "This showed that in V1 and V2 goodness-of-fit was notably greater for the Auckland 3T site than the London 1.5T site in all 3 participants.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_48",
            "start": 109,
            "end": 247,
            "label": {}
        },
        {
            "ix": "8-1681_v1_48@2",
            "content": "In higher extrastriate regions, the pattern of results was less clear, although at least for P3 goodness-of-fit was greater also in V3 and V4 (although note that in V4 for P1 very little data with very low model fits was present beyond 6° eccentricity in the Auckland data).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_48",
            "start": 249,
            "end": 522,
            "label": {}
        },
        {
            "ix": "8-1681_v1_48@3",
            "content": "In V3A, the model fits at both were similar, but generally lower than in the other regions and with greater variability.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_48",
            "start": 524,
            "end": 643,
            "label": {}
        },
        {
            "ix": "8-1681_v1_48@4",
            "content": "However, this was presumably largely driven by the overall signal-to-noise ratio.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_48",
            "start": 645,
            "end": 725,
            "label": {}
        },
        {
            "ix": "8-1681_v1_48@5",
            "content": "When we normalized model fits relative to the noise ceiling, ρ o 2 , the maximum goodness-of-fit that could theoretically be achieved given the data from each site, we found no systematic difference in goodness-of-fit between sites ( Figure 3B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_48",
            "start": 727,
            "end": 972,
            "label": {}
        },
        {
            "ix": "8-1681_v1_48@6",
            "content": "The curves mostly overlapped for P1 and P2 except in V1 where the London data outperformed the Auckland data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_48",
            "start": 974,
            "end": 1082,
            "label": {}
        },
        {
            "ix": "8-1681_v1_48@7",
            "content": "In contrast, for P3 normalized model fits for the Auckland site outperformed the London site in all regions except V3A.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_48",
            "start": 1084,
            "end": 1202,
            "label": {}
        },
        {
            "ix": "8-1681_v1_48@8",
            "content": "The noise ceiling itself was consistently higher for the Auckland data than the London data ( Figure 4C ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_48",
            "start": 1204,
            "end": 1309,
            "label": {}
        },
        {
            "ix": "8-1681_v1_49@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_49",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "8-1681_v1_51@0",
            "content": "Effect of temporal filtering",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_51",
            "start": 0,
            "end": 27,
            "label": {}
        },
        {
            "ix": "8-1681_v1_52@0",
            "content": "Goodness-of-fit of the modelled time course derived from pRF estimates and the measured fMRI time course are typically quantified by R 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_52",
            "start": 0,
            "end": 137,
            "label": {}
        },
        {
            "ix": "8-1681_v1_52@1",
            "content": "However, the pRF model does not account for the high frequency noise observed in fast temporal resolution acquisitions like the 1 s TR we used here, which therefore likely results in lower R 2 values.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_52",
            "start": 139,
            "end": 338,
            "label": {}
        },
        {
            "ix": "8-1681_v1_52@2",
            "content": "Theoretically, high frequency signals could be removed from the data and thus the model fits artifactually improved ( Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_52",
            "start": 340,
            "end": 468,
            "label": {}
        },
        {
            "ix": "8-1681_v1_52@3",
            "content": "We therefore reanalysed the data from the 3T site after temporal low-pass filtering the time series of each voxel by convolving it with a Gaussian kernel of either 1 s or 2 s standard deviation (e.g. Figures 1B and 1C , respectively).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_52",
            "start": 470,
            "end": 703,
            "label": {}
        },
        {
            "ix": "8-1681_v1_53@0",
            "content": "Figure 5 shows visual field maps from the left hemisphere of one participant using the raw data and those after low-pass filtering.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_53",
            "start": 0,
            "end": 130,
            "label": {}
        },
        {
            "ix": "8-1681_v1_53@1",
            "content": "A very similar map structure is apparent in all three images.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_53",
            "start": 132,
            "end": 192,
            "label": {}
        },
        {
            "ix": "8-1681_v1_53@2",
            "content": "There are, however, also a lot of noise voxels surviving thresholding (R 2 >0.1) outside the general visual field maps.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_53",
            "start": 194,
            "end": 312,
            "label": {}
        },
        {
            "ix": "8-1681_v1_53@3",
            "content": "Conversely, while filtering filled in a few missing voxels within the maps, filtering did not affect the overall structure and did not increase the cortical territory of the responsive region.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_53",
            "start": 314,
            "end": 505,
            "label": {}
        },
        {
            "ix": "8-1681_v1_54@0",
            "content": "Figure 5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_54",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "8-1681_v1_56@0",
            "content": "Next, we quantified mean pRF size and compared this for the three data sets ( Figure 6A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_56",
            "start": 0,
            "end": 89,
            "label": {}
        },
        {
            "ix": "8-1681_v1_56@1",
            "content": "In the early areas V1-V3, pRF size is consistently greater for the filtered time series, especially at the longer kernel of 2 s. In V4 and V3A, pRF size remained relatively similar between conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_56",
            "start": 91,
            "end": 290,
            "label": {}
        },
        {
            "ix": "8-1681_v1_56@2",
            "content": "We also quantified the median goodness-of-fit of the pRF model ( Figure 6B ) and observed consistently greater model fits for both the low-pass filtered time series in V1 to V4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_56",
            "start": 292,
            "end": 468,
            "label": {}
        },
        {
            "ix": "8-1681_v1_56@3",
            "content": "A similar pattern could be seen in V3A but results were generally more variable, especially in P1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_56",
            "start": 470,
            "end": 567,
            "label": {}
        },
        {
            "ix": "8-1681_v1_57@0",
            "content": "Figure 6.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_57",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "8-1681_v1_59@0",
            "content": "Raw results are available from Open Science Framework as Underlying data <REF-46> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_59",
            "start": 0,
            "end": 82,
            "label": {}
        },
        {
            "ix": "8-1681_v1_60@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_60",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "8-1681_v1_61@0",
            "content": "Here, we compared pRF mapping data acquired using the same stimuli and participants and under comparable conditions at two sites, a 1.5T scanner in London, United Kingdom, and a 3T scanner (by the same vendor) in Auckland, New Zealand. Generally, pRF model fits were better in the Auckland data, probably in large part because of the approximately double signal-to-noise ratio from the greater static magnetic field.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_61",
            "start": 0,
            "end": 415,
            "label": {}
        },
        {
            "ix": "8-1681_v1_61@1",
            "content": "However, despite this difference in accuracy of data fitting, we found that visual field maps and actual estimates of pRF size and local cortical magnification were very similar between the two sites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_61",
            "start": 417,
            "end": 616,
            "label": {}
        },
        {
            "ix": "8-1681_v1_62@0",
            "content": "Although the London data were always acquired first, this is unlikely to explain our findings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_62",
            "start": 0,
            "end": 93,
            "label": {}
        },
        {
            "ix": "8-1681_v1_62@1",
            "content": "All our participants were familiar with the fMRI environment, including undertaking previous pRF mapping studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_62",
            "start": 95,
            "end": 207,
            "label": {}
        },
        {
            "ix": "8-1681_v1_62@2",
            "content": "Therefore, it is unlikely that there should have been substantial training effects that could for example have changed the amount of head motion or fixation compliance between sessions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_62",
            "start": 209,
            "end": 393,
            "label": {}
        },
        {
            "ix": "8-1681_v1_62@3",
            "content": "The exact parameters of the pulse sequences used and general differences in the image quality of the two scanners could of course also be contributing factors to inter-site differences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_62",
            "start": 395,
            "end": 579,
            "label": {}
        },
        {
            "ix": "8-1681_v1_62@4",
            "content": "We did not apply any correction of distortions caused by the static magnetic field <REF-47> to either site data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_62",
            "start": 581,
            "end": 692,
            "label": {}
        },
        {
            "ix": "8-1681_v1_62@5",
            "content": "Moreover, the exact slice positioning, and thus how the voxel grid resolved the grey matter, may also have differed between sites.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_62",
            "start": 694,
            "end": 823,
            "label": {}
        },
        {
            "ix": "8-1681_v1_62@6",
            "content": "Relevant to this, in our previous work quantifying the test-retest reliability of pRF maps we found that reliability was greater for scanning sessions in close succession on the same day than for sessions on different days <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_62",
            "start": 825,
            "end": 1057,
            "label": {}
        },
        {
            "ix": "8-1681_v1_62@7",
            "content": "This could have been caused by fluctuations in the scanner hardware itself but also relate to differences in head position at set up.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_62",
            "start": 1059,
            "end": 1191,
            "label": {}
        },
        {
            "ix": "8-1681_v1_62@8",
            "content": "While in both cases participants were removed from the scanner between the repeat sessions, it is highly likely that positioning was more similar for the sessions conducted on the same day.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_62",
            "start": 1193,
            "end": 1381,
            "label": {}
        },
        {
            "ix": "8-1681_v1_63@0",
            "content": "While we took painstaking steps to match the visual displays at the two sites as closely as possible, due to constraints of the experimental setup there may have been small differences between the stimuli presented.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_63",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "8-1681_v1_63@1",
            "content": "In London, images were projected onto a screen and this necessitated focussing and scaling the projected image to be of the exact size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_63",
            "start": 216,
            "end": 350,
            "label": {}
        },
        {
            "ix": "8-1681_v1_63@2",
            "content": "The image in London may have been somewhat blurrier and the viewing angle more variable than in Auckland where we used a clear liquid crystal display that was always placed at the exact same position at the back of the bore.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_63",
            "start": 352,
            "end": 575,
            "label": {}
        },
        {
            "ix": "8-1681_v1_63@3",
            "content": "Naturally, the exact viewing angle of the stimuli also depends on the viewing distance and there may have been subtle variation between the sites although this is unlikely to have produced any systematic differences.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_63",
            "start": 577,
            "end": 792,
            "label": {}
        },
        {
            "ix": "8-1681_v1_64@0",
            "content": "Nevertheless, the general extent of the visually responsive area of cortex containing clear retinotopic maps was very comparable across the sites, as were estimates of spatial tuning and cortical magnification.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_64",
            "start": 0,
            "end": 209,
            "label": {}
        },
        {
            "ix": "8-1681_v1_64@1",
            "content": "Therefore, we conclude that pRF estimates are very robust across scanning sites, even when using different magnetic field strengths.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_64",
            "start": 211,
            "end": 342,
            "label": {}
        },
        {
            "ix": "8-1681_v1_65@0",
            "content": "At the short TR of 1 s as used in our study, noise contributes high-frequency signals to the fMRI response that are irrelevant to the sluggish blood oxygen level dependent activity the pRF model seeks to characterize.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_65",
            "start": 0,
            "end": 216,
            "label": {}
        },
        {
            "ix": "8-1681_v1_65@1",
            "content": "This explains why the model fits in most of our studies are relatively low compared to those reported in the literature using more conventional TRs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_65",
            "start": 218,
            "end": 365,
            "label": {}
        },
        {
            "ix": "8-1681_v1_65@2",
            "content": "We therefore also sought to test what effect temporal low-pass filtering had on pRF parameter estimates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_65",
            "start": 367,
            "end": 470,
            "label": {}
        },
        {
            "ix": "8-1681_v1_65@3",
            "content": "Unsurprisingly, low-pass filtering enhanced the goodness-of-fit of pRF models.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_65",
            "start": 472,
            "end": 549,
            "label": {}
        },
        {
            "ix": "8-1681_v1_65@4",
            "content": "However, while this filled in a few gaps in the maps it largely boosted the number of noise voxels outside the visually responsive cortex.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_65",
            "start": 551,
            "end": 688,
            "label": {}
        },
        {
            "ix": "8-1681_v1_66@0",
            "content": "Crucially, low-pass filtering also generally enlarged estimates of pRF size in the early visual regions V1-V3 while data in higher regions were mostly unaffected.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_66",
            "start": 0,
            "end": 161,
            "label": {}
        },
        {
            "ix": "8-1681_v1_66@1",
            "content": "The pRF size estimates for the unfiltered data accord well with previous research and what one would expect from electrophysiological recordings <REF-1> , <REF-21> , <REF-22> , <REF-41> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_66",
            "start": 163,
            "end": 349,
            "label": {}
        },
        {
            "ix": "8-1681_v1_66@2",
            "content": "Therefore, the pRF sizes of the filtered data presumably reflect an overestimate that seems unrealistically high (e.g. for P2 mean pRF size in central V1 was close to 2° for the most heavily filtered data).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_66",
            "start": 351,
            "end": 556,
            "label": {}
        },
        {
            "ix": "8-1681_v1_67@0",
            "content": "The reason why filtering increased pRF sizes in early areas is probably the fact that filtering blurred together signals from stimuli presented close in time (proximal bar positions were presented only a few seconds apart).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_67",
            "start": 0,
            "end": 222,
            "label": {}
        },
        {
            "ix": "8-1681_v1_67@1",
            "content": "In the early regions where pRFs are small this would therefore be modelled as a larger pRF, whereas in higher areas in which pRFs are large enough to encompass adjacent bar positions this should not affect estimates of pRF size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_67",
            "start": 224,
            "end": 451,
            "label": {}
        },
        {
            "ix": "8-1681_v1_67@2",
            "content": "A slower stimulus design where each bar position is stimulated for 2-3 s, or a random instead of an ordered stimulus sequence, could probably counteract this problem but this would come at the expense of longer scanning durations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_67",
            "start": 453,
            "end": 682,
            "label": {}
        },
        {
            "ix": "8-1681_v1_67@3",
            "content": "In any case, for our standard design using 1 s TR low-pass filtering clearly has no practical advantages because it does not appear to fundamentally improve map quality and skews pRF size estimates in the early visual areas.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_67",
            "start": 684,
            "end": 907,
            "label": {}
        },
        {
            "ix": "8-1681_v1_68@0",
            "content": "Since we only tested three participants in this study, our analyses were not designed to detect subtle differences between the scanner environments or small effects of temporal filtering.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_68",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "8-1681_v1_68@1",
            "content": "Retinotopic maps and pRF data are highly replicable <REF-25> and can also be used for case studies on individuals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_68",
            "start": 188,
            "end": 301,
            "label": {}
        },
        {
            "ix": "8-1681_v1_68@2",
            "content": "We were therefore most interested in how consistent results are across all three participants.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_68",
            "start": 303,
            "end": 396,
            "label": {}
        },
        {
            "ix": "8-1681_v1_68@3",
            "content": "Our descriptive analysis of the data included bootstrapped confidence intervals, which permit an inference about the statistical evidence in each participant, and thus each individual participant essentially constitutes a replication.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_68",
            "start": 398,
            "end": 631,
            "label": {}
        },
        {
            "ix": "8-1681_v1_69@0",
            "content": "In summary, our results show that pRF mapping with fast 1 s TR produces similar and reliable results on different scanners, even using different magnetic field strengths.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_69",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "8-1681_v1_69@1",
            "content": "It would be interesting to conduct a similar comparison between 3T and 7T scans as these are becoming increasingly commonplace.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_69",
            "start": 171,
            "end": 297,
            "label": {}
        },
        {
            "ix": "8-1681_v1_70@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_70",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "8-1681_v1_71@0",
            "content": "Open Science Framework: pRF data comparison between London 1.5T & Auckland 3T.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_71",
            "start": 0,
            "end": 77,
            "label": {}
        },
        {
            "ix": "8-1681_v1_71@1",
            "content": "https://doi.org/10.17605/OSF.IO/WX4HP <REF-46> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_71",
            "start": 79,
            "end": 126,
            "label": {}
        },
        {
            "ix": "8-1681_v1_72@0",
            "content": "This project contains Lon-Akl.zip, which itself contains underlying data for each participant in folders 30fl, 39mr and 47fr.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_72",
            "start": 0,
            "end": 124,
            "label": {}
        },
        {
            "ix": "8-1681_v1_72@1",
            "content": "These files each contain the following underlying data:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_72",
            "start": 126,
            "end": 180,
            "label": {}
        },
        {
            "ix": "8-1681_v1_73@0",
            "content": "- anatomy (the model of the subject's brain anatomy).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_73",
            "start": 0,
            "end": 52,
            "label": {}
        },
        {
            "ix": "8-1681_v1_73@1",
            "content": "- prf_bucni (functional MRI data (pRF maps) from London).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_73",
            "start": 54,
            "end": 110,
            "label": {}
        },
        {
            "ix": "8-1681_v1_73@2",
            "content": "- prf_camri (functional MRI data (pRF maps) from Auckland).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_73",
            "start": 112,
            "end": 170,
            "label": {}
        },
        {
            "ix": "8-1681_v1_73@3",
            "content": "- ROIs (delineation (FreeSurfer label files) for the visual areas).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_73",
            "start": 172,
            "end": 238,
            "label": {}
        },
        {
            "ix": "8-1681_v1_74@0",
            "content": "Data are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_74",
            "start": 0,
            "end": 131,
            "label": {}
        },
        {
            "ix": "8-1681_v1_75@0",
            "content": "<REF-1> Dumoulin SO Wandell BA : Population receptive field estimates in human visual cortex. NeuroImage. 2008 ; 39 ( 2 ): 647 – 660 . 17977024 10.1016/j.neuroimage.2007.09.034 3073038",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_75",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "8-1681_v1_76@0",
            "content": "<REF-3> Winawer J Horiguchi H Sayres RA : Mapping hV4 and ventral occipital cortex: the venous eclipse. J Vis. 2010 ; 10 ( 5 ): 1 . 20616143 10.1167/10.5.1 3033222",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_76",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "8-1681_v1_77@0",
            "content": "<REF-4> Dumoulin SO Hess RF May KA : Contour extracting networks in early extrastriate cortex. J Vis. 2014 ; 14 ( 5 ): 18 . 24879865 10.1167/14.5.18",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_77",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "8-1681_v1_78@0",
            "content": "<REF-5> Harvey BM Dumoulin SO : Visual motion transforms visual space representations similarly throughout the human visual hierarchy. NeuroImage. 2016 ; 127 : 173 – 185 . 26666897 10.1016/j.neuroimage.2015.11.070",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_78",
            "start": 0,
            "end": 212,
            "label": {}
        },
        {
            "ix": "8-1681_v1_79@0",
            "content": "<REF-6> de Haas B Schwarzkopf DS Anderson EJ : Perceptual load affects spatial tuning of neuronal populations in human early visual cortex. Curr Biol. 2014 ; 24 ( 2 ): R66 – 67 . 24456976 10.1016/j.cub.2013.11.061 3928995",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_79",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "8-1681_v1_80@0",
            "content": "<REF-10> Vo VA Sprague TC Serences JT : Spatial Tuning Shifts Increase the Discriminability and Fidelity of Population Codes in Visual Cortex. J Neurosci. 2017 ; 37 ( 12 ): 3386 – 3401 . 28242794 10.1523/JNEUROSCI.3484-16.2017 5373124",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_80",
            "start": 0,
            "end": 233,
            "label": {}
        },
        {
            "ix": "8-1681_v1_81@0",
            "content": "<REF-11> Levin N Dumoulin SO Winawer J : Cortical maps and white matter tracts following long period of visual deprivation and retinal image restoration. Neuron. 2010 ; 65 ( 1 ): 21 – 31 . 20152110 10.1016/j.neuron.2009.12.006 2948651",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_81",
            "start": 0,
            "end": 233,
            "label": {}
        },
        {
            "ix": "8-1681_v1_82@0",
            "content": "<REF-13> Schwarzkopf DS Anderson EJ de Haas B : Larger extrastriate population receptive fields in autism spectrum disorders. J Neurosci. 2014 ; 34 ( 7 ): 2713 – 2724 . 24523560 10.1523/JNEUROSCI.4416-13.2014 3921434",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_82",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "8-1681_v1_83@0",
            "content": "<REF-15> Anderson EJ Tibber MS Schwarzkopf DS : Visual Population Receptive Fields in People with Schizophrenia Have Reduced Inhibitory Surrounds. J Neurosci. 2017 ; 37 ( 6 ): 1546 – 1556 . 28025253 10.1523/JNEUROSCI.3620-15.2016 5299570",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_83",
            "start": 0,
            "end": 236,
            "label": {}
        },
        {
            "ix": "8-1681_v1_84@0",
            "content": "<REF-16> Kok P de Lange FP : Shape perception simultaneously up- and downregulates neural activity in the primary visual cortex. Curr Biol. 2014 ; 24 ( 13 ): 1531 – 1535 . 24980501 10.1016/j.cub.2014.05.042",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_84",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "8-1681_v1_85@0",
            "content": "<REF-20> Senden M Emmerling TC van Hoof R : Reconstructing imagined letters from early visual cortex reveals tight topographic correspondence between visual mental imagery and perception. Brain Struct Funct. 2019 ; 224 ( 3 ): 1167 – 1183 . 30637491 10.1007/s00429-019-01828-6 6499877",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_85",
            "start": 0,
            "end": 282,
            "label": {}
        },
        {
            "ix": "8-1681_v1_86@0",
            "content": "<REF-21> Winawer J Rauschecker AM Parvizi J : Population receptive fields in human visual cortex measured with subdural electrodes. J Vis. 2011 ; 11 : 1196 . 10.1167/11.11.1196",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_86",
            "start": 0,
            "end": 175,
            "label": {}
        },
        {
            "ix": "8-1681_v1_87@0",
            "content": "<REF-22> Alvarez I de Haas BA Clark CA : Comparing different stimulus configurations for population receptive field mapping in human fMRI. Front Hum Neurosci. 2015 ; 9 : 96 . 25750620 10.3389/fnhum.2015.00096 4335485",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_87",
            "start": 0,
            "end": 215,
            "label": {}
        },
        {
            "ix": "8-1681_v1_88@0",
            "content": "<REF-23> Keliris GA Li Q Papanikolaou A : Estimating average single-neuron visual receptive field sizes by fMRI. Proc Natl Acad Sci U S A. 2019 ; 116 ( 13 ): 6425 – 6434 . 30867291 10.1073/pnas.1809612116 6442598",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_88",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "8-1681_v1_89@0",
            "content": "<REF-24> Senden M Reithler J Gijsen S : Evaluating population receptive field estimation frameworks in terms of robustness and reproducibility. PLoS One. 2014 ; 9 ( 12 ): e114054 . 25463652 10.1371/journal.pone.0114054 4252088",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_89",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "8-1681_v1_90@0",
            "content": "<REF-25> van Dijk JA de Haas B Moutsiana C : Intersession reliability of population receptive field estimates. NeuroImage. 2016 ; 143 : 293 – 303 . 27620984 10.1016/j.neuroimage.2016.09.013 5139984",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_90",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "8-1681_v1_91@0",
            "content": "<REF-26> Benson NC Jamison KW Arcaro MJ : The Human Connectome Project 7 Tesla retinotopy dataset: Description and population receptive field analysis. J Vis. 2018 ; 18 ( 13 ): 23 . 30593068 10.1167/18.13.23 6314247",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_91",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "8-1681_v1_92@0",
            "content": "<REF-27> Edelstein WA Glover GH Hardy CJ : The intrinsic signal-to-noise ratio in NMR imaging. Magn Reson Med. 1986 ; 3 ( 4 ): 604 – 618 . 3747821 10.1002/mrm.1910030413",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_92",
            "start": 0,
            "end": 168,
            "label": {}
        },
        {
            "ix": "8-1681_v1_93@0",
            "content": "<REF-28> Murphy K Bodurka J Bandettini PA : How long to scan? The relationship between fMRI temporal signal to noise ratio and necessary scan duration. NeuroImage. 2007 ; 34 ( 2 ): 565 – 574 . 17126038 10.1016/j.neuroimage.2006.09.032 2223273",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_93",
            "start": 0,
            "end": 241,
            "label": {}
        },
        {
            "ix": "8-1681_v1_94@0",
            "content": "<REF-29> Moutsiana C de Haas B Papageorgiou A : Cortical idiosyncrasies predict the perception of object size. Nat Commun. 2016 ; 7 : 12110. 27357864 10.1038/ncomms12110 4931347",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_94",
            "start": 0,
            "end": 176,
            "label": {}
        },
        {
            "ix": "8-1681_v1_95@0",
            "content": "<REF-32> Hughes AE Greenwood JA Finlayson NJ : Population receptive field estimates for motion-defined stimuli. NeuroImage. 2019 ; 199 : 245 – 260 . 31158480 10.1016/j.neuroimage.2019.05.068 6693563",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_95",
            "start": 0,
            "end": 197,
            "label": {}
        },
        {
            "ix": "8-1681_v1_96@0",
            "content": "<REF-33> Brainard DH : The Psychophysics Toolbox. Spat Vis. 1997 ; 10 ( 4 ): 433 – 6 . 9176952 10.1163/156856897X00357",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_96",
            "start": 0,
            "end": 117,
            "label": {}
        },
        {
            "ix": "8-1681_v1_97@0",
            "content": "<REF-34> Breuer FA Blaimer M Heidemann RM : Controlled aliasing in parallel imaging results in higher acceleration (CAIPIRINHA) for multi-slice imaging. Magn Reson Med. 2005 ; 53 ( 3 ): 684 – 691 . 15723404 10.1002/mrm.20401",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_97",
            "start": 0,
            "end": 223,
            "label": {}
        },
        {
            "ix": "8-1681_v1_98@0",
            "content": "<REF-35> Moeller S Yacoub E Olman CA : Multiband multislice GE-EPI at 7 tesla, with 16-fold acceleration using partial parallel imaging with application to high spatial and temporal whole-brain fMRI. Magn Reson Med. 2010 ; 63 ( 5 ): 1144 – 1153 . 20432285 10.1002/mrm.22361 2906244",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_98",
            "start": 0,
            "end": 280,
            "label": {}
        },
        {
            "ix": "8-1681_v1_99@0",
            "content": "<REF-36> Dale AM Fischl B Sereno MI : Cortical surface-based analysis. I. Segmentation and surface reconstruction. NeuroImage. 1999 ; 9 ( 2 ): 179 – 194 . 9931268 10.1006/nimg.1998.0395",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_99",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "8-1681_v1_100@0",
            "content": "<REF-37> Fischl B Sereno MI Dale AM : Cortical surface-based analysis. II: Inflation, flattening, and a surface-based coordinate system. NeuroImage. 1999 ; 9 ( 2 ): 195 – 207 . 9931269 10.1006/nimg.1998.0396",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_100",
            "start": 0,
            "end": 206,
            "label": {}
        },
        {
            "ix": "8-1681_v1_101@0",
            "content": "<REF-38> Schwarzkopf DS de Haas B Alvarez I : SamSrf 6 - Toolbox for pRF modelling. Open Science Framework. 2018 . 10.17605/OSF.IO/2RGSM",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_101",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "8-1681_v1_102@0",
            "content": "<REF-39> Nelder JA Mead R : A Simplex Method for Function Minimization. Comput J. 1965 ; 7 ( 4 ): 308 – 313 . 10.1093/comjnl/7.4.308",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_102",
            "start": 0,
            "end": 131,
            "label": {}
        },
        {
            "ix": "8-1681_v1_103@0",
            "content": "<REF-40> Lagarias J Reeds J Wright M : Convergence properties of the Nelder—Mead simplex method in low dimensions. SIAM J Optim. 1998 ; 9 ( 1 ): 112 – 147 . 10.1137/S1052623496303470",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_103",
            "start": 0,
            "end": 181,
            "label": {}
        },
        {
            "ix": "8-1681_v1_104@0",
            "content": "<REF-41> Harvey BM Dumoulin SO : The relationship between cortical magnification factor and population receptive field size in human visual cortex: constancies in cortical architecture. J Neurosci. 2011 ; 31 ( 38 ): 13604 – 13612 . 21940451 10.1523/JNEUROSCI.2572-11.2011 6623292",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_104",
            "start": 0,
            "end": 278,
            "label": {}
        },
        {
            "ix": "8-1681_v1_105@0",
            "content": "<REF-42> Brown W : Some Experimental Results in the Correlation of Mental Abilities1. Brit J Psychol. 1910 ; 3 ( 3 ): 296 – 322 . 10.1111/j.2044-8295.1910.tb00207.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_105",
            "start": 0,
            "end": 163,
            "label": {}
        },
        {
            "ix": "8-1681_v1_106@0",
            "content": "<REF-43> Spearman C : Correlation Calculated from Faulty Data. Brit J Psychol. 1910 ; 3 ( 3 ): 271 – 295 . 10.1111/j.2044-8295.1910.tb00206.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_106",
            "start": 0,
            "end": 140,
            "label": {}
        },
        {
            "ix": "8-1681_v1_107@0",
            "content": "<REF-44> Spearman C : The Proof and Measurement of Association between Two Things. Am J Psychol. 1904 ; 15 ( 1 ): 72 – 101 . 10.2307/1412159",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_107",
            "start": 0,
            "end": 139,
            "label": {}
        },
        {
            "ix": "8-1681_v1_108@0",
            "content": "<REF-45> Sereno MI Dale AM Reppas JB : Borders of multiple visual areas in humans revealed by functional magnetic resonance imaging. Science. 1995 ; 268 ( 5212 ): 889 – 893 . 7754376 10.1126/science.7754376",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_108",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "8-1681_v1_109@0",
            "content": "<REF-46> Schwarzkopf D Morgan C : pRF data comparison between London 1.5T & Auckland 3T . 2019 . http://www.doi.org/10.17605/OSF.IO/WX4HP",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_109",
            "start": 0,
            "end": 136,
            "label": {}
        },
        {
            "ix": "8-1681_v1_110@0",
            "content": "<REF-47> Hutton C Bork A Josephs O : Image distortion correction in fMRI: A quantitative evaluation. NeuroImage. 2002 ; 16 ( 1 ): 217 – 240 . 11969330 10.1006/nimg.2001.1054",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "8-1681_v1_110",
            "start": 0,
            "end": 172,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "8-1681_v1_0",
            "tgt_ix": "8-1681_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_1",
            "tgt_ix": "8-1681_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_1",
            "tgt_ix": "8-1681_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_1",
            "tgt_ix": "8-1681_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_1",
            "tgt_ix": "8-1681_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_0",
            "tgt_ix": "8-1681_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_6",
            "tgt_ix": "8-1681_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_6",
            "tgt_ix": "8-1681_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_6",
            "tgt_ix": "8-1681_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_6",
            "tgt_ix": "8-1681_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_6",
            "tgt_ix": "8-1681_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_11",
            "tgt_ix": "8-1681_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_0",
            "tgt_ix": "8-1681_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_13",
            "tgt_ix": "8-1681_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_14",
            "tgt_ix": "8-1681_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_13",
            "tgt_ix": "8-1681_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_16",
            "tgt_ix": "8-1681_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_13",
            "tgt_ix": "8-1681_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_18",
            "tgt_ix": "8-1681_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_18",
            "tgt_ix": "8-1681_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_18",
            "tgt_ix": "8-1681_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_18",
            "tgt_ix": "8-1681_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_18",
            "tgt_ix": "8-1681_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_13",
            "tgt_ix": "8-1681_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_24",
            "tgt_ix": "8-1681_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_13",
            "tgt_ix": "8-1681_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_26",
            "tgt_ix": "8-1681_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_26",
            "tgt_ix": "8-1681_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_26",
            "tgt_ix": "8-1681_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_13",
            "tgt_ix": "8-1681_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_30",
            "tgt_ix": "8-1681_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_30",
            "tgt_ix": "8-1681_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_30",
            "tgt_ix": "8-1681_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_30",
            "tgt_ix": "8-1681_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_30",
            "tgt_ix": "8-1681_v1_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_30",
            "tgt_ix": "8-1681_v1_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_30",
            "tgt_ix": "8-1681_v1_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_13",
            "tgt_ix": "8-1681_v1_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_38",
            "tgt_ix": "8-1681_v1_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_0",
            "tgt_ix": "8-1681_v1_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_40",
            "tgt_ix": "8-1681_v1_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_41",
            "tgt_ix": "8-1681_v1_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_41",
            "tgt_ix": "8-1681_v1_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_43",
            "tgt_ix": "8-1681_v1_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_41",
            "tgt_ix": "8-1681_v1_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_41",
            "tgt_ix": "8-1681_v1_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_46",
            "tgt_ix": "8-1681_v1_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_41",
            "tgt_ix": "8-1681_v1_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_41",
            "tgt_ix": "8-1681_v1_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_49",
            "tgt_ix": "8-1681_v1_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_40",
            "tgt_ix": "8-1681_v1_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_51",
            "tgt_ix": "8-1681_v1_52",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_51",
            "tgt_ix": "8-1681_v1_53",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_51",
            "tgt_ix": "8-1681_v1_54",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_54",
            "tgt_ix": "8-1681_v1_55",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_51",
            "tgt_ix": "8-1681_v1_56",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_51",
            "tgt_ix": "8-1681_v1_57",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_57",
            "tgt_ix": "8-1681_v1_58",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_51",
            "tgt_ix": "8-1681_v1_59",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_40",
            "tgt_ix": "8-1681_v1_60",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_61",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_62",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_63",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_64",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_65",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_66",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_67",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_68",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_69",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_40",
            "tgt_ix": "8-1681_v1_70",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_70",
            "tgt_ix": "8-1681_v1_71",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_70",
            "tgt_ix": "8-1681_v1_72",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_70",
            "tgt_ix": "8-1681_v1_73",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_70",
            "tgt_ix": "8-1681_v1_74",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_0",
            "tgt_ix": "8-1681_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_1",
            "tgt_ix": "8-1681_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_2",
            "tgt_ix": "8-1681_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_3",
            "tgt_ix": "8-1681_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_4",
            "tgt_ix": "8-1681_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_5",
            "tgt_ix": "8-1681_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_6",
            "tgt_ix": "8-1681_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_9",
            "tgt_ix": "8-1681_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_11",
            "tgt_ix": "8-1681_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_12",
            "tgt_ix": "8-1681_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_13",
            "tgt_ix": "8-1681_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_14",
            "tgt_ix": "8-1681_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_15",
            "tgt_ix": "8-1681_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_16",
            "tgt_ix": "8-1681_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_17",
            "tgt_ix": "8-1681_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_18",
            "tgt_ix": "8-1681_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_19",
            "tgt_ix": "8-1681_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_20",
            "tgt_ix": "8-1681_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_21",
            "tgt_ix": "8-1681_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_22",
            "tgt_ix": "8-1681_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_23",
            "tgt_ix": "8-1681_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_24",
            "tgt_ix": "8-1681_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_26",
            "tgt_ix": "8-1681_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_27",
            "tgt_ix": "8-1681_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_28",
            "tgt_ix": "8-1681_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_29",
            "tgt_ix": "8-1681_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_30",
            "tgt_ix": "8-1681_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_31",
            "tgt_ix": "8-1681_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_33",
            "tgt_ix": "8-1681_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_34",
            "tgt_ix": "8-1681_v1_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_35",
            "tgt_ix": "8-1681_v1_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_36",
            "tgt_ix": "8-1681_v1_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_37",
            "tgt_ix": "8-1681_v1_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_38",
            "tgt_ix": "8-1681_v1_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_39",
            "tgt_ix": "8-1681_v1_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_40",
            "tgt_ix": "8-1681_v1_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_41",
            "tgt_ix": "8-1681_v1_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_42",
            "tgt_ix": "8-1681_v1_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_43",
            "tgt_ix": "8-1681_v1_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_44",
            "tgt_ix": "8-1681_v1_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_45",
            "tgt_ix": "8-1681_v1_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_46",
            "tgt_ix": "8-1681_v1_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_47",
            "tgt_ix": "8-1681_v1_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_49",
            "tgt_ix": "8-1681_v1_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_50",
            "tgt_ix": "8-1681_v1_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_51",
            "tgt_ix": "8-1681_v1_52",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_52",
            "tgt_ix": "8-1681_v1_53",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_53",
            "tgt_ix": "8-1681_v1_54",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_54",
            "tgt_ix": "8-1681_v1_55",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_55",
            "tgt_ix": "8-1681_v1_56",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_56",
            "tgt_ix": "8-1681_v1_57",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_57",
            "tgt_ix": "8-1681_v1_58",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_58",
            "tgt_ix": "8-1681_v1_59",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_59",
            "tgt_ix": "8-1681_v1_60",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_61",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_61",
            "tgt_ix": "8-1681_v1_62",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_63",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_63",
            "tgt_ix": "8-1681_v1_64",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_64",
            "tgt_ix": "8-1681_v1_65",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_65",
            "tgt_ix": "8-1681_v1_66",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_66",
            "tgt_ix": "8-1681_v1_67",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_67",
            "tgt_ix": "8-1681_v1_68",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_68",
            "tgt_ix": "8-1681_v1_69",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_69",
            "tgt_ix": "8-1681_v1_70",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_70",
            "tgt_ix": "8-1681_v1_71",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_71",
            "tgt_ix": "8-1681_v1_72",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_72",
            "tgt_ix": "8-1681_v1_73",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_73",
            "tgt_ix": "8-1681_v1_74",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_20",
            "tgt_ix": "8-1681_v1_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_90",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_91",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_92",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_93",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_94",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_95",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_19",
            "tgt_ix": "8-1681_v1_96",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_97",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_98",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_27",
            "tgt_ix": "8-1681_v1_99",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_27",
            "tgt_ix": "8-1681_v1_100",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_28",
            "tgt_ix": "8-1681_v1_101",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_102",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_103",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_104",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_33",
            "tgt_ix": "8-1681_v1_105",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_33",
            "tgt_ix": "8-1681_v1_106",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_35",
            "tgt_ix": "8-1681_v1_107",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_39",
            "tgt_ix": "8-1681_v1_108",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_59",
            "tgt_ix": "8-1681_v1_109",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_110",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_12",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_42",
            "tgt_ix": "8-1681_v1_44",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_45",
            "tgt_ix": "8-1681_v1_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_53",
            "tgt_ix": "8-1681_v1_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_56",
            "tgt_ix": "8-1681_v1_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "8-1681_v1_0",
            "tgt_ix": "8-1681_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_1",
            "tgt_ix": "8-1681_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_2",
            "tgt_ix": "8-1681_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_2",
            "tgt_ix": "8-1681_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_3",
            "tgt_ix": "8-1681_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_3",
            "tgt_ix": "8-1681_v1_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_4",
            "tgt_ix": "8-1681_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_4",
            "tgt_ix": "8-1681_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_4",
            "tgt_ix": "8-1681_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_4",
            "tgt_ix": "8-1681_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_5",
            "tgt_ix": "8-1681_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_6",
            "tgt_ix": "8-1681_v1_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_7@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_7",
            "tgt_ix": "8-1681_v1_7@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_8",
            "tgt_ix": "8-1681_v1_8@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_9",
            "tgt_ix": "8-1681_v1_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_9",
            "tgt_ix": "8-1681_v1_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_10",
            "tgt_ix": "8-1681_v1_10@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_11",
            "tgt_ix": "8-1681_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_13",
            "tgt_ix": "8-1681_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_14",
            "tgt_ix": "8-1681_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_15",
            "tgt_ix": "8-1681_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_15",
            "tgt_ix": "8-1681_v1_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_15",
            "tgt_ix": "8-1681_v1_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_15",
            "tgt_ix": "8-1681_v1_15@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_15",
            "tgt_ix": "8-1681_v1_15@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_15",
            "tgt_ix": "8-1681_v1_15@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_16",
            "tgt_ix": "8-1681_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_17",
            "tgt_ix": "8-1681_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_17",
            "tgt_ix": "8-1681_v1_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_17",
            "tgt_ix": "8-1681_v1_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_17",
            "tgt_ix": "8-1681_v1_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_17",
            "tgt_ix": "8-1681_v1_17@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_17",
            "tgt_ix": "8-1681_v1_17@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_17",
            "tgt_ix": "8-1681_v1_17@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_18",
            "tgt_ix": "8-1681_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_19",
            "tgt_ix": "8-1681_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_19",
            "tgt_ix": "8-1681_v1_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_19",
            "tgt_ix": "8-1681_v1_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_19",
            "tgt_ix": "8-1681_v1_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_20",
            "tgt_ix": "8-1681_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_20",
            "tgt_ix": "8-1681_v1_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_20",
            "tgt_ix": "8-1681_v1_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_20",
            "tgt_ix": "8-1681_v1_20@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_20",
            "tgt_ix": "8-1681_v1_20@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_20",
            "tgt_ix": "8-1681_v1_20@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_21",
            "tgt_ix": "8-1681_v1_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_21",
            "tgt_ix": "8-1681_v1_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_21",
            "tgt_ix": "8-1681_v1_21@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_22",
            "tgt_ix": "8-1681_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_22",
            "tgt_ix": "8-1681_v1_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_22",
            "tgt_ix": "8-1681_v1_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_22",
            "tgt_ix": "8-1681_v1_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_22",
            "tgt_ix": "8-1681_v1_22@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_22",
            "tgt_ix": "8-1681_v1_22@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_23",
            "tgt_ix": "8-1681_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_23",
            "tgt_ix": "8-1681_v1_23@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_24",
            "tgt_ix": "8-1681_v1_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_25@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_25@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_25@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_25@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_25",
            "tgt_ix": "8-1681_v1_25@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_26",
            "tgt_ix": "8-1681_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_27",
            "tgt_ix": "8-1681_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_27",
            "tgt_ix": "8-1681_v1_27@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_27",
            "tgt_ix": "8-1681_v1_27@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_27",
            "tgt_ix": "8-1681_v1_27@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_27",
            "tgt_ix": "8-1681_v1_27@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_28",
            "tgt_ix": "8-1681_v1_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_28",
            "tgt_ix": "8-1681_v1_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_28",
            "tgt_ix": "8-1681_v1_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_29",
            "tgt_ix": "8-1681_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_30",
            "tgt_ix": "8-1681_v1_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_31",
            "tgt_ix": "8-1681_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_31",
            "tgt_ix": "8-1681_v1_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_31",
            "tgt_ix": "8-1681_v1_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_31",
            "tgt_ix": "8-1681_v1_31@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_31",
            "tgt_ix": "8-1681_v1_31@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_32",
            "tgt_ix": "8-1681_v1_32@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_33",
            "tgt_ix": "8-1681_v1_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_33",
            "tgt_ix": "8-1681_v1_33@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_33",
            "tgt_ix": "8-1681_v1_33@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_34",
            "tgt_ix": "8-1681_v1_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_35",
            "tgt_ix": "8-1681_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_36",
            "tgt_ix": "8-1681_v1_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_37",
            "tgt_ix": "8-1681_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_37",
            "tgt_ix": "8-1681_v1_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_38",
            "tgt_ix": "8-1681_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_39",
            "tgt_ix": "8-1681_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_39",
            "tgt_ix": "8-1681_v1_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_39",
            "tgt_ix": "8-1681_v1_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_39",
            "tgt_ix": "8-1681_v1_39@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_39",
            "tgt_ix": "8-1681_v1_39@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_40",
            "tgt_ix": "8-1681_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_41",
            "tgt_ix": "8-1681_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_42",
            "tgt_ix": "8-1681_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_42",
            "tgt_ix": "8-1681_v1_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_42",
            "tgt_ix": "8-1681_v1_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_42",
            "tgt_ix": "8-1681_v1_42@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_42",
            "tgt_ix": "8-1681_v1_42@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_42",
            "tgt_ix": "8-1681_v1_42@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_42",
            "tgt_ix": "8-1681_v1_42@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_42",
            "tgt_ix": "8-1681_v1_42@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_43",
            "tgt_ix": "8-1681_v1_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_45",
            "tgt_ix": "8-1681_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_45",
            "tgt_ix": "8-1681_v1_45@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_45",
            "tgt_ix": "8-1681_v1_45@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_45",
            "tgt_ix": "8-1681_v1_45@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_45",
            "tgt_ix": "8-1681_v1_45@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_45",
            "tgt_ix": "8-1681_v1_45@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_46",
            "tgt_ix": "8-1681_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_48@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_48@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_48@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_48@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_48@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_48@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_48@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_48",
            "tgt_ix": "8-1681_v1_48@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_49",
            "tgt_ix": "8-1681_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_51",
            "tgt_ix": "8-1681_v1_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_52",
            "tgt_ix": "8-1681_v1_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_52",
            "tgt_ix": "8-1681_v1_52@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_52",
            "tgt_ix": "8-1681_v1_52@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_52",
            "tgt_ix": "8-1681_v1_52@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_53",
            "tgt_ix": "8-1681_v1_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_53",
            "tgt_ix": "8-1681_v1_53@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_53",
            "tgt_ix": "8-1681_v1_53@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_53",
            "tgt_ix": "8-1681_v1_53@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_54",
            "tgt_ix": "8-1681_v1_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_56",
            "tgt_ix": "8-1681_v1_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_56",
            "tgt_ix": "8-1681_v1_56@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_56",
            "tgt_ix": "8-1681_v1_56@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_56",
            "tgt_ix": "8-1681_v1_56@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_57",
            "tgt_ix": "8-1681_v1_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_59",
            "tgt_ix": "8-1681_v1_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_60",
            "tgt_ix": "8-1681_v1_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_61",
            "tgt_ix": "8-1681_v1_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_61",
            "tgt_ix": "8-1681_v1_61@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_62@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_62@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_62@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_62@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_62@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_62@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_62@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_62",
            "tgt_ix": "8-1681_v1_62@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_63",
            "tgt_ix": "8-1681_v1_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_63",
            "tgt_ix": "8-1681_v1_63@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_63",
            "tgt_ix": "8-1681_v1_63@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_63",
            "tgt_ix": "8-1681_v1_63@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_64",
            "tgt_ix": "8-1681_v1_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_64",
            "tgt_ix": "8-1681_v1_64@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_65",
            "tgt_ix": "8-1681_v1_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_65",
            "tgt_ix": "8-1681_v1_65@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_65",
            "tgt_ix": "8-1681_v1_65@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_65",
            "tgt_ix": "8-1681_v1_65@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_65",
            "tgt_ix": "8-1681_v1_65@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_66",
            "tgt_ix": "8-1681_v1_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_66",
            "tgt_ix": "8-1681_v1_66@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_66",
            "tgt_ix": "8-1681_v1_66@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_67",
            "tgt_ix": "8-1681_v1_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_67",
            "tgt_ix": "8-1681_v1_67@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_67",
            "tgt_ix": "8-1681_v1_67@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_67",
            "tgt_ix": "8-1681_v1_67@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_68",
            "tgt_ix": "8-1681_v1_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_68",
            "tgt_ix": "8-1681_v1_68@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_68",
            "tgt_ix": "8-1681_v1_68@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_68",
            "tgt_ix": "8-1681_v1_68@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_69",
            "tgt_ix": "8-1681_v1_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_69",
            "tgt_ix": "8-1681_v1_69@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_70",
            "tgt_ix": "8-1681_v1_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_71",
            "tgt_ix": "8-1681_v1_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_71",
            "tgt_ix": "8-1681_v1_71@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_72",
            "tgt_ix": "8-1681_v1_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_72",
            "tgt_ix": "8-1681_v1_72@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_73",
            "tgt_ix": "8-1681_v1_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_73",
            "tgt_ix": "8-1681_v1_73@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_73",
            "tgt_ix": "8-1681_v1_73@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_73",
            "tgt_ix": "8-1681_v1_73@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_74",
            "tgt_ix": "8-1681_v1_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_75",
            "tgt_ix": "8-1681_v1_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_76",
            "tgt_ix": "8-1681_v1_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_77",
            "tgt_ix": "8-1681_v1_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_78",
            "tgt_ix": "8-1681_v1_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_79",
            "tgt_ix": "8-1681_v1_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_80",
            "tgt_ix": "8-1681_v1_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_81",
            "tgt_ix": "8-1681_v1_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_82",
            "tgt_ix": "8-1681_v1_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_83",
            "tgt_ix": "8-1681_v1_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_84",
            "tgt_ix": "8-1681_v1_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_85",
            "tgt_ix": "8-1681_v1_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_86",
            "tgt_ix": "8-1681_v1_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_87",
            "tgt_ix": "8-1681_v1_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_88",
            "tgt_ix": "8-1681_v1_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_89",
            "tgt_ix": "8-1681_v1_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_90",
            "tgt_ix": "8-1681_v1_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_91",
            "tgt_ix": "8-1681_v1_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_92",
            "tgt_ix": "8-1681_v1_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_93",
            "tgt_ix": "8-1681_v1_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_94",
            "tgt_ix": "8-1681_v1_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_95",
            "tgt_ix": "8-1681_v1_95@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_96",
            "tgt_ix": "8-1681_v1_96@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_97",
            "tgt_ix": "8-1681_v1_97@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_98",
            "tgt_ix": "8-1681_v1_98@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_99",
            "tgt_ix": "8-1681_v1_99@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_100",
            "tgt_ix": "8-1681_v1_100@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_101",
            "tgt_ix": "8-1681_v1_101@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_102",
            "tgt_ix": "8-1681_v1_102@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_103",
            "tgt_ix": "8-1681_v1_103@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_104",
            "tgt_ix": "8-1681_v1_104@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_105",
            "tgt_ix": "8-1681_v1_105@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_106",
            "tgt_ix": "8-1681_v1_106@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_107",
            "tgt_ix": "8-1681_v1_107@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_108",
            "tgt_ix": "8-1681_v1_108@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_109",
            "tgt_ix": "8-1681_v1_109@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "8-1681_v1_110",
            "tgt_ix": "8-1681_v1_110@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "8-1681_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.20496.1",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Comparison of human population receptive field estimates between scanners and the effect of temporal filtering",
        "abstract": "Background: Population receptive field (pRF) analysis with functional magnetic resonance imaging (fMRI) is an increasingly popular method for mapping visual field representations and estimating the spatial selectivity of voxels in human visual cortex. However, the multitude of experimental setups and processing methods used makes comparisons of results between studies difficult. Methods: Here, we compared pRF maps acquired in the same three individuals using comparable scanning parameters on a 1.5 and a 3 Tesla scanner located in two different countries. We also tested the effect of low-pass filtering of the time series on pRF estimates. Results: As expected, the signal-to-noise ratio for the 3 Tesla data was superior; critically, however, estimates of pRF size and cortical magnification did not reveal any systematic differences between the sites. Unsurprisingly, low-pass filtering enhanced goodness-of-fit, presumably by removing high-frequency noise. However, there was no substantial increase in the number of voxels containing meaningful retinotopic signals after low-pass filtering. Importantly, filtering also increased estimates of pRF size in the early visual areas which could substantially skew interpretations of spatial tuning properties. Conclusion: Our results therefore suggest that pRF estimates are generally comparable between scanners of different field strengths, but temporal filtering should be used with caution.",
        "contributors": [
            {
                "surname": "Morgan",
                "given-names": "Catherine"
            },
            {
                "surname": "Schwarzkopf",
                "given-names": "D. Samuel"
            }
        ],
        "url": "https://f1000research.com/articles/8-1681/v1/",
        "doc_id": "8-1681",
        "version": 1,
        "ix_counter": 468,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}