{
    "nodes": [
        {
            "ix": "6-2178_v2_0",
            "content": "Patent foramen ovale closure versus medical therapy for stroke prevention: A systematic review and meta-analysis of randomized controlled trials",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_2",
            "content": "Background: Previous randomized trials on patent foramen ovale (PFO) closure versus medical therapy for stroke prevention were inconclusive. Recently, two new randomized trials and new findings from an extended follow-up of a previous trial have been published on this topic. We conducted a systematic review and meta-analysis of randomized trials comparing PFO closure with medical therapy for stroke prevention.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_3",
            "content": "Methods: PubMed and Cochrane Library were searched until 16 th September 2017. The following search terms were used for PubMed: \"patent foramen ovale\" AND (stroke OR embolism) and \"randomized\" AND \"Trial\". For Cochrane Library, the following terms were used: \"patent foramen ovale\" AND \"closure\" AND (stroke OR embolism).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_4",
            "content": "Results: A total of 91 and 55 entries were retrieved from each database using our search strategy respectively, of which six studies on five trials met the inclusion criteria. This meta-analysis included 1829 patients in the PFO closure arm (mean age: 45.3 years; 54% male) and 1972 patients in the medical therapy arm (mean age: 45.1 years; 51% male). The median follow-up duration was 50 ± 30 months. When compared to medical therapy, PFO closure significantly reduced primary endpoint events with a risk ratio [RR] of 0.60 (95% CI: 0.44-0.83, P < 0.0001; I 2 : 15%). It also reduced stroke (RR: 0.50, 95% CI: 0.35-0.73, P < 0.0001; I 2 : 32%) despite increasing the risk of atrial fibrillation/flutter (RR: 1.90, 95% CI: 1.23-2.93, P < 0.01; I 2 : 43%). However, it did not reduce transient ischemic accident events (0.75; 95% CI: 0.51-1.10, P = 0.14; I 2 : 0%), all-cause bleeding (RR: 0.89; 95% CI: 0.44-1.78, P = 0.74; I 2 : 51%) or gastrointestinal complications (RR: 0.92; 95% CI: 0.32-2.70, P = 0.88; I 2 : 0%).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_5",
            "content": "Conclusions: PFO closure significantly reduces risk of stroke when compared to medical treatment and should therefore be considered for stroke prevention in PFO patients.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_6",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_7",
            "content": "The association between the presence of a patent foramen ovale (PFO) and cryptogenic stroke has been established by previous case-control studies <REF-1> . However, whether PFO closure is effective in reducing stroke events when compared to medical therapy is controversial. Three randomized trials, the STARFlex Septal Closure in Patients with a Stroke and/or Transient Ischemic Attack due to Presumed Paradoxical Embolism through a PFO (CLOSURE I) <REF-2> , the Clinical Trial Comparing Percutaneous Closure of PFO Using the Amplatzer PFO Occluder with Medical Treatment in Patients with Cryptogenic Embolism (PC) <REF-3> and the Randomized Evaluation of Recurrent Stroke Comparing PFO Closure to Established Current Standard of Care Treatment (RESPECT) <REF-4> , were conducted. All of these trials showed numerically fewer events in the primary intention-to-treat analysis, but this did not reach statistical significance. Recently, two trials have focused on this issue. Firstly, the PFO Closure or Anticoagulants versus Antiplatelet Therapy to Prevent Stroke Recurrent (CLOSE) trial evaluated PFO closure or anticoagulation against antiplatelet therapy, with a primary endpoint of fatal or non-fatal stroke <REF-5> . Secondly, the Gore Helex septal occlude and antiplatelet medical management of reduction of recurrent stroke or imaging-confirmed transient ischemic attack in patients with PFO (REDUCE) trial compared PFO closure to antiplatelet therapy only, with a primary endpoint of ischemic stroke, new ischemic stroke or silent brain infarction, demonstrating significant reductions in these events compared to antiplatelet therapy <REF-6> . Moreover, long-term data of the RESPECT trial were recently published <REF-7> . Given these new findings, we conducted a systematic review and meta-analysis of these randomized trials to evaluate the benefits and complication rates in PFO closure versus medical therapy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_8",
            "content": "Methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_9",
            "content": "Search strategy, inclusion and exclusion criteria",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_10",
            "content": "The meta-analysis was performed according to the Preferred Reporting Items for Systematic Reviews and Meta-Analyses statement ( PRISMA ; a completed checklist can be found in Supplementary File 1 ). PubMed and Cochrane Library were searched for randomized trials that compared the efficacy in stroke prevention of PFO closure with that of medical therapy. The following search terms were used for PubMed: \"patent foramen ovale\" AND (stroke OR embolism) and \"randomized\" AND \"Trial\". For Cochrane Library, the following terms were used: \"patent foramen ovale\" AND \"closure\" AND (stroke OR embolism). The search period was from the beginning of the databases through to 16 th September 2017, with no language restrictions.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_11",
            "content": "The following inclusion criteria were applied: i) the design was a randomized trial in humans, ii) the study compared stroke outcomes for PFO closure versus medical therapy. Quality assessment of randomized controlled trials was performed using the Cochrane Risk Assessment Tool ( Supplementary Figure 1 and Supplementary Figure 2 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_12",
            "content": "Data extraction and statistical analysis",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_13",
            "content": "Data from the different studies were entered in Microsoft Excel (2016 Version). All publications extracted from the search strategy were assessed for compliance with the inclusion criteria. In this meta-analysis, the extracted data elements consisted of: i) trial name; ii) follow-up duration; iii) quality score; and iv) characteristics of the population, including sample size, sex and age. Two reviewers (GT and MG) independently reviewed each included study and disagreements were resolved by adjudication with input from a third reviewer (TL).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_14",
            "content": "The number of events for: i) primary endpoint, ii) stroke, iii) transient ischemic attack (TIA), iv) all-cause bleeding complications, v) gastrointestinal complications [bleeding, ulceration, ulcer perforation], vi) short-term AF or AFL, vii) long-term AF or AFL, viii) venous thromboembolism, were identified and extracted independently by each reviewer from each trial. The Comprehensive Meta-Analysis Software (Version 2) was used for subsequent meta-analyses and statistical analyses. The event rates (events per patient-year) were used to calculate rate ratios for each study, which were pooled in subsequent meta-analyses.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_15",
            "content": "Heterogeneity across studies was assessed using the I 2 statistic from the standard chi-square test, which describes the percentage of the variability in the effect estimates resulting from heterogeneity. I 2 > 50% was considered to reflect significant statistical heterogeneity and in such cases the random-effects model was used. To identify the origin of the heterogeneity, sensitivity analysis excluding one study at a time. Funnel plots showing standard errors against the logarithms of the odds ratio were constructed. Begg and Mazumdar rank correlation test was used to test for publication bias and the Egger’s test were used to detect publication bias.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_16",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_17",
            "content": "A flow diagram detailing the above search terms with inclusion and exclusion criteria is depicted in Figure 1 . A total of 91 and 55 studies were retrieved from PubMed and Cochrane Library, respectively. Of these, six studies met our inclusion criteria <REF-3> – <REF-8> . These were based on the following trials: CLOSURE I, PC, CLOSE, RESPECT and REDUCE. The original publication on the RESPECT trial was excluded because an update on longer term results was recently published <REF-7> . Therefore, a total of five studies were included in this meta-analysis <REF-2> – <REF-6> . The baseline characteristics of these studies are listed in Supplementary Table 1 . This meta-analysis included 1829 patients in the PFO closure arm (mean age: 45.3 years; 54% male; mean follow-up duration 50 ± 30 months) and 1972 patients in the medical therapy arm (mean age: 45.1 years; 51% male; mean follow-up duration 50 ± 31 months). For the meta-analyses, event rates (events per patient-year) were extracted and used to calculate rate ratios. The results of the statistical treatment of this meta-analysis are detailed in Supplementary File 2 , with those of sensitivity analyses by the leave-one-out method described in Supplementary Figure 3 – Supplementary Figure 8 . Funnel plots plotting standard errors against the logarithms of the risk ratios are shown in Supplementary Figure 9 – Supplementary Figure 14 . In all of the analyses, Begg and Mazumdar rank correlation test suggested no significant publication bias (P > 0.05) and the Egger’s test demonstrated no asymmetry (P > 0.05).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_18",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Flowchart of the database search and study selection process.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_19",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Flowchart of the database search and study selection process.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Flowchart of the database search and study selection process.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_20",
            "content": "PFO closure and primary endpoint(s), stroke and TIA events",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_21",
            "content": "All five trials compared the primary endpoints in PFO closure versus medical therapy. The different trials used slightly different primary endpoints ( Supplementary Table 2 ), as follows: 1) CLOSURE I trial: stroke, TIA, 30-day mortality, neurology-related death, 2) PC trial: stroke, TIA, death, peripheral embolism, 3) CLOSE trial: fatal or non-fatal stroke, 4) RESPECT trial: nonfatal ischemic stroke, fatal ischemic stroke, or early death after randomization and 5) REDUCE trial: co-primary endpoints of i) ischemic stroke, and ii) new ischemic stroke or silent brain infarction. Among the 1829 subjects who underwent PFO closure, 70 (3.8%) met the primary endpoint ( Supplementary Table 3 ). By contrast, 112 of the 1972 subjects receiving medical therapy (5.7%) met the primary endpoint. Our meta-analysis shows that PFO closure significantly reduced primary endpoint events when compared to medical therapy with a rate ratio [RR] of 0.60 (95% CI: 0.44-0.83, P < 0.0001; I 2 : 15%) ( Figure 2 , top panel). Using hazard ratios [HR] from the trials produced negligible differences from our event rate analyses (HR: 0.61; 95% CI: 0.45-0.83, P < 0.01; I 2 : 0%).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_22",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Rate ratios for primary endpoint(s) (top), strokes (middle) and transient ischemic attacks (TIAs; bottom) in patent foramen ovale (PFO) closure versus medical therapy.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_23",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Rate ratios for primary endpoint(s) (top), strokes (middle) and transient ischemic attacks (TIAs; bottom) in patent foramen ovale (PFO) closure versus medical therapy.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Rate ratios for primary endpoint(s) (top), strokes (middle) and transient ischemic attacks (TIAs; bottom) in patent foramen ovale (PFO) closure versus medical therapy.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_24",
            "content": "Subgroup analyses were performed for the primary endpoint based on atrial septal aneurysm and shunt size by pooling hazard ratios from the subgroup analyses of the included studies. PFO closure was not significantly better than medical therapy for patients with an atrial septal aneurysm (HR: 0.46; 95% CI: 0.14-1.60, P = 0.22; I 2 : 62%, Supplementary Figure 15 ) or without an atrial septal aneurysm (HR: 0.74; 95% CI: 0.47-1.17, P = 0.19; I 2 : 0%, Supplementary Figure 16 ). By contrast, PFO closure significantly reduced primary endpoint events in patients with large shunt size (HR: 0.27, 95% CI: 0.14-0.54, P < 0.0001; I 2 : 0%, Supplementary Figure 17 ) but not in those with small shunt size (HR: 0.80, 95% CI: 0.49-1.31; P = 0.38; I 2 : 0%, Supplementary Figure 18 )",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_25",
            "content": "All five trials compared the stroke events in PFO closure versus medical therapy. The different trials used slightly different primary endpoints, as follows: 1) CLOSURE I trial: acute focal neurological event that is magnet resonance imaging (MRI) positive, regardless of duration of clinical symptoms, or if imaging cannot be performed for confirmation, it was defined as a persistent focal neurological deficit lasting longer than 24 hours; 2) PC trial: any neurologic deficit lasting for >24 hours typically with documentation in MRI or computer tomography (CT); 3) CLOSE trial: sudden onset of focal neurological symptoms with the presence of cerebral infarction in the appropriate territory on brain imaging (CT or MRI), regardless of the duration of the symptoms (less than or greater than 24 hours); 4) RESPECT trial: ischemic stroke was defined as an acute focal neurologic deficit, which was presumed to be due to focal ischemia, and either symptoms that persisted for 24 hours or longer or symptoms that persisted for less than 24 hours but were associated with findings of a new, neuroanatomically relevant, cerebral infarct on MRI or CT; and 5) REDUCE trial: an acute focal neurologic deficit, presumably due to ischemia, that either resulted in clinical symptoms lasting 24 hours or more or was associated with evidence of relevant infarction on MRI or, if MRI could not be performed, CT of the brain. Taken together data from all five trials, stroke occurred in 45 patients (2.5%) in the PFO closure group, but in 102 patients (5.2%) in the medical therapy group. This gave a RR of 0.50 that was statistically significant (95% CI: 0.35-0.73, P < 0.0001; I 2 : 32%) ( Figure 2 , middle panel). Using HR from the trials produced negligible differences from our event rate analyses (HR: 0.49, 95% CI: 0.34-0.71, P < 0.01; I 2 : 30%).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_26",
            "content": "TIAs were assessed in all five trials and the various definitions are shown in Supplementary Table 2 . These occurred in 44 patients (2.4%) in the PFO closure group and in 67 patients (3.4%) of the medical therapy group ( Supplementary Table 3 ). There was no statistically significant difference in the RR (0.75; 95% CI: 0.51-1.10, P = 0.14; I 2 : 0%) ( Figure 2 , bottom panel). Hazard ratios were available from four trials on TIAs, with a pooled HR of 0.73 (95% CI: 0.49-1.09, P = 0.13; I 2 : 0%).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_27",
            "content": "Adverse events in PFO closure group compared to medical therapy group",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_28",
            "content": "AF or AFL was detected in 76 patients in the PFO closure group (4.2%) and 37 patients (1.9%) in the medical therapy group ( Supplementary Table 4 ). These equated to a significant increase in the risk when PFO closure was used (RR: 1.90, 95% CI: 1.23-2.93, P < 0.01; I 2 : 43%) ( Figure 3 , top panel). Subgroup analysis was performed for the type of AF or AFL by dividing the episodes into i) paroxysmal or minor, and ii) permanent or major [as defined by the individual trials]. This revealed that most of the episodes were only paroxysmal or minor for the PFO group (3.0%) when compared to the medical therapy group (0.6%) (RR: 7.70, 95% CI: 2.30-19.77; P < 0.0001; I 2 : 32%) ( Figure 3 , middle panel). Permanent or serious AF or AFL occurred in 1.3% in the PFO closure group compared to 0.4% in the medical therapy group without significance between these groups (RR: 2.19, 95% CI: 0.94-5.01; P = 0.07; I 2 : 0%) ( Figure 3 , bottom panel).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_29",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "Rate ratios for atrial fibrillation or flutter (all types: top; paroxysmal or minor: middle; permanent or major: bottom) in patent foramen ovale (PFO) closure versus medical therapy.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_30",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>Rate ratios for atrial fibrillation or flutter (all types: top; paroxysmal or minor: middle; permanent or major: bottom) in patent foramen ovale (PFO) closure versus medical therapy.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "Rate ratios for atrial fibrillation or flutter (all types: top; paroxysmal or minor: middle; permanent or major: bottom) in patent foramen ovale (PFO) closure versus medical therapy.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_31",
            "content": "All bleeding complications were counted from the included studies ( Supplementary Table 5 ). These were comparable between the groups, occurring in 39 (2.1%) of the PFO closure group and 47 (2.4%) in the medical therapy group, with no significant difference between them (RR: 0.89; 95% CI: 0.44-1.78, P = 0.74; I 2 : 51%) ( Figure 4 , top panel). Three trials reported gastrointestinal complications of hemorrhage, ulceration or ulcer perforation ( Supplementary Table 5 ), which occurred in 7 and 8 patients in the PFO closure and medical therapy groups (0.4% for both arms). Therefore, the risk of gastrointestinal complications was not reduced by PFO closure (RR: 0.92; 95% CI: 0.32-2.70, P = 0.88; I 2 : 0%) ( Figure 4 , bottom panel). Venous thromboembolism, which comprised events of pulmonary embolism and deep venous thrombosis, were also counted from the included studies ( Supplementary Table 6 ). Two trials, RESPECT and REDUCE trials, reported venous thromboembolism, which occurred in 20 and 6 patients in the PFO closure and medical therapy groups.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_32",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Rate ratios for bleeding (top) and gastrointestinal complications (bottom) in patent foramen ovale (PFO) closure versus medical therapy.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_33",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <title>Rate ratios for bleeding (top) and gastrointestinal complications (bottom) in patent foramen ovale (PFO) closure versus medical therapy.</title> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Rate ratios for bleeding (top) and gastrointestinal complications (bottom) in patent foramen ovale (PFO) closure versus medical therapy.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/17114/3e674f91-9640-45ad-a8a5-07cc0ebdfa5d_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_34",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_35",
            "content": "The key findings of this meta-analysis are that, compared to medical therapy, PFO closure significantly reduced primary endpoints by 40% and strokes by 50%, and had comparable risks of TIAs. Nevertheless, these benefits were observed despite a two-fold increase in the risk of AF or AFL in the PFO closure group. No difference in the risks of bleeding or gastrointestinal complications (bleeding, ulceration or ulcer perforation) was observed.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_36",
            "content": "The foramen ovale remains open in about 25% of the healthy population, giving rise to a PFO <REF-9> . PFO can be asymptomatic, but potentially causes cryptogenic strokes mainly through the mechanism of paradoxical embolization. PFO closure is used either for primary or secondary prevention of stroke. It has been proposed that PFO closure is an effective treatment to prevent recurrent stroke or TIA in patients with cryptogenic stroke if the shunt grade of the PFO is greater than moderate <REF-10> . Long-term follow-up following percutaneous PFO closure for presumed paradoxical embolism have demonstrated very low recurrence rates <REF-11> , <REF-12> . Eustachian valve, Chiari’s network, medium-large shunt on trans-esophageal echocardiography, hypertension, age and the Essen stroke risk score have been associated with recurrent neurological events <REF-12> – <REF-14> . Medical treatment using antiplatelets or anticoagulants is an acceptable, alternative approach. A recent meta-analysis reported that anticoagulant therapy was more effective than antiplatelet therapy in preventing recurrent stroke and/or TIA, but with a 6-fold greater risk of major bleeding <REF-15> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_37",
            "content": "The evidence from real-world studies has also been controversial. A small cohort including 159 patients <55 years old with cryptogenic stroke who received PFO closure or medical therapy did not show a statistically significant difference in the recurrence of ischemic events during a mean follow-up of 51.6 months <REF-16> . In addition, in another small cohort including 164 patients with PFO and cryptogenic stroke the two groups (PFO closure vs. medical treatment) did not differ in regard to the composite end-point of death, stroke, TIA or peripheral embolism <REF-17> . Similarly, data of the IPSYS registry, which included 521 patients aged 18–45 years old with cryptogenic stroke and PFO, showed no significant difference neither in composite end-point [ischemic stroke, TIA or peripheral embolism (P=0.285)] nor in brain ischemia (p=0.168) between PFO closure and medical treatment groups <REF-18> . Additionally, Mirzada and colleagues did not find a difference regarding recurrent stroke or TIA between PFO closure and medical treatment groups <REF-19> . Most of studies about PFO closure included young patients (<55 years old). A recent study, compared the outcomes of PFO closure between a young (<55 years old) and an old group (>55 years old) of patients <REF-20> . It was found that in older patients, PFO closure was as safe as in younger patients, but recurrent cerebral ischemia was more frequent and likely this is associated to conditions related to age than to paradoxical embolism <REF-20> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_38",
            "content": "Previous meta-analyses of randomized trials have found no statistically significant differences between PFO closure and medical therapy in the prevention of recurrent ischemic stroke <REF-21> – <REF-24> , whilst PFO closure was associated with an increased risk of AF <REF-21> , <REF-24> . By contrast, others have reported some benefits. For example, a patient-level meta-analysis reported that PFO closure reduced recurrent stroke and had a statistically significant effect on the composite of stroke, TIA, and mortality in adjusted analyses <REF-25> . Moreover, another reported a 50% relative reduction of stroke and/or TIA versus antiplatelet therapy and by 82% relative reduction of major bleeding versus anticoagulant therapy <REF-15> , whilst another reported that significant reductions in recurrent neurological events in intention-to-treat, per-protocol and as-treated cohorts <REF-26> . A recent meta-analysis also reported that in comparison with medical treatment, PFO prevents recurrent stroke and TIA <REF-27> . Further, another recent meta-analysis reported that in patients with PFO and cryptogenic stroke, transcatheter device closure decreases risk of recurrent stroke compared with medical therapy alone <REF-28> . By contrast, anther meta-analysis reported that PFO reduced the risk of stroke, but not TIA, mortality, major bleeding and increased the risk of AF <REF-29> . By pooling together data from two additional trials, our meta-analysis provides a firm conclusion that PFO closure produces a statistically significant reduction in the risk of not only primary endpoints, but also that of strokes. On subgroup analysis, we found that PFO closure significantly reduced primary endpoint events in patients with large shunt size, but not in those with small shunt size. Moreover, although PFO closure was no more effective in reducing TIAs when compared to medical therapy, what is important is that stroke, which is responsible for significant morbidity as well as mortality, was prevented. These benefits are also observed in real-world studies. For example, a long-term propensity score-matched comparison of PFO closure with medical therapy showed a mortality benefit <REF-30> . These data also raise the issue regarding the benefit of primary prevention in cases with high-risk PFO <REF-31> . Such a simple intervention might indeed be effective in preventing the first stroke event. As such, based on the results of our meta-analysis, it supports the need to primarily prevent high-risk PFO with PFO closure procedures instead of providing medical therapy. This approach is further by the increasing simplicity and success rates of the PFO closure procedure <REF-32> . Despite the clear benefits, potential complications of PFO closure should be noted. For example, in the RESPECT trial, a significant increase in pulmonary emboli were observed (12 in the PFO closure group, of which 2 are listed as a complication of the procedure, vs. 3 in the control group) and deep venous thromboses (5 and 1, respectively). While the mechanism leading to the increased risk remains unclear, it may be possibly attributable to inappropriate application of groin compression subsequent to PFO intervention. Our meta-analysis also confirmed the increased risk of AF following PFO closure. Its clinical relevance is less certain for two reasons, that 70–90% of these events occurred in the first month and did not persist beyond this timeframe, and stroke incidence was reduced despite this AF occurrence. While the majority of AF occurrences were transient AF, it is not known how much subsequent monitoring these patients underwent or whether they were anticoagulated as a result.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_39",
            "content": "In our meta-analysis of event rates for primary endpoint(s), low levels of heterogeneity were observed, which was probably due to the different definitions used across the trials. For example, two trials, CLOSURE I <REF-8> and PC <REF-3> , included mortality as part of the primary endpoint, whereas the remaining three trials, CLOSE <REF-5> , RESPECT <REF-4> and REDUCE <REF-6> , included ischemic stroke events but not mortality. The medical therapy offered was similar across the studies, involving anticoagulation, antiplatelet therapy, or both. For the CLOSE trial, the investigators compared antiplatelet therapy with either anticoagulation therapy or PFO closure. For this particular trial, we had pooled data from both anticoagulation and antiplatelet therapy together, and compared the event rates with the PFO closure group. The present meta-analysis also demonstrates the safety of PFO closure when compared to more conservative medical therapy.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_40",
            "content": "Strengths and limitations of the included trials and this meta-analysis",
            "ntype": "title",
            "meta": {
                "section": "4.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_41",
            "content": "However, there are some limitations inherent to the trials themselves. Firstly, the crossover rate is substantial. For example, in REDUCE 6.3% of study subjects crossed over from PFO-closure to medical treatment and 6.3% did the opposite. Secondly, actual mechanical and anatomical closure of the PFO is of paramount importance to prevent recurrent paradoxical embolization. The different trials had different degrees of successful closure (e.g. REDUCE trial: 75%; CLOSURE trial: 86%; CLOSE trial: 93%) but these were not related to outcomes. Secondly, the definitions of TIA were different between the trials, which could have contributed to the between-study heterogeneity. Finally, the trials had large proportions of study subjects who were lost to follow-up, withdrew consent and crossed over to the other study arm, leading to uncertainty in the reported event rates.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_42",
            "content": "There are many strengths of this meta-analysis study. It is the largest meta-analysis of randomized trials to date, including more than 3800 participants from five trials. Moreover, the follow-up duration was sufficiently long for events to be detected. Our quality analysis indicated that the studies had a low risk of bias. Low levels of heterogeneity were observed for most of our analyses, including primary endpoints, strokes, TIAs and gastrointestinal complications. These indicate that it was appropriate to pool these studies together. However, several limitations inherent in the present meta-analysis should be noted. Firstly, the meta-analysis of all-cause bleeding across the trials showed a high level of heterogeneity, which may be clinical in nature, especially when different types of bleeding were measured. Secondly, there is an imbalance between events and lost-to-follow-up/withdrawals <REF-33> . In most trials, the ratio between the two is often in the region of 5 to 1, but is around 0.3 to 1 in the trials included in this meta-analysis. Moreover, publication bias results should be interpreted with caution as publication bias with less than ten studies is not recommended, but the results are presented here for the sake of completeness. Furthermore, there was a moderate degree of heterogeneity for the atrial septal aneurysm vs. no aneurysm comparison. Since our aim was to compare the effectiveness of PFO closure to medical treatment, we did not perform additional analysis by medical group assignment, such as comparing antiplatelet or anticoagulant therapy to PFO closure. The majority of medical management patients were treated with antiplatelet medications, with a minority treated with oral anticoagulation. Since the presumed mechanism of stroke attributable to PFO is paradoxical embolus from venous thrombi, or in situ thrombus formation, oral anticoagulants may be more effective for those causes. Where reported in individual trials, stroke outcome events were numerically less when medical management was with oral anticoagulation. Further analyses are needed to compare PFO closure with anticoagulation treatment alone as this was beyond the scope of the current study.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_43",
            "content": "Conclusions",
            "ntype": "title",
            "meta": {
                "section": "5",
                "sec-type": "conclusions",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_44",
            "content": "PFO closure significantly reduces the risk of primary endpoints, strokes, but not TIAs, when compared to medical treatment, despite higher rates of AF or AFL being observed. No differences in bleeding or gastrointestinal complications were detected between the two arms. PFO closure should therefore be considered for prevention of stroke in patients with PFO, especially in those presenting with cryptogenic stroke, who are less than 60 years of age with moderate to severe shunting.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_45",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_46",
            "content": "All data required for reproducibility of this study are available from published studies.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_47",
            "content": "<REF-1> Gillow SJ Lee VH : PFO Closure for Cryptogenic Stroke. Curr Atheroscler Rep. 2015 ; 17 ( 8 ): 45 . 26076907 10.1007/s11883-015-0525-6",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_48",
            "content": "<REF-2> Furlan AJ Reisman M Massaro J : Closure or medical therapy for cryptogenic stroke with patent foramen ovale. N Engl J Med. 2012 ; 366 ( 11 ): 991 – 999 . 22417252 10.1056/NEJMoa1009639",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_49",
            "content": "<REF-3> Meier B Kalesan B Mattle HP : Percutaneous closure of patent foramen ovale in cryptogenic embolism. N Engl J Med. 2013 ; 368 ( 12 ): 1083 – 91 . 23514285 10.1056/NEJMoa1211716",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_50",
            "content": "<REF-4> Saver JL Carroll JD Thaler DE : Long-Term Outcomes of Patent Foramen Ovale Closure or Medical Therapy after Stroke. N Engl J Med. 2017 ; 377 ( 11 ): 1022 – 1032 . 28902590 10.1056/NEJMoa1610057",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_51",
            "content": "<REF-5> Mas JL Derumeaux G Guillon B : Patent Foramen Ovale Closure or Anticoagulation vs. Antiplatelets after Stroke. N Engl J Med. 2017 ; 377 ( 11 ): 1011 – 1021 . 28902593 10.1056/NEJMoa1705915",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_52",
            "content": "<REF-6> Søndergaard L Kasner SE Rhodes JF : Patent Foramen Ovale Closure or Antiplatelet Therapy for Cryptogenic Stroke. N Engl J Med. 2017 ; 377 ( 11 ): 1033 – 1042 . 28902580 10.1056/NEJMoa1707404",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_53",
            "content": "<REF-7> Carroll JD Saver JL Thaler DE : Closure of patent foramen ovale versus medical therapy after cryptogenic stroke. N Engl J Med. 2013 ; 368 ( 12 ): 1092 – 100 . 23514286 10.1056/NEJMoa1301440",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_54",
            "content": "<REF-8> Furlan AJ Reisman M Massaro J : Closure or medical therapy for cryptogenic stroke with patent foramen ovale. N Engl J Med. 2012 ; 366 ( 11 ): 991 – 999 . 22417252 10.1056/NEJMoa1009639",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_55",
            "content": "<REF-9> Hagen PT Scholz DG Edwards WD : Incidence and size of patent foramen ovale during the first 10 decades of life: an autopsy study of 965 normal hearts. Mayo Clin Proc. 1984 ; 59 ( 1 ): 17 – 20 . 6694427 10.1016/S0025-6196(12)60336-X",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_56",
            "content": "<REF-10> Kim M Kim S Moon J : Effect of patent foramen ovale closure for prevention on recurrent stroke or transient ischemic attack in selected patients with cryptogenic stroke. J Interv Cardiol. 2018 ; 31 ( 3 ): 368 – 374 . 28833599 10.1111/joic.12430",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_57",
            "content": "<REF-11> Eeckhout E Martin S Delabays A : Very long-term follow-up after percutaneous closure of patent foramen ovale. EuroIntervention. 2015 ; 10 ( 12 ): 1474 – 9 . 24429213 10.4244/EIJV10I12A257",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_58",
            "content": "<REF-12> Inglessis I Elmariah S Rengifo-Moreno PA : Long-term experience and outcomes with transcatheter closure of patent foramen ovale. JACC Cardiovasc Interv. 2013 ; 6 ( 11 ): 1176 – 83 . 24262618 10.1016/j.jcin.2013.06.013",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_59",
            "content": "<REF-14> Rigatelli G Dell'avvocata F Braggion G : Persistent venous valves correlate with increased shunt and multiple preceding cryptogenic embolic events in patients with patent foramen ovale: an intracardiac echocardiographic study. Catheter Cardiovasc Interv. 2008 ; 72 ( 7 ): 973 – 6 . 19021284 10.1002/ccd.21761",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_60",
            "content": "<REF-15> Patti G Pelliccia F Gaudio C : Meta-analysis of net long-term benefit of different therapeutic strategies in patients with cryptogenic stroke and patent foramen ovale. Am J Cardiol. 2015 ; 115 ( 6 ): 837 – 43 . 25620037 10.1016/j.amjcard.2014.12.051",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_61",
            "content": "<REF-16> Danese A Stegagno C Tomelleri G : Clinical outcomes of secondary prevention strategies for young patients with cryptogenic stroke and patent foramen ovale. Acta Cardiol. 2017 ; 72 ( 4 ): 410 – 418 . 28705105 10.1080/00015385.2017.1307668",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_62",
            "content": "<REF-17> Moon J Kang WC Kim S : Comparison of Outcomes after Device Closure and Medication Alone in Patients with Patent Foramen Ovale and Cryptogenic Stroke in Korean Population. Yonsei Med J. 2016 ; 57 ( 3 ): 621 – 5 . 26996560 10.3349/ymj.2016.57.3.621 4800350",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_63",
            "content": "<REF-18> Pezzini A Grassi M Lodigiani C : Propensity Score-Based Analysis of Percutaneous Closure Versus Medical Therapy in Patients With Cryptogenic Stroke and Patent Foramen Ovale: The IPSYS Registry (Italian Project on Stroke in Young Adults). Circ Cardiovasc Interv. 2016 ; 9 ( 9 ): pii: e003470. 27582111 10.1161/CIRCINTERVENTIONS.115.003470",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_64",
            "content": "<REF-19> Mirzada N Ladenvall P Hansson PO : Recurrent stroke in patients with patent foramen ovale: An observational prospective study of percutaneous closure of PFO versus non-closure. Int J Cardiol. 2015 ; 195 : 293 – 9 . 26056962 10.1016/j.ijcard.2015.05.088",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_65",
            "content": "<REF-20> Scacciatella P Meynet I Presbitero P : Recurrent cerebral ischemia after patent foramen ovale percutaneous closure in older patients: A two-center registry study. Catheter Cardiovasc Interv. 2016 ; 87 ( 3 ): 508 – 14 . 26106024 10.1002/ccd.26053",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_66",
            "content": "<REF-21> Li J Liu J Liu M : Closure versus medical therapy for preventing recurrent stroke in patients with patent foramen ovale and a history of cryptogenic stroke or transient ischemic attack. Cochrane Database Syst Rev. 2015 ; ( 9 ): CD009938. 26346232 10.1002/14651858.CD009938.pub2",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_67",
            "content": "<REF-24> Udell JA Opotowsky AR Khairy P : Patent foramen ovale closure vs medical therapy for stroke prevention: meta-analysis of randomized trials and review of heterogeneity in meta-analyses. Can J Cardiol. 2014 ; 30 ( 10 ): 1216 – 24 . 25154803 10.1016/j.cjca.2014.05.004",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_68",
            "content": "<REF-25> Kent DM Dahabreh IJ Ruthazer R : Device Closure of Patent Foramen Ovale After Stroke: Pooled Analysis of Completed Randomized Trials. J Am Coll Cardiol. 2016 ; 67 ( 8 ): 907 – 17 . 26916479 10.1016/j.jacc.2015.12.023 4769377",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_69",
            "content": "<REF-26> Khan AR Bin Abdulhak AA Sheikh MA : Device closure of patent foramen ovale versus medical therapy in cryptogenic stroke: a systematic review and meta-analysis. JACC Cardiovasc Interv. 2013 ; 6 ( 12 ): 1316 – 1323 . 24139929 10.1016/j.jcin.2013.08.001",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_70",
            "content": "<REF-27> De Rosa S Sievert H Sabatino J : Percutaneous Closure Versus Medical Treatment in Stroke Patients With Patent Foramen Ovale: A Systematic Review and Meta-analysis. Ann Intern Med. 2018 ; 168 ( 5 ): 343 – 350 . 29310133 10.7326/M17-3033",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_71",
            "content": "<REF-28> Shah R Nayyar M Jovin IS : Device Closure Versus Medical Therapy Alone for Patent Foramen Ovale in Patients With Cryptogenic Stroke: A Systematic Review and Meta-analysis. Ann Intern Med. 2018 ; 168 ( 5 ): 335 – 342 . 29310136 10.7326/M17-2679",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_72",
            "content": "<REF-29> Ando T Holmes AA Pahuja M : Meta-Analysis Comparing Patent Foramen Ovale Closure Versus Medical Therapy to Prevent Recurrent Cryptogenic Stroke. Am J Cardiol. 2018 ; 121 ( 5 ): 649 – 655 . 29306484 10.1016/j.amjcard.2017.11.037",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_73",
            "content": "<REF-30> Wahl A Jüni P Mono ML : Long-term propensity score-matched comparison of percutaneous closure of patent foramen ovale with medical treatment after paradoxical embolism. Circulation. 2012 ; 125 ( 6 ): 803 – 12 . 22238228 10.1161/CIRCULATIONAHA.111.030494",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_74",
            "content": "<REF-31> Nietlispach F Meier B : Percutaneous closure of patent foramen ovale: safe and effective but underutilized. Expert Rev Cardiovasc Ther. 2015 ; 13 ( 2 ): 121 – 3 . 25556896 10.1586/14779072.2015.1000305",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_75",
            "content": "<REF-32> Neill J Lin CH : A Review of Transcatheter Closure of Patent Foramen Ovale. Methodist Debakey Cardiovasc J. 2017 ; 13 ( 3 ): 152 – 159 . 29744000 5935199",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "6-2178_v2_76",
            "content": "<REF-33> Dellborg M Eriksson P : Randomized trials of closure of persistent foramen ovale (PFO) vs medical therapy for patients with cryptogenic stroke - Effect of lost-to-follow-up and withdrawal of consent. Int J Cardiol. 2016 ; 207 : 308 – 9 . 26814634 10.1016/j.ijcard.2016.01.185",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "6-2178_v2_0@0",
            "content": "Patent foramen ovale closure versus medical therapy for stroke prevention: A systematic review and meta-analysis of randomized controlled trials",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_0",
            "start": 0,
            "end": 143,
            "label": {}
        },
        {
            "ix": "6-2178_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "6-2178_v2_2@0",
            "content": "Background: Previous randomized trials on patent foramen ovale (PFO) closure versus medical therapy for stroke prevention were inconclusive.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_2",
            "start": 0,
            "end": 139,
            "label": {}
        },
        {
            "ix": "6-2178_v2_2@1",
            "content": "Recently, two new randomized trials and new findings from an extended follow-up of a previous trial have been published on this topic.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_2",
            "start": 141,
            "end": 274,
            "label": {}
        },
        {
            "ix": "6-2178_v2_2@2",
            "content": "We conducted a systematic review and meta-analysis of randomized trials comparing PFO closure with medical therapy for stroke prevention.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_2",
            "start": 276,
            "end": 412,
            "label": {}
        },
        {
            "ix": "6-2178_v2_3@0",
            "content": "Methods: PubMed and Cochrane Library were searched until 16 th September 2017.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_3",
            "start": 0,
            "end": 77,
            "label": {}
        },
        {
            "ix": "6-2178_v2_3@1",
            "content": "The following search terms were used for PubMed: \"patent foramen ovale\" AND (stroke OR embolism) and \"randomized\" AND \"Trial\".",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_3",
            "start": 79,
            "end": 204,
            "label": {}
        },
        {
            "ix": "6-2178_v2_3@2",
            "content": "For Cochrane Library, the following terms were used: \"patent foramen ovale\" AND \"closure\" AND (stroke OR embolism).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_3",
            "start": 206,
            "end": 320,
            "label": {}
        },
        {
            "ix": "6-2178_v2_4@0",
            "content": "Results: A total of 91 and 55 entries were retrieved from each database using our search strategy respectively, of which six studies on five trials met the inclusion criteria.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_4",
            "start": 0,
            "end": 174,
            "label": {}
        },
        {
            "ix": "6-2178_v2_4@1",
            "content": "This meta-analysis included 1829 patients in the PFO closure arm (mean age: 45.3 years; 54% male) and 1972 patients in the medical therapy arm (mean age: 45.1 years; 51% male).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_4",
            "start": 176,
            "end": 351,
            "label": {}
        },
        {
            "ix": "6-2178_v2_4@2",
            "content": "The median follow-up duration was 50 ± 30 months.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_4",
            "start": 353,
            "end": 401,
            "label": {}
        },
        {
            "ix": "6-2178_v2_4@3",
            "content": "When compared to medical therapy, PFO closure significantly reduced primary endpoint events with a risk ratio [RR] of 0.60 (95% CI: 0.44-0.83, P < 0.0001; I 2 : 15%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_4",
            "start": 403,
            "end": 568,
            "label": {}
        },
        {
            "ix": "6-2178_v2_4@4",
            "content": "It also reduced stroke (RR: 0.50, 95% CI: 0.35-0.73, P < 0.0001; I 2 : 32%) despite increasing the risk of atrial fibrillation/flutter (RR: 1.90, 95% CI: 1.23-2.93, P < 0.01; I 2 : 43%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_4",
            "start": 570,
            "end": 755,
            "label": {}
        },
        {
            "ix": "6-2178_v2_4@5",
            "content": "However, it did not reduce transient ischemic accident events (0.75; 95% CI: 0.51-1.10, P = 0.14; I 2 : 0%), all-cause bleeding (RR: 0.89; 95% CI: 0.44-1.78, P = 0.74; I 2 : 51%) or gastrointestinal complications (RR: 0.92; 95% CI: 0.32-2.70, P = 0.88; I 2 : 0%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_4",
            "start": 757,
            "end": 1019,
            "label": {}
        },
        {
            "ix": "6-2178_v2_5@0",
            "content": "Conclusions: PFO closure significantly reduces risk of stroke when compared to medical treatment and should therefore be considered for stroke prevention in PFO patients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_5",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "6-2178_v2_6@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_6",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "6-2178_v2_7@0",
            "content": "The association between the presence of a patent foramen ovale (PFO) and cryptogenic stroke has been established by previous case-control studies <REF-1> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_7",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "6-2178_v2_7@1",
            "content": "However, whether PFO closure is effective in reducing stroke events when compared to medical therapy is controversial.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_7",
            "start": 156,
            "end": 273,
            "label": {}
        },
        {
            "ix": "6-2178_v2_7@2",
            "content": "Three randomized trials, the STARFlex Septal Closure in Patients with a Stroke and/or Transient Ischemic Attack due to Presumed Paradoxical Embolism through a PFO (CLOSURE I) <REF-2> , the Clinical Trial Comparing Percutaneous Closure of PFO Using the Amplatzer PFO Occluder with Medical Treatment in Patients with Cryptogenic Embolism (PC) <REF-3> and the Randomized Evaluation of Recurrent Stroke Comparing PFO Closure to Established Current Standard of Care Treatment (RESPECT) <REF-4> , were conducted.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_7",
            "start": 275,
            "end": 780,
            "label": {}
        },
        {
            "ix": "6-2178_v2_7@3",
            "content": "All of these trials showed numerically fewer events in the primary intention-to-treat analysis, but this did not reach statistical significance.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_7",
            "start": 782,
            "end": 925,
            "label": {}
        },
        {
            "ix": "6-2178_v2_7@4",
            "content": "Recently, two trials have focused on this issue.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_7",
            "start": 927,
            "end": 974,
            "label": {}
        },
        {
            "ix": "6-2178_v2_7@5",
            "content": "Firstly, the PFO Closure or Anticoagulants versus Antiplatelet Therapy to Prevent Stroke Recurrent (CLOSE) trial evaluated PFO closure or anticoagulation against antiplatelet therapy, with a primary endpoint of fatal or non-fatal stroke <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_7",
            "start": 976,
            "end": 1221,
            "label": {}
        },
        {
            "ix": "6-2178_v2_7@6",
            "content": "Secondly, the Gore Helex septal occlude and antiplatelet medical management of reduction of recurrent stroke or imaging-confirmed transient ischemic attack in patients with PFO (REDUCE) trial compared PFO closure to antiplatelet therapy only, with a primary endpoint of ischemic stroke, new ischemic stroke or silent brain infarction, demonstrating significant reductions in these events compared to antiplatelet therapy <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_7",
            "start": 1223,
            "end": 1652,
            "label": {}
        },
        {
            "ix": "6-2178_v2_7@7",
            "content": "Moreover, long-term data of the RESPECT trial were recently published <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_7",
            "start": 1654,
            "end": 1732,
            "label": {}
        },
        {
            "ix": "6-2178_v2_7@8",
            "content": "Given these new findings, we conducted a systematic review and meta-analysis of these randomized trials to evaluate the benefits and complication rates in PFO closure versus medical therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_7",
            "start": 1734,
            "end": 1923,
            "label": {}
        },
        {
            "ix": "6-2178_v2_8@0",
            "content": "Methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_8",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "6-2178_v2_9@0",
            "content": "Search strategy, inclusion and exclusion criteria",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_9",
            "start": 0,
            "end": 48,
            "label": {}
        },
        {
            "ix": "6-2178_v2_10@0",
            "content": "The meta-analysis was performed according to the Preferred Reporting Items for Systematic Reviews and Meta-Analyses statement ( PRISMA ; a completed checklist can be found in Supplementary File 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_10",
            "start": 0,
            "end": 197,
            "label": {}
        },
        {
            "ix": "6-2178_v2_10@1",
            "content": "PubMed and Cochrane Library were searched for randomized trials that compared the efficacy in stroke prevention of PFO closure with that of medical therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_10",
            "start": 199,
            "end": 354,
            "label": {}
        },
        {
            "ix": "6-2178_v2_10@2",
            "content": "The following search terms were used for PubMed: \"patent foramen ovale\" AND (stroke OR embolism) and \"randomized\" AND \"Trial\".",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_10",
            "start": 356,
            "end": 481,
            "label": {}
        },
        {
            "ix": "6-2178_v2_10@3",
            "content": "For Cochrane Library, the following terms were used: \"patent foramen ovale\" AND \"closure\" AND (stroke OR embolism).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_10",
            "start": 483,
            "end": 597,
            "label": {}
        },
        {
            "ix": "6-2178_v2_10@4",
            "content": "The search period was from the beginning of the databases through to 16 th September 2017, with no language restrictions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_10",
            "start": 599,
            "end": 719,
            "label": {}
        },
        {
            "ix": "6-2178_v2_11@0",
            "content": "The following inclusion criteria were applied: i) the design was a randomized trial in humans, ii) the study compared stroke outcomes for PFO closure versus medical therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_11",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "6-2178_v2_11@1",
            "content": "Quality assessment of randomized controlled trials was performed using the Cochrane Risk Assessment Tool ( Supplementary Figure 1 and Supplementary Figure 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_11",
            "start": 174,
            "end": 332,
            "label": {}
        },
        {
            "ix": "6-2178_v2_12@0",
            "content": "Data extraction and statistical analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_12",
            "start": 0,
            "end": 39,
            "label": {}
        },
        {
            "ix": "6-2178_v2_13@0",
            "content": "Data from the different studies were entered in Microsoft Excel (2016 Version).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_13",
            "start": 0,
            "end": 78,
            "label": {}
        },
        {
            "ix": "6-2178_v2_13@1",
            "content": "All publications extracted from the search strategy were assessed for compliance with the inclusion criteria.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_13",
            "start": 80,
            "end": 188,
            "label": {}
        },
        {
            "ix": "6-2178_v2_13@2",
            "content": "In this meta-analysis, the extracted data elements consisted of: i) trial name; ii) follow-up duration; iii) quality score; and iv) characteristics of the population, including sample size, sex and age.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_13",
            "start": 190,
            "end": 391,
            "label": {}
        },
        {
            "ix": "6-2178_v2_13@3",
            "content": "Two reviewers (GT and MG) independently reviewed each included study and disagreements were resolved by adjudication with input from a third reviewer (TL).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_13",
            "start": 393,
            "end": 547,
            "label": {}
        },
        {
            "ix": "6-2178_v2_14@0",
            "content": "The number of events for: i) primary endpoint, ii) stroke, iii) transient ischemic attack (TIA), iv) all-cause bleeding complications, v) gastrointestinal complications [bleeding, ulceration, ulcer perforation], vi) short-term AF or AFL, vii) long-term AF or AFL, viii) venous thromboembolism, were identified and extracted independently by each reviewer from each trial.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_14",
            "start": 0,
            "end": 370,
            "label": {}
        },
        {
            "ix": "6-2178_v2_14@1",
            "content": "The Comprehensive Meta-Analysis Software (Version 2) was used for subsequent meta-analyses and statistical analyses.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_14",
            "start": 372,
            "end": 487,
            "label": {}
        },
        {
            "ix": "6-2178_v2_14@2",
            "content": "The event rates (events per patient-year) were used to calculate rate ratios for each study, which were pooled in subsequent meta-analyses.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_14",
            "start": 489,
            "end": 627,
            "label": {}
        },
        {
            "ix": "6-2178_v2_15@0",
            "content": "Heterogeneity across studies was assessed using the I 2 statistic from the standard chi-square test, which describes the percentage of the variability in the effect estimates resulting from heterogeneity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_15",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "6-2178_v2_15@1",
            "content": "I 2 > 50% was considered to reflect significant statistical heterogeneity and in such cases the random-effects model was used.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_15",
            "start": 205,
            "end": 330,
            "label": {}
        },
        {
            "ix": "6-2178_v2_15@2",
            "content": "To identify the origin of the heterogeneity, sensitivity analysis excluding one study at a time.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_15",
            "start": 332,
            "end": 427,
            "label": {}
        },
        {
            "ix": "6-2178_v2_15@3",
            "content": "Funnel plots showing standard errors against the logarithms of the odds ratio were constructed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_15",
            "start": 429,
            "end": 523,
            "label": {}
        },
        {
            "ix": "6-2178_v2_15@4",
            "content": "Begg and Mazumdar rank correlation test was used to test for publication bias and the Egger’s test were used to detect publication bias.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_15",
            "start": 525,
            "end": 660,
            "label": {}
        },
        {
            "ix": "6-2178_v2_16@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_16",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@0",
            "content": "A flow diagram detailing the above search terms with inclusion and exclusion criteria is depicted in Figure 1 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 0,
            "end": 110,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@1",
            "content": "A total of 91 and 55 studies were retrieved from PubMed and Cochrane Library, respectively.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 112,
            "end": 202,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@2",
            "content": "Of these, six studies met our inclusion criteria <REF-3> – <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 204,
            "end": 271,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@3",
            "content": "These were based on the following trials: CLOSURE I, PC, CLOSE, RESPECT and REDUCE.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 273,
            "end": 355,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@4",
            "content": "The original publication on the RESPECT trial was excluded because an update on longer term results was recently published <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 357,
            "end": 488,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@5",
            "content": "Therefore, a total of five studies were included in this meta-analysis <REF-2> – <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 490,
            "end": 579,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@6",
            "content": "The baseline characteristics of these studies are listed in Supplementary Table 1 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 581,
            "end": 663,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@7",
            "content": "This meta-analysis included 1829 patients in the PFO closure arm (mean age: 45.3 years; 54% male; mean follow-up duration 50 ± 30 months) and 1972 patients in the medical therapy arm (mean age: 45.1 years; 51% male; mean follow-up duration 50 ± 31 months).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 665,
            "end": 920,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@8",
            "content": "For the meta-analyses, event rates (events per patient-year) were extracted and used to calculate rate ratios.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 922,
            "end": 1031,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@9",
            "content": "The results of the statistical treatment of this meta-analysis are detailed in Supplementary File 2 , with those of sensitivity analyses by the leave-one-out method described in Supplementary Figure 3 – Supplementary Figure 8 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 1033,
            "end": 1259,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@10",
            "content": "Funnel plots plotting standard errors against the logarithms of the risk ratios are shown in Supplementary Figure 9 – Supplementary Figure 14 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 1261,
            "end": 1403,
            "label": {}
        },
        {
            "ix": "6-2178_v2_17@11",
            "content": "In all of the analyses, Begg and Mazumdar rank correlation test suggested no significant publication bias (P > 0.05) and the Egger’s test demonstrated no asymmetry (P > 0.05).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_17",
            "start": 1405,
            "end": 1579,
            "label": {}
        },
        {
            "ix": "6-2178_v2_18@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_18",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-2178_v2_20@0",
            "content": "PFO closure and primary endpoint(s), stroke and TIA events",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_20",
            "start": 0,
            "end": 57,
            "label": {}
        },
        {
            "ix": "6-2178_v2_21@0",
            "content": "All five trials compared the primary endpoints in PFO closure versus medical therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_21",
            "start": 0,
            "end": 84,
            "label": {}
        },
        {
            "ix": "6-2178_v2_21@1",
            "content": "The different trials used slightly different primary endpoints ( Supplementary Table 2 ), as follows: 1) CLOSURE I trial: stroke, TIA, 30-day mortality, neurology-related death, 2) PC trial: stroke, TIA, death, peripheral embolism, 3) CLOSE trial: fatal or non-fatal stroke, 4) RESPECT trial: nonfatal ischemic stroke, fatal ischemic stroke, or early death after randomization and 5) REDUCE trial: co-primary endpoints of i) ischemic stroke, and ii) new ischemic stroke or silent brain infarction.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_21",
            "start": 86,
            "end": 582,
            "label": {}
        },
        {
            "ix": "6-2178_v2_21@2",
            "content": "Among the 1829 subjects who underwent PFO closure, 70 (3.8%) met the primary endpoint ( Supplementary Table 3 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_21",
            "start": 584,
            "end": 695,
            "label": {}
        },
        {
            "ix": "6-2178_v2_21@3",
            "content": "By contrast, 112 of the 1972 subjects receiving medical therapy (5.7%) met the primary endpoint.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_21",
            "start": 697,
            "end": 792,
            "label": {}
        },
        {
            "ix": "6-2178_v2_21@4",
            "content": "Our meta-analysis shows that PFO closure significantly reduced primary endpoint events when compared to medical therapy with a rate ratio [RR] of 0.60 (95% CI: 0.44-0.83, P < 0.0001; I 2 : 15%) ( Figure 2 , top panel).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_21",
            "start": 794,
            "end": 1011,
            "label": {}
        },
        {
            "ix": "6-2178_v2_21@5",
            "content": "Using hazard ratios [HR] from the trials produced negligible differences from our event rate analyses (HR: 0.61; 95% CI: 0.45-0.83, P < 0.01; I 2 : 0%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_21",
            "start": 1013,
            "end": 1164,
            "label": {}
        },
        {
            "ix": "6-2178_v2_22@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_22",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-2178_v2_24@0",
            "content": "Subgroup analyses were performed for the primary endpoint based on atrial septal aneurysm and shunt size by pooling hazard ratios from the subgroup analyses of the included studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_24",
            "start": 0,
            "end": 180,
            "label": {}
        },
        {
            "ix": "6-2178_v2_24@1",
            "content": "PFO closure was not significantly better than medical therapy for patients with an atrial septal aneurysm (HR: 0.46; 95% CI: 0.14-1.60, P = 0.22; I 2 : 62%, Supplementary Figure 15 ) or without an atrial septal aneurysm (HR: 0.74; 95% CI: 0.47-1.17, P = 0.19; I 2 : 0%, Supplementary Figure 16 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_24",
            "start": 182,
            "end": 477,
            "label": {}
        },
        {
            "ix": "6-2178_v2_24@2",
            "content": "By contrast, PFO closure significantly reduced primary endpoint events in patients with large shunt size (HR: 0.27, 95% CI: 0.14-0.54, P < 0.0001; I 2 : 0%, Supplementary Figure 17 ) but not in those with small shunt size (HR: 0.80, 95% CI: 0.49-1.31; P = 0.38; I 2 : 0%, Supplementary Figure 18 )",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_24",
            "start": 479,
            "end": 775,
            "label": {}
        },
        {
            "ix": "6-2178_v2_25@0",
            "content": "All five trials compared the stroke events in PFO closure versus medical therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_25",
            "start": 0,
            "end": 80,
            "label": {}
        },
        {
            "ix": "6-2178_v2_25@1",
            "content": "The different trials used slightly different primary endpoints, as follows: 1) CLOSURE I trial: acute focal neurological event that is magnet resonance imaging (MRI) positive, regardless of duration of clinical symptoms, or if imaging cannot be performed for confirmation, it was defined as a persistent focal neurological deficit lasting longer than 24 hours; 2) PC trial: any neurologic deficit lasting for >24 hours typically with documentation in MRI or computer tomography (CT); 3) CLOSE trial: sudden onset of focal neurological symptoms with the presence of cerebral infarction in the appropriate territory on brain imaging (CT or MRI), regardless of the duration of the symptoms (less than or greater than 24 hours); 4) RESPECT trial: ischemic stroke was defined as an acute focal neurologic deficit, which was presumed to be due to focal ischemia, and either symptoms that persisted for 24 hours or longer or symptoms that persisted for less than 24 hours but were associated with findings of a new, neuroanatomically relevant, cerebral infarct on MRI or CT; and 5) REDUCE trial: an acute focal neurologic deficit, presumably due to ischemia, that either resulted in clinical symptoms lasting 24 hours or more or was associated with evidence of relevant infarction on MRI or, if MRI could not be performed, CT of the brain.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_25",
            "start": 82,
            "end": 1413,
            "label": {}
        },
        {
            "ix": "6-2178_v2_25@2",
            "content": "Taken together data from all five trials, stroke occurred in 45 patients (2.5%) in the PFO closure group, but in 102 patients (5.2%) in the medical therapy group.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_25",
            "start": 1415,
            "end": 1576,
            "label": {}
        },
        {
            "ix": "6-2178_v2_25@3",
            "content": "This gave a RR of 0.50 that was statistically significant (95% CI: 0.35-0.73, P < 0.0001; I 2 : 32%) ( Figure 2 , middle panel).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_25",
            "start": 1578,
            "end": 1705,
            "label": {}
        },
        {
            "ix": "6-2178_v2_25@4",
            "content": "Using HR from the trials produced negligible differences from our event rate analyses (HR: 0.49, 95% CI: 0.34-0.71, P < 0.01; I 2 : 30%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_25",
            "start": 1707,
            "end": 1843,
            "label": {}
        },
        {
            "ix": "6-2178_v2_26@0",
            "content": "TIAs were assessed in all five trials and the various definitions are shown in Supplementary Table 2 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_26",
            "start": 0,
            "end": 101,
            "label": {}
        },
        {
            "ix": "6-2178_v2_26@1",
            "content": "These occurred in 44 patients (2.4%) in the PFO closure group and in 67 patients (3.4%) of the medical therapy group ( Supplementary Table 3 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_26",
            "start": 103,
            "end": 245,
            "label": {}
        },
        {
            "ix": "6-2178_v2_26@2",
            "content": "There was no statistically significant difference in the RR (0.75; 95% CI: 0.51-1.10, P = 0.14; I 2 : 0%) ( Figure 2 , bottom panel).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_26",
            "start": 247,
            "end": 379,
            "label": {}
        },
        {
            "ix": "6-2178_v2_26@3",
            "content": "Hazard ratios were available from four trials on TIAs, with a pooled HR of 0.73 (95% CI: 0.49-1.09, P = 0.13; I 2 : 0%).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_26",
            "start": 381,
            "end": 500,
            "label": {}
        },
        {
            "ix": "6-2178_v2_27@0",
            "content": "Adverse events in PFO closure group compared to medical therapy group",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_27",
            "start": 0,
            "end": 68,
            "label": {}
        },
        {
            "ix": "6-2178_v2_28@0",
            "content": "AF or AFL was detected in 76 patients in the PFO closure group (4.2%) and 37 patients (1.9%) in the medical therapy group ( Supplementary Table 4 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_28",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "6-2178_v2_28@1",
            "content": "These equated to a significant increase in the risk when PFO closure was used (RR: 1.90, 95% CI: 1.23-2.93, P < 0.01; I 2 : 43%) ( Figure 3 , top panel).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_28",
            "start": 149,
            "end": 301,
            "label": {}
        },
        {
            "ix": "6-2178_v2_28@2",
            "content": "Subgroup analysis was performed for the type of AF or AFL by dividing the episodes into i) paroxysmal or minor, and ii) permanent or major [as defined by the individual trials].",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_28",
            "start": 303,
            "end": 479,
            "label": {}
        },
        {
            "ix": "6-2178_v2_28@3",
            "content": "This revealed that most of the episodes were only paroxysmal or minor for the PFO group (3.0%) when compared to the medical therapy group (0.6%) (RR: 7.70, 95% CI: 2.30-19.77; P < 0.0001; I 2 : 32%) ( Figure 3 , middle panel).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_28",
            "start": 481,
            "end": 706,
            "label": {}
        },
        {
            "ix": "6-2178_v2_28@4",
            "content": "Permanent or serious AF or AFL occurred in 1.3% in the PFO closure group compared to 0.4% in the medical therapy group without significance between these groups (RR: 2.19, 95% CI: 0.94-5.01; P = 0.07; I 2 : 0%) ( Figure 3 , bottom panel).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_28",
            "start": 708,
            "end": 945,
            "label": {}
        },
        {
            "ix": "6-2178_v2_29@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_29",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-2178_v2_31@0",
            "content": "All bleeding complications were counted from the included studies ( Supplementary Table 5 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_31",
            "start": 0,
            "end": 91,
            "label": {}
        },
        {
            "ix": "6-2178_v2_31@1",
            "content": "These were comparable between the groups, occurring in 39 (2.1%) of the PFO closure group and 47 (2.4%) in the medical therapy group, with no significant difference between them (RR: 0.89; 95% CI: 0.44-1.78, P = 0.74; I 2 : 51%) ( Figure 4 , top panel).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_31",
            "start": 93,
            "end": 345,
            "label": {}
        },
        {
            "ix": "6-2178_v2_31@2",
            "content": "Three trials reported gastrointestinal complications of hemorrhage, ulceration or ulcer perforation ( Supplementary Table 5 ), which occurred in 7 and 8 patients in the PFO closure and medical therapy groups (0.4% for both arms).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_31",
            "start": 347,
            "end": 575,
            "label": {}
        },
        {
            "ix": "6-2178_v2_31@3",
            "content": "Therefore, the risk of gastrointestinal complications was not reduced by PFO closure (RR: 0.92; 95% CI: 0.32-2.70, P = 0.88; I 2 : 0%) ( Figure 4 , bottom panel).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_31",
            "start": 577,
            "end": 738,
            "label": {}
        },
        {
            "ix": "6-2178_v2_31@4",
            "content": "Venous thromboembolism, which comprised events of pulmonary embolism and deep venous thrombosis, were also counted from the included studies ( Supplementary Table 6 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_31",
            "start": 740,
            "end": 906,
            "label": {}
        },
        {
            "ix": "6-2178_v2_31@5",
            "content": "Two trials, RESPECT and REDUCE trials, reported venous thromboembolism, which occurred in 20 and 6 patients in the PFO closure and medical therapy groups.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_31",
            "start": 908,
            "end": 1061,
            "label": {}
        },
        {
            "ix": "6-2178_v2_32@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_32",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "6-2178_v2_34@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_34",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "6-2178_v2_35@0",
            "content": "The key findings of this meta-analysis are that, compared to medical therapy, PFO closure significantly reduced primary endpoints by 40% and strokes by 50%, and had comparable risks of TIAs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_35",
            "start": 0,
            "end": 189,
            "label": {}
        },
        {
            "ix": "6-2178_v2_35@1",
            "content": "Nevertheless, these benefits were observed despite a two-fold increase in the risk of AF or AFL in the PFO closure group.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_35",
            "start": 191,
            "end": 311,
            "label": {}
        },
        {
            "ix": "6-2178_v2_35@2",
            "content": "No difference in the risks of bleeding or gastrointestinal complications (bleeding, ulceration or ulcer perforation) was observed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_35",
            "start": 313,
            "end": 442,
            "label": {}
        },
        {
            "ix": "6-2178_v2_36@0",
            "content": "The foramen ovale remains open in about 25% of the healthy population, giving rise to a PFO <REF-9> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_36",
            "start": 0,
            "end": 100,
            "label": {}
        },
        {
            "ix": "6-2178_v2_36@1",
            "content": "PFO can be asymptomatic, but potentially causes cryptogenic strokes mainly through the mechanism of paradoxical embolization.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_36",
            "start": 102,
            "end": 226,
            "label": {}
        },
        {
            "ix": "6-2178_v2_36@2",
            "content": "PFO closure is used either for primary or secondary prevention of stroke.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_36",
            "start": 228,
            "end": 300,
            "label": {}
        },
        {
            "ix": "6-2178_v2_36@3",
            "content": "It has been proposed that PFO closure is an effective treatment to prevent recurrent stroke or TIA in patients with cryptogenic stroke if the shunt grade of the PFO is greater than moderate <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_36",
            "start": 302,
            "end": 501,
            "label": {}
        },
        {
            "ix": "6-2178_v2_36@4",
            "content": "Long-term follow-up following percutaneous PFO closure for presumed paradoxical embolism have demonstrated very low recurrence rates <REF-11> , <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_36",
            "start": 503,
            "end": 656,
            "label": {}
        },
        {
            "ix": "6-2178_v2_36@5",
            "content": "Eustachian valve, Chiari’s network, medium-large shunt on trans-esophageal echocardiography, hypertension, age and the Essen stroke risk score have been associated with recurrent neurological events <REF-12> – <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_36",
            "start": 658,
            "end": 877,
            "label": {}
        },
        {
            "ix": "6-2178_v2_36@6",
            "content": "Medical treatment using antiplatelets or anticoagulants is an acceptable, alternative approach.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_36",
            "start": 879,
            "end": 973,
            "label": {}
        },
        {
            "ix": "6-2178_v2_36@7",
            "content": "A recent meta-analysis reported that anticoagulant therapy was more effective than antiplatelet therapy in preventing recurrent stroke and/or TIA, but with a 6-fold greater risk of major bleeding <REF-15> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_36",
            "start": 975,
            "end": 1180,
            "label": {}
        },
        {
            "ix": "6-2178_v2_37@0",
            "content": "The evidence from real-world studies has also been controversial.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_37",
            "start": 0,
            "end": 64,
            "label": {}
        },
        {
            "ix": "6-2178_v2_37@1",
            "content": "A small cohort including 159 patients <55 years old with cryptogenic stroke who received PFO closure or medical therapy did not show a statistically significant difference in the recurrence of ischemic events during a mean follow-up of 51.6 months <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_37",
            "start": 66,
            "end": 323,
            "label": {}
        },
        {
            "ix": "6-2178_v2_37@2",
            "content": "In addition, in another small cohort including 164 patients with PFO and cryptogenic stroke the two groups (PFO closure vs. medical treatment) did not differ in regard to the composite end-point of death, stroke, TIA or peripheral embolism <REF-17> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_37",
            "start": 325,
            "end": 574,
            "label": {}
        },
        {
            "ix": "6-2178_v2_37@3",
            "content": "Similarly, data of the IPSYS registry, which included 521 patients aged 18–45 years old with cryptogenic stroke and PFO, showed no significant difference neither in composite end-point [ischemic stroke, TIA or peripheral embolism (P=0.285)] nor in brain ischemia (p=0.168) between PFO closure and medical treatment groups <REF-18> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_37",
            "start": 576,
            "end": 907,
            "label": {}
        },
        {
            "ix": "6-2178_v2_37@4",
            "content": "Additionally, Mirzada and colleagues did not find a difference regarding recurrent stroke or TIA between PFO closure and medical treatment groups <REF-19> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_37",
            "start": 909,
            "end": 1064,
            "label": {}
        },
        {
            "ix": "6-2178_v2_37@5",
            "content": "Most of studies about PFO closure included young patients (<55 years old).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_37",
            "start": 1066,
            "end": 1139,
            "label": {}
        },
        {
            "ix": "6-2178_v2_37@6",
            "content": "A recent study, compared the outcomes of PFO closure between a young (<55 years old) and an old group (>55 years old) of patients <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_37",
            "start": 1141,
            "end": 1280,
            "label": {}
        },
        {
            "ix": "6-2178_v2_37@7",
            "content": "It was found that in older patients, PFO closure was as safe as in younger patients, but recurrent cerebral ischemia was more frequent and likely this is associated to conditions related to age than to paradoxical embolism <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_37",
            "start": 1282,
            "end": 1514,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@0",
            "content": "Previous meta-analyses of randomized trials have found no statistically significant differences between PFO closure and medical therapy in the prevention of recurrent ischemic stroke <REF-21> – <REF-24> , whilst PFO closure was associated with an increased risk of AF <REF-21> , <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 0,
            "end": 288,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@1",
            "content": "By contrast, others have reported some benefits.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 290,
            "end": 337,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@2",
            "content": "For example, a patient-level meta-analysis reported that PFO closure reduced recurrent stroke and had a statistically significant effect on the composite of stroke, TIA, and mortality in adjusted analyses <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 339,
            "end": 553,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@3",
            "content": "Moreover, another reported a 50% relative reduction of stroke and/or TIA versus antiplatelet therapy and by 82% relative reduction of major bleeding versus anticoagulant therapy <REF-15> , whilst another reported that significant reductions in recurrent neurological events in intention-to-treat, per-protocol and as-treated cohorts <REF-26> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 555,
            "end": 897,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@4",
            "content": "A recent meta-analysis also reported that in comparison with medical treatment, PFO prevents recurrent stroke and TIA <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 899,
            "end": 1026,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@5",
            "content": "Further, another recent meta-analysis reported that in patients with PFO and cryptogenic stroke, transcatheter device closure decreases risk of recurrent stroke compared with medical therapy alone <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 1028,
            "end": 1234,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@6",
            "content": "By contrast, anther meta-analysis reported that PFO reduced the risk of stroke, but not TIA, mortality, major bleeding and increased the risk of AF <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 1236,
            "end": 1393,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@7",
            "content": "By pooling together data from two additional trials, our meta-analysis provides a firm conclusion that PFO closure produces a statistically significant reduction in the risk of not only primary endpoints, but also that of strokes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 1395,
            "end": 1624,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@8",
            "content": "On subgroup analysis, we found that PFO closure significantly reduced primary endpoint events in patients with large shunt size, but not in those with small shunt size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 1626,
            "end": 1793,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@9",
            "content": "Moreover, although PFO closure was no more effective in reducing TIAs when compared to medical therapy, what is important is that stroke, which is responsible for significant morbidity as well as mortality, was prevented.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 1795,
            "end": 2015,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@10",
            "content": "These benefits are also observed in real-world studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 2017,
            "end": 2071,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@11",
            "content": "For example, a long-term propensity score-matched comparison of PFO closure with medical therapy showed a mortality benefit <REF-30> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 2073,
            "end": 2206,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@12",
            "content": "These data also raise the issue regarding the benefit of primary prevention in cases with high-risk PFO <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 2208,
            "end": 2321,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@13",
            "content": "Such a simple intervention might indeed be effective in preventing the first stroke event.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 2323,
            "end": 2412,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@14",
            "content": "As such, based on the results of our meta-analysis, it supports the need to primarily prevent high-risk PFO with PFO closure procedures instead of providing medical therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 2414,
            "end": 2586,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@15",
            "content": "This approach is further by the increasing simplicity and success rates of the PFO closure procedure <REF-32> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 2588,
            "end": 2698,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@16",
            "content": "Despite the clear benefits, potential complications of PFO closure should be noted.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 2700,
            "end": 2782,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@17",
            "content": "For example, in the RESPECT trial, a significant increase in pulmonary emboli were observed (12 in the PFO closure group, of which 2 are listed as a complication of the procedure, vs. 3 in the control group) and deep venous thromboses (5 and 1, respectively).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 2784,
            "end": 3042,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@18",
            "content": "While the mechanism leading to the increased risk remains unclear, it may be possibly attributable to inappropriate application of groin compression subsequent to PFO intervention.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 3044,
            "end": 3223,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@19",
            "content": "Our meta-analysis also confirmed the increased risk of AF following PFO closure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 3225,
            "end": 3304,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@20",
            "content": "Its clinical relevance is less certain for two reasons, that 70–90% of these events occurred in the first month and did not persist beyond this timeframe, and stroke incidence was reduced despite this AF occurrence.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 3306,
            "end": 3520,
            "label": {}
        },
        {
            "ix": "6-2178_v2_38@21",
            "content": "While the majority of AF occurrences were transient AF, it is not known how much subsequent monitoring these patients underwent or whether they were anticoagulated as a result.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_38",
            "start": 3522,
            "end": 3697,
            "label": {}
        },
        {
            "ix": "6-2178_v2_39@0",
            "content": "In our meta-analysis of event rates for primary endpoint(s), low levels of heterogeneity were observed, which was probably due to the different definitions used across the trials.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_39",
            "start": 0,
            "end": 178,
            "label": {}
        },
        {
            "ix": "6-2178_v2_39@1",
            "content": "For example, two trials, CLOSURE I <REF-8> and PC <REF-3> , included mortality as part of the primary endpoint, whereas the remaining three trials, CLOSE <REF-5> , RESPECT <REF-4> and REDUCE <REF-6> , included ischemic stroke events but not mortality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_39",
            "start": 180,
            "end": 430,
            "label": {}
        },
        {
            "ix": "6-2178_v2_39@2",
            "content": "The medical therapy offered was similar across the studies, involving anticoagulation, antiplatelet therapy, or both.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_39",
            "start": 432,
            "end": 548,
            "label": {}
        },
        {
            "ix": "6-2178_v2_39@3",
            "content": "For the CLOSE trial, the investigators compared antiplatelet therapy with either anticoagulation therapy or PFO closure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_39",
            "start": 550,
            "end": 669,
            "label": {}
        },
        {
            "ix": "6-2178_v2_39@4",
            "content": "For this particular trial, we had pooled data from both anticoagulation and antiplatelet therapy together, and compared the event rates with the PFO closure group.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_39",
            "start": 671,
            "end": 833,
            "label": {}
        },
        {
            "ix": "6-2178_v2_39@5",
            "content": "The present meta-analysis also demonstrates the safety of PFO closure when compared to more conservative medical therapy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_39",
            "start": 835,
            "end": 955,
            "label": {}
        },
        {
            "ix": "6-2178_v2_40@0",
            "content": "Strengths and limitations of the included trials and this meta-analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_40",
            "start": 0,
            "end": 70,
            "label": {}
        },
        {
            "ix": "6-2178_v2_41@0",
            "content": "However, there are some limitations inherent to the trials themselves.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_41",
            "start": 0,
            "end": 69,
            "label": {}
        },
        {
            "ix": "6-2178_v2_41@1",
            "content": "Firstly, the crossover rate is substantial.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_41",
            "start": 71,
            "end": 113,
            "label": {}
        },
        {
            "ix": "6-2178_v2_41@2",
            "content": "For example, in REDUCE 6.3% of study subjects crossed over from PFO-closure to medical treatment and 6.3% did the opposite. Secondly, actual mechanical and anatomical closure of the PFO is of paramount importance to prevent recurrent paradoxical embolization.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_41",
            "start": 115,
            "end": 373,
            "label": {}
        },
        {
            "ix": "6-2178_v2_41@3",
            "content": "The different trials had different degrees of successful closure (e.g. REDUCE trial: 75%; CLOSURE trial: 86%; CLOSE trial: 93%) but these were not related to outcomes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_41",
            "start": 375,
            "end": 541,
            "label": {}
        },
        {
            "ix": "6-2178_v2_41@4",
            "content": "Secondly, the definitions of TIA were different between the trials, which could have contributed to the between-study heterogeneity.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_41",
            "start": 543,
            "end": 674,
            "label": {}
        },
        {
            "ix": "6-2178_v2_41@5",
            "content": "Finally, the trials had large proportions of study subjects who were lost to follow-up, withdrew consent and crossed over to the other study arm, leading to uncertainty in the reported event rates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_41",
            "start": 676,
            "end": 872,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@0",
            "content": "There are many strengths of this meta-analysis study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 0,
            "end": 52,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@1",
            "content": "It is the largest meta-analysis of randomized trials to date, including more than 3800 participants from five trials.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 54,
            "end": 170,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@2",
            "content": "Moreover, the follow-up duration was sufficiently long for events to be detected.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 172,
            "end": 252,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@3",
            "content": "Our quality analysis indicated that the studies had a low risk of bias.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 254,
            "end": 324,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@4",
            "content": "Low levels of heterogeneity were observed for most of our analyses, including primary endpoints, strokes, TIAs and gastrointestinal complications.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 326,
            "end": 471,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@5",
            "content": "These indicate that it was appropriate to pool these studies together.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 473,
            "end": 542,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@6",
            "content": "However, several limitations inherent in the present meta-analysis should be noted.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 544,
            "end": 626,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@7",
            "content": "Firstly, the meta-analysis of all-cause bleeding across the trials showed a high level of heterogeneity, which may be clinical in nature, especially when different types of bleeding were measured.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 628,
            "end": 823,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@8",
            "content": "Secondly, there is an imbalance between events and lost-to-follow-up/withdrawals <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 825,
            "end": 915,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@9",
            "content": "In most trials, the ratio between the two is often in the region of 5 to 1, but is around 0.3 to 1 in the trials included in this meta-analysis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 917,
            "end": 1060,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@10",
            "content": "Moreover, publication bias results should be interpreted with caution as publication bias with less than ten studies is not recommended, but the results are presented here for the sake of completeness.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 1062,
            "end": 1262,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@11",
            "content": "Furthermore, there was a moderate degree of heterogeneity for the atrial septal aneurysm vs. no aneurysm comparison.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 1264,
            "end": 1379,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@12",
            "content": "Since our aim was to compare the effectiveness of PFO closure to medical treatment, we did not perform additional analysis by medical group assignment, such as comparing antiplatelet or anticoagulant therapy to PFO closure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 1381,
            "end": 1603,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@13",
            "content": "The majority of medical management patients were treated with antiplatelet medications, with a minority treated with oral anticoagulation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 1605,
            "end": 1742,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@14",
            "content": "Since the presumed mechanism of stroke attributable to PFO is paradoxical embolus from venous thrombi, or in situ thrombus formation, oral anticoagulants may be more effective for those causes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 1744,
            "end": 1936,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@15",
            "content": "Where reported in individual trials, stroke outcome events were numerically less when medical management was with oral anticoagulation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 1938,
            "end": 2072,
            "label": {}
        },
        {
            "ix": "6-2178_v2_42@16",
            "content": "Further analyses are needed to compare PFO closure with anticoagulation treatment alone as this was beyond the scope of the current study.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_42",
            "start": 2074,
            "end": 2211,
            "label": {}
        },
        {
            "ix": "6-2178_v2_43@0",
            "content": "Conclusions",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_43",
            "start": 0,
            "end": 10,
            "label": {}
        },
        {
            "ix": "6-2178_v2_44@0",
            "content": "PFO closure significantly reduces the risk of primary endpoints, strokes, but not TIAs, when compared to medical treatment, despite higher rates of AF or AFL being observed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_44",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "6-2178_v2_44@1",
            "content": "No differences in bleeding or gastrointestinal complications were detected between the two arms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_44",
            "start": 174,
            "end": 269,
            "label": {}
        },
        {
            "ix": "6-2178_v2_44@2",
            "content": "PFO closure should therefore be considered for prevention of stroke in patients with PFO, especially in those presenting with cryptogenic stroke, who are less than 60 years of age with moderate to severe shunting.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_44",
            "start": 271,
            "end": 483,
            "label": {}
        },
        {
            "ix": "6-2178_v2_45@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_45",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "6-2178_v2_46@0",
            "content": "All data required for reproducibility of this study are available from published studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_46",
            "start": 0,
            "end": 88,
            "label": {}
        },
        {
            "ix": "6-2178_v2_47@0",
            "content": "<REF-1> Gillow SJ Lee VH : PFO Closure for Cryptogenic Stroke. Curr Atheroscler Rep. 2015 ; 17 ( 8 ): 45 . 26076907 10.1007/s11883-015-0525-6",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_47",
            "start": 0,
            "end": 140,
            "label": {}
        },
        {
            "ix": "6-2178_v2_48@0",
            "content": "<REF-2> Furlan AJ Reisman M Massaro J : Closure or medical therapy for cryptogenic stroke with patent foramen ovale. N Engl J Med. 2012 ; 366 ( 11 ): 991 – 999 . 22417252 10.1056/NEJMoa1009639",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_48",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "6-2178_v2_49@0",
            "content": "<REF-3> Meier B Kalesan B Mattle HP : Percutaneous closure of patent foramen ovale in cryptogenic embolism. N Engl J Med. 2013 ; 368 ( 12 ): 1083 – 91 . 23514285 10.1056/NEJMoa1211716",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_49",
            "start": 0,
            "end": 182,
            "label": {}
        },
        {
            "ix": "6-2178_v2_50@0",
            "content": "<REF-4> Saver JL Carroll JD Thaler DE : Long-Term Outcomes of Patent Foramen Ovale Closure or Medical Therapy after Stroke. N Engl J Med. 2017 ; 377 ( 11 ): 1022 – 1032 . 28902590 10.1056/NEJMoa1610057",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_50",
            "start": 0,
            "end": 200,
            "label": {}
        },
        {
            "ix": "6-2178_v2_51@0",
            "content": "<REF-5> Mas JL Derumeaux G Guillon B : Patent Foramen Ovale Closure or Anticoagulation vs. Antiplatelets after Stroke. N Engl J Med. 2017 ; 377 ( 11 ): 1011 – 1021 . 28902593 10.1056/NEJMoa1705915",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_51",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "6-2178_v2_52@0",
            "content": "<REF-6> Søndergaard L Kasner SE Rhodes JF : Patent Foramen Ovale Closure or Antiplatelet Therapy for Cryptogenic Stroke. N Engl J Med. 2017 ; 377 ( 11 ): 1033 – 1042 . 28902580 10.1056/NEJMoa1707404",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_52",
            "start": 0,
            "end": 197,
            "label": {}
        },
        {
            "ix": "6-2178_v2_53@0",
            "content": "<REF-7> Carroll JD Saver JL Thaler DE : Closure of patent foramen ovale versus medical therapy after cryptogenic stroke. N Engl J Med. 2013 ; 368 ( 12 ): 1092 – 100 . 23514286 10.1056/NEJMoa1301440",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_53",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "6-2178_v2_54@0",
            "content": "<REF-8> Furlan AJ Reisman M Massaro J : Closure or medical therapy for cryptogenic stroke with patent foramen ovale. N Engl J Med. 2012 ; 366 ( 11 ): 991 – 999 . 22417252 10.1056/NEJMoa1009639",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_54",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "6-2178_v2_55@0",
            "content": "<REF-9> Hagen PT Scholz DG Edwards WD : Incidence and size of patent foramen ovale during the first 10 decades of life: an autopsy study of 965 normal hearts. Mayo Clin Proc. 1984 ; 59 ( 1 ): 17 – 20 . 6694427 10.1016/S0025-6196(12)60336-X",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_55",
            "start": 0,
            "end": 238,
            "label": {}
        },
        {
            "ix": "6-2178_v2_56@0",
            "content": "<REF-10> Kim M Kim S Moon J : Effect of patent foramen ovale closure for prevention on recurrent stroke or transient ischemic attack in selected patients with cryptogenic stroke. J Interv Cardiol. 2018 ; 31 ( 3 ): 368 – 374 . 28833599 10.1111/joic.12430",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_56",
            "start": 0,
            "end": 252,
            "label": {}
        },
        {
            "ix": "6-2178_v2_57@0",
            "content": "<REF-11> Eeckhout E Martin S Delabays A : Very long-term follow-up after percutaneous closure of patent foramen ovale. EuroIntervention. 2015 ; 10 ( 12 ): 1474 – 9 . 24429213 10.4244/EIJV10I12A257",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_57",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "6-2178_v2_58@0",
            "content": "<REF-12> Inglessis I Elmariah S Rengifo-Moreno PA : Long-term experience and outcomes with transcatheter closure of patent foramen ovale. JACC Cardiovasc Interv. 2013 ; 6 ( 11 ): 1176 – 83 . 24262618 10.1016/j.jcin.2013.06.013",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_58",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "6-2178_v2_59@0",
            "content": "<REF-14> Rigatelli G Dell'avvocata F Braggion G : Persistent venous valves correlate with increased shunt and multiple preceding cryptogenic embolic events in patients with patent foramen ovale: an intracardiac echocardiographic study. Catheter Cardiovasc Interv. 2008 ; 72 ( 7 ): 973 – 6 . 19021284 10.1002/ccd.21761",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_59",
            "start": 0,
            "end": 316,
            "label": {}
        },
        {
            "ix": "6-2178_v2_60@0",
            "content": "<REF-15> Patti G Pelliccia F Gaudio C : Meta-analysis of net long-term benefit of different therapeutic strategies in patients with cryptogenic stroke and patent foramen ovale. Am J Cardiol. 2015 ; 115 ( 6 ): 837 – 43 . 25620037 10.1016/j.amjcard.2014.12.051",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_60",
            "start": 0,
            "end": 257,
            "label": {}
        },
        {
            "ix": "6-2178_v2_61@0",
            "content": "<REF-16> Danese A Stegagno C Tomelleri G : Clinical outcomes of secondary prevention strategies for young patients with cryptogenic stroke and patent foramen ovale. Acta Cardiol. 2017 ; 72 ( 4 ): 410 – 418 . 28705105 10.1080/00015385.2017.1307668",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_61",
            "start": 0,
            "end": 245,
            "label": {}
        },
        {
            "ix": "6-2178_v2_62@0",
            "content": "<REF-17> Moon J Kang WC Kim S : Comparison of Outcomes after Device Closure and Medication Alone in Patients with Patent Foramen Ovale and Cryptogenic Stroke in Korean Population. Yonsei Med J. 2016 ; 57 ( 3 ): 621 – 5 . 26996560 10.3349/ymj.2016.57.3.621 4800350",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_62",
            "start": 0,
            "end": 262,
            "label": {}
        },
        {
            "ix": "6-2178_v2_63@0",
            "content": "<REF-18> Pezzini A Grassi M Lodigiani C : Propensity Score-Based Analysis of Percutaneous Closure Versus Medical Therapy in Patients With Cryptogenic Stroke and Patent Foramen Ovale: The IPSYS Registry (Italian Project on Stroke in Young Adults). Circ Cardiovasc Interv. 2016 ; 9 ( 9 ): pii: e003470. 27582111 10.1161/CIRCINTERVENTIONS.115.003470",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_63",
            "start": 0,
            "end": 345,
            "label": {}
        },
        {
            "ix": "6-2178_v2_64@0",
            "content": "<REF-19> Mirzada N Ladenvall P Hansson PO : Recurrent stroke in patients with patent foramen ovale: An observational prospective study of percutaneous closure of PFO versus non-closure. Int J Cardiol. 2015 ; 195 : 293 – 9 . 26056962 10.1016/j.ijcard.2015.05.088",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_64",
            "start": 0,
            "end": 260,
            "label": {}
        },
        {
            "ix": "6-2178_v2_65@0",
            "content": "<REF-20> Scacciatella P Meynet I Presbitero P : Recurrent cerebral ischemia after patent foramen ovale percutaneous closure in older patients: A two-center registry study. Catheter Cardiovasc Interv. 2016 ; 87 ( 3 ): 508 – 14 . 26106024 10.1002/ccd.26053",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_65",
            "start": 0,
            "end": 253,
            "label": {}
        },
        {
            "ix": "6-2178_v2_66@0",
            "content": "<REF-21> Li J Liu J Liu M : Closure versus medical therapy for preventing recurrent stroke in patients with patent foramen ovale and a history of cryptogenic stroke or transient ischemic attack. Cochrane Database Syst Rev. 2015 ; ( 9 ): CD009938. 26346232 10.1002/14651858.CD009938.pub2",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_66",
            "start": 0,
            "end": 285,
            "label": {}
        },
        {
            "ix": "6-2178_v2_67@0",
            "content": "<REF-24> Udell JA Opotowsky AR Khairy P : Patent foramen ovale closure vs medical therapy for stroke prevention: meta-analysis of randomized trials and review of heterogeneity in meta-analyses. Can J Cardiol. 2014 ; 30 ( 10 ): 1216 – 24 . 25154803 10.1016/j.cjca.2014.05.004",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_67",
            "start": 0,
            "end": 273,
            "label": {}
        },
        {
            "ix": "6-2178_v2_68@0",
            "content": "<REF-25> Kent DM Dahabreh IJ Ruthazer R : Device Closure of Patent Foramen Ovale After Stroke: Pooled Analysis of Completed Randomized Trials. J Am Coll Cardiol. 2016 ; 67 ( 8 ): 907 – 17 . 26916479 10.1016/j.jacc.2015.12.023 4769377",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_68",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "6-2178_v2_69@0",
            "content": "<REF-26> Khan AR Bin Abdulhak AA Sheikh MA : Device closure of patent foramen ovale versus medical therapy in cryptogenic stroke: a systematic review and meta-analysis. JACC Cardiovasc Interv. 2013 ; 6 ( 12 ): 1316 – 1323 . 24139929 10.1016/j.jcin.2013.08.001",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_69",
            "start": 0,
            "end": 258,
            "label": {}
        },
        {
            "ix": "6-2178_v2_70@0",
            "content": "<REF-27> De Rosa S Sievert H Sabatino J : Percutaneous Closure Versus Medical Treatment in Stroke Patients With Patent Foramen Ovale: A Systematic Review and Meta-analysis. Ann Intern Med. 2018 ; 168 ( 5 ): 343 – 350 . 29310133 10.7326/M17-3033",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_70",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "6-2178_v2_71@0",
            "content": "<REF-28> Shah R Nayyar M Jovin IS : Device Closure Versus Medical Therapy Alone for Patent Foramen Ovale in Patients With Cryptogenic Stroke: A Systematic Review and Meta-analysis. Ann Intern Med. 2018 ; 168 ( 5 ): 335 – 342 . 29310136 10.7326/M17-2679",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_71",
            "start": 0,
            "end": 251,
            "label": {}
        },
        {
            "ix": "6-2178_v2_72@0",
            "content": "<REF-29> Ando T Holmes AA Pahuja M : Meta-Analysis Comparing Patent Foramen Ovale Closure Versus Medical Therapy to Prevent Recurrent Cryptogenic Stroke. Am J Cardiol. 2018 ; 121 ( 5 ): 649 – 655 . 29306484 10.1016/j.amjcard.2017.11.037",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_72",
            "start": 0,
            "end": 235,
            "label": {}
        },
        {
            "ix": "6-2178_v2_73@0",
            "content": "<REF-30> Wahl A Jüni P Mono ML : Long-term propensity score-matched comparison of percutaneous closure of patent foramen ovale with medical treatment after paradoxical embolism. Circulation. 2012 ; 125 ( 6 ): 803 – 12 . 22238228 10.1161/CIRCULATIONAHA.111.030494",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_73",
            "start": 0,
            "end": 261,
            "label": {}
        },
        {
            "ix": "6-2178_v2_74@0",
            "content": "<REF-31> Nietlispach F Meier B : Percutaneous closure of patent foramen ovale: safe and effective but underutilized. Expert Rev Cardiovasc Ther. 2015 ; 13 ( 2 ): 121 – 3 . 25556896 10.1586/14779072.2015.1000305",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_74",
            "start": 0,
            "end": 209,
            "label": {}
        },
        {
            "ix": "6-2178_v2_75@0",
            "content": "<REF-32> Neill J Lin CH : A Review of Transcatheter Closure of Patent Foramen Ovale. Methodist Debakey Cardiovasc J. 2017 ; 13 ( 3 ): 152 – 159 . 29744000 5935199",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_75",
            "start": 0,
            "end": 161,
            "label": {}
        },
        {
            "ix": "6-2178_v2_76@0",
            "content": "<REF-33> Dellborg M Eriksson P : Randomized trials of closure of persistent foramen ovale (PFO) vs medical therapy for patients with cryptogenic stroke - Effect of lost-to-follow-up and withdrawal of consent. Int J Cardiol. 2016 ; 207 : 308 – 9 . 26814634 10.1016/j.ijcard.2016.01.185",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "6-2178_v2_76",
            "start": 0,
            "end": 283,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "6-2178_v2_0",
            "tgt_ix": "6-2178_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_1",
            "tgt_ix": "6-2178_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_1",
            "tgt_ix": "6-2178_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_1",
            "tgt_ix": "6-2178_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_1",
            "tgt_ix": "6-2178_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_0",
            "tgt_ix": "6-2178_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_6",
            "tgt_ix": "6-2178_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_0",
            "tgt_ix": "6-2178_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_8",
            "tgt_ix": "6-2178_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_9",
            "tgt_ix": "6-2178_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_9",
            "tgt_ix": "6-2178_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_8",
            "tgt_ix": "6-2178_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_12",
            "tgt_ix": "6-2178_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_12",
            "tgt_ix": "6-2178_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_12",
            "tgt_ix": "6-2178_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_0",
            "tgt_ix": "6-2178_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_16",
            "tgt_ix": "6-2178_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_16",
            "tgt_ix": "6-2178_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_18",
            "tgt_ix": "6-2178_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_16",
            "tgt_ix": "6-2178_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_20",
            "tgt_ix": "6-2178_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_20",
            "tgt_ix": "6-2178_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_22",
            "tgt_ix": "6-2178_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_20",
            "tgt_ix": "6-2178_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_20",
            "tgt_ix": "6-2178_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_20",
            "tgt_ix": "6-2178_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_16",
            "tgt_ix": "6-2178_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_27",
            "tgt_ix": "6-2178_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_27",
            "tgt_ix": "6-2178_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_29",
            "tgt_ix": "6-2178_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_27",
            "tgt_ix": "6-2178_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_27",
            "tgt_ix": "6-2178_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_32",
            "tgt_ix": "6-2178_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_0",
            "tgt_ix": "6-2178_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_34",
            "tgt_ix": "6-2178_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_34",
            "tgt_ix": "6-2178_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_34",
            "tgt_ix": "6-2178_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_34",
            "tgt_ix": "6-2178_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_34",
            "tgt_ix": "6-2178_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_34",
            "tgt_ix": "6-2178_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_40",
            "tgt_ix": "6-2178_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_40",
            "tgt_ix": "6-2178_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_0",
            "tgt_ix": "6-2178_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_43",
            "tgt_ix": "6-2178_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_0",
            "tgt_ix": "6-2178_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_45",
            "tgt_ix": "6-2178_v2_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_0",
            "tgt_ix": "6-2178_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_1",
            "tgt_ix": "6-2178_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_2",
            "tgt_ix": "6-2178_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_3",
            "tgt_ix": "6-2178_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_4",
            "tgt_ix": "6-2178_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_5",
            "tgt_ix": "6-2178_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_6",
            "tgt_ix": "6-2178_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_8",
            "tgt_ix": "6-2178_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_9",
            "tgt_ix": "6-2178_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_10",
            "tgt_ix": "6-2178_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_11",
            "tgt_ix": "6-2178_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_12",
            "tgt_ix": "6-2178_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_13",
            "tgt_ix": "6-2178_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_14",
            "tgt_ix": "6-2178_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_15",
            "tgt_ix": "6-2178_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_16",
            "tgt_ix": "6-2178_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_18",
            "tgt_ix": "6-2178_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_19",
            "tgt_ix": "6-2178_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_20",
            "tgt_ix": "6-2178_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_21",
            "tgt_ix": "6-2178_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_22",
            "tgt_ix": "6-2178_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_23",
            "tgt_ix": "6-2178_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_24",
            "tgt_ix": "6-2178_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_25",
            "tgt_ix": "6-2178_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_26",
            "tgt_ix": "6-2178_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_27",
            "tgt_ix": "6-2178_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_28",
            "tgt_ix": "6-2178_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_29",
            "tgt_ix": "6-2178_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_30",
            "tgt_ix": "6-2178_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_31",
            "tgt_ix": "6-2178_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_32",
            "tgt_ix": "6-2178_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_33",
            "tgt_ix": "6-2178_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_34",
            "tgt_ix": "6-2178_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_35",
            "tgt_ix": "6-2178_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_39",
            "tgt_ix": "6-2178_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_40",
            "tgt_ix": "6-2178_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_41",
            "tgt_ix": "6-2178_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_43",
            "tgt_ix": "6-2178_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_44",
            "tgt_ix": "6-2178_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_45",
            "tgt_ix": "6-2178_v2_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_48",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_19",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_21",
            "tgt_ix": "6-2178_v2_23",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_28",
            "tgt_ix": "6-2178_v2_30",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_31",
            "tgt_ix": "6-2178_v2_33",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "6-2178_v2_0",
            "tgt_ix": "6-2178_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_1",
            "tgt_ix": "6-2178_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_2",
            "tgt_ix": "6-2178_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_2",
            "tgt_ix": "6-2178_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_2",
            "tgt_ix": "6-2178_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_3",
            "tgt_ix": "6-2178_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_3",
            "tgt_ix": "6-2178_v2_3@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_3",
            "tgt_ix": "6-2178_v2_3@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_4",
            "tgt_ix": "6-2178_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_4",
            "tgt_ix": "6-2178_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_4",
            "tgt_ix": "6-2178_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_4",
            "tgt_ix": "6-2178_v2_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_4",
            "tgt_ix": "6-2178_v2_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_4",
            "tgt_ix": "6-2178_v2_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_5",
            "tgt_ix": "6-2178_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_6",
            "tgt_ix": "6-2178_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_7@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_7@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_7@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_7@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_7@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_7",
            "tgt_ix": "6-2178_v2_7@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_8",
            "tgt_ix": "6-2178_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_9",
            "tgt_ix": "6-2178_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_10",
            "tgt_ix": "6-2178_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_10",
            "tgt_ix": "6-2178_v2_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_10",
            "tgt_ix": "6-2178_v2_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_10",
            "tgt_ix": "6-2178_v2_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_10",
            "tgt_ix": "6-2178_v2_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_11",
            "tgt_ix": "6-2178_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_11",
            "tgt_ix": "6-2178_v2_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_12",
            "tgt_ix": "6-2178_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_13",
            "tgt_ix": "6-2178_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_13",
            "tgt_ix": "6-2178_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_13",
            "tgt_ix": "6-2178_v2_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_13",
            "tgt_ix": "6-2178_v2_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_14",
            "tgt_ix": "6-2178_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_14",
            "tgt_ix": "6-2178_v2_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_14",
            "tgt_ix": "6-2178_v2_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_15",
            "tgt_ix": "6-2178_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_15",
            "tgt_ix": "6-2178_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_15",
            "tgt_ix": "6-2178_v2_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_15",
            "tgt_ix": "6-2178_v2_15@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_15",
            "tgt_ix": "6-2178_v2_15@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_16",
            "tgt_ix": "6-2178_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_17",
            "tgt_ix": "6-2178_v2_17@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_18",
            "tgt_ix": "6-2178_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_20",
            "tgt_ix": "6-2178_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_21",
            "tgt_ix": "6-2178_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_21",
            "tgt_ix": "6-2178_v2_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_21",
            "tgt_ix": "6-2178_v2_21@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_21",
            "tgt_ix": "6-2178_v2_21@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_21",
            "tgt_ix": "6-2178_v2_21@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_21",
            "tgt_ix": "6-2178_v2_21@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_22",
            "tgt_ix": "6-2178_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_24",
            "tgt_ix": "6-2178_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_24",
            "tgt_ix": "6-2178_v2_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_24",
            "tgt_ix": "6-2178_v2_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_25",
            "tgt_ix": "6-2178_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_25",
            "tgt_ix": "6-2178_v2_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_25",
            "tgt_ix": "6-2178_v2_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_25",
            "tgt_ix": "6-2178_v2_25@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_25",
            "tgt_ix": "6-2178_v2_25@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_26",
            "tgt_ix": "6-2178_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_26",
            "tgt_ix": "6-2178_v2_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_26",
            "tgt_ix": "6-2178_v2_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_26",
            "tgt_ix": "6-2178_v2_26@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_27",
            "tgt_ix": "6-2178_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_28",
            "tgt_ix": "6-2178_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_28",
            "tgt_ix": "6-2178_v2_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_28",
            "tgt_ix": "6-2178_v2_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_28",
            "tgt_ix": "6-2178_v2_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_28",
            "tgt_ix": "6-2178_v2_28@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_29",
            "tgt_ix": "6-2178_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_31",
            "tgt_ix": "6-2178_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_31",
            "tgt_ix": "6-2178_v2_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_31",
            "tgt_ix": "6-2178_v2_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_31",
            "tgt_ix": "6-2178_v2_31@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_31",
            "tgt_ix": "6-2178_v2_31@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_31",
            "tgt_ix": "6-2178_v2_31@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_32",
            "tgt_ix": "6-2178_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_34",
            "tgt_ix": "6-2178_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_35",
            "tgt_ix": "6-2178_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_35",
            "tgt_ix": "6-2178_v2_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_35",
            "tgt_ix": "6-2178_v2_35@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_36@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_36@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_36@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_36@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_36@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_36",
            "tgt_ix": "6-2178_v2_36@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_37@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_37@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_37@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_37@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_37@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_37",
            "tgt_ix": "6-2178_v2_37@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@14",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@15",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@16",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@17",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@18",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@19",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@20",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_38",
            "tgt_ix": "6-2178_v2_38@21",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_39",
            "tgt_ix": "6-2178_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_39",
            "tgt_ix": "6-2178_v2_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_39",
            "tgt_ix": "6-2178_v2_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_39",
            "tgt_ix": "6-2178_v2_39@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_39",
            "tgt_ix": "6-2178_v2_39@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_39",
            "tgt_ix": "6-2178_v2_39@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_40",
            "tgt_ix": "6-2178_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_41",
            "tgt_ix": "6-2178_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_41",
            "tgt_ix": "6-2178_v2_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_41",
            "tgt_ix": "6-2178_v2_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_41",
            "tgt_ix": "6-2178_v2_41@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_41",
            "tgt_ix": "6-2178_v2_41@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_41",
            "tgt_ix": "6-2178_v2_41@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@14",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@15",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_42",
            "tgt_ix": "6-2178_v2_42@16",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_43",
            "tgt_ix": "6-2178_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_44",
            "tgt_ix": "6-2178_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_44",
            "tgt_ix": "6-2178_v2_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_44",
            "tgt_ix": "6-2178_v2_44@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_45",
            "tgt_ix": "6-2178_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_46",
            "tgt_ix": "6-2178_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_47",
            "tgt_ix": "6-2178_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_48",
            "tgt_ix": "6-2178_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_49",
            "tgt_ix": "6-2178_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_50",
            "tgt_ix": "6-2178_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_51",
            "tgt_ix": "6-2178_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_52",
            "tgt_ix": "6-2178_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_53",
            "tgt_ix": "6-2178_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_54",
            "tgt_ix": "6-2178_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_55",
            "tgt_ix": "6-2178_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_56",
            "tgt_ix": "6-2178_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_57",
            "tgt_ix": "6-2178_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_58",
            "tgt_ix": "6-2178_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_59",
            "tgt_ix": "6-2178_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_60",
            "tgt_ix": "6-2178_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_61",
            "tgt_ix": "6-2178_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_62",
            "tgt_ix": "6-2178_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_63",
            "tgt_ix": "6-2178_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_64",
            "tgt_ix": "6-2178_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_65",
            "tgt_ix": "6-2178_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_66",
            "tgt_ix": "6-2178_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_67",
            "tgt_ix": "6-2178_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_68",
            "tgt_ix": "6-2178_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_69",
            "tgt_ix": "6-2178_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_70",
            "tgt_ix": "6-2178_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_71",
            "tgt_ix": "6-2178_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_72",
            "tgt_ix": "6-2178_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_73",
            "tgt_ix": "6-2178_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_74",
            "tgt_ix": "6-2178_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_75",
            "tgt_ix": "6-2178_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "6-2178_v2_76",
            "tgt_ix": "6-2178_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "6-2178_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.13444.2",
        "atype": "systematic-review",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Patent foramen ovale closure versus medical therapy for stroke prevention: A systematic review and meta-analysis of randomized controlled trials",
        "abstract": "Background: Previous randomized trials on patent foramen ovale (PFO) closure versus medical therapy for stroke prevention were inconclusive. Recently, two new randomized trials and new findings from an extended follow-up of a previous trial have been published on this topic. We conducted a systematic review and meta-analysis of randomized trials comparing PFO closure with medical therapy for stroke prevention. Methods: PubMed and Cochrane Library were searched until 16 th September 2017. The following search terms were used for PubMed: \"patent foramen ovale\" AND (stroke OR embolism) and \"randomized\" AND \"Trial\". For Cochrane Library, the following terms were used: \"patent foramen ovale\" AND \"closure\" AND (stroke OR embolism). Results: A total of 91 and 55 entries were retrieved from each database using our search strategy respectively, of which six studies on five trials met the inclusion criteria. This meta-analysis included 1829 patients in the PFO closure arm (mean age: 45.3 years; 54% male) and 1972 patients in the medical therapy arm (mean age: 45.1 years; 51% male). The median follow-up duration was 50 ± 30 months. When compared to medical therapy, PFO closure significantly reduced primary endpoint events with a risk ratio [RR] of 0.60 (95% CI: 0.44-0.83, P < 0.0001; I 2 : 15%). It also reduced stroke (RR: 0.50, 95% CI: 0.35-0.73, P < 0.0001; I 2 : 32%) despite increasing the risk of atrial fibrillation/flutter (RR: 1.90, 95% CI: 1.23-2.93, P < 0.01; I 2 : 43%). However, it did not reduce transient ischemic accident events (0.75; 95% CI: 0.51-1.10, P = 0.14; I 2 : 0%), all-cause bleeding (RR: 0.89; 95% CI: 0.44-1.78, P = 0.74; I 2 : 51%) or gastrointestinal complications (RR: 0.92; 95% CI: 0.32-2.70, P = 0.88; I 2 : 0%). Conclusions: PFO closure significantly reduces risk of stroke when compared to medical treatment and should therefore be considered for stroke prevention in PFO patients.",
        "contributors": [
            {
                "surname": "Lai",
                "given-names": "Jenny Chi Ling "
            },
            {
                "surname": "Tse",
                "given-names": "Gary"
            },
            {
                "surname": "Wu",
                "given-names": "William K.K."
            },
            {
                "surname": "Gong",
                "given-names": "Mengqi"
            },
            {
                "surname": "Bazoukis",
                "given-names": "George"
            },
            {
                "surname": "Wong",
                "given-names": "Wing Tak"
            },
            {
                "surname": "Wong",
                "given-names": "Sunny Hei"
            },
            {
                "surname": "Lampropoulos",
                "given-names": "Konstantinos"
            },
            {
                "surname": "Baranchuk",
                "given-names": "Adrian"
            },
            {
                "surname": "Tse",
                "given-names": "Lap Ah"
            },
            {
                "surname": "Xia",
                "given-names": "Yunlong"
            },
            {
                "surname": "Li",
                "given-names": "Guangping"
            },
            {
                "surname": "Wong",
                "given-names": "Martin C.S."
            },
            {
                "surname": "Chan",
                "given-names": "Yat Sun"
            },
            {
                "surname": "Mu",
                "given-names": "Nan"
            },
            {
                "surname": "Dong",
                "given-names": "Mei"
            },
            {
                "surname": "Liu",
                "given-names": "Tong"
            }
        ],
        "url": "https://f1000research.com/articles/6-2178/v2/",
        "doc_id": "6-2178",
        "version": 2,
        "ix_counter": 356,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}