{
    "nodes": [
        {
            "ix": "9-34_v2_0",
            "content": "Intrinsic negative feedback as a limiting factor for the evolution of higher forms of intelligence",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_2",
            "content": "Longstanding scientific efforts have been dedicated to answer why and how our particular intelligence is generated by our brain but not by the brain of other species. However, surprisingly little effort has been made to ask why no other species ever developed an intelligence similar to ours. Here, I explore this question based on genetic and paleontologic evidence. Contrary to the established view, this review suggests that the developmental hurdles alone are not high enough to explain the uniqueness of human intelligence (HI). As an additional explanation I propose that HI is normally not retained by natural selection, because it is, under most conditions, an intrinsically unfavourable trait. This unfavourableness, however, cannot be explained by physical constraints alone; rather, it may also be rooted in the same emotional and social complexity that is necessary for the development of HI. Thus, a major obstacle towards HI may not be solely the development of the required physical assets, but also to cope with harmful individual, social and environmental feedback intrinsically associated with this trait.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_4",
            "content": "Our particular type of intelligence is commonly believed to be the central feature that has allowed humans to become one of the most abundant mammals on Earth. Yet, although our intelligence is such a powerful and generally useful trait, it has never been paralleled in any other organism. As an explanation, we generally assume that our cognitive uniqueness results from the major difficulty in achieving the required level of developmental sophistication. And after billion years of competitive evolution, we humans were the first species advanced enough to surmount these difficulties and to accumulate all features necessary for achieving this higher intelligence. Here, I investigate this conjecture and its underlying assumptions. For this purpose, I deliberately and necessarily adopt a very narrow anthropocentric definition for human (or human-like) intelligence (HI) as “the intelligence that enables development of advanced technology-based societies like ours”. Within this definition, ‘intelligence’ does not only refer to ‘computing power’, but also to the full ensemble of cognitive and character traits required.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_5",
            "content": "A race towards higher intelligence?",
            "ntype": "title",
            "meta": {
                "section": "1.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_6",
            "content": "First, underlying this conjecture is a worldwide trend toward ever higher levels of intelligence, a trend that reached a critical threshold in the Pliocene when HI was finally developed in humans <REF-1> , <REF-2> . Evidence for such a trend is weak. While a global trend toward bigger brains has been observed in several instances, it does not hold true for all taxonomic levels <REF-1> – <REF-4> . It is unclear if this trend, which is weak and concomitant with an increase in diversity and afflicted by exceptions, is the result of directed evolution or random drift <REF-3> . It also appears that this trend, if it indeed exists, is a much weaker driving force than are the forces that are linked to adaptation to a specific niche <REF-5> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_7",
            "content": "Linear evolution versus iterative adaptation",
            "ntype": "title",
            "meta": {
                "section": "1.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_8",
            "content": "The argument that Homo sapiens was the first to reach an HI-enabling level of developmental sophistication evokes a linear view of evolution that posits that basal forms develop into ever more advanced and intelligent organisms. However, paleontologic and genetic evidence shows that evolution is not an orderly step-by-step advancement; rather, it is characterised by consecutive waves of radiation of species (many of which become dead-end groups) into the same ecological niches <REF-6> . During this iterative process of consecutive adaptations, many sophisticated characteristics (such as vision, flight, echolocation, burrowing or re-adaptation to water) evolved several times, successively and independently, in different species <REF-6> – <REF-11> ( Figure 1 ). Even mammalian hallmark features, such as the middle ear and tribosphenic (crushing and biting) molars, evolved not once but several times in different mammals <REF-6> , <REF-12> . This convergence level of evolution indicates that the geological time scale is sufficiently large compared to the biological reproduction and diversification rates that even complex anatomical and molecular features can be reproduced if they enhance the chances of a species’ survival. Since our type of intelligence appears to be such a powerful and versatile development for the survival of a species, why has no other organism acquired HI?",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_9",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Evolution of features related to thinking, swimming and flying. Left: Skeletal changes associated with evolution of the human brain. ( A ) Rhinopithecus (stub-nosed monkey), ( B ) Australopithecus , ( C ) Homo erectus , ( D ) Homo neanderthalensis , ( E ) Homo sapiens . Note that also other anatomical features are likely to be required for human intelligence (HI) (for example those enabling tool-use). Middle: Skeletal changes associated with the evolution of whales. Adaptations to the aquatic habitat include: Removing of external appendices (ears, genitals, hind legs); changes of skin; loss of hair; stream-lined body shape; development of a sealable blowhole on top of the head, flippers, tail flukes and a dorsal fin; evolution of a flexible rib cage; increased organ-selective oxygen storage in the body; increased anaerobic capacity of muscles; capacity to slow down pulse ( bradycdia ); capacity of resting (‘sleeping’) one half of the brain at a time; tail-first birth of babies; development of echolocation ( odontoceti ). ( A ) Diacodexis , ( B ) Pakicetcus , ( C ) Ambulocetus , ( D ) Dorudon , ( E ) Balaena . Taken from <REF-27> . Right: Convergent evolution for wing development. ( A ) pterosaurus, ( B ) bat, ( C ) bird, ( D ) insect, ( E ) flying fish. Note that although vertebrate forelimbs adaptions are functionally convergent, they are not anatomically convergent. Insect wings are formed from a totally different organ. Although flying and re-adaptation to water are not equivalent to the development of HI on all levels, they might serve as comparison in terms of ‘evolutionary difficulty’ with respect to the required profound reshaping or combination of existing structures (including alterations in bone structure, muscle, metabolism, respiration, vision or connective tissue).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/28862/c9ca0ffb-bb0c-4b13-9641-97c341567c00_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_10",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Evolution of features related to thinking, swimming and flying.</title> <p> <italic>Left:</italic> Skeletal changes associated with evolution of the human brain. ( <bold>A</bold>) <italic>Rhinopithecus</italic> (stub-nosed monkey), ( <bold>B</bold>) <italic>Australopithecus</italic>, ( <bold>C</bold>) <italic>Homo erectus</italic>, ( <bold>D</bold>) <italic>Homo neanderthalensis</italic>, ( <bold>E</bold>) <italic>Homo sapiens</italic>. Note that also other anatomical features are likely to be required for human intelligence (HI) (for example those enabling tool-use). <italic>Middle:</italic> Skeletal changes associated with the evolution of whales. Adaptations to the aquatic habitat include: Removing of external appendices (ears, genitals, hind legs); changes of skin; loss of hair; stream-lined body shape; development of a sealable blowhole on top of the head, flippers, tail flukes and a dorsal fin; evolution of a flexible rib cage; increased organ-selective oxygen storage in the body; increased anaerobic capacity of muscles; capacity to slow down pulse ( <italic>bradycdia</italic>); capacity of resting (&#8216;sleeping&#8217;) one half of the brain at a time; tail-first birth of babies; development of echolocation ( <italic>odontoceti</italic>). ( <bold>A</bold>) <italic>Diacodexis</italic>, ( <bold>B</bold>) <italic>Pakicetcus</italic>, ( <bold>C</bold>) <italic>Ambulocetus</italic>, ( <bold>D</bold>) <italic>Dorudon</italic>, ( <bold>E</bold>) <italic>Balaena</italic>. Taken from <xref ref-type=\"bibr\" rid=\"ref-27\">27</xref>. <italic>Right:</italic> Convergent evolution for wing development. ( <bold>A</bold>) pterosaurus, ( <bold>B</bold>) bat, ( <bold>C</bold>) bird, ( <bold>D</bold>) insect, ( <bold>E</bold>) flying fish. Note that although vertebrate forelimbs adaptions are functionally convergent, they are not anatomically convergent. Insect wings are formed from a totally different organ. Although flying and re-adaptation to water are not equivalent to the development of HI on all levels, they might serve as comparison in terms of &#8216;evolutionary difficulty&#8217; with respect to the required profound reshaping or combination of existing structures (including alterations in bone structure, muscle, metabolism, respiration, vision or connective tissue).</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/28862/c9ca0ffb-bb0c-4b13-9641-97c341567c00_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Evolution of features related to thinking, swimming and flying. Left: Skeletal changes associated with evolution of the human brain. ( A ) Rhinopithecus (stub-nosed monkey), ( B ) Australopithecus , ( C ) Homo erectus , ( D ) Homo neanderthalensis , ( E ) Homo sapiens . Note that also other anatomical features are likely to be required for human intelligence (HI) (for example those enabling tool-use). Middle: Skeletal changes associated with the evolution of whales. Adaptations to the aquatic habitat include: Removing of external appendices (ears, genitals, hind legs); changes of skin; loss of hair; stream-lined body shape; development of a sealable blowhole on top of the head, flippers, tail flukes and a dorsal fin; evolution of a flexible rib cage; increased organ-selective oxygen storage in the body; increased anaerobic capacity of muscles; capacity to slow down pulse ( bradycdia ); capacity of resting (‘sleeping’) one half of the brain at a time; tail-first birth of babies; development of echolocation ( odontoceti ). ( A ) Diacodexis , ( B ) Pakicetcus , ( C ) Ambulocetus , ( D ) Dorudon , ( E ) Balaena . Taken from <REF-27> . Right: Convergent evolution for wing development. ( A ) pterosaurus, ( B ) bat, ( C ) bird, ( D ) insect, ( E ) flying fish. Note that although vertebrate forelimbs adaptions are functionally convergent, they are not anatomically convergent. Insect wings are formed from a totally different organ. Although flying and re-adaptation to water are not equivalent to the development of HI on all levels, they might serve as comparison in terms of ‘evolutionary difficulty’ with respect to the required profound reshaping or combination of existing structures (including alterations in bone structure, muscle, metabolism, respiration, vision or connective tissue).",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/28862/c9ca0ffb-bb0c-4b13-9641-97c341567c00_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_11",
            "content": "Lack of suitable environment?",
            "ntype": "title",
            "meta": {
                "section": "1.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_12",
            "content": "The previous section highlights the importance of ecological niches in directing the evolution of specific traits. Hominid evolution is indeed likely to have been driven by particular changes or variability in climate, although the exact nature and importance of these changes are a matter of debate <REF-13> . More specifically concerning our cognition, coping with environmental changes has been suggested as a factor that drives brain evolution, within the cognitive buffer hypothesis <REF-14> . Nonetheless, the climate changes evoked are not sufficiently rare or specific to be a serious limiting factor for the development of HI in other species. Moreover, similar environments, or environmental changes, have failed to promote the emergence of HI in other species. Additionally, if the competitive advantage and driving force of HI development lies in overcoming dependence of the environment <REF-14> , or enables favourable niche construction <REF-15> , then this advantage would profit many species, and hence is not a limiting factor. Finally, the rapid and almost worldwide spread of Homo species shows that its type of intelligence can be used under many conditions and is not an adaptation limited to a unique environmental ecological niche or geological condition that existed only at the precise time and place of the origin of humans.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_13",
            "content": "Brain size, structure and complexity",
            "ntype": "title",
            "meta": {
                "section": "1.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_14",
            "content": "Compared to the brain structure and brain-body ratios of other animals, the human brain is, of course, exceptionally big and complex in terms of layered structure, interconnectedness and neuronal diversity. But is its structure unique and sophisticated enough to justify that our brain capacity was never paralleled through adaptation and convergent evolution? Accumulated evidence suggests that the answer is no. Neuroscientists have established that the brain structures of birds and mammals are never simple. The anatomical differences between species reflect the animals’ adaptations to a particular niche, not the lack of sufficient time for their brains to become more complex <REF-5> . In fact, the human brain is less evolved (in the sense of being altered with respect to the brains of stem mammalians) than the aye-aye ( Daubentonia madagascariensis ) brain <REF-16> . Rather, the human brain is more or less a scaled-up version of a non-human primate brain <REF-17> . Its size and structure are principally the result of simply extending the high growth rate of foetal brains into early infancy <REF-18> – <REF-21> . This prolonged growth was achieved by the modification of gene expression patterns of a few regulators <REF-22> , <REF-23> , a common mechanism for species differentiation (for example, <REF-24> – <REF-26> ). Of course, the scaling-up of the primate brain did not linearly affect all components, and the enhanced increase of the neocortex was certainly key to generating HI. Yet, altering the gene expression pattern of a single transcription factor ( Pax6 ) in mice to a human-like pattern suffices to obtain a primate-like increase in neural progenitors, notably basal radial glia, and ultimately in the number of neurons produced, which is thought to underlie the evolutionary expansion of the neocortex <REF-23> . Human brain performance was additionally boosted by slightly increasing the ratio of astrocytes to neurons, a tendency already observed in other higher mammals <REF-28> . This ratio present in humans is, however, similar to that seen in other primates <REF-17> . In terms of genetic modifications, the development of the human brain therefore appears to be based on extending already existing features through gradual and common mechanisms, rather than being the result of a genetic quantum leap.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_15",
            "content": "Such genetic evolutionary mechanisms are not restricted to primates. For example, it was the expansion of a handful of gene families and genome rearrangements in an otherwise standard invertebrate gene background that allowed octopuses to produce profound morphological and neurological changes <REF-29> . These changes sufficed to produce a large and sophisticated nervous system in addition to profound morphological innovations for their vision, arms and embryogenesis, resulting in a dramatically increased cognition and behavioural richness in octopuses as compared to worms, molluscs and other lophotrochozoans. Thus, the emergence of our highly specific human cognition has been achieved through continuity on a genetic level, accessible in principle also to other species.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_16",
            "content": "Convergent evolution of intelligence",
            "ntype": "title",
            "meta": {
                "section": "1.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_17",
            "content": "Since the human brain originated through extensions of primate brain features, can HI originate only from the brain structure of apes (Hominoidea)? If this is the case, then apes would have had to evolve first before HI occurred, and this condition may help to explain the late and single occurrence of this type of intelligence. However, it was not only other primate species (such as capuchins), but also elephants, cetaceans and certain birds that independently evolved cognitive and social characteristics that are very similar to those of apes (including self-consciousness, grief, altruism, play, envy, compassion and abstract numerical competence), despite having fundamentally different brain architectures <REF-30> – <REF-36> . Although the overall brain architecture differs, convergent evolution can produce obligatory neuronal adaptations in unrelated genera. For example, von Economo neurons, which have been related to complex social behaviour, have independently evolved in primates, whales, elephants and racoons <REF-37> . Because of neuroplasticity, such convergent evolution is even easier for the brain than for other organs. Accordingly, our particular intelligence is not based on unique characteristics; rather, it arises from a combination and enhancement of abilities found in other vertebrates <REF-38> . In fact, our large brains and particular intelligence appear to be independent of our ape phylogeny; rather, they result from convergent processes similar to those that produced avian and New World monkey brains <REF-39> . Taken together with the finding that in some cognitive tasks monkeys can be outperformed by other animals, including birds <REF-40> , <REF-41> and even fish <REF-42> , scientific evidence does not support the unilinear view that only the brain structure of apes is suited to produce HI.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_18",
            "content": "Overcoming the high energy requirement",
            "ntype": "title",
            "meta": {
                "section": "1.6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_19",
            "content": "Big brains are energetically costly organs. Moreover, because of its neuronal density and neuron/glial cell ratio, a human brain requires more energy than for example a rodent brain of the same size <REF-43> . Could the unique development of HI in humans be explained by our species being the only one capable of coping with the high metabolic demand of a brain required for generating HI?",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_20",
            "content": "There are many ways of overcoming metabolic limitations. These include shifting to higher-energy food sources (such as nuts, honey or meat, especially from invertebrates like molluscs or insects); external transformation of food to a more edible state (through grinding, fermentation, cooking or other types of food processing); more efficient use of existing food sources through simple tools and/or strategies (for transport, butchery, or storage); adaptive genetic changes to improve the digestive system (and associated microflora), or to diminish body energy expenditure [such as changes in skin coating (e.g. fur or feathers) or locomotion (e.g. bipedalism, architecture of limbs and feet)]; increasing foraging efficiency through intra-species organisation (e.g. for hunting, gathering, carcass defence or food processing); or shifting to habitats richer in high-protein food sources. A subset of these strategies was sufficient to provide the increased energy demand throughout hominid evolution (see ref. <REF-44> and discussion therein). These strategies (including the cognitive capacities to cook <REF-45> ) do not require features that are only found in humans, making sufficient subsets of them also accessible to other species. Moreover, as the brain of an organism becomes bigger and more powerful, the enhanced cognitive capacities will increasingly enable this organism to implement strategies to enhance energy intake. The cognitive pay-offs of big brains should therefore allow alleviation of the associated energetic cost. In conclusion, while the high energy demand of an HI-capable brain is an important roadblock for the development of HI, the physical and intellectual strategies required to overcome this hurdle are not only accessible to the human body plan. And although the adaptations required to sustain a big brain are profound, they are paralleled, for example, by the metabolic and physical adaptations required for powered flight, which has evolved multiple times in different taxa ( Figure 1 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_21",
            "content": "Language and intelligence",
            "ntype": "title",
            "meta": {
                "section": "1.7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_22",
            "content": "It appears safe to assume that HI would not be possible without a powerful language. Compared to other animals, the human language appears to distinguish itself in many ways, including the large amount of symbols used (‘vocabulary’), the complex compositional, hierarchical and recursive syntax, and the need to learn the complete language from scratch during an individual’s lifetime <REF-46> . It has been suggested that language evolution and efficient tool use have stimulated each other mutually <REF-47> . More generally, it might be that the way of thinking that our language enables is what makes us human <REF-48> , <REF-49> . It is therefore important to discuss whether the uniqueness of HI can be explained by the uniqueness of our language.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_23",
            "content": "Adopting the particular viewpoint of this essay, we then have to ask whether the development of HI-supporting language would be possible for other species. Let us first consider the requirements for producing a sufficient vocabulary. On a purely anatomical or mechanistic level, a HI-supporting language might be any sort of expression not limited to speech (e.g. twitter, tapping, signs, gestures, visual cues) that can produce a sufficient vocabulary space. This requirement does not seem to be restrictive. Moreover, some evidence suggests that the increase in human brain size preceded the development of finely articulated speech <REF-50> . It was therefore not the pre-existence of an articulate vocalisation, but only a physiological potential for it, that was sufficient for allowing the evolution of HI in humans.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_24",
            "content": "Let us now consider language syntax and acquisition with respect to human uniqueness. It has indeed been proposed that such properties of the human language are neither specific to language nor to humans: Already Darwin had recognized the similarity between birdsong and human speech <REF-51> . The process and the underlying neuronal circuits by which a young bird learns the songs from an adult ‘tutor’ show indeed strong parallels with speech acquisition in human infants on behavioural, neural and genetic levels <REF-52> , <REF-53> . Moreover, common genetic key players have been identified, including the FOXP2 gene <REF-54> , <REF-55> . The hierarchical combination of ‘words’ bears resemblance to semantic combinations in primate calls or compass headings in honeybees <REF-56> , <REF-57> . It has therefore been suggested that the human language results from the combination of separate, pre-existing simple systems that may have evolved for other functional tasks <REF-58> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_25",
            "content": "In conclusion, while the exact behavioural, neural and molecular links between language, intelligence and behaviour are still emerging and under debate, significant characteristics of human language appear accessible to other species, including non-primates, and are not tied to a specific brain anatomy or size. Thus, current evidence suggests that the capacity for developing a HI-supporting system of communication is not a feature strictly limited to humans or the human brain anatomy or speech production.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_26",
            "content": "Is there an essential combination of features?",
            "ntype": "title",
            "meta": {
                "section": "1.8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_27",
            "content": "HI poses requirements to a candidate species beyond developing and coping with the appropriate brain anatomy, associated energy demands and language. For example, HI would be most useful in an organism that can use tools and has a complex social system that allows transmitting and accumulating acquired knowledge and culture. Importantly, these individual features synergise with each other (e.g. <REF-47> , <REF-59> ) and may need to evolve as an ensemble. While producing one individual feature may not be particularly difficult, and although combination of pre-existing traits is a common evolutionary mechanism, it could still be that the combined likelihood of assembling all required features in one species is sufficiently small to explain HI’s uniqueness. Unfortunately, it is currently impossible (i) to test which sub-ensemble of characteristics is a strict prerequisite for HI development (as opposed to characteristics which can be developed en route towards HI), and (ii) to quantitate the likelihood for the occurrence of such an ensemble in one animal. Thus, we can only approximate this question by asking if the presence of HI-enabling features and capacities was uniquely found in early hominids. In other words, is HI development such a rare event because of a shortage of suitable candidate species?",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_28",
            "content": "Tool use is well documented in many animals and is neither restricted to primates (it has been observed in sea otters, elephants and dolphins) nor to mammals (more than 120 cases of tool use in 104 bird species have been reported) <REF-60> – <REF-63> . Many species of dinosaurs, Triassic archosaurs or marsupials were/are bipeds with free, articulate limbs, affording them great potential for tool use <REF-9> , many relatively small, birdlike dinosaurs, such as Troodon , possessed a grasping hand with an opposable digit <REF-64> , whereas dolphins use tools even though they have no limbs to grasp the tools. Child caring, intra-species communication and even cultural transmissions are documented not only in primates, but also other vertebrates (such as meerkats and fish) and maybe even in insects (e.g., teaching behaviours have been suggested in ants) <REF-65> . Social complexity as a potential driver for enhanced brain size and social intelligence (the ‘social complexity hypothesis’ <REF-59> ) has been reported in diverse non-human vertebrates (including lemurs, dolphins, parrots and spotted hyenas <REF-66> – <REF-70> , suggesting that social complexity can drive brain evolution in diverse species. With respect to the importance of language, as discussed above, many species possess means of communication which might have the potential to evolve, within a few million years, into a sufficiently complex vocabulary and syntax to synergise with an emerging cognition. Thus, great apes, dolphins and some bird species have reached a high sophistication in terms of vocabulary, semantics, syntax and symbolic references, together with their cognitive capacities <REF-33> , <REF-71> , <REF-72>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_29",
            "content": "Finally, development of HI does not appear restricted to organisms with sizes similar to humans. Although the brain-to-body size (encephalization) appears to correlate roughly with cognitive capacity, brains do not have to be above a particular absolute size to produce high levels of intelligence <REF-73> . For example, despite having a smaller brain than chimpanzees and australopithecines, Homo floresiensis , the Indonesian small-bodied ‘Hobbit’ species, was capable of manufacturing tools as advanced as those produced by Homo species with a three times larger brain <REF-74> . Moreover, the complex cognitive abilities of some bird species (including tool use, episodic-like memory, predicting the behaviour of conspecifics based on own experiences and self-recognition) are produced by brains that are less than 10 g in weight <REF-75> . Thus, HI candidate species are not limited to those animals that have comparable sizes to humans.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_30",
            "content": "In summary, while it is currently impossible to evaluate the evolutionary likelihood for combining the required features into a HI-capable animal, it is clear that many organisms besides humans readily combined several characteristics that could support HI (such as tool use, cultural transmissions, size of groups or body). During development towards HI, these characteristics can in principle be developed further, and completed, as it has been the case in our lineage. And although the combination of features found in early hominids before brain expansion (i.e. free limbs, capacity for grasping, social structure and tool use) are not common, they are not unique either, and it is therefore unlikely that HI was developed only once because no other species would have been a suitable candidate.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_31",
            "content": "HI as an intrinsically unfavourable trait",
            "ntype": "title",
            "meta": {
                "section": "1.9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_32",
            "content": "According to the findings discussed above, the development of HI is not complex enough to fully explain that it has never been reproduced in any other species than Homo sapiens . If HI were within reach of convergent evolution, as my survey suggests, then an intriguing possible explanation for the fact that HI nonetheless evolved only once would be that HI is normally an overall unfavourable feature that is sooner or later sanctioned by selection. Yet, the physical constraints associated with HI appear to be manageable, and the human body is not special enough to suggest that no other organism could have evolved to cope with those constraints. If there is an unfavourable aspect of HI, then it must arise from somewhere other than these physical constraints.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_33",
            "content": "Could it be that some of the same mental and behavioural characteristics that are necessary for the development of HI might become increasingly unfavourable as a species evolves towards HI, creating a negative feedback loop? There is certainly a positive correlation between the proximity of species to HI and the emotional and structural complexity of their individuals and societies (where emotional complexity is defined as having emotional experiences that are broad in range and well differentiated). This correlation is apparent in species with very different brain structures and sizes (cetaceans, elephants, apes, Cebus monkeys and some birds <REF-30> , <REF-31> , <REF-33> , <REF-72> , <REF-76> ), suggesting that it is an intrinsic hallmark of HI.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_34",
            "content": "Behavioural studies on capuchin monkeys may provide an anecdotal illustration of this concept. These New World monkeys independently evolved an intelligence with certain characteristics similar to that of great apes and humans <REF-33> . Owing to their particular amalgam of a strong cognitive capacity and an emotional and almost pugnacious character, capuchins have developed tools and strategies that allow them to forage for food that is impossible for most other animals to attain. Their complex social system stimulates learning, the emergence of culture and the establishment of an efficient communal defence against predators <REF-33> . This type of intelligence, however, produces a society in which individuals spend an excessive amount of time engaged in complex nonproductive or even counterproductive social activities (such as allomothering, non-reproductive sex, apparently non-profit harassment of other animals or harmful “games” such as eyeball poking) and in violent or lethal aggression (the major cause of death for a capuchin monkey is an altercation with another capuchin monkey) <REF-33> . If a further increase in the monkey’s para-HI intelligence requires increasing the same behavioural and character features that cause counterproductive comportments, then the resulting negative feedback may block development of HI. Conversely, if a candidate species deviates too much from these characteristics, then HI may not result, despite a suitable cognitive power.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_35",
            "content": "In humans, an illustration for the negative effects of HI-associated cognitive complexity is provided by the high incident of cognitive diseases. For example, schizophrenia has been suggested to be ‘the price that Homo sapiens pays for language’ <REF-77> . It has also been shown in animals and humans that the more polymorphic tri-nucleotide repeats are present in the gene Hdh (which codes for the protein huntingtin), the higher the capacity of this gene to promote the neural tube formation required for complex brains, but also the higher the probability to develop fatal neurodegenerative Huntington’s disease <REF-78> . More generally, the genes regulating synaptogenesis and neuronal circuit formation have been associated with an increased risk of mental illnesses <REF-79> , <REF-80> . Based on autism spectrum disorders, it was suggested that brain networks involved in HI-required cognitive skills, such as language and complex social behaviour, have less compensatory mechanisms, and are hence less robust, than more ancient biological functions <REF-80> . As a final example, the rise of complex diseases (i.e. diseases caused by a combination of genetic, environmental and lifestyle factors) has been linked to the rapid genetic, geographic, dietary and cultural changes associated with HI <REF-81> . The impact of neurological pathologies increases in high-cognition species, and cumulates in humans, where currently about one in four individuals is affected (source: World Health Organization, 2001 ). The incidence of mental disorders continues to grow, and with it its individual, social and economic impacts ( World Health Organization, 2019 ). Accordingly, mental health costs are now the highest single source of global economic burden in the world <REF-82> . Thus, the increased instability and lability inherently associated with a trajectory towards HI might produce a negative feedback loop counteracting the evolution of HI.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_36",
            "content": "Additionally, there might be a different type of negative feedback loop intrinsic to HI—HI might simply allow a species to become so successful in exploiting food resources that these resources become exhausted. A non-human example is provided by long-tailed macaques living on islands in Thailand. These monkeys developed stone tools that allow foraging on shellfish. Over time, however, this technology is so efficient that the macaques severely deplete the shellfish populations on the islands. This triggers a feedback loop where diminishing prey size results in reduced stone size <REF-83> . The authors suggest that continuation of this pattern leads to a point where this technology is no longer beneficial or useful to the island macaques, ultimately leading to extinguishing of this technology.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_37",
            "content": "Conclusion and outlook",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "conclusions",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_38",
            "content": "A specie’s intelligence is a multidimensional characteristic adapted to maximise the specie’s survival. My analysis suggests that the genetic adaptations required for development of HI might have been within reach of more species than only Homo sapiens . However, all other species that have radiated into high-intelligence niches have stagnated at sub-HI levels, often for many million years; only the Homo lineage has crossed this barrier in a very short time. The fact that no other species has reached HI appears unsatisfactorily explained by physical constraints of HI. A possible additional explanation may be that the main barrier towards HI is not only the development of the required physical assets, but also that negative feedback from social, behavioural and neuroanatomical complexity, as well as negative environmental feedback make the development of HI increasingly unfavourable.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_39",
            "content": "How could Homo overcome this barrier? I speculate that key features may have been that our brain originated very rapidly as an exaptation, not adaptation <REF-84> , together with an ensemble of favourable anatomical changes (e.g., skeletal proportions, dental function and the respiratory system), in a species with extremely low population densities (typically about 10 individuals per 100 km 2 <REF-85> ). This origin may have initially allowed Homo to develop the brain structure required for HI, while circumventing or sufficiently attenuating immediate negative feedback associated with the use of HI in a socially complex populous environment where intra-species competition is the biggest threat.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_40",
            "content": "However, as we are becoming overly abundant, and use our brain to its full potential to succeed within our complex societies, the negative side effects become increasingly challenging. Despite the development of psychological, moral, behavioural (‘self-domestication’), pharmacological and technological solutions, we are knowingly and consciously pursuing our unsustainable development that is rapidly destroying the resources upon which we critically depend <REF-86> , <REF-87> . However, globally engaging in the actions required to change our current trajectory and achieve long-term sustainability appears contrary to human nature.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_41",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_42",
            "content": "No data are associated with this article.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_43",
            "content": "<REF-1> Jerison HJ : Brain evolution: new light on old principles. Science. 1970 ; 170 ( 3963 ): 1224 – 1225 . 5478198 10.1126/science.170.3963.1224",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_44",
            "content": "<REF-2> Kruska DC : On the evolutionary significance of encephalization in some eutherian mammals: effects of adaptive radiation, domestication, and feralization. Brain Behav Evol. 2005 ; 65 ( 2 ): 73 – 108 . 15627722 10.1159/000082979",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_45",
            "content": "<REF-3> Finarelli JA Flynn JJ : The evolution of encephalization in caniform carnivorans. Evolution. 2007 ; 61 ( 7 ): 1758 – 1772 . 17598754 10.1111/j.1558-5646.2007.00131.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_46",
            "content": "<REF-4> Montgomery SH Geisler JH McGowen MR : The evolutionary history of cetacean brain and body size. Evolution. 2013 ; 67 ( 11 ): 3339 – 3353 . 24152011 10.1111/evo.12197",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_47",
            "content": "<REF-5> Marino L Hof PR : Nature's experiments in brain diversity. Anat Rec A Discov Mol Cell Evol Biol. 2005 ; 287 ( 1 ): 997 – 1000 . 16200645 10.1002/ar.a.20261",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_48",
            "content": "<REF-6> Luo ZX : Transformation and diversification in early mammal evolution. Nature. 2007 ; 450 ( 7172 ): 1011 – 1019 . 18075580 10.1038/nature06277",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_49",
            "content": "<REF-9> Brusatte SL Benton MJ Ruta M : Superiority, competition, and opportunism in the evolutionary radiation of dinosaurs. Science. 2008 ; 321 ( 5895 ): 1485 – 1488 . 18787166 10.1126/science.1161833",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_50",
            "content": "<REF-11> Wang M O'Connor JK Xu X : A new Jurassic scansoriopterygid and the loss of membranous wings in theropod dinosaurs. Nature. 2019 ; 569 ( 7755 ): 256 – 259 . 31068719 10.1038/s41586-019-1137-z",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_51",
            "content": "<REF-12> Martin T Ruf I : Paleontology. On the mammalian ear. Science. 2009 ; 326 ( 5950 ): 243 – 244 . 19815765 10.1126/science.1181131",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_52",
            "content": "<REF-13> Gibbons A : Human evolution. How a fickle climate made us human. Science. 2013 ; 341 ( 6145 ): 474 – 479 . 23908217 10.1126/science.341.6145.474",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_53",
            "content": "<REF-14> Sol D : Revisiting the cognitive buffer hypothesis for the evolution of large brains. Biol Lett. 2009 ; 5 ( 1 ): 130 – 133 . 19049952 10.1098/rsbl.2008.0621 2657766",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_54",
            "content": "<REF-15> Kendal J Tehrani JJ Odling-Smee J : Human niche construction in interdisciplinary focus. Philos Trans R Soc Lond B Biol Sci. 2011 ; 366 ( 1566 ): 785 – 92 . 21320894 10.1098/rstb.2010.0306 3048995",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_55",
            "content": "<REF-16> Kaufman JA Ahrens ET Laidlaw DH : Anatomical analysis of an aye-aye brain ( Daubentonia madagascariensis , primates: Prosimii) combining histology, structural magnetic resonance imaging, and diffusion-tensor imaging. Anat Rec A Discov Mol Cell Evol Biol. 2005 ; 287 ( 1 ): 1026 – 1037 . 16211637 10.1002/ar.a.20264",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_56",
            "content": "<REF-17> Azevedo FA Carvalho LR Grinberg LT : Equal numbers of neuronal and nonneuronal cells make the human brain an isometrically scaled-up primate brain. J Comp Neurol. 2009 ; 513 ( 5 ): 532 – 541 . 19226510 10.1002/cne.21974",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_57",
            "content": "<REF-18> Bush EC Allman JM : The scaling of frontal cortex in primates and carnivores. Proc Natl Acad Sci U S A. 2004 ; 101 ( 11 ): 3962 – 3966 . 15007170 10.1073/pnas.0305760101 374352",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_58",
            "content": "<REF-21> Sherwood CC Stimpson CD Raghanti MA : Evolution of increased glia-neuron ratios in the human frontal cortex. Proc Natl Acad Sci U S A. 2006 ; 103 ( 37 ): 13606 – 13611 . 16938869 10.1073/pnas.0605843103 1564260",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_59",
            "content": "<REF-22> Somel M Liu X Tang L : MicroRNA-driven developmental remodeling in the brain distinguishes humans from other primates. PLoS Biol. 2011 ; 9 ( 12 ): e1001214 . 22162950 10.1371/journal.pbio.1001214 3232219",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_60",
            "content": "<REF-23> Wong FK Fei JF Mora-Bermudez F : Sustained Pax6 Expression Generates Primate-like Basal Radial Glia in Developing Mouse Neocortex. PLoS Biol. 2015 ; 13 ( 8 ): e1002217 . 26252244 10.1371/journal.pbio.1002217 4529158",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_61",
            "content": "<REF-24> Abzhanov A Protas M Grant BR : Bmp4 and morphological variation of beaks in Darwin's finches. Science. 2004 ; 305 ( 5689 ): 1462 – 1465 . 15353802 10.1126/science.1098095",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_62",
            "content": "<REF-26> Bhullar BA Marugán-Lobón J Racimo F : Birds have paedomorphic dinosaur skulls. Nature. 2012 ; 487 ( 7406 ): 223 – 226 . 22722850 10.1038/nature11146",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_63",
            "content": "<REF-28> Nedergaard M Ransom B Goldman SA : New roles for astrocytes : redefining the functional architecture of the brain. Trends Neurosci. 2003 ; 26 ( 10 ): 523 – 530 . 14522144 10.1016/j.tins.2003.08.008",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_64",
            "content": "<REF-29> Albertin CB Simakov O Mitros T : The octopus genome and the evolution of cephalopod neural and morphological novelties. Nature. 2015 ; 524 ( 7564 ): 220 – 224 . 26268193 10.1038/nature14668 4795812",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_65",
            "content": "<REF-30> Shoshani J Kupsky WJ Marchant GH : Elephant brain. Part I: gross morphology, functions, comparative anatomy, and evolution. Brain Res Bull. 2006 ; 70 ( 2 ): 124 – 157 . 16782503 10.1016/j.brainresbull.2006.03.016",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_66",
            "content": "<REF-31> Marino L McShea DW Uhen MD : Origin and evolution of large brains in toothed whales. Anat Rec A Discov Mol Cell Evol Biol. 2004 ; 281 ( 2 ): 1247 – 1255 . 15497142 10.1002/ar.a.20128",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_67",
            "content": "<REF-33> Perry S : Manipulative Monkeys. The Capuchins of Lomas Barbudal . Harvard University Press. 2011 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_68",
            "content": "<REF-36> McNally L Brown SP Jackson AL : Cooperation and the evolution of intelligence. Proc Biol Sci. 2012 ; 279 ( 1740 ): 3027 – 3034 . 22496188 10.1098/rspb.2012.0206 3385471",
            "ntype": "ref",
            "meta": {
                "id": "ref-36",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_69",
            "content": "<REF-37> Allman JM Tetreault NA Hakeem AY : The von Economo neurons in the frontoinsular and anterior cingulate cortex. Ann N Y Acad Sci. 2011 ; 1225 : 59 – 71 . 21534993 10.1111/j.1749-6632.2011.06011.x 3140770",
            "ntype": "ref",
            "meta": {
                "id": "ref-37",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_70",
            "content": "<REF-38> Roth G Dicke U : Evolution of the brain and intelligence in primates. Prog Brain Res. 2012 ; 195 : 413 – 430 . 22230639 10.1016/B978-0-444-53860-4.00020-9",
            "ntype": "ref",
            "meta": {
                "id": "ref-38",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_71",
            "content": "<REF-39> Lefebvre L : Brains, innovations, tools and cultural transmission in birds, non-human primates, and fossil hominins. Front Hum Neurosci. 2013 ; 7 : 245 . 23761751 10.3389/fnhum.2013.00245 3674321",
            "ntype": "ref",
            "meta": {
                "id": "ref-39",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_72",
            "content": "<REF-40> Bolhuis JJ Wynne CD : Can evolution explain how minds work? Nature. 2009 ; 458 ( 7240 ): 832 – 833 . 19370014 10.1038/458832a",
            "ntype": "ref",
            "meta": {
                "id": "ref-40",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_73",
            "content": "<REF-41> Emery NJ Clayton NS : The mentality of crows: convergent evolution of intelligence in corvids and apes. Science. 2004 ; 306 ( 5703 ): 1903 – 1907 . 15591194 10.1126/science.1098410",
            "ntype": "ref",
            "meta": {
                "id": "ref-41",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_74",
            "content": "<REF-42> Salwiczek LH Prétôt L Demarta L : Adult cleaner wrasse outperform capuchin monkeys, chimpanzees and orang-utans in a complex foraging task derived from cleaner--client reef fish cooperation. PLoS One. 2012 ; 7 ( 11 ): e49068 . 23185293 10.1371/journal.pone.0049068 3504063",
            "ntype": "ref",
            "meta": {
                "id": "ref-42",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_75",
            "content": "<REF-43> Fonseca-Azevedo K Herculano-Houzel S : Metabolic constraint imposes tradeoff between body size and number of brain neurons in human evolution. Proc Natl Acad Sci U S A. 2012 ; 109 ( 45 ): 18571 – 18576 . 23090991 10.1073/pnas.1206390109 3494886",
            "ntype": "ref",
            "meta": {
                "id": "ref-43",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_76",
            "content": "<REF-44> Wrangham RW Jones JH Laden G : The Raw and the Stolen. Cooking and the Ecology of Human Origins. Curr Anthropol. 1999 ; 40 ( 5 ): 567 – 594 . 10539941 10.1086/300083",
            "ntype": "ref",
            "meta": {
                "id": "ref-44",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_77",
            "content": "<REF-45> Warneken F Rosati AG : Cognitive capacities for cooking in chimpanzees. Proc Biol Sci. 2015 ; 282 ( 1809 ): 20150229 . 26041356 10.1098/rspb.2015.0229 4590439",
            "ntype": "ref",
            "meta": {
                "id": "ref-45",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_78",
            "content": "<REF-46> Hurford JR : Human uniqueness, learned symbols and recursive thought. Eur Rev. 2004 ; 12 ( 4 ): 551 – 565 . 10.1017/S106279870400047X",
            "ntype": "ref",
            "meta": {
                "id": "ref-46",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_79",
            "content": "<REF-47> Greenfield PM : Language, Tools, and Brain - the Ontogeny and Phylogeny of Hierarchically Organized Sequential Behavior. Behav Brain Sci. 1991 ; 14 ( 4 ): 531 – 550 . 10.1017/S0140525X00071235",
            "ntype": "ref",
            "meta": {
                "id": "ref-47",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_80",
            "content": "<REF-48> Hauser MD Chomsky N Fitch WT : The faculty of language: what is it, who has it, and how did it evolve? Science. 2002 ; 298 ( 5598 ): 1569 – 1579 . 12446899 10.1126/science.298.5598.1569",
            "ntype": "ref",
            "meta": {
                "id": "ref-48",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_81",
            "content": "<REF-49> Boeckx C : Biolinguistics: forays into human cognitive biology. J Anthropol Sci. 2013 ; 91 : 63 – 89 . 24038628 10.4436/jass.91009",
            "ntype": "ref",
            "meta": {
                "id": "ref-49",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_82",
            "content": "<REF-50> Capasso L Michetti E D'Anastasio R : A Homo erectus hyoid bone: possible implications for the origin of the human capability for speech. Coll Antropol. 2008 ; 32 ( 4 ): 1007 – 1011 . 19149203",
            "ntype": "ref",
            "meta": {
                "id": "ref-50",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_83",
            "content": "<REF-51> Darwin C : The descent of man, and selection in relation to sex. D. Appleton and company, New York. 1871 . 10.5962/bhl.title.24784",
            "ntype": "ref",
            "meta": {
                "id": "ref-51",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_84",
            "content": "<REF-52> Bolhuis JJ Gahr M : Neural mechanisms of birdsong memory. Nat Rev Neurosci. 2006 ; 7 ( 5 ): 347 – 357 . 16760915 10.1038/nrn1904",
            "ntype": "ref",
            "meta": {
                "id": "ref-52",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_85",
            "content": "<REF-53> Mooney R : Neural mechanisms for learned birdsong. Learn Mem. 2009 ; 16 ( 11 ): 655 – 669 . 19850665 10.1101/lm.1065209",
            "ntype": "ref",
            "meta": {
                "id": "ref-53",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_86",
            "content": "<REF-54> Bolhuis JJ Okanoya K Scharff C : Twitter evolution: converging mechanisms in birdsong and human speech. Nat Rev Neurosci. 2010 ; 11 ( 11 ): 747 – 759 . 20959859 10.1038/nrn2931",
            "ntype": "ref",
            "meta": {
                "id": "ref-54",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_87",
            "content": "<REF-55> Scharff C Petri J : Evo-devo, deep homology and FoxP2: implications for the evolution of speech and language. Philos Trans R Soc Lond B Biol Sci. 2011 ; 366 ( 1574 ): 2124 – 2140 . 21690130 10.1098/rstb.2011.0001 3130369",
            "ntype": "ref",
            "meta": {
                "id": "ref-55",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_88",
            "content": "<REF-56> Arnold K Zuberbühler K : Language evolution: semantic combinations in primate calls. Nature. 2006 ; 441 ( 7091 ): 303 . 16710411 10.1038/441303a",
            "ntype": "ref",
            "meta": {
                "id": "ref-56",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_89",
            "content": "<REF-57> Riley JR Greggers U Smith AD : The flight paths of honeybees recruited by the waggle dance. Nature. 2005 ; 435 ( 7039 ): 205 – 207 . 15889092 10.1038/nature03526",
            "ntype": "ref",
            "meta": {
                "id": "ref-57",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_90",
            "content": "<REF-58> Miyagawa S Berwick RC Okanoya K : The emergence of hierarchical structure in human language. Front Psychol. 2013 ; 4 : 71 . 23431042 10.3389/fpsyg.2013.00071 3577014",
            "ntype": "ref",
            "meta": {
                "id": "ref-58",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_91",
            "content": "<REF-59> Dunbar RI : The social Brain hypothesis. Evolutionary Anthropology: Issues, News and Reviews. 1998 ; 6 ( 5 ): 178 – 190 . 10.1002/(SICI)1520-6505(1998)6:5<178::AID-EVAN5>3.0.CO;2-8",
            "ntype": "ref",
            "meta": {
                "id": "ref-59",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_92",
            "content": "<REF-60> Lefebvre L Nicolakakis N Boire D : Tools and brains in birds. Behav. 2002 ; 139 : 939 – 973 . 10.1163/156853902320387918",
            "ntype": "ref",
            "meta": {
                "id": "ref-60",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_93",
            "content": "<REF-63> Rutz C Klump BC Komarczyk L : Discovery of species-wide tool use in the Hawaiian crow. Nature. 2016 ; 537 ( 7620 ): 403 – 407 . 27629645 10.1038/nature19103",
            "ntype": "ref",
            "meta": {
                "id": "ref-63",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_94",
            "content": "<REF-64> Russell DA Dong Z : A nearly complete skeleton of a new troodontid dinosaur from the Early Cretaceous of the Ordos Basin, Inner Mongolia, People's Republic of China. Can J Earth Sci. 1993 ; 30 ( 10 ): 2163 – 2173 . 10.1139/e93-187",
            "ntype": "ref",
            "meta": {
                "id": "ref-64",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_95",
            "content": "<REF-65> Franks NR Richardson T : Teaching in tandem-running ants. Nature. 2006 ; 439 ( 7073 ): 153 . 16407943 10.1038/439153a",
            "ntype": "ref",
            "meta": {
                "id": "ref-65",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_96",
            "content": "<REF-66> Jolly A : Lemur social behavior and primate intelligence. Science. 1966 ; 153 ( 3735 ): 501 – 506 . 5938775 10.1126/science.153.3735.501",
            "ntype": "ref",
            "meta": {
                "id": "ref-66",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_97",
            "content": "<REF-70> Freeberg TM Dunbar RIM Ord TJ : Social complexity as a proximate and ultimate factor in communicative complexity. Philos Trans R Soc Lond B Biol Sci. 2012 ; 367 ( 1597 ): 1785 – 1801 . 22641818 10.1098/rstb.2011.0213 3367695",
            "ntype": "ref",
            "meta": {
                "id": "ref-70",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_98",
            "content": "<REF-71> Marino L : Dolphin cognition. Curr Biol. 2004 ; 14 ( 21 ): R910 – 911 . 15530377 10.1016/j.cub.2004.10.010",
            "ntype": "ref",
            "meta": {
                "id": "ref-71",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_99",
            "content": "<REF-72> Jarvis ED Güntürkün O Bruce L : Avian brains and a new understanding of vertebrate brain evolution. Nat Rev Neurosci. 2005 ; 6 ( 2 ): 151 – 159 . 15685220 10.1038/nrn1606 2507884",
            "ntype": "ref",
            "meta": {
                "id": "ref-72",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_100",
            "content": "<REF-73> Willemet R : Reconsidering the evolution of brain, cognition, and behavior in birds and mammals. Front Psychol. 2013 ; 4 : 396 . 23847570 10.3389/fpsyg.2013.00396 3696912",
            "ntype": "ref",
            "meta": {
                "id": "ref-73",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_101",
            "content": "<REF-74> Brumm A Aziz F van den Bergh GD : Early stone technology on Flores and its implications for Homo floresiensis . Nature. 2006 ; 441 ( 7093 ): 624 – 628 . 16738657 10.1038/nature04618",
            "ntype": "ref",
            "meta": {
                "id": "ref-74",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_102",
            "content": "<REF-75> Prior H Schwarz A Gunturkun O : Mirror-induced behavior in the magpie ( Pica pica ): evidence of self-recognition. PLoS Biol. 2008 ; 6 ( 8 ): e202 . 18715117 10.1371/journal.pbio.0060202 2517622",
            "ntype": "ref",
            "meta": {
                "id": "ref-75",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_103",
            "content": "<REF-76> Emery NJ Seed AM von Bayern AM : Cognitive adaptations of social bonding in birds. Philos Trans R Soc Lond B Biol Sci. 2007 ; 362 ( 1480 ): 489 – 505 . 17255008 10.1098/rstb.2006.1991 2346513",
            "ntype": "ref",
            "meta": {
                "id": "ref-76",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_104",
            "content": "<REF-77> Crow TJ : Schizophrenia as the price that homo sapiens pays for language: a resolution of the central paradox in the origin of the species. Brain Res Brain Res Rev. 2000 ; 31 ( 2–3 ): 118 – 129 . 10719140 10.1016/s0165-0173(99)00029-6",
            "ntype": "ref",
            "meta": {
                "id": "ref-77",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_105",
            "content": "<REF-78> Lo Sardo V Zuccato C Gaudenzi G : An evolutionary recent neuroepithelial cell adhesion function of huntingtin implicates ADAM10-Ncadherin. Nat Neurosci. 2012 ; 15 ( 5 ): 713 – 721 . 22466506 10.1038/nn.3080",
            "ntype": "ref",
            "meta": {
                "id": "ref-78",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_106",
            "content": "<REF-79> Yin J Yuan Q : Structural homeostasis in the nervous system: a balancing act for wiring plasticity and stability. Front Cell Neurosci. 2014 ; 8 : 439 . 25653587 10.3389/fncel.2014.00439 4299450",
            "ntype": "ref",
            "meta": {
                "id": "ref-79",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_107",
            "content": "<REF-80> Toro R Konyukh M Delorme R : Key role for gene dosage and synaptic homeostasis in autism spectrum disorders. Trends Genet. 2010 ; 26 ( 8 ): 363 – 372 . 20609491 10.1016/j.tig.2010.05.007",
            "ntype": "ref",
            "meta": {
                "id": "ref-80",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_108",
            "content": "<REF-81> Gibson G : Decanalization and the origin of complex disease. Nat Rev Genet. 2009 ; 10 ( 2 ): 134 – 140 . 19119265 10.1038/nrg2502",
            "ntype": "ref",
            "meta": {
                "id": "ref-81",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_109",
            "content": "<REF-82> Bloom DE Cafiero ET Jané-Llopis E : World Economic Forum . Geneva. 2011 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-82",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_110",
            "content": "<REF-83> Luncz LV Tan A Haslam M : Resource depletion through primate stone technology. eLife. 2017 ; 6 : pii: e23647. 28884681 10.7554/eLife.23647 5590808",
            "ntype": "ref",
            "meta": {
                "id": "ref-83",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_111",
            "content": "<REF-84> Gould SJ : Exaptation: A crucial tool for evolutionary psychology. Journal of Social Issues. 1991 ; 47 ( 3 ): 43 – 65 . 10.1111/j.1540-4560.1991.tb01822.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-84",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_112",
            "content": "<REF-85> Eriksson A Betti L Friend AD : Late Pleistocene climate change and the global expansion of anatomically modern humans. Proc Natl Acad Sci U S A. 2012 ; 109 ( 40 ): 16089 – 16094 . 22988099 10.1073/pnas.1209494109 3479575",
            "ntype": "ref",
            "meta": {
                "id": "ref-85",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_113",
            "content": "<REF-86> Running SW : Approaching the Limits. Science. 2013 ; 339 ( 6 ): 1276 – 1277 . 10.1126/science.1235886",
            "ntype": "ref",
            "meta": {
                "id": "ref-86",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "9-34_v2_114",
            "content": "<REF-87> Spratt D Dunlop I : Existential climate-related security risk: A scenario approach . breakthroughonline.org.au. 2019 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-87",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "9-34_v2_0@0",
            "content": "Intrinsic negative feedback as a limiting factor for the evolution of higher forms of intelligence",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_0",
            "start": 0,
            "end": 97,
            "label": {}
        },
        {
            "ix": "9-34_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "9-34_v2_2@0",
            "content": "Longstanding scientific efforts have been dedicated to answer why and how our particular intelligence is generated by our brain but not by the brain of other species.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_2",
            "start": 0,
            "end": 165,
            "label": {}
        },
        {
            "ix": "9-34_v2_2@1",
            "content": "However, surprisingly little effort has been made to ask why no other species ever developed an intelligence similar to ours.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_2",
            "start": 167,
            "end": 291,
            "label": {}
        },
        {
            "ix": "9-34_v2_2@2",
            "content": "Here, I explore this question based on genetic and paleontologic evidence.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_2",
            "start": 293,
            "end": 366,
            "label": {}
        },
        {
            "ix": "9-34_v2_2@3",
            "content": "Contrary to the established view, this review suggests that the developmental hurdles alone are not high enough to explain the uniqueness of human intelligence (HI).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_2",
            "start": 368,
            "end": 532,
            "label": {}
        },
        {
            "ix": "9-34_v2_2@4",
            "content": "As an additional explanation I propose that HI is normally not retained by natural selection, because it is, under most conditions, an intrinsically unfavourable trait.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_2",
            "start": 534,
            "end": 701,
            "label": {}
        },
        {
            "ix": "9-34_v2_2@5",
            "content": "This unfavourableness, however, cannot be explained by physical constraints alone; rather, it may also be rooted in the same emotional and social complexity that is necessary for the development of HI.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_2",
            "start": 703,
            "end": 903,
            "label": {}
        },
        {
            "ix": "9-34_v2_2@6",
            "content": "Thus, a major obstacle towards HI may not be solely the development of the required physical assets, but also to cope with harmful individual, social and environmental feedback intrinsically associated with this trait.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_2",
            "start": 905,
            "end": 1122,
            "label": {}
        },
        {
            "ix": "9-34_v2_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "9-34_v2_4@0",
            "content": "Our particular type of intelligence is commonly believed to be the central feature that has allowed humans to become one of the most abundant mammals on Earth. Yet, although our intelligence is such a powerful and generally useful trait, it has never been paralleled in any other organism.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_4",
            "start": 0,
            "end": 288,
            "label": {}
        },
        {
            "ix": "9-34_v2_4@1",
            "content": "As an explanation, we generally assume that our cognitive uniqueness results from the major difficulty in achieving the required level of developmental sophistication.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_4",
            "start": 290,
            "end": 456,
            "label": {}
        },
        {
            "ix": "9-34_v2_4@2",
            "content": "And after billion years of competitive evolution, we humans were the first species advanced enough to surmount these difficulties and to accumulate all features necessary for achieving this higher intelligence.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_4",
            "start": 458,
            "end": 667,
            "label": {}
        },
        {
            "ix": "9-34_v2_4@3",
            "content": "Here, I investigate this conjecture and its underlying assumptions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_4",
            "start": 669,
            "end": 735,
            "label": {}
        },
        {
            "ix": "9-34_v2_4@4",
            "content": "For this purpose, I deliberately and necessarily adopt a very narrow anthropocentric definition for human (or human-like) intelligence (HI) as “the intelligence that enables development of advanced technology-based societies like ours”.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_4",
            "start": 737,
            "end": 972,
            "label": {}
        },
        {
            "ix": "9-34_v2_4@5",
            "content": "Within this definition, ‘intelligence’ does not only refer to ‘computing power’, but also to the full ensemble of cognitive and character traits required.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_4",
            "start": 974,
            "end": 1127,
            "label": {}
        },
        {
            "ix": "9-34_v2_5@0",
            "content": "A race towards higher intelligence?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_5",
            "start": 0,
            "end": 34,
            "label": {}
        },
        {
            "ix": "9-34_v2_6@0",
            "content": "First, underlying this conjecture is a worldwide trend toward ever higher levels of intelligence, a trend that reached a critical threshold in the Pliocene when HI was finally developed in humans <REF-1> , <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_6",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "9-34_v2_6@1",
            "content": "Evidence for such a trend is weak.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_6",
            "start": 216,
            "end": 249,
            "label": {}
        },
        {
            "ix": "9-34_v2_6@2",
            "content": "While a global trend toward bigger brains has been observed in several instances, it does not hold true for all taxonomic levels <REF-1> – <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_6",
            "start": 251,
            "end": 398,
            "label": {}
        },
        {
            "ix": "9-34_v2_6@3",
            "content": "It is unclear if this trend, which is weak and concomitant with an increase in diversity and afflicted by exceptions, is the result of directed evolution or random drift <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_6",
            "start": 400,
            "end": 578,
            "label": {}
        },
        {
            "ix": "9-34_v2_6@4",
            "content": "It also appears that this trend, if it indeed exists, is a much weaker driving force than are the forces that are linked to adaptation to a specific niche <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_6",
            "start": 580,
            "end": 743,
            "label": {}
        },
        {
            "ix": "9-34_v2_7@0",
            "content": "Linear evolution versus iterative adaptation",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_7",
            "start": 0,
            "end": 43,
            "label": {}
        },
        {
            "ix": "9-34_v2_8@0",
            "content": "The argument that Homo sapiens was the first to reach an HI-enabling level of developmental sophistication evokes a linear view of evolution that posits that basal forms develop into ever more advanced and intelligent organisms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_8",
            "start": 0,
            "end": 227,
            "label": {}
        },
        {
            "ix": "9-34_v2_8@1",
            "content": "However, paleontologic and genetic evidence shows that evolution is not an orderly step-by-step advancement; rather, it is characterised by consecutive waves of radiation of species (many of which become dead-end groups) into the same ecological niches <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_8",
            "start": 229,
            "end": 490,
            "label": {}
        },
        {
            "ix": "9-34_v2_8@2",
            "content": "During this iterative process of consecutive adaptations, many sophisticated characteristics (such as vision, flight, echolocation, burrowing or re-adaptation to water) evolved several times, successively and independently, in different species <REF-6> – <REF-11> ( Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_8",
            "start": 492,
            "end": 768,
            "label": {}
        },
        {
            "ix": "9-34_v2_8@3",
            "content": "Even mammalian hallmark features, such as the middle ear and tribosphenic (crushing and biting) molars, evolved not once but several times in different mammals <REF-6> , <REF-12> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_8",
            "start": 770,
            "end": 949,
            "label": {}
        },
        {
            "ix": "9-34_v2_8@4",
            "content": "This convergence level of evolution indicates that the geological time scale is sufficiently large compared to the biological reproduction and diversification rates that even complex anatomical and molecular features can be reproduced if they enhance the chances of a species’ survival.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_8",
            "start": 951,
            "end": 1236,
            "label": {}
        },
        {
            "ix": "9-34_v2_8@5",
            "content": "Since our type of intelligence appears to be such a powerful and versatile development for the survival of a species, why has no other organism acquired HI?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_8",
            "start": 1238,
            "end": 1393,
            "label": {}
        },
        {
            "ix": "9-34_v2_9@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_9",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "9-34_v2_11@0",
            "content": "Lack of suitable environment?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_11",
            "start": 0,
            "end": 28,
            "label": {}
        },
        {
            "ix": "9-34_v2_12@0",
            "content": "The previous section highlights the importance of ecological niches in directing the evolution of specific traits.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_12",
            "start": 0,
            "end": 113,
            "label": {}
        },
        {
            "ix": "9-34_v2_12@1",
            "content": "Hominid evolution is indeed likely to have been driven by particular changes or variability in climate, although the exact nature and importance of these changes are a matter of debate <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_12",
            "start": 115,
            "end": 309,
            "label": {}
        },
        {
            "ix": "9-34_v2_12@2",
            "content": "More specifically concerning our cognition, coping with environmental changes has been suggested as a factor that drives brain evolution, within the cognitive buffer hypothesis <REF-14> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_12",
            "start": 311,
            "end": 497,
            "label": {}
        },
        {
            "ix": "9-34_v2_12@3",
            "content": "Nonetheless, the climate changes evoked are not sufficiently rare or specific to be a serious limiting factor for the development of HI in other species.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_12",
            "start": 499,
            "end": 651,
            "label": {}
        },
        {
            "ix": "9-34_v2_12@4",
            "content": "Moreover, similar environments, or environmental changes, have failed to promote the emergence of HI in other species.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_12",
            "start": 653,
            "end": 770,
            "label": {}
        },
        {
            "ix": "9-34_v2_12@5",
            "content": "Additionally, if the competitive advantage and driving force of HI development lies in overcoming dependence of the environment <REF-14> , or enables favourable niche construction <REF-15> , then this advantage would profit many species, and hence is not a limiting factor.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_12",
            "start": 772,
            "end": 1044,
            "label": {}
        },
        {
            "ix": "9-34_v2_12@6",
            "content": "Finally, the rapid and almost worldwide spread of Homo species shows that its type of intelligence can be used under many conditions and is not an adaptation limited to a unique environmental ecological niche or geological condition that existed only at the precise time and place of the origin of humans.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_12",
            "start": 1046,
            "end": 1350,
            "label": {}
        },
        {
            "ix": "9-34_v2_13@0",
            "content": "Brain size, structure and complexity",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_13",
            "start": 0,
            "end": 35,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@0",
            "content": "Compared to the brain structure and brain-body ratios of other animals, the human brain is, of course, exceptionally big and complex in terms of layered structure, interconnectedness and neuronal diversity. But is its structure unique and sophisticated enough to justify that our brain capacity was never paralleled through adaptation and convergent evolution?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 0,
            "end": 359,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@1",
            "content": "Accumulated evidence suggests that the answer is no. Neuroscientists have established that the brain structures of birds and mammals are never simple.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 361,
            "end": 510,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@2",
            "content": "The anatomical differences between species reflect the animals’ adaptations to a particular niche, not the lack of sufficient time for their brains to become more complex <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 512,
            "end": 691,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@3",
            "content": "In fact, the human brain is less evolved (in the sense of being altered with respect to the brains of stem mammalians) than the aye-aye ( Daubentonia madagascariensis ) brain <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 693,
            "end": 877,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@4",
            "content": "Rather, the human brain is more or less a scaled-up version of a non-human primate brain <REF-17> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 879,
            "end": 977,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@5",
            "content": "Its size and structure are principally the result of simply extending the high growth rate of foetal brains into early infancy <REF-18> – <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 979,
            "end": 1126,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@6",
            "content": "This prolonged growth was achieved by the modification of gene expression patterns of a few regulators <REF-22> , <REF-23> , a common mechanism for species differentiation (for example, <REF-24> – <REF-26> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 1128,
            "end": 1335,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@7",
            "content": "Of course, the scaling-up of the primate brain did not linearly affect all components, and the enhanced increase of the neocortex was certainly key to generating HI. Yet, altering the gene expression pattern of a single transcription factor ( Pax6 ) in mice to a human-like pattern suffices to obtain a primate-like increase in neural progenitors, notably basal radial glia, and ultimately in the number of neurons produced, which is thought to underlie the evolutionary expansion of the neocortex <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 1337,
            "end": 1844,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@8",
            "content": "Human brain performance was additionally boosted by slightly increasing the ratio of astrocytes to neurons, a tendency already observed in other higher mammals <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 1846,
            "end": 2015,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@9",
            "content": "This ratio present in humans is, however, similar to that seen in other primates <REF-17> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 2017,
            "end": 2107,
            "label": {}
        },
        {
            "ix": "9-34_v2_14@10",
            "content": "In terms of genetic modifications, the development of the human brain therefore appears to be based on extending already existing features through gradual and common mechanisms, rather than being the result of a genetic quantum leap.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_14",
            "start": 2109,
            "end": 2341,
            "label": {}
        },
        {
            "ix": "9-34_v2_15@0",
            "content": "Such genetic evolutionary mechanisms are not restricted to primates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_15",
            "start": 0,
            "end": 67,
            "label": {}
        },
        {
            "ix": "9-34_v2_15@1",
            "content": "For example, it was the expansion of a handful of gene families and genome rearrangements in an otherwise standard invertebrate gene background that allowed octopuses to produce profound morphological and neurological changes <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_15",
            "start": 69,
            "end": 304,
            "label": {}
        },
        {
            "ix": "9-34_v2_15@2",
            "content": "These changes sufficed to produce a large and sophisticated nervous system in addition to profound morphological innovations for their vision, arms and embryogenesis, resulting in a dramatically increased cognition and behavioural richness in octopuses as compared to worms, molluscs and other lophotrochozoans.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_15",
            "start": 306,
            "end": 616,
            "label": {}
        },
        {
            "ix": "9-34_v2_15@3",
            "content": "Thus, the emergence of our highly specific human cognition has been achieved through continuity on a genetic level, accessible in principle also to other species.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_15",
            "start": 618,
            "end": 779,
            "label": {}
        },
        {
            "ix": "9-34_v2_16@0",
            "content": "Convergent evolution of intelligence",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_16",
            "start": 0,
            "end": 35,
            "label": {}
        },
        {
            "ix": "9-34_v2_17@0",
            "content": "Since the human brain originated through extensions of primate brain features, can HI originate only from the brain structure of apes (Hominoidea)? If this is the case, then apes would have had to evolve first before HI occurred, and this condition may help to explain the late and single occurrence of this type of intelligence.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_17",
            "start": 0,
            "end": 328,
            "label": {}
        },
        {
            "ix": "9-34_v2_17@1",
            "content": "However, it was not only other primate species (such as capuchins), but also elephants, cetaceans and certain birds that independently evolved cognitive and social characteristics that are very similar to those of apes (including self-consciousness, grief, altruism, play, envy, compassion and abstract numerical competence), despite having fundamentally different brain architectures <REF-30> – <REF-36> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_17",
            "start": 330,
            "end": 735,
            "label": {}
        },
        {
            "ix": "9-34_v2_17@2",
            "content": "Although the overall brain architecture differs, convergent evolution can produce obligatory neuronal adaptations in unrelated genera.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_17",
            "start": 737,
            "end": 870,
            "label": {}
        },
        {
            "ix": "9-34_v2_17@3",
            "content": "For example, von Economo neurons, which have been related to complex social behaviour, have independently evolved in primates, whales, elephants and racoons <REF-37> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_17",
            "start": 872,
            "end": 1038,
            "label": {}
        },
        {
            "ix": "9-34_v2_17@4",
            "content": "Because of neuroplasticity, such convergent evolution is even easier for the brain than for other organs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_17",
            "start": 1040,
            "end": 1144,
            "label": {}
        },
        {
            "ix": "9-34_v2_17@5",
            "content": "Accordingly, our particular intelligence is not based on unique characteristics; rather, it arises from a combination and enhancement of abilities found in other vertebrates <REF-38> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_17",
            "start": 1146,
            "end": 1329,
            "label": {}
        },
        {
            "ix": "9-34_v2_17@6",
            "content": "In fact, our large brains and particular intelligence appear to be independent of our ape phylogeny; rather, they result from convergent processes similar to those that produced avian and New World monkey brains <REF-39> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_17",
            "start": 1331,
            "end": 1552,
            "label": {}
        },
        {
            "ix": "9-34_v2_17@7",
            "content": "Taken together with the finding that in some cognitive tasks monkeys can be outperformed by other animals, including birds <REF-40> , <REF-41> and even fish <REF-42> , scientific evidence does not support the unilinear view that only the brain structure of apes is suited to produce HI.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_17",
            "start": 1554,
            "end": 1839,
            "label": {}
        },
        {
            "ix": "9-34_v2_18@0",
            "content": "Overcoming the high energy requirement",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_18",
            "start": 0,
            "end": 37,
            "label": {}
        },
        {
            "ix": "9-34_v2_19@0",
            "content": "Big brains are energetically costly organs.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_19",
            "start": 0,
            "end": 42,
            "label": {}
        },
        {
            "ix": "9-34_v2_19@1",
            "content": "Moreover, because of its neuronal density and neuron/glial cell ratio, a human brain requires more energy than for example a rodent brain of the same size <REF-43> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_19",
            "start": 44,
            "end": 208,
            "label": {}
        },
        {
            "ix": "9-34_v2_19@2",
            "content": "Could the unique development of HI in humans be explained by our species being the only one capable of coping with the high metabolic demand of a brain required for generating HI?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_19",
            "start": 210,
            "end": 388,
            "label": {}
        },
        {
            "ix": "9-34_v2_20@0",
            "content": "There are many ways of overcoming metabolic limitations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_20",
            "start": 0,
            "end": 55,
            "label": {}
        },
        {
            "ix": "9-34_v2_20@1",
            "content": "These include shifting to higher-energy food sources (such as nuts, honey or meat, especially from invertebrates like molluscs or insects); external transformation of food to a more edible state (through grinding, fermentation, cooking or other types of food processing); more efficient use of existing food sources through simple tools and/or strategies (for transport, butchery, or storage); adaptive genetic changes to improve the digestive system (and associated microflora), or to diminish body energy expenditure [such as changes in skin coating (e.g. fur or feathers) or locomotion (e.g. bipedalism, architecture of limbs and feet)]; increasing foraging efficiency through intra-species organisation (e.g. for hunting, gathering, carcass defence or food processing); or shifting to habitats richer in high-protein food sources.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_20",
            "start": 57,
            "end": 890,
            "label": {}
        },
        {
            "ix": "9-34_v2_20@2",
            "content": "A subset of these strategies was sufficient to provide the increased energy demand throughout hominid evolution (see ref. <REF-44> and discussion therein).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_20",
            "start": 892,
            "end": 1046,
            "label": {}
        },
        {
            "ix": "9-34_v2_20@3",
            "content": "These strategies (including the cognitive capacities to cook <REF-45> ) do not require features that are only found in humans, making sufficient subsets of them also accessible to other species.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_20",
            "start": 1048,
            "end": 1241,
            "label": {}
        },
        {
            "ix": "9-34_v2_20@4",
            "content": "Moreover, as the brain of an organism becomes bigger and more powerful, the enhanced cognitive capacities will increasingly enable this organism to implement strategies to enhance energy intake.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_20",
            "start": 1243,
            "end": 1436,
            "label": {}
        },
        {
            "ix": "9-34_v2_20@5",
            "content": "The cognitive pay-offs of big brains should therefore allow alleviation of the associated energetic cost.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_20",
            "start": 1438,
            "end": 1542,
            "label": {}
        },
        {
            "ix": "9-34_v2_20@6",
            "content": "In conclusion, while the high energy demand of an HI-capable brain is an important roadblock for the development of HI, the physical and intellectual strategies required to overcome this hurdle are not only accessible to the human body plan.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_20",
            "start": 1544,
            "end": 1784,
            "label": {}
        },
        {
            "ix": "9-34_v2_20@7",
            "content": "And although the adaptations required to sustain a big brain are profound, they are paralleled, for example, by the metabolic and physical adaptations required for powered flight, which has evolved multiple times in different taxa ( Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_20",
            "start": 1786,
            "end": 2029,
            "label": {}
        },
        {
            "ix": "9-34_v2_21@0",
            "content": "Language and intelligence",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_21",
            "start": 0,
            "end": 24,
            "label": {}
        },
        {
            "ix": "9-34_v2_22@0",
            "content": "It appears safe to assume that HI would not be possible without a powerful language.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_22",
            "start": 0,
            "end": 83,
            "label": {}
        },
        {
            "ix": "9-34_v2_22@1",
            "content": "Compared to other animals, the human language appears to distinguish itself in many ways, including the large amount of symbols used (‘vocabulary’), the complex compositional, hierarchical and recursive syntax, and the need to learn the complete language from scratch during an individual’s lifetime <REF-46> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_22",
            "start": 85,
            "end": 394,
            "label": {}
        },
        {
            "ix": "9-34_v2_22@2",
            "content": "It has been suggested that language evolution and efficient tool use have stimulated each other mutually <REF-47> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_22",
            "start": 396,
            "end": 510,
            "label": {}
        },
        {
            "ix": "9-34_v2_22@3",
            "content": "More generally, it might be that the way of thinking that our language enables is what makes us human <REF-48> , <REF-49> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_22",
            "start": 512,
            "end": 634,
            "label": {}
        },
        {
            "ix": "9-34_v2_22@4",
            "content": "It is therefore important to discuss whether the uniqueness of HI can be explained by the uniqueness of our language.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_22",
            "start": 636,
            "end": 752,
            "label": {}
        },
        {
            "ix": "9-34_v2_23@0",
            "content": "Adopting the particular viewpoint of this essay, we then have to ask whether the development of HI-supporting language would be possible for other species. Let us first consider the requirements for producing a sufficient vocabulary.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_23",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "9-34_v2_23@1",
            "content": "On a purely anatomical or mechanistic level, a HI-supporting language might be any sort of expression not limited to speech (e.g. twitter, tapping, signs, gestures, visual cues) that can produce a sufficient vocabulary space.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_23",
            "start": 234,
            "end": 458,
            "label": {}
        },
        {
            "ix": "9-34_v2_23@2",
            "content": "This requirement does not seem to be restrictive.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_23",
            "start": 460,
            "end": 508,
            "label": {}
        },
        {
            "ix": "9-34_v2_23@3",
            "content": "Moreover, some evidence suggests that the increase in human brain size preceded the development of finely articulated speech <REF-50> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_23",
            "start": 510,
            "end": 644,
            "label": {}
        },
        {
            "ix": "9-34_v2_23@4",
            "content": "It was therefore not the pre-existence of an articulate vocalisation, but only a physiological potential for it, that was sufficient for allowing the evolution of HI in humans.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_23",
            "start": 646,
            "end": 821,
            "label": {}
        },
        {
            "ix": "9-34_v2_24@0",
            "content": "Let us now consider language syntax and acquisition with respect to human uniqueness.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_24",
            "start": 0,
            "end": 84,
            "label": {}
        },
        {
            "ix": "9-34_v2_24@1",
            "content": "It has indeed been proposed that such properties of the human language are neither specific to language nor to humans: Already Darwin had recognized the similarity between birdsong and human speech <REF-51> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_24",
            "start": 86,
            "end": 293,
            "label": {}
        },
        {
            "ix": "9-34_v2_24@2",
            "content": "The process and the underlying neuronal circuits by which a young bird learns the songs from an adult ‘tutor’ show indeed strong parallels with speech acquisition in human infants on behavioural, neural and genetic levels <REF-52> , <REF-53> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_24",
            "start": 295,
            "end": 537,
            "label": {}
        },
        {
            "ix": "9-34_v2_24@3",
            "content": "Moreover, common genetic key players have been identified, including the FOXP2 gene <REF-54> , <REF-55> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_24",
            "start": 539,
            "end": 643,
            "label": {}
        },
        {
            "ix": "9-34_v2_24@4",
            "content": "The hierarchical combination of ‘words’ bears resemblance to semantic combinations in primate calls or compass headings in honeybees <REF-56> , <REF-57> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_24",
            "start": 645,
            "end": 798,
            "label": {}
        },
        {
            "ix": "9-34_v2_24@5",
            "content": "It has therefore been suggested that the human language results from the combination of separate, pre-existing simple systems that may have evolved for other functional tasks <REF-58> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_24",
            "start": 800,
            "end": 984,
            "label": {}
        },
        {
            "ix": "9-34_v2_25@0",
            "content": "In conclusion, while the exact behavioural, neural and molecular links between language, intelligence and behaviour are still emerging and under debate, significant characteristics of human language appear accessible to other species, including non-primates, and are not tied to a specific brain anatomy or size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_25",
            "start": 0,
            "end": 311,
            "label": {}
        },
        {
            "ix": "9-34_v2_25@1",
            "content": "Thus, current evidence suggests that the capacity for developing a HI-supporting system of communication is not a feature strictly limited to humans or the human brain anatomy or speech production.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_25",
            "start": 313,
            "end": 509,
            "label": {}
        },
        {
            "ix": "9-34_v2_26@0",
            "content": "Is there an essential combination of features?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_26",
            "start": 0,
            "end": 45,
            "label": {}
        },
        {
            "ix": "9-34_v2_27@0",
            "content": "HI poses requirements to a candidate species beyond developing and coping with the appropriate brain anatomy, associated energy demands and language.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_27",
            "start": 0,
            "end": 148,
            "label": {}
        },
        {
            "ix": "9-34_v2_27@1",
            "content": "For example, HI would be most useful in an organism that can use tools and has a complex social system that allows transmitting and accumulating acquired knowledge and culture.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_27",
            "start": 150,
            "end": 325,
            "label": {}
        },
        {
            "ix": "9-34_v2_27@2",
            "content": "Importantly, these individual features synergise with each other (e.g. <REF-47> , <REF-59> ) and may need to evolve as an ensemble.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_27",
            "start": 327,
            "end": 457,
            "label": {}
        },
        {
            "ix": "9-34_v2_27@3",
            "content": "While producing one individual feature may not be particularly difficult, and although combination of pre-existing traits is a common evolutionary mechanism, it could still be that the combined likelihood of assembling all required features in one species is sufficiently small to explain HI’s uniqueness.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_27",
            "start": 459,
            "end": 763,
            "label": {}
        },
        {
            "ix": "9-34_v2_27@4",
            "content": "Unfortunately, it is currently impossible (i) to test which sub-ensemble of characteristics is a strict prerequisite for HI development (as opposed to characteristics which can be developed en route towards HI), and (ii) to quantitate the likelihood for the occurrence of such an ensemble in one animal.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_27",
            "start": 765,
            "end": 1067,
            "label": {}
        },
        {
            "ix": "9-34_v2_27@5",
            "content": "Thus, we can only approximate this question by asking if the presence of HI-enabling features and capacities was uniquely found in early hominids.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_27",
            "start": 1069,
            "end": 1214,
            "label": {}
        },
        {
            "ix": "9-34_v2_27@6",
            "content": "In other words, is HI development such a rare event because of a shortage of suitable candidate species?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_27",
            "start": 1216,
            "end": 1319,
            "label": {}
        },
        {
            "ix": "9-34_v2_28@0",
            "content": "Tool use is well documented in many animals and is neither restricted to primates (it has been observed in sea otters, elephants and dolphins) nor to mammals (more than 120 cases of tool use in 104 bird species have been reported) <REF-60> – <REF-63> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_28",
            "start": 0,
            "end": 251,
            "label": {}
        },
        {
            "ix": "9-34_v2_28@1",
            "content": "Many species of dinosaurs, Triassic archosaurs or marsupials were/are bipeds with free, articulate limbs, affording them great potential for tool use <REF-9> , many relatively small, birdlike dinosaurs, such as Troodon , possessed a grasping hand with an opposable digit <REF-64> , whereas dolphins use tools even though they have no limbs to grasp the tools.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_28",
            "start": 253,
            "end": 611,
            "label": {}
        },
        {
            "ix": "9-34_v2_28@2",
            "content": "Child caring, intra-species communication and even cultural transmissions are documented not only in primates, but also other vertebrates (such as meerkats and fish) and maybe even in insects (e.g., teaching behaviours have been suggested in ants) <REF-65> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_28",
            "start": 613,
            "end": 870,
            "label": {}
        },
        {
            "ix": "9-34_v2_28@3",
            "content": "Social complexity as a potential driver for enhanced brain size and social intelligence (the ‘social complexity hypothesis’ <REF-59> ) has been reported in diverse non-human vertebrates (including lemurs, dolphins, parrots and spotted hyenas <REF-66> – <REF-70> , suggesting that social complexity can drive brain evolution in diverse species.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_28",
            "start": 872,
            "end": 1214,
            "label": {}
        },
        {
            "ix": "9-34_v2_28@4",
            "content": "With respect to the importance of language, as discussed above, many species possess means of communication which might have the potential to evolve, within a few million years, into a sufficiently complex vocabulary and syntax to synergise with an emerging cognition.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_28",
            "start": 1216,
            "end": 1483,
            "label": {}
        },
        {
            "ix": "9-34_v2_28@5",
            "content": "Thus, great apes, dolphins and some bird species have reached a high sophistication in terms of vocabulary, semantics, syntax and symbolic references, together with their cognitive capacities <REF-33> , <REF-71> , <REF-72>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_28",
            "start": 1485,
            "end": 1706,
            "label": {}
        },
        {
            "ix": "9-34_v2_29@0",
            "content": "Finally, development of HI does not appear restricted to organisms with sizes similar to humans.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_29",
            "start": 0,
            "end": 95,
            "label": {}
        },
        {
            "ix": "9-34_v2_29@1",
            "content": "Although the brain-to-body size (encephalization) appears to correlate roughly with cognitive capacity, brains do not have to be above a particular absolute size to produce high levels of intelligence <REF-73> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_29",
            "start": 97,
            "end": 307,
            "label": {}
        },
        {
            "ix": "9-34_v2_29@2",
            "content": "For example, despite having a smaller brain than chimpanzees and australopithecines, Homo floresiensis , the Indonesian small-bodied ‘Hobbit’ species, was capable of manufacturing tools as advanced as those produced by Homo species with a three times larger brain <REF-74> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_29",
            "start": 309,
            "end": 582,
            "label": {}
        },
        {
            "ix": "9-34_v2_29@3",
            "content": "Moreover, the complex cognitive abilities of some bird species (including tool use, episodic-like memory, predicting the behaviour of conspecifics based on own experiences and self-recognition) are produced by brains that are less than 10 g in weight <REF-75> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_29",
            "start": 584,
            "end": 844,
            "label": {}
        },
        {
            "ix": "9-34_v2_29@4",
            "content": "Thus, HI candidate species are not limited to those animals that have comparable sizes to humans.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_29",
            "start": 846,
            "end": 942,
            "label": {}
        },
        {
            "ix": "9-34_v2_30@0",
            "content": "In summary, while it is currently impossible to evaluate the evolutionary likelihood for combining the required features into a HI-capable animal, it is clear that many organisms besides humans readily combined several characteristics that could support HI (such as tool use, cultural transmissions, size of groups or body).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_30",
            "start": 0,
            "end": 323,
            "label": {}
        },
        {
            "ix": "9-34_v2_30@1",
            "content": "During development towards HI, these characteristics can in principle be developed further, and completed, as it has been the case in our lineage. And although the combination of features found in early hominids before brain expansion (i.e. free limbs, capacity for grasping, social structure and tool use) are not common, they are not unique either, and it is therefore unlikely that HI was developed only once because no other species would have been a suitable candidate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_30",
            "start": 325,
            "end": 798,
            "label": {}
        },
        {
            "ix": "9-34_v2_31@0",
            "content": "HI as an intrinsically unfavourable trait",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_31",
            "start": 0,
            "end": 40,
            "label": {}
        },
        {
            "ix": "9-34_v2_32@0",
            "content": "According to the findings discussed above, the development of HI is not complex enough to fully explain that it has never been reproduced in any other species than Homo sapiens .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_32",
            "start": 0,
            "end": 177,
            "label": {}
        },
        {
            "ix": "9-34_v2_32@1",
            "content": "If HI were within reach of convergent evolution, as my survey suggests, then an intriguing possible explanation for the fact that HI nonetheless evolved only once would be that HI is normally an overall unfavourable feature that is sooner or later sanctioned by selection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_32",
            "start": 179,
            "end": 450,
            "label": {}
        },
        {
            "ix": "9-34_v2_32@2",
            "content": "Yet, the physical constraints associated with HI appear to be manageable, and the human body is not special enough to suggest that no other organism could have evolved to cope with those constraints.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_32",
            "start": 452,
            "end": 650,
            "label": {}
        },
        {
            "ix": "9-34_v2_32@3",
            "content": "If there is an unfavourable aspect of HI, then it must arise from somewhere other than these physical constraints.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_32",
            "start": 652,
            "end": 765,
            "label": {}
        },
        {
            "ix": "9-34_v2_33@0",
            "content": "Could it be that some of the same mental and behavioural characteristics that are necessary for the development of HI might become increasingly unfavourable as a species evolves towards HI, creating a negative feedback loop?",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_33",
            "start": 0,
            "end": 223,
            "label": {}
        },
        {
            "ix": "9-34_v2_33@1",
            "content": "There is certainly a positive correlation between the proximity of species to HI and the emotional and structural complexity of their individuals and societies (where emotional complexity is defined as having emotional experiences that are broad in range and well differentiated).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_33",
            "start": 225,
            "end": 504,
            "label": {}
        },
        {
            "ix": "9-34_v2_33@2",
            "content": "This correlation is apparent in species with very different brain structures and sizes (cetaceans, elephants, apes, Cebus monkeys and some birds <REF-30> , <REF-31> , <REF-33> , <REF-72> , <REF-76> ), suggesting that it is an intrinsic hallmark of HI.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_33",
            "start": 506,
            "end": 756,
            "label": {}
        },
        {
            "ix": "9-34_v2_34@0",
            "content": "Behavioural studies on capuchin monkeys may provide an anecdotal illustration of this concept.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_34",
            "start": 0,
            "end": 93,
            "label": {}
        },
        {
            "ix": "9-34_v2_34@1",
            "content": "These New World monkeys independently evolved an intelligence with certain characteristics similar to that of great apes and humans <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_34",
            "start": 95,
            "end": 236,
            "label": {}
        },
        {
            "ix": "9-34_v2_34@2",
            "content": "Owing to their particular amalgam of a strong cognitive capacity and an emotional and almost pugnacious character, capuchins have developed tools and strategies that allow them to forage for food that is impossible for most other animals to attain.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_34",
            "start": 238,
            "end": 485,
            "label": {}
        },
        {
            "ix": "9-34_v2_34@3",
            "content": "Their complex social system stimulates learning, the emergence of culture and the establishment of an efficient communal defence against predators <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_34",
            "start": 487,
            "end": 643,
            "label": {}
        },
        {
            "ix": "9-34_v2_34@4",
            "content": "This type of intelligence, however, produces a society in which individuals spend an excessive amount of time engaged in complex nonproductive or even counterproductive social activities (such as allomothering, non-reproductive sex, apparently non-profit harassment of other animals or harmful “games” such as eyeball poking) and in violent or lethal aggression (the major cause of death for a capuchin monkey is an altercation with another capuchin monkey) <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_34",
            "start": 645,
            "end": 1112,
            "label": {}
        },
        {
            "ix": "9-34_v2_34@5",
            "content": "If a further increase in the monkey’s para-HI intelligence requires increasing the same behavioural and character features that cause counterproductive comportments, then the resulting negative feedback may block development of HI.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_34",
            "start": 1114,
            "end": 1344,
            "label": {}
        },
        {
            "ix": "9-34_v2_34@6",
            "content": "Conversely, if a candidate species deviates too much from these characteristics, then HI may not result, despite a suitable cognitive power.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_34",
            "start": 1346,
            "end": 1485,
            "label": {}
        },
        {
            "ix": "9-34_v2_35@0",
            "content": "In humans, an illustration for the negative effects of HI-associated cognitive complexity is provided by the high incident of cognitive diseases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_35",
            "start": 0,
            "end": 144,
            "label": {}
        },
        {
            "ix": "9-34_v2_35@1",
            "content": "For example, schizophrenia has been suggested to be ‘the price that Homo sapiens pays for language’ <REF-77> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_35",
            "start": 146,
            "end": 255,
            "label": {}
        },
        {
            "ix": "9-34_v2_35@2",
            "content": "It has also been shown in animals and humans that the more polymorphic tri-nucleotide repeats are present in the gene Hdh (which codes for the protein huntingtin), the higher the capacity of this gene to promote the neural tube formation required for complex brains, but also the higher the probability to develop fatal neurodegenerative Huntington’s disease <REF-78> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_35",
            "start": 257,
            "end": 625,
            "label": {}
        },
        {
            "ix": "9-34_v2_35@3",
            "content": "More generally, the genes regulating synaptogenesis and neuronal circuit formation have been associated with an increased risk of mental illnesses <REF-79> , <REF-80> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_35",
            "start": 627,
            "end": 794,
            "label": {}
        },
        {
            "ix": "9-34_v2_35@4",
            "content": "Based on autism spectrum disorders, it was suggested that brain networks involved in HI-required cognitive skills, such as language and complex social behaviour, have less compensatory mechanisms, and are hence less robust, than more ancient biological functions <REF-80> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_35",
            "start": 796,
            "end": 1068,
            "label": {}
        },
        {
            "ix": "9-34_v2_35@5",
            "content": "As a final example, the rise of complex diseases (i.e. diseases caused by a combination of genetic, environmental and lifestyle factors) has been linked to the rapid genetic, geographic, dietary and cultural changes associated with HI <REF-81> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_35",
            "start": 1070,
            "end": 1314,
            "label": {}
        },
        {
            "ix": "9-34_v2_35@6",
            "content": "The impact of neurological pathologies increases in high-cognition species, and cumulates in humans, where currently about one in four individuals is affected (source: World Health Organization, 2001 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_35",
            "start": 1316,
            "end": 1517,
            "label": {}
        },
        {
            "ix": "9-34_v2_35@7",
            "content": "The incidence of mental disorders continues to grow, and with it its individual, social and economic impacts ( World Health Organization, 2019 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_35",
            "start": 1519,
            "end": 1663,
            "label": {}
        },
        {
            "ix": "9-34_v2_35@8",
            "content": "Accordingly, mental health costs are now the highest single source of global economic burden in the world <REF-82> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_35",
            "start": 1665,
            "end": 1780,
            "label": {}
        },
        {
            "ix": "9-34_v2_35@9",
            "content": "Thus, the increased instability and lability inherently associated with a trajectory towards HI might produce a negative feedback loop counteracting the evolution of HI.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_35",
            "start": 1782,
            "end": 1950,
            "label": {}
        },
        {
            "ix": "9-34_v2_36@0",
            "content": "Additionally, there might be a different type of negative feedback loop intrinsic to HI—HI might simply allow a species to become so successful in exploiting food resources that these resources become exhausted.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_36",
            "start": 0,
            "end": 210,
            "label": {}
        },
        {
            "ix": "9-34_v2_36@1",
            "content": "A non-human example is provided by long-tailed macaques living on islands in Thailand.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_36",
            "start": 212,
            "end": 297,
            "label": {}
        },
        {
            "ix": "9-34_v2_36@2",
            "content": "These monkeys developed stone tools that allow foraging on shellfish.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_36",
            "start": 299,
            "end": 367,
            "label": {}
        },
        {
            "ix": "9-34_v2_36@3",
            "content": "Over time, however, this technology is so efficient that the macaques severely deplete the shellfish populations on the islands.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_36",
            "start": 369,
            "end": 496,
            "label": {}
        },
        {
            "ix": "9-34_v2_36@4",
            "content": "This triggers a feedback loop where diminishing prey size results in reduced stone size <REF-83> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_36",
            "start": 498,
            "end": 595,
            "label": {}
        },
        {
            "ix": "9-34_v2_36@5",
            "content": "The authors suggest that continuation of this pattern leads to a point where this technology is no longer beneficial or useful to the island macaques, ultimately leading to extinguishing of this technology.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_36",
            "start": 597,
            "end": 802,
            "label": {}
        },
        {
            "ix": "9-34_v2_37@0",
            "content": "Conclusion and outlook",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_37",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "9-34_v2_38@0",
            "content": "A specie’s intelligence is a multidimensional characteristic adapted to maximise the specie’s survival.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_38",
            "start": 0,
            "end": 102,
            "label": {}
        },
        {
            "ix": "9-34_v2_38@1",
            "content": "My analysis suggests that the genetic adaptations required for development of HI might have been within reach of more species than only Homo sapiens .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_38",
            "start": 104,
            "end": 253,
            "label": {}
        },
        {
            "ix": "9-34_v2_38@2",
            "content": "However, all other species that have radiated into high-intelligence niches have stagnated at sub-HI levels, often for many million years; only the Homo lineage has crossed this barrier in a very short time.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_38",
            "start": 255,
            "end": 461,
            "label": {}
        },
        {
            "ix": "9-34_v2_38@3",
            "content": "The fact that no other species has reached HI appears unsatisfactorily explained by physical constraints of HI.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_38",
            "start": 463,
            "end": 573,
            "label": {}
        },
        {
            "ix": "9-34_v2_38@4",
            "content": "A possible additional explanation may be that the main barrier towards HI is not only the development of the required physical assets, but also that negative feedback from social, behavioural and neuroanatomical complexity, as well as negative environmental feedback make the development of HI increasingly unfavourable.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_38",
            "start": 575,
            "end": 894,
            "label": {}
        },
        {
            "ix": "9-34_v2_39@0",
            "content": "How could Homo overcome this barrier? I speculate that key features may have been that our brain originated very rapidly as an exaptation, not adaptation <REF-84> , together with an ensemble of favourable anatomical changes (e.g., skeletal proportions, dental function and the respiratory system), in a species with extremely low population densities (typically about 10 individuals per 100 km 2 <REF-85> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_39",
            "start": 0,
            "end": 406,
            "label": {}
        },
        {
            "ix": "9-34_v2_39@1",
            "content": "This origin may have initially allowed Homo to develop the brain structure required for HI, while circumventing or sufficiently attenuating immediate negative feedback associated with the use of HI in a socially complex populous environment where intra-species competition is the biggest threat.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_39",
            "start": 408,
            "end": 702,
            "label": {}
        },
        {
            "ix": "9-34_v2_40@0",
            "content": "However, as we are becoming overly abundant, and use our brain to its full potential to succeed within our complex societies, the negative side effects become increasingly challenging.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_40",
            "start": 0,
            "end": 183,
            "label": {}
        },
        {
            "ix": "9-34_v2_40@1",
            "content": "Despite the development of psychological, moral, behavioural (‘self-domestication’), pharmacological and technological solutions, we are knowingly and consciously pursuing our unsustainable development that is rapidly destroying the resources upon which we critically depend <REF-86> , <REF-87> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_40",
            "start": 185,
            "end": 480,
            "label": {}
        },
        {
            "ix": "9-34_v2_40@2",
            "content": "However, globally engaging in the actions required to change our current trajectory and achieve long-term sustainability appears contrary to human nature.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_40",
            "start": 482,
            "end": 635,
            "label": {}
        },
        {
            "ix": "9-34_v2_41@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_41",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "9-34_v2_42@0",
            "content": "No data are associated with this article.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_42",
            "start": 0,
            "end": 40,
            "label": {}
        },
        {
            "ix": "9-34_v2_43@0",
            "content": "<REF-1> Jerison HJ : Brain evolution: new light on old principles. Science. 1970 ; 170 ( 3963 ): 1224 – 1225 . 5478198 10.1126/science.170.3963.1224",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_43",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "9-34_v2_44@0",
            "content": "<REF-2> Kruska DC : On the evolutionary significance of encephalization in some eutherian mammals: effects of adaptive radiation, domestication, and feralization. Brain Behav Evol. 2005 ; 65 ( 2 ): 73 – 108 . 15627722 10.1159/000082979",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_44",
            "start": 0,
            "end": 234,
            "label": {}
        },
        {
            "ix": "9-34_v2_45@0",
            "content": "<REF-3> Finarelli JA Flynn JJ : The evolution of encephalization in caniform carnivorans. Evolution. 2007 ; 61 ( 7 ): 1758 – 1772 . 17598754 10.1111/j.1558-5646.2007.00131.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_45",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "9-34_v2_46@0",
            "content": "<REF-4> Montgomery SH Geisler JH McGowen MR : The evolutionary history of cetacean brain and body size. Evolution. 2013 ; 67 ( 11 ): 3339 – 3353 . 24152011 10.1111/evo.12197",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_46",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "9-34_v2_47@0",
            "content": "<REF-5> Marino L Hof PR : Nature's experiments in brain diversity. Anat Rec A Discov Mol Cell Evol Biol. 2005 ; 287 ( 1 ): 997 – 1000 . 16200645 10.1002/ar.a.20261",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_47",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "9-34_v2_48@0",
            "content": "<REF-6> Luo ZX : Transformation and diversification in early mammal evolution. Nature. 2007 ; 450 ( 7172 ): 1011 – 1019 . 18075580 10.1038/nature06277",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_48",
            "start": 0,
            "end": 149,
            "label": {}
        },
        {
            "ix": "9-34_v2_49@0",
            "content": "<REF-9> Brusatte SL Benton MJ Ruta M : Superiority, competition, and opportunism in the evolutionary radiation of dinosaurs. Science. 2008 ; 321 ( 5895 ): 1485 – 1488 . 18787166 10.1126/science.1161833",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_49",
            "start": 0,
            "end": 200,
            "label": {}
        },
        {
            "ix": "9-34_v2_50@0",
            "content": "<REF-11> Wang M O'Connor JK Xu X : A new Jurassic scansoriopterygid and the loss of membranous wings in theropod dinosaurs. Nature. 2019 ; 569 ( 7755 ): 256 – 259 . 31068719 10.1038/s41586-019-1137-z",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_50",
            "start": 0,
            "end": 198,
            "label": {}
        },
        {
            "ix": "9-34_v2_51@0",
            "content": "<REF-12> Martin T Ruf I : Paleontology. On the mammalian ear. Science. 2009 ; 326 ( 5950 ): 243 – 244 . 19815765 10.1126/science.1181131",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_51",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "9-34_v2_52@0",
            "content": "<REF-13> Gibbons A : Human evolution. How a fickle climate made us human. Science. 2013 ; 341 ( 6145 ): 474 – 479 . 23908217 10.1126/science.341.6145.474",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_52",
            "start": 0,
            "end": 152,
            "label": {}
        },
        {
            "ix": "9-34_v2_53@0",
            "content": "<REF-14> Sol D : Revisiting the cognitive buffer hypothesis for the evolution of large brains. Biol Lett. 2009 ; 5 ( 1 ): 130 – 133 . 19049952 10.1098/rsbl.2008.0621 2657766",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_53",
            "start": 0,
            "end": 172,
            "label": {}
        },
        {
            "ix": "9-34_v2_54@0",
            "content": "<REF-15> Kendal J Tehrani JJ Odling-Smee J : Human niche construction in interdisciplinary focus. Philos Trans R Soc Lond B Biol Sci. 2011 ; 366 ( 1566 ): 785 – 92 . 21320894 10.1098/rstb.2010.0306 3048995",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_54",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "9-34_v2_55@0",
            "content": "<REF-16> Kaufman JA Ahrens ET Laidlaw DH : Anatomical analysis of an aye-aye brain ( Daubentonia madagascariensis , primates: Prosimii) combining histology, structural magnetic resonance imaging, and diffusion-tensor imaging. Anat Rec A Discov Mol Cell Evol Biol. 2005 ; 287 ( 1 ): 1026 – 1037 . 16211637 10.1002/ar.a.20264",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_55",
            "start": 0,
            "end": 322,
            "label": {}
        },
        {
            "ix": "9-34_v2_56@0",
            "content": "<REF-17> Azevedo FA Carvalho LR Grinberg LT : Equal numbers of neuronal and nonneuronal cells make the human brain an isometrically scaled-up primate brain. J Comp Neurol. 2009 ; 513 ( 5 ): 532 – 541 . 19226510 10.1002/cne.21974",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_56",
            "start": 0,
            "end": 227,
            "label": {}
        },
        {
            "ix": "9-34_v2_57@0",
            "content": "<REF-18> Bush EC Allman JM : The scaling of frontal cortex in primates and carnivores. Proc Natl Acad Sci U S A. 2004 ; 101 ( 11 ): 3962 – 3966 . 15007170 10.1073/pnas.0305760101 374352",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_57",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "9-34_v2_58@0",
            "content": "<REF-21> Sherwood CC Stimpson CD Raghanti MA : Evolution of increased glia-neuron ratios in the human frontal cortex. Proc Natl Acad Sci U S A. 2006 ; 103 ( 37 ): 13606 – 13611 . 16938869 10.1073/pnas.0605843103 1564260",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_58",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "9-34_v2_59@0",
            "content": "<REF-22> Somel M Liu X Tang L : MicroRNA-driven developmental remodeling in the brain distinguishes humans from other primates. PLoS Biol. 2011 ; 9 ( 12 ): e1001214 . 22162950 10.1371/journal.pbio.1001214 3232219",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_59",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "9-34_v2_60@0",
            "content": "<REF-23> Wong FK Fei JF Mora-Bermudez F : Sustained Pax6 Expression Generates Primate-like Basal Radial Glia in Developing Mouse Neocortex. PLoS Biol. 2015 ; 13 ( 8 ): e1002217 . 26252244 10.1371/journal.pbio.1002217 4529158",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_60",
            "start": 0,
            "end": 223,
            "label": {}
        },
        {
            "ix": "9-34_v2_61@0",
            "content": "<REF-24> Abzhanov A Protas M Grant BR : Bmp4 and morphological variation of beaks in Darwin's finches. Science. 2004 ; 305 ( 5689 ): 1462 – 1465 . 15353802 10.1126/science.1098095",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_61",
            "start": 0,
            "end": 178,
            "label": {}
        },
        {
            "ix": "9-34_v2_62@0",
            "content": "<REF-26> Bhullar BA Marugán-Lobón J Racimo F : Birds have paedomorphic dinosaur skulls. Nature. 2012 ; 487 ( 7406 ): 223 – 226 . 22722850 10.1038/nature11146",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_62",
            "start": 0,
            "end": 156,
            "label": {}
        },
        {
            "ix": "9-34_v2_63@0",
            "content": "<REF-28> Nedergaard M Ransom B Goldman SA : New roles for astrocytes : redefining the functional architecture of the brain. Trends Neurosci. 2003 ; 26 ( 10 ): 523 – 530 . 14522144 10.1016/j.tins.2003.08.008",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_63",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "9-34_v2_64@0",
            "content": "<REF-29> Albertin CB Simakov O Mitros T : The octopus genome and the evolution of cephalopod neural and morphological novelties. Nature. 2015 ; 524 ( 7564 ): 220 – 224 . 26268193 10.1038/nature14668 4795812",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_64",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "9-34_v2_65@0",
            "content": "<REF-30> Shoshani J Kupsky WJ Marchant GH : Elephant brain. Part I: gross morphology, functions, comparative anatomy, and evolution. Brain Res Bull. 2006 ; 70 ( 2 ): 124 – 157 . 16782503 10.1016/j.brainresbull.2006.03.016",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_65",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "9-34_v2_66@0",
            "content": "<REF-31> Marino L McShea DW Uhen MD : Origin and evolution of large brains in toothed whales. Anat Rec A Discov Mol Cell Evol Biol. 2004 ; 281 ( 2 ): 1247 – 1255 . 15497142 10.1002/ar.a.20128",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_66",
            "start": 0,
            "end": 190,
            "label": {}
        },
        {
            "ix": "9-34_v2_67@0",
            "content": "<REF-33> Perry S : Manipulative Monkeys. The Capuchins of Lomas Barbudal . Harvard University Press. 2011 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_67",
            "start": 0,
            "end": 123,
            "label": {}
        },
        {
            "ix": "9-34_v2_68@0",
            "content": "<REF-36> McNally L Brown SP Jackson AL : Cooperation and the evolution of intelligence. Proc Biol Sci. 2012 ; 279 ( 1740 ): 3027 – 3034 . 22496188 10.1098/rspb.2012.0206 3385471",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_68",
            "start": 0,
            "end": 176,
            "label": {}
        },
        {
            "ix": "9-34_v2_69@0",
            "content": "<REF-37> Allman JM Tetreault NA Hakeem AY : The von Economo neurons in the frontoinsular and anterior cingulate cortex. Ann N Y Acad Sci. 2011 ; 1225 : 59 – 71 . 21534993 10.1111/j.1749-6632.2011.06011.x 3140770",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_69",
            "start": 0,
            "end": 210,
            "label": {}
        },
        {
            "ix": "9-34_v2_70@0",
            "content": "<REF-38> Roth G Dicke U : Evolution of the brain and intelligence in primates. Prog Brain Res. 2012 ; 195 : 413 – 430 . 22230639 10.1016/B978-0-444-53860-4.00020-9",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_70",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "9-34_v2_71@0",
            "content": "<REF-39> Lefebvre L : Brains, innovations, tools and cultural transmission in birds, non-human primates, and fossil hominins. Front Hum Neurosci. 2013 ; 7 : 245 . 23761751 10.3389/fnhum.2013.00245 3674321",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_71",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "9-34_v2_72@0",
            "content": "<REF-40> Bolhuis JJ Wynne CD : Can evolution explain how minds work? Nature. 2009 ; 458 ( 7240 ): 832 – 833 . 19370014 10.1038/458832a",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_72",
            "start": 0,
            "end": 133,
            "label": {}
        },
        {
            "ix": "9-34_v2_73@0",
            "content": "<REF-41> Emery NJ Clayton NS : The mentality of crows: convergent evolution of intelligence in corvids and apes. Science. 2004 ; 306 ( 5703 ): 1903 – 1907 . 15591194 10.1126/science.1098410",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_73",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "9-34_v2_74@0",
            "content": "<REF-42> Salwiczek LH Prétôt L Demarta L : Adult cleaner wrasse outperform capuchin monkeys, chimpanzees and orang-utans in a complex foraging task derived from cleaner--client reef fish cooperation. PLoS One. 2012 ; 7 ( 11 ): e49068 . 23185293 10.1371/journal.pone.0049068 3504063",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_74",
            "start": 0,
            "end": 280,
            "label": {}
        },
        {
            "ix": "9-34_v2_75@0",
            "content": "<REF-43> Fonseca-Azevedo K Herculano-Houzel S : Metabolic constraint imposes tradeoff between body size and number of brain neurons in human evolution. Proc Natl Acad Sci U S A. 2012 ; 109 ( 45 ): 18571 – 18576 . 23090991 10.1073/pnas.1206390109 3494886",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_75",
            "start": 0,
            "end": 252,
            "label": {}
        },
        {
            "ix": "9-34_v2_76@0",
            "content": "<REF-44> Wrangham RW Jones JH Laden G : The Raw and the Stolen. Cooking and the Ecology of Human Origins. Curr Anthropol. 1999 ; 40 ( 5 ): 567 – 594 . 10539941 10.1086/300083",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_76",
            "start": 0,
            "end": 173,
            "label": {}
        },
        {
            "ix": "9-34_v2_77@0",
            "content": "<REF-45> Warneken F Rosati AG : Cognitive capacities for cooking in chimpanzees. Proc Biol Sci. 2015 ; 282 ( 1809 ): 20150229 . 26041356 10.1098/rspb.2015.0229 4590439",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_77",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "9-34_v2_78@0",
            "content": "<REF-46> Hurford JR : Human uniqueness, learned symbols and recursive thought. Eur Rev. 2004 ; 12 ( 4 ): 551 – 565 . 10.1017/S106279870400047X",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_78",
            "start": 0,
            "end": 141,
            "label": {}
        },
        {
            "ix": "9-34_v2_79@0",
            "content": "<REF-47> Greenfield PM : Language, Tools, and Brain - the Ontogeny and Phylogeny of Hierarchically Organized Sequential Behavior. Behav Brain Sci. 1991 ; 14 ( 4 ): 531 – 550 . 10.1017/S0140525X00071235",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_79",
            "start": 0,
            "end": 200,
            "label": {}
        },
        {
            "ix": "9-34_v2_80@0",
            "content": "<REF-48> Hauser MD Chomsky N Fitch WT : The faculty of language: what is it, who has it, and how did it evolve? Science. 2002 ; 298 ( 5598 ): 1569 – 1579 . 12446899 10.1126/science.298.5598.1569",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_80",
            "start": 0,
            "end": 193,
            "label": {}
        },
        {
            "ix": "9-34_v2_81@0",
            "content": "<REF-49> Boeckx C : Biolinguistics: forays into human cognitive biology. J Anthropol Sci. 2013 ; 91 : 63 – 89 . 24038628 10.4436/jass.91009",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_81",
            "start": 0,
            "end": 138,
            "label": {}
        },
        {
            "ix": "9-34_v2_82@0",
            "content": "<REF-50> Capasso L Michetti E D'Anastasio R : A Homo erectus hyoid bone: possible implications for the origin of the human capability for speech. Coll Antropol. 2008 ; 32 ( 4 ): 1007 – 1011 . 19149203",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_82",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "9-34_v2_83@0",
            "content": "<REF-51> Darwin C : The descent of man, and selection in relation to sex. D. Appleton and company, New York. 1871 . 10.5962/bhl.title.24784",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_83",
            "start": 0,
            "end": 138,
            "label": {}
        },
        {
            "ix": "9-34_v2_84@0",
            "content": "<REF-52> Bolhuis JJ Gahr M : Neural mechanisms of birdsong memory. Nat Rev Neurosci. 2006 ; 7 ( 5 ): 347 – 357 . 16760915 10.1038/nrn1904",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_84",
            "start": 0,
            "end": 136,
            "label": {}
        },
        {
            "ix": "9-34_v2_85@0",
            "content": "<REF-53> Mooney R : Neural mechanisms for learned birdsong. Learn Mem. 2009 ; 16 ( 11 ): 655 – 669 . 19850665 10.1101/lm.1065209",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_85",
            "start": 0,
            "end": 127,
            "label": {}
        },
        {
            "ix": "9-34_v2_86@0",
            "content": "<REF-54> Bolhuis JJ Okanoya K Scharff C : Twitter evolution: converging mechanisms in birdsong and human speech. Nat Rev Neurosci. 2010 ; 11 ( 11 ): 747 – 759 . 20959859 10.1038/nrn2931",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_86",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "9-34_v2_87@0",
            "content": "<REF-55> Scharff C Petri J : Evo-devo, deep homology and FoxP2: implications for the evolution of speech and language. Philos Trans R Soc Lond B Biol Sci. 2011 ; 366 ( 1574 ): 2124 – 2140 . 21690130 10.1098/rstb.2011.0001 3130369",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_87",
            "start": 0,
            "end": 228,
            "label": {}
        },
        {
            "ix": "9-34_v2_88@0",
            "content": "<REF-56> Arnold K Zuberbühler K : Language evolution: semantic combinations in primate calls. Nature. 2006 ; 441 ( 7091 ): 303 . 16710411 10.1038/441303a",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_88",
            "start": 0,
            "end": 152,
            "label": {}
        },
        {
            "ix": "9-34_v2_89@0",
            "content": "<REF-57> Riley JR Greggers U Smith AD : The flight paths of honeybees recruited by the waggle dance. Nature. 2005 ; 435 ( 7039 ): 205 – 207 . 15889092 10.1038/nature03526",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_89",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "9-34_v2_90@0",
            "content": "<REF-58> Miyagawa S Berwick RC Okanoya K : The emergence of hierarchical structure in human language. Front Psychol. 2013 ; 4 : 71 . 23431042 10.3389/fpsyg.2013.00071 3577014",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_90",
            "start": 0,
            "end": 173,
            "label": {}
        },
        {
            "ix": "9-34_v2_91@0",
            "content": "<REF-59> Dunbar RI : The social Brain hypothesis. Evolutionary Anthropology: Issues, News and Reviews. 1998 ; 6 ( 5 ): 178 – 190 . 10.1002/(SICI)1520-6505(1998)6:5<178::AID-EVAN5>3.0.CO;2-8",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_91",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "9-34_v2_92@0",
            "content": "<REF-60> Lefebvre L Nicolakakis N Boire D : Tools and brains in birds. Behav. 2002 ; 139 : 939 – 973 . 10.1163/156853902320387918",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_92",
            "start": 0,
            "end": 128,
            "label": {}
        },
        {
            "ix": "9-34_v2_93@0",
            "content": "<REF-63> Rutz C Klump BC Komarczyk L : Discovery of species-wide tool use in the Hawaiian crow. Nature. 2016 ; 537 ( 7620 ): 403 – 407 . 27629645 10.1038/nature19103",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_93",
            "start": 0,
            "end": 164,
            "label": {}
        },
        {
            "ix": "9-34_v2_94@0",
            "content": "<REF-64> Russell DA Dong Z : A nearly complete skeleton of a new troodontid dinosaur from the Early Cretaceous of the Ordos Basin, Inner Mongolia, People's Republic of China. Can J Earth Sci. 1993 ; 30 ( 10 ): 2163 – 2173 . 10.1139/e93-187",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_94",
            "start": 0,
            "end": 238,
            "label": {}
        },
        {
            "ix": "9-34_v2_95@0",
            "content": "<REF-65> Franks NR Richardson T : Teaching in tandem-running ants. Nature. 2006 ; 439 ( 7073 ): 153 . 16407943 10.1038/439153a",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_95",
            "start": 0,
            "end": 125,
            "label": {}
        },
        {
            "ix": "9-34_v2_96@0",
            "content": "<REF-66> Jolly A : Lemur social behavior and primate intelligence. Science. 1966 ; 153 ( 3735 ): 501 – 506 . 5938775 10.1126/science.153.3735.501",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_96",
            "start": 0,
            "end": 144,
            "label": {}
        },
        {
            "ix": "9-34_v2_97@0",
            "content": "<REF-70> Freeberg TM Dunbar RIM Ord TJ : Social complexity as a proximate and ultimate factor in communicative complexity. Philos Trans R Soc Lond B Biol Sci. 2012 ; 367 ( 1597 ): 1785 – 1801 . 22641818 10.1098/rstb.2011.0213 3367695",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_97",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "9-34_v2_98@0",
            "content": "<REF-71> Marino L : Dolphin cognition. Curr Biol. 2004 ; 14 ( 21 ): R910 – 911 . 15530377 10.1016/j.cub.2004.10.010",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_98",
            "start": 0,
            "end": 114,
            "label": {}
        },
        {
            "ix": "9-34_v2_99@0",
            "content": "<REF-72> Jarvis ED Güntürkün O Bruce L : Avian brains and a new understanding of vertebrate brain evolution. Nat Rev Neurosci. 2005 ; 6 ( 2 ): 151 – 159 . 15685220 10.1038/nrn1606 2507884",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_99",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "9-34_v2_100@0",
            "content": "<REF-73> Willemet R : Reconsidering the evolution of brain, cognition, and behavior in birds and mammals. Front Psychol. 2013 ; 4 : 396 . 23847570 10.3389/fpsyg.2013.00396 3696912",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_100",
            "start": 0,
            "end": 178,
            "label": {}
        },
        {
            "ix": "9-34_v2_101@0",
            "content": "<REF-74> Brumm A Aziz F van den Bergh GD : Early stone technology on Flores and its implications for Homo floresiensis . Nature. 2006 ; 441 ( 7093 ): 624 – 628 . 16738657 10.1038/nature04618",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_101",
            "start": 0,
            "end": 189,
            "label": {}
        },
        {
            "ix": "9-34_v2_102@0",
            "content": "<REF-75> Prior H Schwarz A Gunturkun O : Mirror-induced behavior in the magpie ( Pica pica ): evidence of self-recognition. PLoS Biol. 2008 ; 6 ( 8 ): e202 . 18715117 10.1371/journal.pbio.0060202 2517622",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_102",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "9-34_v2_103@0",
            "content": "<REF-76> Emery NJ Seed AM von Bayern AM : Cognitive adaptations of social bonding in birds. Philos Trans R Soc Lond B Biol Sci. 2007 ; 362 ( 1480 ): 489 – 505 . 17255008 10.1098/rstb.2006.1991 2346513",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_103",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "9-34_v2_104@0",
            "content": "<REF-77> Crow TJ : Schizophrenia as the price that homo sapiens pays for language: a resolution of the central paradox in the origin of the species. Brain Res Brain Res Rev. 2000 ; 31 ( 2–3 ): 118 – 129 . 10719140 10.1016/s0165-0173(99)00029-6",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_104",
            "start": 0,
            "end": 242,
            "label": {}
        },
        {
            "ix": "9-34_v2_105@0",
            "content": "<REF-78> Lo Sardo V Zuccato C Gaudenzi G : An evolutionary recent neuroepithelial cell adhesion function of huntingtin implicates ADAM10-Ncadherin. Nat Neurosci. 2012 ; 15 ( 5 ): 713 – 721 . 22466506 10.1038/nn.3080",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_105",
            "start": 0,
            "end": 214,
            "label": {}
        },
        {
            "ix": "9-34_v2_106@0",
            "content": "<REF-79> Yin J Yuan Q : Structural homeostasis in the nervous system: a balancing act for wiring plasticity and stability. Front Cell Neurosci. 2014 ; 8 : 439 . 25653587 10.3389/fncel.2014.00439 4299450",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_106",
            "start": 0,
            "end": 201,
            "label": {}
        },
        {
            "ix": "9-34_v2_107@0",
            "content": "<REF-80> Toro R Konyukh M Delorme R : Key role for gene dosage and synaptic homeostasis in autism spectrum disorders. Trends Genet. 2010 ; 26 ( 8 ): 363 – 372 . 20609491 10.1016/j.tig.2010.05.007",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_107",
            "start": 0,
            "end": 194,
            "label": {}
        },
        {
            "ix": "9-34_v2_108@0",
            "content": "<REF-81> Gibson G : Decanalization and the origin of complex disease. Nat Rev Genet. 2009 ; 10 ( 2 ): 134 – 140 . 19119265 10.1038/nrg2502",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_108",
            "start": 0,
            "end": 137,
            "label": {}
        },
        {
            "ix": "9-34_v2_109@0",
            "content": "<REF-82> Bloom DE Cafiero ET Jané-Llopis E : World Economic Forum . Geneva. 2011 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_109",
            "start": 0,
            "end": 81,
            "label": {}
        },
        {
            "ix": "9-34_v2_110@0",
            "content": "<REF-83> Luncz LV Tan A Haslam M : Resource depletion through primate stone technology. eLife. 2017 ; 6 : pii: e23647. 28884681 10.7554/eLife.23647 5590808",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_110",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "9-34_v2_111@0",
            "content": "<REF-84> Gould SJ : Exaptation: A crucial tool for evolutionary psychology. Journal of Social Issues. 1991 ; 47 ( 3 ): 43 – 65 . 10.1111/j.1540-4560.1991.tb01822.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_111",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "9-34_v2_112@0",
            "content": "<REF-85> Eriksson A Betti L Friend AD : Late Pleistocene climate change and the global expansion of anatomically modern humans. Proc Natl Acad Sci U S A. 2012 ; 109 ( 40 ): 16089 – 16094 . 22988099 10.1073/pnas.1209494109 3479575",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_112",
            "start": 0,
            "end": 228,
            "label": {}
        },
        {
            "ix": "9-34_v2_113@0",
            "content": "<REF-86> Running SW : Approaching the Limits. Science. 2013 ; 339 ( 6 ): 1276 – 1277 . 10.1126/science.1235886",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_113",
            "start": 0,
            "end": 109,
            "label": {}
        },
        {
            "ix": "9-34_v2_114@0",
            "content": "<REF-87> Spratt D Dunlop I : Existential climate-related security risk: A scenario approach . breakthroughonline.org.au. 2019 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "9-34_v2_114",
            "start": 0,
            "end": 143,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "9-34_v2_0",
            "tgt_ix": "9-34_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_1",
            "tgt_ix": "9-34_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_0",
            "tgt_ix": "9-34_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_5",
            "tgt_ix": "9-34_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_7",
            "tgt_ix": "9-34_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_7",
            "tgt_ix": "9-34_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_9",
            "tgt_ix": "9-34_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_11",
            "tgt_ix": "9-34_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_13",
            "tgt_ix": "9-34_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_13",
            "tgt_ix": "9-34_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_16",
            "tgt_ix": "9-34_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_18",
            "tgt_ix": "9-34_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_18",
            "tgt_ix": "9-34_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_21",
            "tgt_ix": "9-34_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_21",
            "tgt_ix": "9-34_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_21",
            "tgt_ix": "9-34_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_21",
            "tgt_ix": "9-34_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_26",
            "tgt_ix": "9-34_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_26",
            "tgt_ix": "9-34_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_26",
            "tgt_ix": "9-34_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_26",
            "tgt_ix": "9-34_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_31",
            "tgt_ix": "9-34_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_31",
            "tgt_ix": "9-34_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_31",
            "tgt_ix": "9-34_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_31",
            "tgt_ix": "9-34_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_31",
            "tgt_ix": "9-34_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_0",
            "tgt_ix": "9-34_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_37",
            "tgt_ix": "9-34_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_37",
            "tgt_ix": "9-34_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_37",
            "tgt_ix": "9-34_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_0",
            "tgt_ix": "9-34_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_41",
            "tgt_ix": "9-34_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_0",
            "tgt_ix": "9-34_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_1",
            "tgt_ix": "9-34_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_2",
            "tgt_ix": "9-34_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_4",
            "tgt_ix": "9-34_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_5",
            "tgt_ix": "9-34_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_7",
            "tgt_ix": "9-34_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_9",
            "tgt_ix": "9-34_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_10",
            "tgt_ix": "9-34_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_11",
            "tgt_ix": "9-34_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_13",
            "tgt_ix": "9-34_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_15",
            "tgt_ix": "9-34_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_16",
            "tgt_ix": "9-34_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_18",
            "tgt_ix": "9-34_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_19",
            "tgt_ix": "9-34_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_21",
            "tgt_ix": "9-34_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_22",
            "tgt_ix": "9-34_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_23",
            "tgt_ix": "9-34_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_25",
            "tgt_ix": "9-34_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_26",
            "tgt_ix": "9-34_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_27",
            "tgt_ix": "9-34_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_29",
            "tgt_ix": "9-34_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_30",
            "tgt_ix": "9-34_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_31",
            "tgt_ix": "9-34_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_32",
            "tgt_ix": "9-34_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_33",
            "tgt_ix": "9-34_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_34",
            "tgt_ix": "9-34_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_36",
            "tgt_ix": "9-34_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_37",
            "tgt_ix": "9-34_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_38",
            "tgt_ix": "9-34_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_39",
            "tgt_ix": "9-34_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_40",
            "tgt_ix": "9-34_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_41",
            "tgt_ix": "9-34_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_43",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_44",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_45",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_46",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_48",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_15",
            "tgt_ix": "9-34_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_65",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_33",
            "tgt_ix": "9-34_v2_66",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_67",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_68",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_69",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_70",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_71",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_19",
            "tgt_ix": "9-34_v2_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_22",
            "tgt_ix": "9-34_v2_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_22",
            "tgt_ix": "9-34_v2_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_22",
            "tgt_ix": "9-34_v2_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_22",
            "tgt_ix": "9-34_v2_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_23",
            "tgt_ix": "9-34_v2_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_90",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_27",
            "tgt_ix": "9-34_v2_91",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_92",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_93",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_94",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_95",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_96",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_97",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_98",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_99",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_29",
            "tgt_ix": "9-34_v2_100",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_29",
            "tgt_ix": "9-34_v2_101",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_29",
            "tgt_ix": "9-34_v2_102",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_33",
            "tgt_ix": "9-34_v2_103",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_104",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_105",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_106",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_107",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_108",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_109",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_36",
            "tgt_ix": "9-34_v2_110",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_39",
            "tgt_ix": "9-34_v2_111",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_39",
            "tgt_ix": "9-34_v2_112",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_40",
            "tgt_ix": "9-34_v2_113",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_40",
            "tgt_ix": "9-34_v2_114",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_10",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "9-34_v2_0",
            "tgt_ix": "9-34_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_1",
            "tgt_ix": "9-34_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_2",
            "tgt_ix": "9-34_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_2",
            "tgt_ix": "9-34_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_2",
            "tgt_ix": "9-34_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_2",
            "tgt_ix": "9-34_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_2",
            "tgt_ix": "9-34_v2_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_2",
            "tgt_ix": "9-34_v2_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_2",
            "tgt_ix": "9-34_v2_2@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_3",
            "tgt_ix": "9-34_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_4",
            "tgt_ix": "9-34_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_4",
            "tgt_ix": "9-34_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_4",
            "tgt_ix": "9-34_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_4",
            "tgt_ix": "9-34_v2_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_4",
            "tgt_ix": "9-34_v2_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_4",
            "tgt_ix": "9-34_v2_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_5",
            "tgt_ix": "9-34_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_6",
            "tgt_ix": "9-34_v2_6@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_7",
            "tgt_ix": "9-34_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_8@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_8@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_8@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_8@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_8",
            "tgt_ix": "9-34_v2_8@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_9",
            "tgt_ix": "9-34_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_11",
            "tgt_ix": "9-34_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_12@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_12@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_12@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_12",
            "tgt_ix": "9-34_v2_12@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_13",
            "tgt_ix": "9-34_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_14",
            "tgt_ix": "9-34_v2_14@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_15",
            "tgt_ix": "9-34_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_15",
            "tgt_ix": "9-34_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_15",
            "tgt_ix": "9-34_v2_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_15",
            "tgt_ix": "9-34_v2_15@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_16",
            "tgt_ix": "9-34_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_17@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_17@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_17@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_17",
            "tgt_ix": "9-34_v2_17@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_18",
            "tgt_ix": "9-34_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_19",
            "tgt_ix": "9-34_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_19",
            "tgt_ix": "9-34_v2_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_19",
            "tgt_ix": "9-34_v2_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_20@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_20@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_20@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_20@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_20@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_20",
            "tgt_ix": "9-34_v2_20@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_21",
            "tgt_ix": "9-34_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_22",
            "tgt_ix": "9-34_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_22",
            "tgt_ix": "9-34_v2_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_22",
            "tgt_ix": "9-34_v2_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_22",
            "tgt_ix": "9-34_v2_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_22",
            "tgt_ix": "9-34_v2_22@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_23",
            "tgt_ix": "9-34_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_23",
            "tgt_ix": "9-34_v2_23@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_23",
            "tgt_ix": "9-34_v2_23@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_23",
            "tgt_ix": "9-34_v2_23@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_23",
            "tgt_ix": "9-34_v2_23@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_24@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_24@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_24",
            "tgt_ix": "9-34_v2_24@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_25",
            "tgt_ix": "9-34_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_25",
            "tgt_ix": "9-34_v2_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_26",
            "tgt_ix": "9-34_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_27",
            "tgt_ix": "9-34_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_27",
            "tgt_ix": "9-34_v2_27@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_27",
            "tgt_ix": "9-34_v2_27@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_27",
            "tgt_ix": "9-34_v2_27@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_27",
            "tgt_ix": "9-34_v2_27@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_27",
            "tgt_ix": "9-34_v2_27@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_27",
            "tgt_ix": "9-34_v2_27@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_28@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_28",
            "tgt_ix": "9-34_v2_28@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_29",
            "tgt_ix": "9-34_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_29",
            "tgt_ix": "9-34_v2_29@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_29",
            "tgt_ix": "9-34_v2_29@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_29",
            "tgt_ix": "9-34_v2_29@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_29",
            "tgt_ix": "9-34_v2_29@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_30",
            "tgt_ix": "9-34_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_30",
            "tgt_ix": "9-34_v2_30@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_31",
            "tgt_ix": "9-34_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_32",
            "tgt_ix": "9-34_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_32",
            "tgt_ix": "9-34_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_32",
            "tgt_ix": "9-34_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_32",
            "tgt_ix": "9-34_v2_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_33",
            "tgt_ix": "9-34_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_33",
            "tgt_ix": "9-34_v2_33@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_33",
            "tgt_ix": "9-34_v2_33@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_34",
            "tgt_ix": "9-34_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_34",
            "tgt_ix": "9-34_v2_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_34",
            "tgt_ix": "9-34_v2_34@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_34",
            "tgt_ix": "9-34_v2_34@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_34",
            "tgt_ix": "9-34_v2_34@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_34",
            "tgt_ix": "9-34_v2_34@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_34",
            "tgt_ix": "9-34_v2_34@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_35@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_35@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_35@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_35@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_35@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_35@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_35@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_35",
            "tgt_ix": "9-34_v2_35@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_36",
            "tgt_ix": "9-34_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_36",
            "tgt_ix": "9-34_v2_36@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_36",
            "tgt_ix": "9-34_v2_36@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_36",
            "tgt_ix": "9-34_v2_36@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_36",
            "tgt_ix": "9-34_v2_36@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_36",
            "tgt_ix": "9-34_v2_36@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_37",
            "tgt_ix": "9-34_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_38",
            "tgt_ix": "9-34_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_38",
            "tgt_ix": "9-34_v2_38@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_38",
            "tgt_ix": "9-34_v2_38@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_38",
            "tgt_ix": "9-34_v2_38@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_38",
            "tgt_ix": "9-34_v2_38@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_39",
            "tgt_ix": "9-34_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_39",
            "tgt_ix": "9-34_v2_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_40",
            "tgt_ix": "9-34_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_40",
            "tgt_ix": "9-34_v2_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_40",
            "tgt_ix": "9-34_v2_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_41",
            "tgt_ix": "9-34_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_42",
            "tgt_ix": "9-34_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_43",
            "tgt_ix": "9-34_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_44",
            "tgt_ix": "9-34_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_45",
            "tgt_ix": "9-34_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_46",
            "tgt_ix": "9-34_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_47",
            "tgt_ix": "9-34_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_48",
            "tgt_ix": "9-34_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_49",
            "tgt_ix": "9-34_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_50",
            "tgt_ix": "9-34_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_51",
            "tgt_ix": "9-34_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_52",
            "tgt_ix": "9-34_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_53",
            "tgt_ix": "9-34_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_54",
            "tgt_ix": "9-34_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_55",
            "tgt_ix": "9-34_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_56",
            "tgt_ix": "9-34_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_57",
            "tgt_ix": "9-34_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_58",
            "tgt_ix": "9-34_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_59",
            "tgt_ix": "9-34_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_60",
            "tgt_ix": "9-34_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_61",
            "tgt_ix": "9-34_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_62",
            "tgt_ix": "9-34_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_63",
            "tgt_ix": "9-34_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_64",
            "tgt_ix": "9-34_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_65",
            "tgt_ix": "9-34_v2_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_66",
            "tgt_ix": "9-34_v2_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_67",
            "tgt_ix": "9-34_v2_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_68",
            "tgt_ix": "9-34_v2_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_69",
            "tgt_ix": "9-34_v2_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_70",
            "tgt_ix": "9-34_v2_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_71",
            "tgt_ix": "9-34_v2_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_72",
            "tgt_ix": "9-34_v2_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_73",
            "tgt_ix": "9-34_v2_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_74",
            "tgt_ix": "9-34_v2_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_75",
            "tgt_ix": "9-34_v2_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_76",
            "tgt_ix": "9-34_v2_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_77",
            "tgt_ix": "9-34_v2_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_78",
            "tgt_ix": "9-34_v2_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_79",
            "tgt_ix": "9-34_v2_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_80",
            "tgt_ix": "9-34_v2_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_81",
            "tgt_ix": "9-34_v2_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_82",
            "tgt_ix": "9-34_v2_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_83",
            "tgt_ix": "9-34_v2_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_84",
            "tgt_ix": "9-34_v2_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_85",
            "tgt_ix": "9-34_v2_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_86",
            "tgt_ix": "9-34_v2_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_87",
            "tgt_ix": "9-34_v2_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_88",
            "tgt_ix": "9-34_v2_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_89",
            "tgt_ix": "9-34_v2_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_90",
            "tgt_ix": "9-34_v2_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_91",
            "tgt_ix": "9-34_v2_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_92",
            "tgt_ix": "9-34_v2_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_93",
            "tgt_ix": "9-34_v2_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_94",
            "tgt_ix": "9-34_v2_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_95",
            "tgt_ix": "9-34_v2_95@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_96",
            "tgt_ix": "9-34_v2_96@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_97",
            "tgt_ix": "9-34_v2_97@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_98",
            "tgt_ix": "9-34_v2_98@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_99",
            "tgt_ix": "9-34_v2_99@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_100",
            "tgt_ix": "9-34_v2_100@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_101",
            "tgt_ix": "9-34_v2_101@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_102",
            "tgt_ix": "9-34_v2_102@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_103",
            "tgt_ix": "9-34_v2_103@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_104",
            "tgt_ix": "9-34_v2_104@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_105",
            "tgt_ix": "9-34_v2_105@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_106",
            "tgt_ix": "9-34_v2_106@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_107",
            "tgt_ix": "9-34_v2_107@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_108",
            "tgt_ix": "9-34_v2_108@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_109",
            "tgt_ix": "9-34_v2_109@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_110",
            "tgt_ix": "9-34_v2_110@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_111",
            "tgt_ix": "9-34_v2_111@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_112",
            "tgt_ix": "9-34_v2_112@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_113",
            "tgt_ix": "9-34_v2_113@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "9-34_v2_114",
            "tgt_ix": "9-34_v2_114@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "9-34_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.22039.2",
        "atype": "opinion-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Intrinsic negative feedback as a limiting factor for the evolution of higher forms of intelligence",
        "abstract": "Longstanding scientific efforts have been dedicated to answer why and how our particular intelligence is generated by our brain but not by the brain of other species. However, surprisingly little effort has been made to ask why no other species ever developed an intelligence similar to ours. Here, I explore this question based on genetic and paleontologic evidence. Contrary to the established view, this review suggests that the developmental hurdles alone are not high enough to explain the uniqueness of human intelligence (HI). As an additional explanation I propose that HI is normally not retained by natural selection, because it is, under most conditions, an intrinsically unfavourable trait. This unfavourableness, however, cannot be explained by physical constraints alone; rather, it may also be rooted in the same emotional and social complexity that is necessary for the development of HI. Thus, a major obstacle towards HI may not be solely the development of the required physical assets, but also to cope with harmful individual, social and environmental feedback intrinsically associated with this trait.",
        "contributors": [
            {
                "surname": "Arold",
                "given-names": "Stefan T."
            }
        ],
        "url": "https://f1000research.com/articles/9-34/v2/",
        "doc_id": "9-34",
        "version": 2,
        "ix_counter": 460,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}