{
    "nodes": [
        {
            "ix": "3-176_v2_0",
            "content": "Sub-strains of Drosophila Canton-S differ markedly in their locomotor behavior",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_2",
            "content": "We collected five sub-strains of the standard laboratory wild-type Drosophila melanogaster Canton Special (CS) and analyzed their walking behavior in Buridan's paradigm using the CeTrAn software. According to twelve different aspects of their behavior, the sub-strains fit into three groups. The group separation appeared not to be correlated with the origin of the stocks. We conclude that founder effects but not laboratory selection likely influenced the gene pool of the sub-strains. The flies’ stripe fixation was the parameter that varied most. Our results suggest that differences in the genome of laboratory stocks can render comparisons between nominally identical wild-type stocks meaningless. A single source for control strains may settle this problem.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_4",
            "content": "In our quest for understanding gene function, we commonly manipulate gene expression and compare the phenotypes of the manipulated versus control organisms. For technical reasons and to facilitate comparison as well as reproducibility between different experiments, a limited number of control strains have been established in most model organisms. For instance, the C57BL, 129 and FVB strains are commonly used in mouse studies; N2 is the common control strain used in Caenorhabditis elegans ; and Canton-Special (CS) is one of the most-used wild-type strains in Drosophila melanogaster genetics studies. The CS stock was established by C. B. Bridges <REF-1> and chosen because of its low mutation rate. S. Benzer introduced CS to what was to become neurogenetics in his landmark study in 1967 <REF-2> , because of its strong fast-phototaxis response. The strain has been used as a control in neurogenetics studies ever since.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_5",
            "content": "With time and reproductive isolation, populations of laboratory control strains can diverge, in spite of ideal breeding conditions and seemingly little selective pressure. Several studies comparing the behavior of sub-strains of mice showed that their behavior differs <REF-3> . For instance, Paylor and colleagues measured that one sub-strain of C57 mice showed a higher startle amplitude after tactile stimulation than another <REF-4> . Similarly, the behavior of different N2 C. elegans sub-strains was found to vary to a considerable extent <REF-5> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_6",
            "content": "In this study, we tested five different CS Drosophila melanogaster sub-strains in Buridan’s paradigm <REF-6> – <REF-8> ), where flies walk between two stripes on a platform surrounded by a water moat. We could separate the CS sub-strains into three groups according to their behavior during the experiment. In addition, we found that the between-strain variability in the stripe fixation score is particularly high. We discuss possible solutions to prevent sub-strain related problems.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_7",
            "content": "Materials and methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "materials | methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_8",
            "content": "Fly care",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_9",
            "content": "Flies were kept in vials (68 ml, Art.-Nr. 217101, Greiner Bio-One GmbH, Maybachstr.2, 72636 Frickenhausen) in a controlled density on standard cornmeal/molasses medium <REF-9> at 25°C in a 12 h:12 h dark/light cycle for one generation before being tested. Flies were collected 0–1 day after hatching and put in new food vials for one day. Approximately ten female flies (N=11–12 in each group) were then CO 2 -anaesthetized and their wings were cut with surgical scissors at two thirds of their length, before being taken back to their vial to recover overnight. They were then captured individually using a fly aspirator and put in the experimental setup to be tested.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_10",
            "content": "Fly strains",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_11",
            "content": "Five sub-strains of CS wild-type Drosophila melanogaster were collected in the lab from 2008 to 2011. Troy Zars took his CS_TZ stock to Columbia, MO, USA in 2002 when leaving Martin Heisenberg’s lab in Würzburg, Germany. It arrived in our laboratory in Berlin in 2008. The CS_TP stock was separated from Tim Tully’s strain in Waltham, MA, USA in 1992 and moved to Paris, France. The CS_JC stock was derived from the CS_TP stock in 2007 when one of the authors (JC) was in Thomas Préat’s lab. Both strains (TP and JC) arrived in Berlin in 2009. The CS_BS stock was separated by Bruno van Swinderen from Ralf Greenspan’s stock in San Diego, CA, USA in 1999 and brought to Brisbane, Australia. From there it arrived in Berlin in 2008. Finally, Henrike Scholz received her stock from Ulrike Heberlein in San Francisco, CA, USA. The CS_HS strain arrived in Berlin in 2007. Flies of all strains were kept at 18°C until being tested in 2012 and 2013.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_12",
            "content": "Buridan’s paradigm",
            "ntype": "title",
            "meta": {
                "section": "2.3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_13",
            "content": "Experimental details are described in detail elsewhere <REF-7> . Briefly, two black stripes producing 11° wide landmarks were positioned 293 mm from the center of a platform with a diameter of 117 mm, surrounded by water and illuminated with bright white light from behind. The centroid position of the fly was recorded via custom software (BuriTrack, http://buridan.sourceforge.net ). If flies jumped from the platform, they were taken back to the platform with a brush and the tracker was reinitialized. Each data file represents five minutes of uninterrupted walking. We measured two replicates of the same five sub-strains in consecutive years, 2012 and 2013.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_14",
            "content": "For more than three decades, experiments in Buridan’s paradigm demonstrated that wild-type flies typically walk back and forth between the landmarks. We performed 5 minute long walking experiments with five different wild type Canton S (CS) sub-strains: CS_TP, CS_TZ, CS_JC, CS_BS and CS_HS. The locomotion parameters we calculated can be divided into three broad categories: temporal (activity/pause structure), spatial (stripe fixation, thigmotaxis, trajectory straightness) and mixed (speed, number of walks between stripes, distance travelled) measures (ref. <REF-7> , Table 1 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_15",
            "content": "Table 1.",
            "ntype": "label",
            "meta": {
                "id": "T1",
                "caption": "Brief description of the twelve parameters calculated from the trajectory of the flies used in this paper. A more detailed description is available at http://dx.doi.org/10.6084/m9.figshare.844624 .",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_16",
            "content": "<table-wrap xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" id=\"T1\" position=\"anchor\"> <caption> <title>Brief description of the twelve parameters calculated from the trajectory of the flies used in this paper.</title> <p>A more detailed description is available at <ext-link ext-link-type=\"uri\" xlink:href=\"https://dx.doi.org/10.6084/m9.figshare.844624\">http://dx.doi.org/10.6084/m9.figshare.844624</ext-link>.</p> </caption> <table content-type=\"article-table\" frame=\"hsides\"> <thead> <tr> <th align=\"left\">Parameter</th> <th align=\"left\">Description</th> </tr> </thead> <tbody> <tr> <td>Median speed</td> <td>Median of the speed of the animal while walking</td> </tr> <tr> <td>Mean distance travelled per min.</td> <td>Distance travelled during the experiment divided by the duration of the experiment</td> </tr> <tr> <td>Turning angle</td> <td>Median of the angle difference between two movements</td> </tr> <tr> <td>Meander</td> <td>Median of the turning angle divided by instantaneous speed</td> </tr> <tr> <td>Thigmotaxis while moving</td> <td>Proportion of time spent on the edge of the platform versus the center of the platform <break/>(equal surfaces) while moving</td> </tr> <tr> <td>Thigmotaxis while sitting</td> <td>Proportion of time spent on the edge of the platform versus the center of the platform <break/>(equal surfaces) while being immobile</td> </tr> <tr> <td>Stripe deviation</td> <td>Median deviation angle between walking direction and direction toward the stripes</td> </tr> <tr> <td>Number of walks</td> <td>Number of times a fly walks between the two stripes during the experiment</td> </tr> <tr> <td>Number of pauses</td> <td>Number of times a fly stopped walking for more than 1s during the experiment</td> </tr> <tr> <td>Activity bouts duration</td> <td>Median duration of activity phases</td> </tr> <tr> <td>Pause length</td> <td>Median duration of pauses</td> </tr> <tr> <td>Total time active</td> <td>Sum of the length of activity phases during the experiment</td> </tr> </tbody> </table> </table-wrap>",
            "ntype": "table-wrap",
            "meta": {
                "id": "T1",
                "caption": "Brief description of the twelve parameters calculated from the trajectory of the flies used in this paper. A more detailed description is available at http://dx.doi.org/10.6084/m9.figshare.844624 .",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_17",
            "content": "Experimental differences between the replicates",
            "ntype": "title",
            "meta": {
                "section": "2.4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_18",
            "content": "The experiments in 2012 were done according to the previously published setup <REF-7> , while the 2013 experiments were performed in four new setups. In the new setups, illumination is slightly brighter (10–11 klx in the new setup, 7.5–8.5 klx in the old setup). We did not detect any difference in the temperature on the platforms (27°C for all machines). The platform was cleaned between flies in the 2012 replicate, while the platform was rotated between two tests in the 2013 replicate, and cleaned only after a series of five flies had been tested.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_19",
            "content": "Analysis",
            "ntype": "title",
            "meta": {
                "section": "2.5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_20",
            "content": "The data was analyzed using CeTrAn v.4 ( https://github.com/jcolomb/CeTrAn/releases/tag/v.4 ). Data with a mean distance travelled smaller than 50 mm/min was excluded to avoid outliers (2 data points were excluded in the second replicate, one for CS_JC and one for CS_HS).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_21",
            "content": "Twelve different parameters were calculated ( Table 1 ) and a Principal Components Analysis (PCA) was performed to visualize the results and identify potential groupings of the sub-strains. The effects of genotype and replicate were analyzed with an ANOVA (in R) using the second principal component, since the first and the third components were not normally distributed (assessed with a Shapiro test). Transition plots and the stripe deviation plot have not been tested statistically.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_22",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "2.6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_23",
            "content": "Raw trajectory data (including outliers), the results of the CeTrAn analysis and the PCA result table are available on figshare: http://dx.doi.org/10.6084/m9.figshare.1014264 .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_24",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_25",
            "content": "In Buridan’s paradigm, wild-type flies typically walk back and forth between two inaccessible landmarks and their walking behavior is then analyzed. We performed 5 minutes long walking experiments with five different Canton S (CS) sub-strains: CS_TP, CS_TZ, CS_JC, CS_BS and CS_HS. We tested them in two replicates in two consecutive years using different hardware and under slightly varying experimental details (see Materials and Methods). The locomotion parameters that we calculated can be divided into three broad categories: temporal (activity/pause structure), spatial (stripe fixation, thigmotaxis, trajectory straightness) and mixed (speed, number of walks between stripes, distance travelled) measures (ref. <REF-7> , Table 1 ). Flies’ walking behavior was also visualized in transition plots, where the frequency of passage at each platform position is indicated by a heatmap. A distinction between sub-strains, which is consistent between the two replicates, can be seen in the visualization of this purely spatial parameter ( Figure 1 ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_26",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "In transition plots, the behavior of each sub-strain looks different from the other strains and similar between the two experimental sessions. Transition plots represent the position of the fly on the platform, excluding the time when the fly was immobile. The scale is proportional, with red points meaning that the number of times the fly was in that position is at least 95% of the maximal score obtained for any position. A Gaussian smooth was applied to the resulting heat map. The two points outside the platform were added manually to assure orthogonal axes of the representation. Sample size is 11–12 for each plot.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_27",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>In transition plots, the behavior of each sub-strain looks different from the other strains and similar between the two experimental sessions.</title> <p>Transition plots represent the position of the fly on the platform, excluding the time when the fly was immobile. The scale is proportional, with red points meaning that the number of times the fly was in that position is at least 95% of the maximal score obtained for any position. A Gaussian smooth was applied to the resulting heat map. The two points outside the platform were added manually to assure orthogonal axes of the representation. Sample size is 11&#8211;12 for each plot.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "In transition plots, the behavior of each sub-strain looks different from the other strains and similar between the two experimental sessions. Transition plots represent the position of the fly on the platform, excluding the time when the fly was immobile. The scale is proportional, with red points meaning that the number of times the fly was in that position is at least 95% of the maximal score obtained for any position. A Gaussian smooth was applied to the resulting heat map. The two points outside the platform were added manually to assure orthogonal axes of the representation. Sample size is 11–12 for each plot.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_28",
            "content": "Using CeTrAn 4.0, we took twelve measurements of the flies’ walking behavior and analyzed them using PCA (for individual performance of each strain in each measurement, see supplementary materials ). For simplicity of representation, we plotted the mean and standard error of the three first principal components, while pooling the replicates ( Figure 2 ). Since the first and third principal components were not normally distributed (Shapiro test), we performed an ANOVA for the second component with the fly sub-strains and the replicates as factors. This analysis demonstrated significant main effects of the sub-strain (F = 28.305, p<2e-16) and the replicate (F = 9.35, p<0.003), while there seems to be no sub-strain × replicate interaction (F value = 2.337, p = 0.059). A Tukey HSD post hoc test of the sub-strain effect confirmed the visual impression of the PCA grouping: CS_TZ and CS_TP together in one group, CS_BS and CS_HS together and CS_JC alone.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_29",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "The CS sub-strains can be separated into three groups according to their overall behavior in Buridan’s paradigm. A PCA was performed over the 12 measured variables capturing the flies’ locomotion. The three first principal components are plotted against each other: from the center of the axes; PC1 to the left, PC2 up and PC3 down and to the right. Since units are arbitrary, they were not indicated. For each genotype, we represent the mean and standard error of the mean for the different PCs as a colored cross (data from the two replicates were pooled). The three groups are best visualized separately on the PC2-PC3 plot (upper-right), while PC2 is sufficient to separate the three groups statistically (see text). Sample size for each group is 23–28.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_30",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>The CS sub-strains can be separated into three groups according to their overall behavior in Buridan&#8217;s paradigm.</title> <p>A PCA was performed over the 12 measured variables capturing the flies&#8217; locomotion. The three first principal components are plotted against each other: from the center of the axes; PC1 to the left, PC2 up and PC3 down and to the right. Since units are arbitrary, they were not indicated. For each genotype, we represent the mean and standard error of the mean for the different PCs as a colored cross (data from the two replicates were pooled). The three groups are best visualized separately on the PC2-PC3 plot (upper-right), while PC2 is sufficient to separate the three groups statistically (see text). Sample size for each group is 23&#8211;28.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "The CS sub-strains can be separated into three groups according to their overall behavior in Buridan’s paradigm. A PCA was performed over the 12 measured variables capturing the flies’ locomotion. The three first principal components are plotted against each other: from the center of the axes; PC1 to the left, PC2 up and PC3 down and to the right. Since units are arbitrary, they were not indicated. For each genotype, we represent the mean and standard error of the mean for the different PCs as a colored cross (data from the two replicates were pooled). The three groups are best visualized separately on the PC2-PC3 plot (upper-right), while PC2 is sufficient to separate the three groups statistically (see text). Sample size for each group is 23–28.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_31",
            "content": "Strikingly, the stripe fixation behavior covered the full range from strong fixation (10° average deviation from the stripe) to almost no fixation at all (30°: a random walk generates a 44° score, <REF-7> ) ( Figure 3 ). We did not perform any statistical tests on this data, as they are already included in the PCA.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_32",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "The different sub-strains show a large spectrum of values for the stripe deviation parameter. For every movement of the fly, the angle between its direction and the direction toward the stripes was calculated. The median of these angles was calculated for each fly, representing a quantification of stripe fixation by the fly. The value of each sub-strain in each session is depicted in boxplots: for each group, we represent the median, 25–75% quantiles and the total spread of the values (excluding outliers) as line, box and whiskers, respectively. The version of this figure on the F1000Research website is interactive; readers can define the type of whiskers displayed as either Tukey whiskers (1.5 x IQR from 1 st /3 rd quartile; A ) or the 10 th –90 th percentiles ( B ). The text color code used for the genotypes is analogous to that used in Figure 2 . The red horizontal line corresponds to the median value for random walks: 44°. Sample size is 11–12 for each boxplot. No statistical analysis was performed.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_33",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>The different sub-strains show a large spectrum of values for the stripe deviation parameter.</title> <p>For every movement of the fly, the angle between its direction and the direction toward the stripes was calculated. The median of these angles was calculated for each fly, representing a quantification of stripe fixation by the fly. The value of each sub-strain in each session is depicted in boxplots: for each group, we represent the median, 25&#8211;75% quantiles and the total spread of the values (excluding outliers) as line, box and whiskers, respectively. The version of this figure on the <italic>F1000Research</italic> website is interactive; readers can define the type of whiskers displayed as either Tukey whiskers (1.5 x IQR from 1 <sup>st</sup>/3 <sup>rd</sup> quartile; <bold>A</bold>) or the 10 <sup>th</sup>&#8211;90 <sup>th</sup> percentiles ( <bold>B</bold>). The text color code used for the genotypes is analogous to that used in <xref ref-type=\"fig\" rid=\"f2\">Figure 2</xref>. The red horizontal line corresponds to the median value for random walks: 44&#176;. Sample size is 11&#8211;12 for each boxplot. No statistical analysis was performed.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "The different sub-strains show a large spectrum of values for the stripe deviation parameter. For every movement of the fly, the angle between its direction and the direction toward the stripes was calculated. The median of these angles was calculated for each fly, representing a quantification of stripe fixation by the fly. The value of each sub-strain in each session is depicted in boxplots: for each group, we represent the median, 25–75% quantiles and the total spread of the values (excluding outliers) as line, box and whiskers, respectively. The version of this figure on the F1000Research website is interactive; readers can define the type of whiskers displayed as either Tukey whiskers (1.5 x IQR from 1 st /3 rd quartile; A ) or the 10 th –90 th percentiles ( B ). The text color code used for the genotypes is analogous to that used in Figure 2 . The red horizontal line corresponds to the median value for random walks: 44°. Sample size is 11–12 for each boxplot. No statistical analysis was performed.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_34",
            "content": "In order to estimate the variability range of the CS behavior on a larger scale, we have set up a trajectory database to receive data from CS flies in different laboratories, using similar machines and protocols. In Figure 4 , we have visualized the result of a PCA over both our and submitted data. Additional data will constantly be added to the analysis after the publication of this article; the interactivity of this figure will allow readers to visualize the data at different points in time.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_35",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Updating principal component analysis of Canton S strains. Results from the PCA obtained using the same analysis as for Figure 2 , but with data uploaded from different laboratories. The version of this figure on the F1000Research site is ‘living’; it will automatically re-plot as and when new data for other Canton S strains are submitted, and users can visualize previous versions of this figure. The conclusions of this article only relate to the data available at the time of publication. The prefixes in the key are the initials of the data contributor (except CS_ strains, which were tested by Julien Colomb); full names and affiliations can be found in the figure legend of the article on the F1000Research site. The suffixes denote the initials of the principal investigators from where each sub-strain was sourced. The BB_JB (Jose Botella) strain was ordered from the Bloomington stock center (stock #1) approx. seven years ago. BB_JB falls within the range of variability seen so far, but does not appear to clearly group with any of the previously measured strains. Instructions for adding data: Click the ‘Submit New Data’ button to the left of the figure on the online version of article and fill in the fields on the form (user registration may be required). 'Uploader Name' should be “First name, Last name”; 'Uploader Lab Address' should be “Department, University, Country”. For 'Genotype', use the initials of the principal investigator of the lab from where the strain originated (this will typically be the initials of the uploader). The data should be uploaded as one metadata and one data file for each fly (click links for template examples). Only one CS strain per lab should be uploaded. Please email BB for additional details on contributing data to this figure.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_36",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <title>Updating principal component analysis of Canton S strains.</title> <p>Results from the PCA obtained using the same analysis as for <xref ref-type=\"fig\" rid=\"f2\">Figure 2</xref>, but with data uploaded from different laboratories. The version of this figure on the <italic>F1000Research</italic> site is &#8216;living&#8217;; it will automatically re-plot as and when new data for other Canton S strains are submitted, and users can visualize previous versions of this figure. The conclusions of this article only relate to the data available at the time of publication. The prefixes in the key are the initials of the data contributor (except CS_ strains, which were tested by Julien Colomb); full names and affiliations can be found in the figure legend of the article on the <italic>F1000Research</italic> site. The suffixes denote the initials of the principal investigators from where each sub-strain was sourced. The BB_JB (Jose Botella) strain was ordered from the Bloomington stock center (stock #1) approx. seven years ago. BB_JB falls within the range of variability seen so far, but does not appear to clearly group with any of the previously measured strains.</p> <p> <bold>Instructions for adding data:</bold> Click the &#8216;Submit New Data&#8217; button to the left of the figure on the online version of article and fill in the fields on the form (user registration may be required). 'Uploader Name' should be &#8220;First name, Last name&#8221;; 'Uploader Lab Address' should be &#8220;Department, University, Country&#8221;. For 'Genotype', use the initials of the principal investigator of the lab from where the strain originated (this will typically be the initials of the uploader). The data should be uploaded as one <ext-link ext-link-type=\"uri\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/supplementary/6345/4a3f694a-fa3c-448f-be58-45ec6471a1e7.xml\">metadata</ext-link> and one <ext-link ext-link-type=\"uri\" xlink:href=\"https://f1000researchdata.s3.amazonaws.com/supplementary/6345/2f94a1b1-7011-4f4d-932a-95686e98c74b.dat\">data file</ext-link> for each fly (click links for template examples). Only one CS strain per lab should be uploaded. Please email BB for additional details on contributing data to this figure.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Updating principal component analysis of Canton S strains. Results from the PCA obtained using the same analysis as for Figure 2 , but with data uploaded from different laboratories. The version of this figure on the F1000Research site is ‘living’; it will automatically re-plot as and when new data for other Canton S strains are submitted, and users can visualize previous versions of this figure. The conclusions of this article only relate to the data available at the time of publication. The prefixes in the key are the initials of the data contributor (except CS_ strains, which were tested by Julien Colomb); full names and affiliations can be found in the figure legend of the article on the F1000Research site. The suffixes denote the initials of the principal investigators from where each sub-strain was sourced. The BB_JB (Jose Botella) strain was ordered from the Bloomington stock center (stock #1) approx. seven years ago. BB_JB falls within the range of variability seen so far, but does not appear to clearly group with any of the previously measured strains. Instructions for adding data: Click the ‘Submit New Data’ button to the left of the figure on the online version of article and fill in the fields on the form (user registration may be required). 'Uploader Name' should be “First name, Last name”; 'Uploader Lab Address' should be “Department, University, Country”. For 'Genotype', use the initials of the principal investigator of the lab from where the strain originated (this will typically be the initials of the uploader). The data should be uploaded as one metadata and one data file for each fly (click links for template examples). Only one CS strain per lab should be uploaded. Please email BB for additional details on contributing data to this figure.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/6750/c0da9148-8de1-4054-afcb-b40533cf071e_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_37",
            "content": "Discussion",
            "ntype": "title",
            "meta": {
                "section": "4",
                "sec-type": "discussion",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_38",
            "content": "By analyzing the trajectories of five nominally identical CS sub-strains of Drosophila melanogaster in Buridan’s paradigm, we were able to distinguish three different groups of sub-strains. In principle, the differences between the strains could be explained by genetic, epigenetic or environmental differences, or a combination of these factors. All strains were treated similarly in the same laboratory conditions for many generations (4 to 6 years) before being tested. There was no difference in rearing or experimental conditions between the different groups of flies. Taking into account these circumstances, it is a straightforward assumption that the differences in behavior we report here are either genetic or epigenetic in origin. Taking all the measured parameters into account, sub-strain differences were comparable in the two replicates conducted one year apart, even though one of the Principal Components showed a statistically significant (but numerically small) replicate effect. In fact, a separate replication in a different location (Regensburg instead of Berlin), new hardware and a different experimenter (Brembs instead of Colomb, manuscript in preparation, see data and project progress at https://github.com/brembslab/cs_buri ), suggests that the spatial parameters, in particular, are relatively constant between replicates, while the temporal activity parameters may vary to some degree. We take these observations as evidence that the differences between the sub-strains are stable over at least several years.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_39",
            "content": "The time elapsed between replicates also seems to suggest that epigenetic changes are rather unlikely. We thus tentatively conclude that the differences between the strains are genetic in origin and have hence begun to sequence the genomes of these five Canton S sub-strains, with marked alterations in all of them (manuscript in preparation, see data and project progress at https://github.com/brembslab/cs_buri ). However, epigenetic modification, as well as selection may play a much larger role when studying mutant or transgenic lines which have been outbred to, e.g. a Canton S genetic background. In these cases there may be more or less strong evolutionary forces driving genomic changes.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_40",
            "content": "From the twelve parameters of walking that we tested, stripe deviation showed the most striking variability. Stripe fixation likely depends on multiple parameters, such as the fly’s light/dark preference, their anxiety state, visual acuity, leg motor coordination or effects of wing clipping. It was used as a determining behavioral feature of Buridan’s paradigm <REF-10> . Our results call for special care with the genetic background of the tested strains when analyzing this behavioral feature.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_41",
            "content": "The numerically small but statistically significant difference between the two replicates (see raw data for individual variables) may be attributed to the differences in test setups and conditions. Since the behavior of the flies did not tend to converge (at least not over the one year time-frame we covered), the different strains apparently did not evolve particular traits to cope with our particular laboratory conditions. It is therefore plausible that such micro-evolution played little role in differentiating the sub-strains in the first place; the major cause for the difference between sub-strains might therefore be founder effects produced when a new fly stock is established, or population bottlenecks in the history of each strain. This hypothesis is also supported by the fact that common descent fails to explain the grouping we found in the PCA. In particular, two strains originating from the Paris lab (CS_TP and CS_JC) showed strikingly different locomotor behavior. This suggests that founder effects or bottlenecks were leading to dramatic alterations of behavior in Buridan’s paradigm. These results raise the question of which other phenotypes might be affected in the numerous CS sub-strains present in laboratories throughout the world.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_42",
            "content": "The results also raise the question, if every laboratory sub-strain is effectively different from any other strain, or if there are groups of sub-strains that remain genetically and behaviorally similar. To examine the degree to which different laboratory strains cluster around certain groups, we are soliciting Buridan data from other laboratories with Canton S strains. The results in Figure 4 will be updated, whenever new data is being uploaded, such that the degree of clustering between sub-strains can be observed. Further research will be required to test the hypothesis that most of the variance between sub-strains of wild type flies is due to genetic differences acquired by founder effects.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_43",
            "content": "Interestingly, the use of a control line may lead to inaccurate interpretation of the data. For example, crammer mutant flies were reported to either show <REF-11> or not show <REF-12> an appetitive short term memory deficit with identical memory retention scores, because the scores of the control “CS” flies were different in the two studies. Our results further emphasize the need for a more systematic scheme addressing control populations. Existing genetic background differences may indeed explain discrepancies between results obtained in different laboratories, and that the use of the “CS” as a control strain is not enough to achieve comparability or reproducibility. A homogenization of the genetic backgrounds of ‘standard’ control strains would indeed be required.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_44",
            "content": "Fortunately, our experiments suggest that the primary cause for differences in wild-type strains come from founder effects and not laboratory selection. One possible, but logistically challenging solution might be to have a common source for lines used for out-crossing events (including control lines), kept in massive, randomly interbreeding populations, for each lab to purchase at regular intervals. Large stock centers such as the Bloomington stock center would in principle be the candidate locations to implement such a solution. However, the phenotypes of mutations can vary depending on the genetic background within which the mutation is embedded <REF-13> – <REF-15> ). The choice of one or multiple reference wild-type strain(s) is therefore not without implications for the future of the field and should be carefully investigated.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_45",
            "content": "Data availability",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_46",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2015 Colomb J and Brembs B",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_47",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_48",
            "content": "figshare: Buridan raw data: Sub-strains of Drosophila Canton-S differ markedly in their locomotor behaviour, doi: 10.6084/m9.figshare.1014264 <REF-16>",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_49",
            "content": "Additional data can be downloaded from Figure 4 .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_50",
            "content": "<REF-1> Stern C Schaeffer EW : On primary attributes of alleles in Drosophila melanogaster . Proc Natl Acad Sci U S A. 1943 ; 29 ( 11 ): 351 – 61 . 16588625 10.1073/pnas.29.11.351 1078632",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_51",
            "content": "<REF-2> Benzer S : Behavioral mutants of Drosophila isolated by countercurrent distribution. Proc Natl Acad Sci U S A. 1967 ; 58 ( 3 ): 1112 – 9 . 16578662 10.1073/pnas.58.3.1112 335755",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_52",
            "content": "<REF-3> Crawley JN Belknap JK Collins A : Behavioral phenotypes of inbred mouse strains: implications and recommendations for molecular studies. Psychopharmacology (Berl). 1997 ; 132 ( 2 ): 107 – 24 . 9266608 10.1007/s002130050327",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_53",
            "content": "<REF-4> Paylor R Crawley JN : Inbred strain differences in prepulse inhibition of the mouse startle response. Psychopharmacology (Berl). 1997 ; 132 ( 2 ): 169 – 80 . 9266614 10.1007/s002130050333",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_54",
            "content": "<REF-5> Gems D Riddle DL : Defining wild-type life span in Caenorhabditis elegans . J Gerontol A Biol Sci Med Sci. 2000 ; 55 ( 5 ): B215 – 9 . 10819307 10.1093/gerona/55.5.B215",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_55",
            "content": "<REF-6> Buelthoff H Gotz KG Herre M : Recurrent inversion of visual orientation in the walking fly Drosophila melanogaster . Springer Berlin/Heidelberg. J Comp Physiol A. 1982 ; 148 ( 4 ): 471 – 81 . 10.1007/BF00619785",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_56",
            "content": "<REF-7> Colomb J Reiter L Blaszkiewicz J : Open source tracking and analysis of adult Drosophila locomotion in Buridan’s paradigm with and without visual targets. PLoS One. 2012 ; 7 ( 8 ): e42247 . 22912692 10.1371/journal.pone.0042247 3415391",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_57",
            "content": "<REF-8> Götz KG : Visual guidance in Drosophila . Basic Life Sci. 1980 ; 16 : 391 – 407 . 6779803 10.1007/978-1-4684-7968-3_28",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_58",
            "content": "<REF-9> Guo A Liu L Xia SZ : Conditioned visual flight orientation in Drosophila: dependence on age, practice and diet. Learn Mem. 1996 ; 3 ( 1 ): 49 – 59 . 10456076 10.1101/lm.3.1.49",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_59",
            "content": "<REF-10> Phillips AM Smart R Strauss R : The Drosophila black enigma: the molecular and behavioural characterization of the black 1 mutant allele. Gene. 2005 ; 351 : 131 – 42 . 15878647 10.1016/j.gene.2005.03.013",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_60",
            "content": "<REF-11> Colomb J Kaiser L Chabaud MA : Parametric and genetic analysis of Drosophila appetitive long-term memory and sugar motivation. Genes Brain Behav. 2009 ; 8 ( 4 ): 407 – 15 . 19220480 10.1111/j.1601-183X.2009.00482.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_61",
            "content": "<REF-12> Krashes MJ Waddell S : Rapid consolidation to a radish and protein synthesis-dependent long-term memory after single-session appetitive olfactory conditioning in Drosophila . J Neurosci. 2008 ; 28 ( 12 ): 3103 – 13 . 18354013 10.1523/JNEUROSCI.5333-07.2008 2516741",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_62",
            "content": "<REF-13> Ivanco TL Greenough WT : Altered mossy fiber distributions in adult Fmr1 (FVB) knockout mice. Hippocampus. 2002 ; 12 ( 1 ): 47 – 54 . 11918288 10.1002/hipo.10004",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_63",
            "content": "<REF-15> Lipp HP Wolfer DP : Genetic background problems in the analysis of cognitive and neuronal changes in genetically modified mice. Clin Neurosci Res. 2003 ; 3 ( 4–5 ): 223 – 31 . 10.1016/S1566-2772(03)00096-3",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "3-176_v2_64",
            "content": "<REF-16> Colomb J Brembs B : Buridan raw data: Sub-strains of Drosophila Canton-S differ markedly in their locomotor behavior. figshare. 2014 . Data Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "3-176_v2_0@0",
            "content": "Sub-strains of Drosophila Canton-S differ markedly in their locomotor behavior",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_0",
            "start": 0,
            "end": 77,
            "label": {}
        },
        {
            "ix": "3-176_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "3-176_v2_2@0",
            "content": "We collected five sub-strains of the standard laboratory wild-type Drosophila melanogaster Canton Special (CS) and analyzed their walking behavior in Buridan's paradigm using the CeTrAn software.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_2",
            "start": 0,
            "end": 194,
            "label": {}
        },
        {
            "ix": "3-176_v2_2@1",
            "content": "According to twelve different aspects of their behavior, the sub-strains fit into three groups.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_2",
            "start": 196,
            "end": 290,
            "label": {}
        },
        {
            "ix": "3-176_v2_2@2",
            "content": "The group separation appeared not to be correlated with the origin of the stocks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_2",
            "start": 292,
            "end": 372,
            "label": {}
        },
        {
            "ix": "3-176_v2_2@3",
            "content": "We conclude that founder effects but not laboratory selection likely influenced the gene pool of the sub-strains.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_2",
            "start": 374,
            "end": 486,
            "label": {}
        },
        {
            "ix": "3-176_v2_2@4",
            "content": "The flies’ stripe fixation was the parameter that varied most.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_2",
            "start": 488,
            "end": 549,
            "label": {}
        },
        {
            "ix": "3-176_v2_2@5",
            "content": "Our results suggest that differences in the genome of laboratory stocks can render comparisons between nominally identical wild-type stocks meaningless.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_2",
            "start": 551,
            "end": 702,
            "label": {}
        },
        {
            "ix": "3-176_v2_2@6",
            "content": "A single source for control strains may settle this problem.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_2",
            "start": 704,
            "end": 763,
            "label": {}
        },
        {
            "ix": "3-176_v2_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "3-176_v2_4@0",
            "content": "In our quest for understanding gene function, we commonly manipulate gene expression and compare the phenotypes of the manipulated versus control organisms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_4",
            "start": 0,
            "end": 155,
            "label": {}
        },
        {
            "ix": "3-176_v2_4@1",
            "content": "For technical reasons and to facilitate comparison as well as reproducibility between different experiments, a limited number of control strains have been established in most model organisms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_4",
            "start": 157,
            "end": 347,
            "label": {}
        },
        {
            "ix": "3-176_v2_4@2",
            "content": "For instance, the C57BL, 129 and FVB strains are commonly used in mouse studies; N2 is the common control strain used in Caenorhabditis elegans ; and Canton-Special (CS) is one of the most-used wild-type strains in Drosophila melanogaster genetics studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_4",
            "start": 349,
            "end": 604,
            "label": {}
        },
        {
            "ix": "3-176_v2_4@3",
            "content": "The CS stock was established by C. B. Bridges <REF-1> and chosen because of its low mutation rate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_4",
            "start": 606,
            "end": 703,
            "label": {}
        },
        {
            "ix": "3-176_v2_4@4",
            "content": "S. Benzer introduced CS to what was to become neurogenetics in his landmark study in 1967 <REF-2> , because of its strong fast-phototaxis response.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_4",
            "start": 705,
            "end": 851,
            "label": {}
        },
        {
            "ix": "3-176_v2_4@5",
            "content": "The strain has been used as a control in neurogenetics studies ever since.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_4",
            "start": 853,
            "end": 926,
            "label": {}
        },
        {
            "ix": "3-176_v2_5@0",
            "content": "With time and reproductive isolation, populations of laboratory control strains can diverge, in spite of ideal breeding conditions and seemingly little selective pressure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_5",
            "start": 0,
            "end": 170,
            "label": {}
        },
        {
            "ix": "3-176_v2_5@1",
            "content": "Several studies comparing the behavior of sub-strains of mice showed that their behavior differs <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_5",
            "start": 172,
            "end": 277,
            "label": {}
        },
        {
            "ix": "3-176_v2_5@2",
            "content": "For instance, Paylor and colleagues measured that one sub-strain of C57 mice showed a higher startle amplitude after tactile stimulation than another <REF-4> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_5",
            "start": 279,
            "end": 437,
            "label": {}
        },
        {
            "ix": "3-176_v2_5@3",
            "content": "Similarly, the behavior of different N2 C. elegans sub-strains was found to vary to a considerable extent <REF-5> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_5",
            "start": 439,
            "end": 553,
            "label": {}
        },
        {
            "ix": "3-176_v2_6@0",
            "content": "In this study, we tested five different CS Drosophila melanogaster sub-strains in Buridan’s paradigm <REF-6> – <REF-8> ), where flies walk between two stripes on a platform surrounded by a water moat.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_6",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "3-176_v2_6@1",
            "content": "We could separate the CS sub-strains into three groups according to their behavior during the experiment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_6",
            "start": 201,
            "end": 305,
            "label": {}
        },
        {
            "ix": "3-176_v2_6@2",
            "content": "In addition, we found that the between-strain variability in the stripe fixation score is particularly high.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_6",
            "start": 307,
            "end": 414,
            "label": {}
        },
        {
            "ix": "3-176_v2_6@3",
            "content": "We discuss possible solutions to prevent sub-strain related problems.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_6",
            "start": 416,
            "end": 484,
            "label": {}
        },
        {
            "ix": "3-176_v2_7@0",
            "content": "Materials and methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_7",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "3-176_v2_8@0",
            "content": "Fly care",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_8",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "3-176_v2_9@0",
            "content": "Flies were kept in vials (68 ml, Art.-Nr. 217101, Greiner Bio-One GmbH, Maybachstr.2, 72636 Frickenhausen) in a controlled density on standard cornmeal/molasses medium <REF-9> at 25°C in a 12 h:12 h dark/light cycle for one generation before being tested.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_9",
            "start": 0,
            "end": 254,
            "label": {}
        },
        {
            "ix": "3-176_v2_9@1",
            "content": "Flies were collected 0–1 day after hatching and put in new food vials for one day.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_9",
            "start": 256,
            "end": 337,
            "label": {}
        },
        {
            "ix": "3-176_v2_9@2",
            "content": "Approximately ten female flies (N=11–12 in each group) were then CO 2 -anaesthetized and their wings were cut with surgical scissors at two thirds of their length, before being taken back to their vial to recover overnight.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_9",
            "start": 339,
            "end": 561,
            "label": {}
        },
        {
            "ix": "3-176_v2_9@3",
            "content": "They were then captured individually using a fly aspirator and put in the experimental setup to be tested.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_9",
            "start": 563,
            "end": 668,
            "label": {}
        },
        {
            "ix": "3-176_v2_10@0",
            "content": "Fly strains",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_10",
            "start": 0,
            "end": 10,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@0",
            "content": "Five sub-strains of CS wild-type Drosophila melanogaster were collected in the lab from 2008 to 2011.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 0,
            "end": 100,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@1",
            "content": "Troy Zars took his CS_TZ stock to Columbia, MO, USA in 2002 when leaving Martin Heisenberg’s lab in Würzburg, Germany.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 102,
            "end": 219,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@2",
            "content": "It arrived in our laboratory in Berlin in 2008.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 221,
            "end": 267,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@3",
            "content": "The CS_TP stock was separated from Tim Tully’s strain in Waltham, MA, USA in 1992 and moved to Paris, France.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 269,
            "end": 377,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@4",
            "content": "The CS_JC stock was derived from the CS_TP stock in 2007 when one of the authors (JC) was in Thomas Préat’s lab.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 379,
            "end": 490,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@5",
            "content": "Both strains (TP and JC) arrived in Berlin in 2009.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 492,
            "end": 542,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@6",
            "content": "The CS_BS stock was separated by Bruno van Swinderen from Ralf Greenspan’s stock in San Diego, CA, USA in 1999 and brought to Brisbane, Australia.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 544,
            "end": 689,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@7",
            "content": "From there it arrived in Berlin in 2008.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 691,
            "end": 730,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@8",
            "content": "Finally, Henrike Scholz received her stock from Ulrike Heberlein in San Francisco, CA, USA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 732,
            "end": 822,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@9",
            "content": "The CS_HS strain arrived in Berlin in 2007.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 824,
            "end": 866,
            "label": {}
        },
        {
            "ix": "3-176_v2_11@10",
            "content": "Flies of all strains were kept at 18°C until being tested in 2012 and 2013.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_11",
            "start": 868,
            "end": 942,
            "label": {}
        },
        {
            "ix": "3-176_v2_12@0",
            "content": "Buridan’s paradigm",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_12",
            "start": 0,
            "end": 17,
            "label": {}
        },
        {
            "ix": "3-176_v2_13@0",
            "content": "Experimental details are described in detail elsewhere <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_13",
            "start": 0,
            "end": 63,
            "label": {}
        },
        {
            "ix": "3-176_v2_13@1",
            "content": "Briefly, two black stripes producing 11° wide landmarks were positioned 293 mm from the center of a platform with a diameter of 117 mm, surrounded by water and illuminated with bright white light from behind.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_13",
            "start": 65,
            "end": 272,
            "label": {}
        },
        {
            "ix": "3-176_v2_13@2",
            "content": "The centroid position of the fly was recorded via custom software (BuriTrack, http://buridan.sourceforge.net ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_13",
            "start": 274,
            "end": 384,
            "label": {}
        },
        {
            "ix": "3-176_v2_13@3",
            "content": "If flies jumped from the platform, they were taken back to the platform with a brush and the tracker was reinitialized.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_13",
            "start": 386,
            "end": 504,
            "label": {}
        },
        {
            "ix": "3-176_v2_13@4",
            "content": "Each data file represents five minutes of uninterrupted walking.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_13",
            "start": 506,
            "end": 569,
            "label": {}
        },
        {
            "ix": "3-176_v2_13@5",
            "content": "We measured two replicates of the same five sub-strains in consecutive years, 2012 and 2013.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_13",
            "start": 571,
            "end": 662,
            "label": {}
        },
        {
            "ix": "3-176_v2_14@0",
            "content": "For more than three decades, experiments in Buridan’s paradigm demonstrated that wild-type flies typically walk back and forth between the landmarks.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_14",
            "start": 0,
            "end": 148,
            "label": {}
        },
        {
            "ix": "3-176_v2_14@1",
            "content": "We performed 5 minute long walking experiments with five different wild type Canton S (CS) sub-strains: CS_TP, CS_TZ, CS_JC, CS_BS and CS_HS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_14",
            "start": 150,
            "end": 290,
            "label": {}
        },
        {
            "ix": "3-176_v2_14@2",
            "content": "The locomotion parameters we calculated can be divided into three broad categories: temporal (activity/pause structure), spatial (stripe fixation, thigmotaxis, trajectory straightness) and mixed (speed, number of walks between stripes, distance travelled) measures (ref. <REF-7> , Table 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_14",
            "start": 292,
            "end": 582,
            "label": {}
        },
        {
            "ix": "3-176_v2_15@0",
            "content": "Table 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_15",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "3-176_v2_17@0",
            "content": "Experimental differences between the replicates",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_17",
            "start": 0,
            "end": 46,
            "label": {}
        },
        {
            "ix": "3-176_v2_18@0",
            "content": "The experiments in 2012 were done according to the previously published setup <REF-7> , while the 2013 experiments were performed in four new setups.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_18",
            "start": 0,
            "end": 148,
            "label": {}
        },
        {
            "ix": "3-176_v2_18@1",
            "content": "In the new setups, illumination is slightly brighter (10–11 klx in the new setup, 7.5–8.5 klx in the old setup).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_18",
            "start": 150,
            "end": 261,
            "label": {}
        },
        {
            "ix": "3-176_v2_18@2",
            "content": "We did not detect any difference in the temperature on the platforms (27°C for all machines).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_18",
            "start": 263,
            "end": 355,
            "label": {}
        },
        {
            "ix": "3-176_v2_18@3",
            "content": "The platform was cleaned between flies in the 2012 replicate, while the platform was rotated between two tests in the 2013 replicate, and cleaned only after a series of five flies had been tested.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_18",
            "start": 357,
            "end": 552,
            "label": {}
        },
        {
            "ix": "3-176_v2_19@0",
            "content": "Analysis",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_19",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "3-176_v2_20@0",
            "content": "The data was analyzed using CeTrAn v.4 ( https://github.com/jcolomb/CeTrAn/releases/tag/v.4 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_20",
            "start": 0,
            "end": 93,
            "label": {}
        },
        {
            "ix": "3-176_v2_20@1",
            "content": "Data with a mean distance travelled smaller than 50 mm/min was excluded to avoid outliers (2 data points were excluded in the second replicate, one for CS_JC and one for CS_HS).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_20",
            "start": 95,
            "end": 271,
            "label": {}
        },
        {
            "ix": "3-176_v2_21@0",
            "content": "Twelve different parameters were calculated ( Table 1 ) and a Principal Components Analysis (PCA) was performed to visualize the results and identify potential groupings of the sub-strains.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_21",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "3-176_v2_21@1",
            "content": "The effects of genotype and replicate were analyzed with an ANOVA (in R) using the second principal component, since the first and the third components were not normally distributed (assessed with a Shapiro test).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_21",
            "start": 190,
            "end": 402,
            "label": {}
        },
        {
            "ix": "3-176_v2_21@2",
            "content": "Transition plots and the stripe deviation plot have not been tested statistically.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_21",
            "start": 404,
            "end": 485,
            "label": {}
        },
        {
            "ix": "3-176_v2_22@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_22",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "3-176_v2_23@0",
            "content": "Raw trajectory data (including outliers), the results of the CeTrAn analysis and the PCA result table are available on figshare: http://dx.doi.org/10.6084/m9.figshare.1014264 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_23",
            "start": 0,
            "end": 175,
            "label": {}
        },
        {
            "ix": "3-176_v2_24@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_24",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "3-176_v2_25@0",
            "content": "In Buridan’s paradigm, wild-type flies typically walk back and forth between two inaccessible landmarks and their walking behavior is then analyzed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_25",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "3-176_v2_25@1",
            "content": "We performed 5 minutes long walking experiments with five different Canton S (CS) sub-strains: CS_TP, CS_TZ, CS_JC, CS_BS and CS_HS.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_25",
            "start": 149,
            "end": 280,
            "label": {}
        },
        {
            "ix": "3-176_v2_25@2",
            "content": "We tested them in two replicates in two consecutive years using different hardware and under slightly varying experimental details (see Materials and Methods).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_25",
            "start": 282,
            "end": 440,
            "label": {}
        },
        {
            "ix": "3-176_v2_25@3",
            "content": "The locomotion parameters that we calculated can be divided into three broad categories: temporal (activity/pause structure), spatial (stripe fixation, thigmotaxis, trajectory straightness) and mixed (speed, number of walks between stripes, distance travelled) measures (ref. <REF-7> , Table 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_25",
            "start": 442,
            "end": 737,
            "label": {}
        },
        {
            "ix": "3-176_v2_25@4",
            "content": "Flies’ walking behavior was also visualized in transition plots, where the frequency of passage at each platform position is indicated by a heatmap.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_25",
            "start": 739,
            "end": 886,
            "label": {}
        },
        {
            "ix": "3-176_v2_25@5",
            "content": "A distinction between sub-strains, which is consistent between the two replicates, can be seen in the visualization of this purely spatial parameter ( Figure 1 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_25",
            "start": 888,
            "end": 1049,
            "label": {}
        },
        {
            "ix": "3-176_v2_26@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_26",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-176_v2_28@0",
            "content": "Using CeTrAn 4.0, we took twelve measurements of the flies’ walking behavior and analyzed them using PCA (for individual performance of each strain in each measurement, see supplementary materials ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_28",
            "start": 0,
            "end": 198,
            "label": {}
        },
        {
            "ix": "3-176_v2_28@1",
            "content": "For simplicity of representation, we plotted the mean and standard error of the three first principal components, while pooling the replicates ( Figure 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_28",
            "start": 200,
            "end": 355,
            "label": {}
        },
        {
            "ix": "3-176_v2_28@2",
            "content": "Since the first and third principal components were not normally distributed (Shapiro test), we performed an ANOVA for the second component with the fly sub-strains and the replicates as factors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_28",
            "start": 357,
            "end": 551,
            "label": {}
        },
        {
            "ix": "3-176_v2_28@3",
            "content": "This analysis demonstrated significant main effects of the sub-strain (F = 28.305, p<2e-16) and the replicate (F = 9.35, p<0.003), while there seems to be no sub-strain × replicate interaction (F value = 2.337, p = 0.059).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_28",
            "start": 553,
            "end": 774,
            "label": {}
        },
        {
            "ix": "3-176_v2_28@4",
            "content": "A Tukey HSD post hoc test of the sub-strain effect confirmed the visual impression of the PCA grouping: CS_TZ and CS_TP together in one group, CS_BS and CS_HS together and CS_JC alone.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_28",
            "start": 776,
            "end": 959,
            "label": {}
        },
        {
            "ix": "3-176_v2_29@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_29",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-176_v2_31@0",
            "content": "Strikingly, the stripe fixation behavior covered the full range from strong fixation (10° average deviation from the stripe) to almost no fixation at all (30°: a random walk generates a 44° score, <REF-7> ) ( Figure 3 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_31",
            "start": 0,
            "end": 219,
            "label": {}
        },
        {
            "ix": "3-176_v2_31@1",
            "content": "We did not perform any statistical tests on this data, as they are already included in the PCA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_31",
            "start": 221,
            "end": 315,
            "label": {}
        },
        {
            "ix": "3-176_v2_32@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_32",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-176_v2_34@0",
            "content": "In order to estimate the variability range of the CS behavior on a larger scale, we have set up a trajectory database to receive data from CS flies in different laboratories, using similar machines and protocols.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_34",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "3-176_v2_34@1",
            "content": "In Figure 4 , we have visualized the result of a PCA over both our and submitted data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_34",
            "start": 213,
            "end": 298,
            "label": {}
        },
        {
            "ix": "3-176_v2_34@2",
            "content": "Additional data will constantly be added to the analysis after the publication of this article; the interactivity of this figure will allow readers to visualize the data at different points in time.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_34",
            "start": 300,
            "end": 497,
            "label": {}
        },
        {
            "ix": "3-176_v2_35@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_35",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "3-176_v2_37@0",
            "content": "Discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_37",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "3-176_v2_38@0",
            "content": "By analyzing the trajectories of five nominally identical CS sub-strains of Drosophila melanogaster in Buridan’s paradigm, we were able to distinguish three different groups of sub-strains.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_38",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "3-176_v2_38@1",
            "content": "In principle, the differences between the strains could be explained by genetic, epigenetic or environmental differences, or a combination of these factors.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_38",
            "start": 190,
            "end": 345,
            "label": {}
        },
        {
            "ix": "3-176_v2_38@2",
            "content": "All strains were treated similarly in the same laboratory conditions for many generations (4 to 6 years) before being tested.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_38",
            "start": 347,
            "end": 471,
            "label": {}
        },
        {
            "ix": "3-176_v2_38@3",
            "content": "There was no difference in rearing or experimental conditions between the different groups of flies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_38",
            "start": 473,
            "end": 572,
            "label": {}
        },
        {
            "ix": "3-176_v2_38@4",
            "content": "Taking into account these circumstances, it is a straightforward assumption that the differences in behavior we report here are either genetic or epigenetic in origin.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_38",
            "start": 574,
            "end": 740,
            "label": {}
        },
        {
            "ix": "3-176_v2_38@5",
            "content": "Taking all the measured parameters into account, sub-strain differences were comparable in the two replicates conducted one year apart, even though one of the Principal Components showed a statistically significant (but numerically small) replicate effect.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_38",
            "start": 742,
            "end": 997,
            "label": {}
        },
        {
            "ix": "3-176_v2_38@6",
            "content": "In fact, a separate replication in a different location (Regensburg instead of Berlin), new hardware and a different experimenter (Brembs instead of Colomb, manuscript in preparation, see data and project progress at https://github.com/brembslab/cs_buri ), suggests that the spatial parameters, in particular, are relatively constant between replicates, while the temporal activity parameters may vary to some degree.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_38",
            "start": 999,
            "end": 1415,
            "label": {}
        },
        {
            "ix": "3-176_v2_38@7",
            "content": "We take these observations as evidence that the differences between the sub-strains are stable over at least several years.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_38",
            "start": 1417,
            "end": 1539,
            "label": {}
        },
        {
            "ix": "3-176_v2_39@0",
            "content": "The time elapsed between replicates also seems to suggest that epigenetic changes are rather unlikely.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_39",
            "start": 0,
            "end": 101,
            "label": {}
        },
        {
            "ix": "3-176_v2_39@1",
            "content": "We thus tentatively conclude that the differences between the strains are genetic in origin and have hence begun to sequence the genomes of these five Canton S sub-strains, with marked alterations in all of them (manuscript in preparation, see data and project progress at https://github.com/brembslab/cs_buri ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_39",
            "start": 103,
            "end": 414,
            "label": {}
        },
        {
            "ix": "3-176_v2_39@2",
            "content": "However, epigenetic modification, as well as selection may play a much larger role when studying mutant or transgenic lines which have been outbred to, e.g. a Canton S genetic background.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_39",
            "start": 416,
            "end": 602,
            "label": {}
        },
        {
            "ix": "3-176_v2_39@3",
            "content": "In these cases there may be more or less strong evolutionary forces driving genomic changes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_39",
            "start": 604,
            "end": 695,
            "label": {}
        },
        {
            "ix": "3-176_v2_40@0",
            "content": "From the twelve parameters of walking that we tested, stripe deviation showed the most striking variability.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_40",
            "start": 0,
            "end": 107,
            "label": {}
        },
        {
            "ix": "3-176_v2_40@1",
            "content": "Stripe fixation likely depends on multiple parameters, such as the fly’s light/dark preference, their anxiety state, visual acuity, leg motor coordination or effects of wing clipping.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_40",
            "start": 109,
            "end": 291,
            "label": {}
        },
        {
            "ix": "3-176_v2_40@2",
            "content": "It was used as a determining behavioral feature of Buridan’s paradigm <REF-10> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_40",
            "start": 293,
            "end": 372,
            "label": {}
        },
        {
            "ix": "3-176_v2_40@3",
            "content": "Our results call for special care with the genetic background of the tested strains when analyzing this behavioral feature.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_40",
            "start": 374,
            "end": 496,
            "label": {}
        },
        {
            "ix": "3-176_v2_41@0",
            "content": "The numerically small but statistically significant difference between the two replicates (see raw data for individual variables) may be attributed to the differences in test setups and conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_41",
            "start": 0,
            "end": 196,
            "label": {}
        },
        {
            "ix": "3-176_v2_41@1",
            "content": "Since the behavior of the flies did not tend to converge (at least not over the one year time-frame we covered), the different strains apparently did not evolve particular traits to cope with our particular laboratory conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_41",
            "start": 198,
            "end": 426,
            "label": {}
        },
        {
            "ix": "3-176_v2_41@2",
            "content": "It is therefore plausible that such micro-evolution played little role in differentiating the sub-strains in the first place; the major cause for the difference between sub-strains might therefore be founder effects produced when a new fly stock is established, or population bottlenecks in the history of each strain.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_41",
            "start": 428,
            "end": 745,
            "label": {}
        },
        {
            "ix": "3-176_v2_41@3",
            "content": "This hypothesis is also supported by the fact that common descent fails to explain the grouping we found in the PCA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_41",
            "start": 747,
            "end": 862,
            "label": {}
        },
        {
            "ix": "3-176_v2_41@4",
            "content": "In particular, two strains originating from the Paris lab (CS_TP and CS_JC) showed strikingly different locomotor behavior.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_41",
            "start": 864,
            "end": 986,
            "label": {}
        },
        {
            "ix": "3-176_v2_41@5",
            "content": "This suggests that founder effects or bottlenecks were leading to dramatic alterations of behavior in Buridan’s paradigm.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_41",
            "start": 988,
            "end": 1108,
            "label": {}
        },
        {
            "ix": "3-176_v2_41@6",
            "content": "These results raise the question of which other phenotypes might be affected in the numerous CS sub-strains present in laboratories throughout the world.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_41",
            "start": 1110,
            "end": 1262,
            "label": {}
        },
        {
            "ix": "3-176_v2_42@0",
            "content": "The results also raise the question, if every laboratory sub-strain is effectively different from any other strain, or if there are groups of sub-strains that remain genetically and behaviorally similar.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_42",
            "start": 0,
            "end": 202,
            "label": {}
        },
        {
            "ix": "3-176_v2_42@1",
            "content": "To examine the degree to which different laboratory strains cluster around certain groups, we are soliciting Buridan data from other laboratories with Canton S strains.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_42",
            "start": 204,
            "end": 371,
            "label": {}
        },
        {
            "ix": "3-176_v2_42@2",
            "content": "The results in Figure 4 will be updated, whenever new data is being uploaded, such that the degree of clustering between sub-strains can be observed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_42",
            "start": 373,
            "end": 521,
            "label": {}
        },
        {
            "ix": "3-176_v2_42@3",
            "content": "Further research will be required to test the hypothesis that most of the variance between sub-strains of wild type flies is due to genetic differences acquired by founder effects.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_42",
            "start": 523,
            "end": 702,
            "label": {}
        },
        {
            "ix": "3-176_v2_43@0",
            "content": "Interestingly, the use of a control line may lead to inaccurate interpretation of the data.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_43",
            "start": 0,
            "end": 90,
            "label": {}
        },
        {
            "ix": "3-176_v2_43@1",
            "content": "For example, crammer mutant flies were reported to either show <REF-11> or not show <REF-12> an appetitive short term memory deficit with identical memory retention scores, because the scores of the control “CS” flies were different in the two studies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_43",
            "start": 92,
            "end": 343,
            "label": {}
        },
        {
            "ix": "3-176_v2_43@2",
            "content": "Our results further emphasize the need for a more systematic scheme addressing control populations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_43",
            "start": 345,
            "end": 443,
            "label": {}
        },
        {
            "ix": "3-176_v2_43@3",
            "content": "Existing genetic background differences may indeed explain discrepancies between results obtained in different laboratories, and that the use of the “CS” as a control strain is not enough to achieve comparability or reproducibility.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_43",
            "start": 445,
            "end": 676,
            "label": {}
        },
        {
            "ix": "3-176_v2_43@4",
            "content": "A homogenization of the genetic backgrounds of ‘standard’ control strains would indeed be required.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_43",
            "start": 678,
            "end": 776,
            "label": {}
        },
        {
            "ix": "3-176_v2_44@0",
            "content": "Fortunately, our experiments suggest that the primary cause for differences in wild-type strains come from founder effects and not laboratory selection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_44",
            "start": 0,
            "end": 151,
            "label": {}
        },
        {
            "ix": "3-176_v2_44@1",
            "content": "One possible, but logistically challenging solution might be to have a common source for lines used for out-crossing events (including control lines), kept in massive, randomly interbreeding populations, for each lab to purchase at regular intervals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_44",
            "start": 153,
            "end": 402,
            "label": {}
        },
        {
            "ix": "3-176_v2_44@2",
            "content": "Large stock centers such as the Bloomington stock center would in principle be the candidate locations to implement such a solution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_44",
            "start": 404,
            "end": 535,
            "label": {}
        },
        {
            "ix": "3-176_v2_44@3",
            "content": "However, the phenotypes of mutations can vary depending on the genetic background within which the mutation is embedded <REF-13> – <REF-15> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_44",
            "start": 537,
            "end": 678,
            "label": {}
        },
        {
            "ix": "3-176_v2_44@4",
            "content": "The choice of one or multiple reference wild-type strain(s) is therefore not without implications for the future of the field and should be carefully investigated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_44",
            "start": 680,
            "end": 842,
            "label": {}
        },
        {
            "ix": "3-176_v2_45@0",
            "content": "Data availability",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_45",
            "start": 0,
            "end": 16,
            "label": {}
        },
        {
            "ix": "3-176_v2_46@0",
            "content": "The data referenced by this article are under copyright with the following copyright statement: Copyright: ï¿½ 2015 Colomb J and Brembs B",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_46",
            "start": 0,
            "end": 136,
            "label": {}
        },
        {
            "ix": "3-176_v2_47@0",
            "content": "Data associated with the article are available under the terms of the Creative Commons Zero \"No rights reserved\" data waiver (CC0 1.0 Public domain dedication).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_47",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "3-176_v2_48@0",
            "content": "figshare: Buridan raw data: Sub-strains of Drosophila Canton-S differ markedly in their locomotor behaviour, doi: 10.6084/m9.figshare.1014264 <REF-16>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_48",
            "start": 0,
            "end": 149,
            "label": {}
        },
        {
            "ix": "3-176_v2_49@0",
            "content": "Additional data can be downloaded from Figure 4 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_49",
            "start": 0,
            "end": 48,
            "label": {}
        },
        {
            "ix": "3-176_v2_50@0",
            "content": "<REF-1> Stern C Schaeffer EW : On primary attributes of alleles in Drosophila melanogaster . Proc Natl Acad Sci U S A. 1943 ; 29 ( 11 ): 351 – 61 . 16588625 10.1073/pnas.29.11.351 1078632",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_50",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "3-176_v2_51@0",
            "content": "<REF-2> Benzer S : Behavioral mutants of Drosophila isolated by countercurrent distribution. Proc Natl Acad Sci U S A. 1967 ; 58 ( 3 ): 1112 – 9 . 16578662 10.1073/pnas.58.3.1112 335755",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_51",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "3-176_v2_52@0",
            "content": "<REF-3> Crawley JN Belknap JK Collins A : Behavioral phenotypes of inbred mouse strains: implications and recommendations for molecular studies. Psychopharmacology (Berl). 1997 ; 132 ( 2 ): 107 – 24 . 9266608 10.1007/s002130050327",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_52",
            "start": 0,
            "end": 229,
            "label": {}
        },
        {
            "ix": "3-176_v2_53@0",
            "content": "<REF-4> Paylor R Crawley JN : Inbred strain differences in prepulse inhibition of the mouse startle response. Psychopharmacology (Berl). 1997 ; 132 ( 2 ): 169 – 80 . 9266614 10.1007/s002130050333",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_53",
            "start": 0,
            "end": 194,
            "label": {}
        },
        {
            "ix": "3-176_v2_54@0",
            "content": "<REF-5> Gems D Riddle DL : Defining wild-type life span in Caenorhabditis elegans . J Gerontol A Biol Sci Med Sci. 2000 ; 55 ( 5 ): B215 – 9 . 10819307 10.1093/gerona/55.5.B215",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_54",
            "start": 0,
            "end": 175,
            "label": {}
        },
        {
            "ix": "3-176_v2_55@0",
            "content": "<REF-6> Buelthoff H Gotz KG Herre M : Recurrent inversion of visual orientation in the walking fly Drosophila melanogaster . Springer Berlin/Heidelberg. J Comp Physiol A. 1982 ; 148 ( 4 ): 471 – 81 . 10.1007/BF00619785",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_55",
            "start": 0,
            "end": 217,
            "label": {}
        },
        {
            "ix": "3-176_v2_56@0",
            "content": "<REF-7> Colomb J Reiter L Blaszkiewicz J : Open source tracking and analysis of adult Drosophila locomotion in Buridan’s paradigm with and without visual targets. PLoS One. 2012 ; 7 ( 8 ): e42247 . 22912692 10.1371/journal.pone.0042247 3415391",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_56",
            "start": 0,
            "end": 242,
            "label": {}
        },
        {
            "ix": "3-176_v2_57@0",
            "content": "<REF-8> Götz KG : Visual guidance in Drosophila . Basic Life Sci. 1980 ; 16 : 391 – 407 . 6779803 10.1007/978-1-4684-7968-3_28",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_57",
            "start": 0,
            "end": 125,
            "label": {}
        },
        {
            "ix": "3-176_v2_58@0",
            "content": "<REF-9> Guo A Liu L Xia SZ : Conditioned visual flight orientation in Drosophila: dependence on age, practice and diet. Learn Mem. 1996 ; 3 ( 1 ): 49 – 59 . 10456076 10.1101/lm.3.1.49",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_58",
            "start": 0,
            "end": 182,
            "label": {}
        },
        {
            "ix": "3-176_v2_59@0",
            "content": "<REF-10> Phillips AM Smart R Strauss R : The Drosophila black enigma: the molecular and behavioural characterization of the black 1 mutant allele. Gene. 2005 ; 351 : 131 – 42 . 15878647 10.1016/j.gene.2005.03.013",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_59",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "3-176_v2_60@0",
            "content": "<REF-11> Colomb J Kaiser L Chabaud MA : Parametric and genetic analysis of Drosophila appetitive long-term memory and sugar motivation. Genes Brain Behav. 2009 ; 8 ( 4 ): 407 – 15 . 19220480 10.1111/j.1601-183X.2009.00482.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_60",
            "start": 0,
            "end": 222,
            "label": {}
        },
        {
            "ix": "3-176_v2_61@0",
            "content": "<REF-12> Krashes MJ Waddell S : Rapid consolidation to a radish and protein synthesis-dependent long-term memory after single-session appetitive olfactory conditioning in Drosophila . J Neurosci. 2008 ; 28 ( 12 ): 3103 – 13 . 18354013 10.1523/JNEUROSCI.5333-07.2008 2516741",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_61",
            "start": 0,
            "end": 272,
            "label": {}
        },
        {
            "ix": "3-176_v2_62@0",
            "content": "<REF-13> Ivanco TL Greenough WT : Altered mossy fiber distributions in adult Fmr1 (FVB) knockout mice. Hippocampus. 2002 ; 12 ( 1 ): 47 – 54 . 11918288 10.1002/hipo.10004",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_62",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "3-176_v2_63@0",
            "content": "<REF-15> Lipp HP Wolfer DP : Genetic background problems in the analysis of cognitive and neuronal changes in genetically modified mice. Clin Neurosci Res. 2003 ; 3 ( 4–5 ): 223 – 31 . 10.1016/S1566-2772(03)00096-3",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_63",
            "start": 0,
            "end": 213,
            "label": {}
        },
        {
            "ix": "3-176_v2_64@0",
            "content": "<REF-16> Colomb J Brembs B : Buridan raw data: Sub-strains of Drosophila Canton-S differ markedly in their locomotor behavior. figshare. 2014 . Data Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "3-176_v2_64",
            "start": 0,
            "end": 154,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "3-176_v2_0",
            "tgt_ix": "3-176_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_1",
            "tgt_ix": "3-176_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_0",
            "tgt_ix": "3-176_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_3",
            "tgt_ix": "3-176_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_3",
            "tgt_ix": "3-176_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_3",
            "tgt_ix": "3-176_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_0",
            "tgt_ix": "3-176_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_7",
            "tgt_ix": "3-176_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_8",
            "tgt_ix": "3-176_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_7",
            "tgt_ix": "3-176_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_10",
            "tgt_ix": "3-176_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_7",
            "tgt_ix": "3-176_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_12",
            "tgt_ix": "3-176_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_12",
            "tgt_ix": "3-176_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_12",
            "tgt_ix": "3-176_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_15",
            "tgt_ix": "3-176_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_7",
            "tgt_ix": "3-176_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_17",
            "tgt_ix": "3-176_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_7",
            "tgt_ix": "3-176_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_19",
            "tgt_ix": "3-176_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_19",
            "tgt_ix": "3-176_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_7",
            "tgt_ix": "3-176_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_22",
            "tgt_ix": "3-176_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_0",
            "tgt_ix": "3-176_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_24",
            "tgt_ix": "3-176_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_24",
            "tgt_ix": "3-176_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_26",
            "tgt_ix": "3-176_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_24",
            "tgt_ix": "3-176_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_24",
            "tgt_ix": "3-176_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_29",
            "tgt_ix": "3-176_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_24",
            "tgt_ix": "3-176_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_24",
            "tgt_ix": "3-176_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_32",
            "tgt_ix": "3-176_v2_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_24",
            "tgt_ix": "3-176_v2_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_24",
            "tgt_ix": "3-176_v2_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_35",
            "tgt_ix": "3-176_v2_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_0",
            "tgt_ix": "3-176_v2_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_37",
            "tgt_ix": "3-176_v2_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_37",
            "tgt_ix": "3-176_v2_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_37",
            "tgt_ix": "3-176_v2_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_37",
            "tgt_ix": "3-176_v2_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_37",
            "tgt_ix": "3-176_v2_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_37",
            "tgt_ix": "3-176_v2_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_37",
            "tgt_ix": "3-176_v2_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_0",
            "tgt_ix": "3-176_v2_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_45",
            "tgt_ix": "3-176_v2_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_45",
            "tgt_ix": "3-176_v2_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_45",
            "tgt_ix": "3-176_v2_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_45",
            "tgt_ix": "3-176_v2_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_0",
            "tgt_ix": "3-176_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_1",
            "tgt_ix": "3-176_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_2",
            "tgt_ix": "3-176_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_3",
            "tgt_ix": "3-176_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_4",
            "tgt_ix": "3-176_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_5",
            "tgt_ix": "3-176_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_6",
            "tgt_ix": "3-176_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_7",
            "tgt_ix": "3-176_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_8",
            "tgt_ix": "3-176_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_9",
            "tgt_ix": "3-176_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_10",
            "tgt_ix": "3-176_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_12",
            "tgt_ix": "3-176_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_13",
            "tgt_ix": "3-176_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_14",
            "tgt_ix": "3-176_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_15",
            "tgt_ix": "3-176_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_16",
            "tgt_ix": "3-176_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_17",
            "tgt_ix": "3-176_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_18",
            "tgt_ix": "3-176_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_19",
            "tgt_ix": "3-176_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_20",
            "tgt_ix": "3-176_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_21",
            "tgt_ix": "3-176_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_22",
            "tgt_ix": "3-176_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_23",
            "tgt_ix": "3-176_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_24",
            "tgt_ix": "3-176_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_25",
            "tgt_ix": "3-176_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_26",
            "tgt_ix": "3-176_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_27",
            "tgt_ix": "3-176_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_28",
            "tgt_ix": "3-176_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_29",
            "tgt_ix": "3-176_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_30",
            "tgt_ix": "3-176_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_31",
            "tgt_ix": "3-176_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_32",
            "tgt_ix": "3-176_v2_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_33",
            "tgt_ix": "3-176_v2_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_34",
            "tgt_ix": "3-176_v2_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_35",
            "tgt_ix": "3-176_v2_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_36",
            "tgt_ix": "3-176_v2_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_37",
            "tgt_ix": "3-176_v2_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_38",
            "tgt_ix": "3-176_v2_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_39",
            "tgt_ix": "3-176_v2_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_40",
            "tgt_ix": "3-176_v2_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_41",
            "tgt_ix": "3-176_v2_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_42",
            "tgt_ix": "3-176_v2_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_43",
            "tgt_ix": "3-176_v2_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_44",
            "tgt_ix": "3-176_v2_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_45",
            "tgt_ix": "3-176_v2_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_46",
            "tgt_ix": "3-176_v2_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_47",
            "tgt_ix": "3-176_v2_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_48",
            "tgt_ix": "3-176_v2_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_4",
            "tgt_ix": "3-176_v2_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_4",
            "tgt_ix": "3-176_v2_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_5",
            "tgt_ix": "3-176_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_5",
            "tgt_ix": "3-176_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_5",
            "tgt_ix": "3-176_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_6",
            "tgt_ix": "3-176_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_13",
            "tgt_ix": "3-176_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_6",
            "tgt_ix": "3-176_v2_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_9",
            "tgt_ix": "3-176_v2_58",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_40",
            "tgt_ix": "3-176_v2_59",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_43",
            "tgt_ix": "3-176_v2_60",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_43",
            "tgt_ix": "3-176_v2_61",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_44",
            "tgt_ix": "3-176_v2_62",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_44",
            "tgt_ix": "3-176_v2_63",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_48",
            "tgt_ix": "3-176_v2_64",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_14",
            "tgt_ix": "3-176_v2_16",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_25",
            "tgt_ix": "3-176_v2_27",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_28",
            "tgt_ix": "3-176_v2_30",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_31",
            "tgt_ix": "3-176_v2_33",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_34",
            "tgt_ix": "3-176_v2_36",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "3-176_v2_0",
            "tgt_ix": "3-176_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_1",
            "tgt_ix": "3-176_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_2",
            "tgt_ix": "3-176_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_2",
            "tgt_ix": "3-176_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_2",
            "tgt_ix": "3-176_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_2",
            "tgt_ix": "3-176_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_2",
            "tgt_ix": "3-176_v2_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_2",
            "tgt_ix": "3-176_v2_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_2",
            "tgt_ix": "3-176_v2_2@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_3",
            "tgt_ix": "3-176_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_4",
            "tgt_ix": "3-176_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_4",
            "tgt_ix": "3-176_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_4",
            "tgt_ix": "3-176_v2_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_4",
            "tgt_ix": "3-176_v2_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_4",
            "tgt_ix": "3-176_v2_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_4",
            "tgt_ix": "3-176_v2_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_5",
            "tgt_ix": "3-176_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_5",
            "tgt_ix": "3-176_v2_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_5",
            "tgt_ix": "3-176_v2_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_5",
            "tgt_ix": "3-176_v2_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_6",
            "tgt_ix": "3-176_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_6",
            "tgt_ix": "3-176_v2_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_6",
            "tgt_ix": "3-176_v2_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_6",
            "tgt_ix": "3-176_v2_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_7",
            "tgt_ix": "3-176_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_8",
            "tgt_ix": "3-176_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_9",
            "tgt_ix": "3-176_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_9",
            "tgt_ix": "3-176_v2_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_9",
            "tgt_ix": "3-176_v2_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_9",
            "tgt_ix": "3-176_v2_9@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_10",
            "tgt_ix": "3-176_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_11",
            "tgt_ix": "3-176_v2_11@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_12",
            "tgt_ix": "3-176_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_13",
            "tgt_ix": "3-176_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_13",
            "tgt_ix": "3-176_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_13",
            "tgt_ix": "3-176_v2_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_13",
            "tgt_ix": "3-176_v2_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_13",
            "tgt_ix": "3-176_v2_13@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_13",
            "tgt_ix": "3-176_v2_13@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_14",
            "tgt_ix": "3-176_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_14",
            "tgt_ix": "3-176_v2_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_14",
            "tgt_ix": "3-176_v2_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_15",
            "tgt_ix": "3-176_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_17",
            "tgt_ix": "3-176_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_18",
            "tgt_ix": "3-176_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_18",
            "tgt_ix": "3-176_v2_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_18",
            "tgt_ix": "3-176_v2_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_18",
            "tgt_ix": "3-176_v2_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_19",
            "tgt_ix": "3-176_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_20",
            "tgt_ix": "3-176_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_20",
            "tgt_ix": "3-176_v2_20@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_21",
            "tgt_ix": "3-176_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_21",
            "tgt_ix": "3-176_v2_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_21",
            "tgt_ix": "3-176_v2_21@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_22",
            "tgt_ix": "3-176_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_23",
            "tgt_ix": "3-176_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_24",
            "tgt_ix": "3-176_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_25",
            "tgt_ix": "3-176_v2_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_25",
            "tgt_ix": "3-176_v2_25@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_25",
            "tgt_ix": "3-176_v2_25@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_25",
            "tgt_ix": "3-176_v2_25@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_25",
            "tgt_ix": "3-176_v2_25@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_25",
            "tgt_ix": "3-176_v2_25@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_26",
            "tgt_ix": "3-176_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_28",
            "tgt_ix": "3-176_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_28",
            "tgt_ix": "3-176_v2_28@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_28",
            "tgt_ix": "3-176_v2_28@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_28",
            "tgt_ix": "3-176_v2_28@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_28",
            "tgt_ix": "3-176_v2_28@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_29",
            "tgt_ix": "3-176_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_31",
            "tgt_ix": "3-176_v2_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_31",
            "tgt_ix": "3-176_v2_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_32",
            "tgt_ix": "3-176_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_34",
            "tgt_ix": "3-176_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_34",
            "tgt_ix": "3-176_v2_34@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_34",
            "tgt_ix": "3-176_v2_34@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_35",
            "tgt_ix": "3-176_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_37",
            "tgt_ix": "3-176_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_38",
            "tgt_ix": "3-176_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_38",
            "tgt_ix": "3-176_v2_38@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_38",
            "tgt_ix": "3-176_v2_38@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_38",
            "tgt_ix": "3-176_v2_38@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_38",
            "tgt_ix": "3-176_v2_38@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_38",
            "tgt_ix": "3-176_v2_38@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_38",
            "tgt_ix": "3-176_v2_38@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_38",
            "tgt_ix": "3-176_v2_38@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_39",
            "tgt_ix": "3-176_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_39",
            "tgt_ix": "3-176_v2_39@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_39",
            "tgt_ix": "3-176_v2_39@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_39",
            "tgt_ix": "3-176_v2_39@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_40",
            "tgt_ix": "3-176_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_40",
            "tgt_ix": "3-176_v2_40@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_40",
            "tgt_ix": "3-176_v2_40@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_40",
            "tgt_ix": "3-176_v2_40@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_41",
            "tgt_ix": "3-176_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_41",
            "tgt_ix": "3-176_v2_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_41",
            "tgt_ix": "3-176_v2_41@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_41",
            "tgt_ix": "3-176_v2_41@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_41",
            "tgt_ix": "3-176_v2_41@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_41",
            "tgt_ix": "3-176_v2_41@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_41",
            "tgt_ix": "3-176_v2_41@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_42",
            "tgt_ix": "3-176_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_42",
            "tgt_ix": "3-176_v2_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_42",
            "tgt_ix": "3-176_v2_42@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_42",
            "tgt_ix": "3-176_v2_42@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_43",
            "tgt_ix": "3-176_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_43",
            "tgt_ix": "3-176_v2_43@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_43",
            "tgt_ix": "3-176_v2_43@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_43",
            "tgt_ix": "3-176_v2_43@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_43",
            "tgt_ix": "3-176_v2_43@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_44",
            "tgt_ix": "3-176_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_44",
            "tgt_ix": "3-176_v2_44@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_44",
            "tgt_ix": "3-176_v2_44@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_44",
            "tgt_ix": "3-176_v2_44@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_44",
            "tgt_ix": "3-176_v2_44@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_45",
            "tgt_ix": "3-176_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_46",
            "tgt_ix": "3-176_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_47",
            "tgt_ix": "3-176_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_48",
            "tgt_ix": "3-176_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_49",
            "tgt_ix": "3-176_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_50",
            "tgt_ix": "3-176_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_51",
            "tgt_ix": "3-176_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_52",
            "tgt_ix": "3-176_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_53",
            "tgt_ix": "3-176_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_54",
            "tgt_ix": "3-176_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_55",
            "tgt_ix": "3-176_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_56",
            "tgt_ix": "3-176_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_57",
            "tgt_ix": "3-176_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_58",
            "tgt_ix": "3-176_v2_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_59",
            "tgt_ix": "3-176_v2_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_60",
            "tgt_ix": "3-176_v2_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_61",
            "tgt_ix": "3-176_v2_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_62",
            "tgt_ix": "3-176_v2_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_63",
            "tgt_ix": "3-176_v2_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "3-176_v2_64",
            "tgt_ix": "3-176_v2_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "3-176_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.4263.2",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Sub-strains of\n                      Drosophila  Canton-S differ markedly in their locomotor behavior",
        "abstract": "We collected five sub-strains of the standard laboratory wild-type Drosophila melanogaster Canton Special (CS) and analyzed their walking behavior in Buridan's paradigm using the CeTrAn software. According to twelve different aspects of their behavior, the sub-strains fit into three groups. The group separation appeared not to be correlated with the origin of the stocks. We conclude that founder effects but not laboratory selection likely influenced the gene pool of the sub-strains. The flies’ stripe fixation was the parameter that varied most. Our results suggest that differences in the genome of laboratory stocks can render comparisons between nominally identical wild-type stocks meaningless. A single source for control strains may settle this problem.",
        "contributors": [
            {
                "surname": "Colomb",
                "given-names": "Julien"
            },
            {
                "surname": "Brembs",
                "given-names": "Björn"
            }
        ],
        "url": "https://f1000research.com/articles/3-176/v2/",
        "doc_id": "3-176",
        "version": 2,
        "ix_counter": 274,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}