{
    "nodes": [
        {
            "ix": "5-1385_v2_0",
            "content": "Finger stick blood collection for gene expression profiling and storage of tempus blood RNA tubes",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_2",
            "content": "With this report we aim to make available a standard operating procedure (SOP) developed for RNA stabilization of small blood volumes collected via a finger stick. The anticipation that this procedure may be improved through peer-review and/or readers public comments is another element motivating the publication of this SOP. Procuring blood samples from human subjects can, among other uses, enable assessment of the immune status of an individual subject via the profiling of RNA abundance using technologies such as real time PCR, NanoString, microarrays or RNA-sequencing. It is often desirable to minimize blood volumes and employ methods that are the least invasive and can be practically implemented outside of clinical settings. Finger stick blood samples are increasingly used for measurement of levels of pharmacological drugs and biological analytes. It is a simple and convenient procedure amenable for instance to field use or self-collection at home using a blood sample collection kit. Such methodologies should also enable the procurement of blood samples at high frequency for health or disease monitoring applications.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_4",
            "content": "Finger stick blood collection is a practical and minimally invasive sample collection method that is used for a wide range of applications in routine clinical practice and can be implemented outside of clinical settings. It is for instance by this means that millions of individuals collect daily small blood volumes to monitor sugar levels.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_5",
            "content": "More recently, availability of high throughput profiling technologies made it possible to measure simultaneously the abundance of tens of thousands of analytes. For instance, transcriptome profiling, which measures abundance of RNA on a genome-wide scale has become a mainstay in biomedical research settings <REF-1> – <REF-6> . This approach can be implemented through the use of technologies such as microarray and more recently RNA-sequencing. Robust and more cost-effective “meso-scale” profiling technologies, relying for instance on PCR or NanoString probes, can profile the abundance of hundreds of genes <REF-7> . Blood transcriptome profiling has proven useful in generating high-resolution molecular phenotypes: to investigate pathogenesis of a wide range of diseases <REF-8> – <REF-11> ; to develop biomarker signatures <REF-12> – <REF-15> ; and to assess response to vaccines or therapies <REF-7> , <REF-16> – <REF-20> . More recently, an approach consisting in correlating serial blood transcriptome signatures with clinical course of disease was described as a means to guide development and selection of novel therapeutic modalities in patients with systemic lupus erythematosus <REF-1> , <REF-21> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_6",
            "content": "Transcriptome profiling studies have initially employed peripheral blood mononuclear cells (PBMCs) <REF-11> , <REF-22> , <REF-23> . PBMCs are isolated by fractionation and are enriched in blood leukocytes. It is also a type of sample from which high quality RNA can be reliably obtained, which at the time was not the case of whole blood. However, the PBMC preparation procedure involves multiple steps and important variations are introduced between the time of blood draw and preparation of the cell lysates <REF-24> . Furthermore, it is a time consuming process that requires trained personnel and equipment and is not straightforward to implement in most clinical settings. Whole blood RNA stabilization systems; PAXgene™ (Qiagen) and Tempus™ (Life Technologies) have been adopted as they became available and are now widely used. Several studies have compared the performance of these 2 commercial kits and found differences in gene expression profiles, RNA quality and yield <REF-25> – <REF-27> . Reported yields and quality of RNA stabilized in Tempus solution was generally greater. Thus, the choice of RNA stabilizing reagent used to preserve samples can indeed be important and affect subsequent RNA quantity and quality. Our choice of the tempus system over PaxGene dates from side-by-side comparisons we have performed over 10 years ago. However the vast majority of the studies carried out to date use relatively large volumes of venous blood <REF-12> , <REF-13> , <REF-19> , <REF-20> , <REF-28> . Collection of small volumes of blood via finger sticks is especially indicated for high frequency sample collection to enable monitoring of the immune status of individuals in health and disease <REF-2> . Advantages of this collection modality stem from the fact that it is less invasive, faster and does not require a trained phlebotomist. Therefore, it is more amenable to field applications and in home self-collection for proximity testing. A study by Obermoser et al., employed this collection method to investigate transcriptome responses elicited by influenza and pneumococcal vaccines at 8 different time points in the 48 hours following vaccine administration <REF-16> . A methods development article has also been published by Robinson et al., demonstrating that RNA quality and gene expression data obtained from blood obtained via finger stick (70 μL) and venipuncture (2.5 mL) are highly comparable <REF-29> . Since version 1 of our SOP came out in F1000Research <REF-30> we have published a paper describing results of a study in which weekly in home self-finger stick blood collection was undertaken by 13 subjects with type 1 diabetes and 14 controls for a period of 6 months <REF-31> . Subjects returned an average of 24 out of 26 total weekly samples, and transcript data were successfully obtained for >99% of samples returned. A high degree of correlation between finger stick data and data from a standard 3 mL venipuncture sample was observed. RNA yields obtained from blood volumes ranging from 10, 15, 20, and 25 μL indicated that those volumes were sufficient to generate the 100 ng of RNA needed for high throughput real time-PCR <REF-31> . However, the detailed procedure for finger stick blood collection and RNA stabilization employed in this and other studies has never been published.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_7",
            "content": "The standard operating procedure that we are sharing with this report will be published as part of our molecular profiling of pregnancy channel. Indeed, it was specifically developed for collection and stabilization of 50 μl of blood collected via a finger stick in a pregnancy monitoring study currently being conducted on the Thai-Myanmar border. It will consist of measuring changes in blood transcript abundance in 400 women during the second and third trimester of their pregnancy. A complete description of this study will be provided elsewhere.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_8",
            "content": "Narrative of the procedure",
            "ntype": "title",
            "meta": {
                "section": "1.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_9",
            "content": "The procedure described in this article can be employed for serial blood collection in clinical or research laboratory settings as well as for in-home self-collection. A narrative is provided here, along with general remarks and considerations. A detailed point-by-point SOP follows.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_10",
            "content": "Narrative: Tempus RNA tubes are designed for the collection of 3 ml of blood via venipuncture and contain 6 ml of a proprietary RNA stabilizing reagent. For the collection of 50 μl blood samples 100 μl of the RNA stabilizing reagent is aliquoted in microfuge tubes. Blood is collected with a plastic capillary straw. Immediately after collection, the tube is shaken vigorously to disrupt the blood cells for at least 20 seconds. A sufficient quantity of RNA for downstream processing was obtained when tubes were flicked, pipetted, or vortexed, but was reduced when samples were not mixed at all. Lysis of blood cells occurs upon thoroughly mixing the blood drawn into the tube and the stabilizing reagent. Furthermore, RNases are inactivated and the freed RNA is selectively precipitated and thus further protected from degradation. Effective stabilization of the RNA ensures that the transcriptional profile is maintained and will accurately reflect the physiological state of the patient at the time of the blood draw. RNA properly collected in Tempus solution and stored at -20°C or -80°C will remain stable for minimum of 6 years <REF-32> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_11",
            "content": "General remarks : After over 10 years of use across a wide range of clinical settings RNA stabilization using tempus solution has in our hands proven robust and reliable. However there are a few things that we have learned that are worth sharing:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_12",
            "content": "1) Finger stick : The finger is usually the preferred site for capillary testing in an adult patient. When samples are collected serially it is recommended to choose a different finger from the one used for the last procedure to prevent bruising. The sides of the heel are only used in pediatric and neonatal patients. The guidance given in Section 7.1 of the WHO guidelines on blood drawing: best practices in phlebotomy, can help decide whether to use a finger or heel-stick, and with the selection of an appropriately sized lancet <REF-33> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_13",
            "content": "2) Blood volumes : The volume can be adjusted depending on the application. Typical yield from 50 μl of blood is the minimum about 500 ng of total RNA. Procedures for RNA extraction and quality control will be shared in a separate publication (Anguiano E., Rinchai D., Tomei S., Chaussabel D., unpublished report). A study was conducted where as little as 15 μl of blood was collected, which was sufficient to run a high throughput Fluidigm PCR assay <REF-31> . Such small blood volumes can also be obtained serially from mice, which allow longitudinal monitoring of individual animals. In human studies, instead of using a capillary straw small blood volumes can also be collected and measured with a micropipette. The blood is then placed into the microfuge tube containing the tempus solution. This can be done when collecting small volumes of blood from a finger stick or obtaining a small aliquot of blood from a larger venous blood draw.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_14",
            "content": "3) Volume of RNA stabilization solution : The appropriate ratio of [Blood : RNA stabilizing reagent] is 1 volume of blood for 2 volumes of tempus solution (in our case 50 μl of blood in 100 μl of RNA stabilizing reagent). Loss in RNA quality and quantity will be observed if this ratio is not respected. Collecting more blood will actually result in decreased yields and RNA quality. In cases when the amount of blood collected is lower, the volume of tempus solution can be adjusted accordingly when feasible. The same ratio can be used when working with mouse blood collected from the tail vein using a similar procedure (as mentioned above blood volumes can be lowered to 15 μl). The volumetric ratio is usually lower when working with non-human primate species (e.g. 1:3, 1:4) and should be determined on a species-by-species basis (a 1:3 ratio is used when collecting blood from macaques <REF-34> ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_15",
            "content": "4) Sample mixing : This, after maintaining an appropriate blood: tempus solution ratio, is the second most critical aspect of the procedure, and a potential cause of sample failure. As mentioned above samples must be homogenized by thorough mixing in order to disrupt cells and release their RNA cargo. The RNA will precipitate in the tempus solution and in this form is protected from degradation by the RNAses that are present in the sample.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_16",
            "content": "5) Temperature : RNA should remain in a precipitated state at “room temperature”. Although refrigeration and freezing at the earliest possible time is recommended, based on our observations keeping the blood lysates at room temperature (25°C) for up to 24 hours should not affect RNA quality. Samples can be stored at 4°C (refrigerator or cold packs) for up to 48 hours, which can simplify the logistics associated with temporary storage, transfer and shipping of samples post-collection. Based on information provided by the manufacturer RNA should remain in a precipitated state as long as temperatures remain below 30°C. It may therefore be necessary to take precaution when working in warm climates.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_17",
            "content": "6) Storage and shipping : After collecting the blood sample should be kept cold at 4°C no longer than 48 hours and transferred to a -20°C or -80°C freezer for long-term storage. By default, samples are stored in the lab at -20°C. Data obtained using a limited set of samples frozen overnight showed that the RNA yield for samples stored at -80°C was about half the yield of same blood samples stored at -20°C, but was nevertheless still amply sufficient for downstream analyses. It should also be noted that the plastic tempus tubes are made of will become brittle at temperatures lower than -20°C. The effect of storage temperature on RNA yield and quality will have to be evaluated further, especially over extended periods of time where storage at lower temperatures might show benefits (see also referees comments and our response for more details). Shipments are made on dry ice although for overnight shipping in cooler climates using ice packs should be sufficient (however testing using mock samples is recommended). When shipping “off the shelf” tempus tubes direct contact with dry ice should be avoided to prevent breakage. When shipping on dry ice attention should be paid to the thickness of the walls of the polystyrene container holding the tubes along with the dry ice. The thinner the walls the faster the shipment will run out of dry ice. This is especially important to consider when contemplating longer transit times and/or warm weather conditions. Regarding biosafety, we have found the tempus solution to prevent growth of bacteria known for their resilience such as Burkholderia pseudomallei (Rinchai D, unpublished report), and thus conclude that threat of contamination via tempus blood lysates is likely to be low. However, appropriate testing should be carried out on a case-by-case basis and all procedures in the laboratory involving tempus lysates should be consistent with standard blood handling procedures.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_18",
            "content": "7) Safety : The hazardous nature of the tempus solution would make extensive roll out of the collection procedure described in this manuscript problematic and is at the moment clearly intended for research use under well controlled conditions, with preferably collection carried out by trained personnel. However, it should be noted that it has been-field tested for in-home self-collection in a limited number of subject over a period of 6 months without incident <REF-31> . The fact that small volumes of solution are used may alleviate some concerns (30 microliters of solution for 15 microliters of blood in the above-mentioned study, vs 6 ml of solution for 3 ml of blood using “off the shelf” tempus collection tubes). However, other technical solutions in which liquids are better contained may indeed be preferable (e.g. microfluidics card, sponges), with one of the best example being the recently developed “DxCollect” system (DxTerity, Rancho Dominguez, CA).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_19",
            "content": "Materials and methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "sec-type": "materials | methods",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_20",
            "content": "Reagents and equipment",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_21",
            "content": "- Tempus TM blood RNA tubes (ThermoFischer Scientific, Waltham, MA, USA; Product number 4342792; https://www.thermofisher.com/order/catalog/product/4342792 )\n- Capillary blood and tube assembly, untreated, 50 μl, thin design (Kabe Labortechnik, Nümbrecht, Germany (Product number GK100, http://www.kabe-labortechnik.de/download/kapillarblut_en.pdf ) <REF-35> , <REF-36>\n- Sterile blood lancets\n- Alcohol pads\n- Biohazard container\n- Lab coat\n- Gloves\n- Ziploc-type biohazard bag and freezer box\n- Adhesive bandages\n- Sample collection tube labels",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_22",
            "content": "Preparation of sample collection tubes",
            "ntype": "title",
            "meta": {
                "section": "3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_23",
            "content": "- 1. Prepare Tempus Tube RNA stabilization into blood collection tubes ( Figure 1 ) a. Place the blood collection tubes on a rack and remove the capillary assembly and place them at the same rack. b. Put the Tempus tube on a second rack and remove the lid c. Pipette 100 ul of RNA stabilizing solution from the open tempus tube and transfer it into the blood collection tubes d. Place the capillary assembly on the collection tube. The blood collection tubes are ready for immediate use. In case the blood collection tubes are prepared for later use the lid should be closed and capillary assembly set aside. e. Store the blood collection tubes containing RNA stabilizing solution in storage box at room temperature\n- 2. For the later use, assembly capillary tube and blood collection tubes a. Open the lid of blood collection tubes containing the RNA stabilizing solution b. Assemble the capillary assembly into the collection tubes containing the RNA stabilising solution\n- 3. Follow the blood sample collection procedure step-by-step",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_24",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Preparation of the sample collection tubes. This figure illustrates the different steps involved in preparation sample collection tubes for collection and stabilization of blood RNA.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11887/9bd16ca6-15af-49b0-a471-4f2503c79d1f_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_25",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <title>Preparation of the sample collection tubes.</title> <p>This figure illustrates the different steps involved in preparation sample collection tubes for collection and stabilization of blood RNA.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/11887/9bd16ca6-15af-49b0-a471-4f2503c79d1f_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Preparation of the sample collection tubes. This figure illustrates the different steps involved in preparation sample collection tubes for collection and stabilization of blood RNA.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11887/9bd16ca6-15af-49b0-a471-4f2503c79d1f_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_26",
            "content": "Precautions",
            "ntype": "title",
            "meta": {
                "section": "4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_27",
            "content": "- Personal protective equipment (PPE) must be worn to prevent accidental exposure to blood and bloodborne pathogens, and to help reduce contamination during sample collection [ http://www.cdc.gov/niosh/topics/emres/ppe.html ].\n- Discard all blood collection materials and “sharps” in properly labeled biohazard containers approved for their disposal.\n- Check that the liquid preservatives and anticoagulants in the collection tubes are clear and colorless. Do not use any tubes if they are discolored or contain precipitates.\n- Tempus Tube RNA stabilization reagent is a potential health hazard; acute oral toxicity, skin corrosion/irritation and serious eye damage/eye irritation can occur upon contact (See MSDS for details).",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_28",
            "content": "Procedures",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_29",
            "content": "The procedures below are illustrated in Figure 2 and a demonstration video is available here: https://www.youtube.com/watch?v=Mxc36ARxWqQ",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_30",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "Illustration for capillary blood sampling. This figure illustrates the different steps involved in capillary blood sampling via finger stick.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11887/9bd16ca6-15af-49b0-a471-4f2503c79d1f_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_31",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>Illustration for capillary blood sampling.</title> <p> This figure illustrates the different steps involved in capillary blood sampling via finger stick.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/11887/9bd16ca6-15af-49b0-a471-4f2503c79d1f_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "Illustration for capillary blood sampling. This figure illustrates the different steps involved in capillary blood sampling via finger stick.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/11887/9bd16ca6-15af-49b0-a471-4f2503c79d1f_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_32",
            "content": "- 1. Assemble equipment and supplies, then complete the finger stick information log by recording relevant information about blood collection such as patient name, patient identity number (patient ID), date of blood collection, frequency number of blood collection (Day 1 st , Day 7 th ... Day 90 th ,…). Double check that the label on the collection tube matches with the patient ID.\n- 2. Put on well-fitting gloves\n- 3. Choose one of the subject’s fingers from which blood will be collected. The middle or the ring finger is the best choice for finger stick collection, ideally of the non-dominant hand. Fingers on the non-dominant hand are generally less calloused. Avoid the thumb that may be calloused and has pulse and pinkie finger that is often calloused and potentially more sensitive to pain due to additional nerve ending, fingers with thick calluses, that are injured or swollen and fingers with tight rings as they may constrict blood flow.\n- 4. Prepare the puncture site by warming the area. If the subject is particularly cold have the subject wash hands under warm water to stimulate blood flow. In addition, it may be necessary to warm the area with a moist towel for five to ten minutes.\n- 5. Wipe the fingertip with the alcohol pad and allow to air-dry completely without blowing or wiping off the alcohol.\n- 6. To stimulate blood flow, you may shake or gently knead the subject’s hand from palm to fingertip. Blood will also flow better if the hand is kept lower, approximately at the level of the subject’s waist.\n- 7. Hold finger and press lancet firmly against the side of the center of the finger, with lancet oriented perpendicular to the fingerprint grooves.\n- 8. Discard lancet in an appropriate container.\n- 9. Release pressure and allow a full drop of blood to collect on finger. If necessary, gently knead the palm only to stimulate blood flow.\n- 10. Wipe away the first drop of blood with a sterile gauze pad because it may be contaminated with tissue fluid or debris (sloughing skin).\n- 11. Collect blood sample into the capillary tube. a. Hold the capillary and micro-tube assembly horizontally, and touch the tip of the capillary to the blood drop. b. The blood will be pulled into the tube via capillary action. c. Be sure to allow the capillary to fill end-to-end to allow collection of accurate blood volume. d. To expel the sample from the capillary, place the capillary and micro-tube assembly vertically and firmly tap the bottom of the tube. Remove capillary tube together with cap assembly system and discard in the appropriate biohazard container. e. It is important to maintain the appropriate blood sample to tempus solution ratio. A volume of 50 μl of blood should be added to the 100 μl of tempus solution. If necessary the volume of solution can be adjusted to the available or desired volume of blood; e.g. for 15 μl of blood use 30 μl of tempus solution. f. Close the micro-tubes, making sure that the cap is pressed down firmly to avoid any spillage during sample homogenization. g. To prevent clotting, blood samples should be collected within 30 seconds of performing the finger stick. Clotted samples will not be usable.\n- 12. Have the subject apply pressure to the puncture site using sterile gauze pad until bleeding has stopped and apply a bandage. Do not use the alcohol pad as contact of an open wound with alcohol would be painful for the subject.\n- 13. Immediately, mix the blood sample and preservative thoroughly by holding the top of the tube between thumb and index of one hand and flicking the tube vigorously for 20 seconds with the index finger of the other hand ( Figure 2 ) . This is important because it will allow precipitation of the RNA, which is then protected from degradation.\n- 14. If not already in place stick pre-printed label with sample information on the sample tube.\n- 15. Place sample tube in appropriate container (e.g. freezer box).\n- 16. The sample should be kept cold at 4°C no longer than 48 hours and transferred to a -20°C or -80°C freezer for long-term storage. Note that RNA integrity is still preserved when samples are kept at “room temperature” for a few hours as long as the temperature does not rise above 30°C.\n- 17. For local transportation samples can be kept in a freezer box containing ice or ice packs. For international shipping samples can be kept on dry ice in a freezer box.",
            "ntype": "list",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_33",
            "content": "<REF-1> Banchereau R Hong S Cantarel B : Personalized Immunomonitoring Uncovers Molecular Networks that Stratify Lupus Patients. Cell. 2016 ; 165 ( 3 ): 551 – 65 . 27040498 10.1016/j.cell.2016.03.008",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_34",
            "content": "<REF-2> Chaussabel D Pulendran B : A vision and a prescription for big data-enabled medicine. Nat Immunol. 2015 ; 16 ( 5 ): 435 – 9 . 25898187 10.1038/ni.3151",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_35",
            "content": "<REF-6> Furman D Davis MM : New approaches to understanding the immune response to vaccination and infection. Vaccine. 2015 ; 33 ( 40 ): 5271 – 81 . 26232539 10.1016/j.vaccine.2015.06.117 4581990",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_36",
            "content": "<REF-7> Nielsen T Wallden B Schaper C : Analytical validation of the PAM50-based Prosigna Breast Cancer Prognostic Gene Signature Assay and nCounter Analysis System using formalin-fixed paraffin-embedded breast tumor specimens. BMC Cancer. 2014 ; 14 : 177 . 24625003 10.1186/1471-2407-14-177 4008304",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_37",
            "content": "<REF-8> Ramilo O Allman W Chung W : Gene expression patterns in blood leukocytes discriminate patients with acute infections. Blood. 2007 ; 109 ( 5 ): 2066 – 77 . 17105821 10.1182/blood-2006-02-002477 1801073",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_38",
            "content": "<REF-11> Tang BM McLean AS Dawes IW : Gene-expression profiling of peripheral blood mononuclear cells in sepsis. Crit Care Med. 2009 ; 37 ( 3 ): 882 – 8 . 19237892 10.1097/CCM.0b013e31819b52fd",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_39",
            "content": "<REF-12> Mejias A Dimo B Suarez NM : Whole blood gene expression profiles to assess pathogenesis and disease severity in infants with respiratory syncytial virus infection. PLoS Med. 2013 ; 10 ( 11 ): e1001549 . 24265599 10.1371/journal.pmed.1001549 3825655",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_40",
            "content": "<REF-13> Berry MP Graham CM McNab FW : An interferon-inducible neutrophil-driven blood transcriptional signature in human tuberculosis. Nature. 2010 ; 466 ( 7309 ): 973 – 7 . 20725040 10.1038/nature09247 3492754",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_41",
            "content": "<REF-15> Newell KA Asare A Kirk AD : Identification of a B cell signature associated with renal transplant tolerance in humans. J Clin Invest. 2010 ; 120 ( 6 ): 1836 – 47 . 20501946 10.1172/JCI39933 2877933",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_42",
            "content": "<REF-16> Obermoser G Presnell S Domico K : Systems scale interactive exploration reveals quantitative and qualitative differences in response to influenza and pneumococcal vaccines. Immunity. 2013 ; 38 ( 4 ): 831 – 44 . 23601689 10.1016/j.immuni.2012.12.008 3681204",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_43",
            "content": "<REF-19> Oswald M Curran ME Lamberth SL : Modular analysis of peripheral blood gene expression in rheumatoid arthritis captures reproducible gene expression changes in tumor necrosis factor responders. Arthritis Rheumatol. 2015 ; 67 ( 2 ): 344 – 51 . 25371395 10.1002/art.38947 4476407",
            "ntype": "ref",
            "meta": {
                "id": "ref-19",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_44",
            "content": "<REF-20> Querec TD Akondy RS Lee EK : Systems biology approach predicts immunogenicity of the yellow fever vaccine in humans. Nat Immunol. 2009 ; 10 ( 1 ): 116 – 25 . 19029902 10.1038/ni.1688 4049462",
            "ntype": "ref",
            "meta": {
                "id": "ref-20",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_45",
            "content": "<REF-21> Jourde-Chiche N Chiche L Chaussabel D : Introducing a New Dimension to Molecular Disease Classifications. Trends Mol Med. 2016 ; 22 ( 6 ): 451 – 53 , pii: S1471-4914(16)30009-0. 27161597 10.1016/j.molmed.2016.04.005",
            "ntype": "ref",
            "meta": {
                "id": "ref-21",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_46",
            "content": "<REF-22> Kaizer EC Glaser CL Chaussabel D : Gene expression in peripheral blood mononuclear cells from children with diabetes. J Clin Endocrinol Metab. 2007 ; 92 ( 9 ): 3705 – 11 . 17595242 10.1210/jc.2007-0979",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_47",
            "content": "<REF-23> Allantaz F Chaussabel D Stichweh D : Blood leukocyte microarrays to diagnose systemic onset juvenile idiopathic arthritis and follow the response to IL-1 blockade. J Exp Med. 2007 ; 204 ( 9 ): 2131 – 44 . 17724127 10.1084/jem.20070070 2118700",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_48",
            "content": "<REF-24> Debey-Pascher S Eggle D Schultze JL : RNA stabilization of peripheral blood and profiling by bead chip analysis. Methods Mol Biol. 2009 ; 496 : 175 – 210 . 18839112 10.1007/978-1-59745-553-4_13",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_49",
            "content": "<REF-25> Asare AL Kolchinsky SA Gao Z : Differential gene expression profiles are dependent upon method of peripheral blood collection and RNA isolation. BMC Genomics. 2008 ; 9 : 474 . 18847473 10.1186/1471-2164-9-474 2573897",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_50",
            "content": "<REF-27> Häntzsch M Tolios A Beutner F : Comparison of whole blood RNA preservation tubes and novel generation RNA extraction kits for analysis of mRNA and MiRNA profiles. PLoS One. 2014 ; 9 ( 12 ): e113298 . 25469788 10.1371/journal.pone.0113298 4254602",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_51",
            "content": "<REF-28> Pankla R Buddhisa S Berry M : Genomic transcriptional profiling identifies a candidate blood biomarker signature for the diagnosis of septicemic melioidosis. Genome Biol. 2009 ; 10 ( 11 ): R127 . 19903332 10.1186/gb-2009-10-11-r127 3091321",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_52",
            "content": "<REF-29> Robison EH Mondala TS Williams AR : Whole genome transcript profiling from fingerstick blood samples: a comparison and feasibility study. BMC Genomics. 2009 ; 10 : 617 . 20017944 10.1186/1471-2164-10-617 2811129",
            "ntype": "ref",
            "meta": {
                "id": "ref-29",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_53",
            "content": "<REF-30> Rinchai D Anguiano E Nguyen P : Finger stick blood collection for gene expression profiling and storage of tempus blood RNA tubes [version 1; referees: 3 approved with reservations]. F1000Research. 2016 ; 5 : 1385 . 10.12688/f1000research.8841.1",
            "ntype": "ref",
            "meta": {
                "id": "ref-30",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_54",
            "content": "<REF-31> Speake C Whalen E Gersuk VH : Longitudinal Monitoring of Gene Expression in Ultra-Low Volume Blood Samples Self-Collected at Home. Clin Exp Immunol. 2016 . 28009047 10.1111/cei.12916",
            "ntype": "ref",
            "meta": {
                "id": "ref-31",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_55",
            "content": "<REF-32> Duale N Lipkin WI Briese T : Long-term storage of blood RNA collected in RNA stabilizing Tempus tubes in a large biobank--evaluation of RNA quality and stability. BMC Res Notes. 2014 ; 7 : 633 . 25214016 10.1186/1756-0500-7-633 4168124",
            "ntype": "ref",
            "meta": {
                "id": "ref-32",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_56",
            "content": "<REF-33> WHO Guidelines Approved by the Guidelines Review Committee : WHO Guidelines on Drawing Blood: Best Practices in Phlebotomy. Geneva, 2010 . 23741774",
            "ntype": "ref",
            "meta": {
                "id": "ref-33",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "5-1385_v2_57",
            "content": "<REF-34> Skinner JA Zurawski SM Sugimoto C : Immunologic characterization of a rhesus macaque H1N1 challenge model for candidate influenza virus vaccine assessment. Clin Vaccine Immunol. 2014 ; 21 ( 12 ): 1668 – 80 . 25298110 10.1128/CVI.00547-14 4248778",
            "ntype": "ref",
            "meta": {
                "id": "ref-34",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "5-1385_v2_0@0",
            "content": "Finger stick blood collection for gene expression profiling and storage of tempus blood RNA tubes",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_0",
            "start": 0,
            "end": 96,
            "label": {}
        },
        {
            "ix": "5-1385_v2_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "5-1385_v2_2@0",
            "content": "With this report we aim to make available a standard operating procedure (SOP) developed for RNA stabilization of small blood volumes collected via a finger stick.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_2",
            "start": 0,
            "end": 162,
            "label": {}
        },
        {
            "ix": "5-1385_v2_2@1",
            "content": "The anticipation that this procedure may be improved through peer-review and/or readers public comments is another element motivating the publication of this SOP.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_2",
            "start": 164,
            "end": 325,
            "label": {}
        },
        {
            "ix": "5-1385_v2_2@2",
            "content": "Procuring blood samples from human subjects can, among other uses, enable assessment of the immune status of an individual subject via the profiling of RNA abundance using technologies such as real time PCR, NanoString, microarrays or RNA-sequencing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_2",
            "start": 327,
            "end": 576,
            "label": {}
        },
        {
            "ix": "5-1385_v2_2@3",
            "content": "It is often desirable to minimize blood volumes and employ methods that are the least invasive and can be practically implemented outside of clinical settings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_2",
            "start": 578,
            "end": 736,
            "label": {}
        },
        {
            "ix": "5-1385_v2_2@4",
            "content": "Finger stick blood samples are increasingly used for measurement of levels of pharmacological drugs and biological analytes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_2",
            "start": 738,
            "end": 861,
            "label": {}
        },
        {
            "ix": "5-1385_v2_2@5",
            "content": "It is a simple and convenient procedure amenable for instance to field use or self-collection at home using a blood sample collection kit.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_2",
            "start": 863,
            "end": 1000,
            "label": {}
        },
        {
            "ix": "5-1385_v2_2@6",
            "content": "Such methodologies should also enable the procurement of blood samples at high frequency for health or disease monitoring applications.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_2",
            "start": 1002,
            "end": 1136,
            "label": {}
        },
        {
            "ix": "5-1385_v2_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "5-1385_v2_4@0",
            "content": "Finger stick blood collection is a practical and minimally invasive sample collection method that is used for a wide range of applications in routine clinical practice and can be implemented outside of clinical settings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_4",
            "start": 0,
            "end": 219,
            "label": {}
        },
        {
            "ix": "5-1385_v2_4@1",
            "content": "It is for instance by this means that millions of individuals collect daily small blood volumes to monitor sugar levels.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_4",
            "start": 221,
            "end": 340,
            "label": {}
        },
        {
            "ix": "5-1385_v2_5@0",
            "content": "More recently, availability of high throughput profiling technologies made it possible to measure simultaneously the abundance of tens of thousands of analytes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_5",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "5-1385_v2_5@1",
            "content": "For instance, transcriptome profiling, which measures abundance of RNA on a genome-wide scale has become a mainstay in biomedical research settings <REF-1> – <REF-6> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_5",
            "start": 161,
            "end": 327,
            "label": {}
        },
        {
            "ix": "5-1385_v2_5@2",
            "content": "This approach can be implemented through the use of technologies such as microarray and more recently RNA-sequencing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_5",
            "start": 329,
            "end": 445,
            "label": {}
        },
        {
            "ix": "5-1385_v2_5@3",
            "content": "Robust and more cost-effective “meso-scale” profiling technologies, relying for instance on PCR or NanoString probes, can profile the abundance of hundreds of genes <REF-7> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_5",
            "start": 447,
            "end": 620,
            "label": {}
        },
        {
            "ix": "5-1385_v2_5@4",
            "content": "Blood transcriptome profiling has proven useful in generating high-resolution molecular phenotypes: to investigate pathogenesis of a wide range of diseases <REF-8> – <REF-11> ; to develop biomarker signatures <REF-12> – <REF-15> ; and to assess response to vaccines or therapies <REF-7> , <REF-16> – <REF-20> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_5",
            "start": 622,
            "end": 931,
            "label": {}
        },
        {
            "ix": "5-1385_v2_5@5",
            "content": "More recently, an approach consisting in correlating serial blood transcriptome signatures with clinical course of disease was described as a means to guide development and selection of novel therapeutic modalities in patients with systemic lupus erythematosus <REF-1> , <REF-21> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_5",
            "start": 933,
            "end": 1213,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@0",
            "content": "Transcriptome profiling studies have initially employed peripheral blood mononuclear cells (PBMCs) <REF-11> , <REF-22> , <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 0,
            "end": 130,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@1",
            "content": "PBMCs are isolated by fractionation and are enriched in blood leukocytes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 132,
            "end": 204,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@2",
            "content": "It is also a type of sample from which high quality RNA can be reliably obtained, which at the time was not the case of whole blood.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 206,
            "end": 337,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@3",
            "content": "However, the PBMC preparation procedure involves multiple steps and important variations are introduced between the time of blood draw and preparation of the cell lysates <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 339,
            "end": 519,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@4",
            "content": "Furthermore, it is a time consuming process that requires trained personnel and equipment and is not straightforward to implement in most clinical settings.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 521,
            "end": 676,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@5",
            "content": "Whole blood RNA stabilization systems; PAXgene™ (Qiagen) and Tempus™ (Life Technologies) have been adopted as they became available and are now widely used.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 678,
            "end": 833,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@6",
            "content": "Several studies have compared the performance of these 2 commercial kits and found differences in gene expression profiles, RNA quality and yield <REF-25> – <REF-27> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 835,
            "end": 1001,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@7",
            "content": "Reported yields and quality of RNA stabilized in Tempus solution was generally greater.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 1003,
            "end": 1089,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@8",
            "content": "Thus, the choice of RNA stabilizing reagent used to preserve samples can indeed be important and affect subsequent RNA quantity and quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 1091,
            "end": 1230,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@9",
            "content": "Our choice of the tempus system over PaxGene dates from side-by-side comparisons we have performed over 10 years ago.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 1232,
            "end": 1348,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@10",
            "content": "However the vast majority of the studies carried out to date use relatively large volumes of venous blood <REF-12> , <REF-13> , <REF-19> , <REF-20> , <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 1350,
            "end": 1509,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@11",
            "content": "Collection of small volumes of blood via finger sticks is especially indicated for high frequency sample collection to enable monitoring of the immune status of individuals in health and disease <REF-2> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 1511,
            "end": 1714,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@12",
            "content": "Advantages of this collection modality stem from the fact that it is less invasive, faster and does not require a trained phlebotomist.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 1716,
            "end": 1850,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@13",
            "content": "Therefore, it is more amenable to field applications and in home self-collection for proximity testing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 1852,
            "end": 1954,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@14",
            "content": "A study by Obermoser et al., employed this collection method to investigate transcriptome responses elicited by influenza and pneumococcal vaccines at 8 different time points in the 48 hours following vaccine administration <REF-16> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 1956,
            "end": 2189,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@15",
            "content": "A methods development article has also been published by Robinson et al., demonstrating that RNA quality and gene expression data obtained from blood obtained via finger stick (70 μL) and venipuncture (2.5 mL) are highly comparable <REF-29> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 2191,
            "end": 2432,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@16",
            "content": "Since version 1 of our SOP came out in F1000Research <REF-30> we have published a paper describing results of a study in which weekly in home self-finger stick blood collection was undertaken by 13 subjects with type 1 diabetes and 14 controls for a period of 6 months <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 2434,
            "end": 2712,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@17",
            "content": "Subjects returned an average of 24 out of 26 total weekly samples, and transcript data were successfully obtained for >99% of samples returned.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 2714,
            "end": 2856,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@18",
            "content": "A high degree of correlation between finger stick data and data from a standard 3 mL venipuncture sample was observed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 2858,
            "end": 2975,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@19",
            "content": "RNA yields obtained from blood volumes ranging from 10, 15, 20, and 25 μL indicated that those volumes were sufficient to generate the 100 ng of RNA needed for high throughput real time-PCR <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 2977,
            "end": 3176,
            "label": {}
        },
        {
            "ix": "5-1385_v2_6@20",
            "content": "However, the detailed procedure for finger stick blood collection and RNA stabilization employed in this and other studies has never been published.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_6",
            "start": 3178,
            "end": 3325,
            "label": {}
        },
        {
            "ix": "5-1385_v2_7@0",
            "content": "The standard operating procedure that we are sharing with this report will be published as part of our molecular profiling of pregnancy channel.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_7",
            "start": 0,
            "end": 143,
            "label": {}
        },
        {
            "ix": "5-1385_v2_7@1",
            "content": "Indeed, it was specifically developed for collection and stabilization of 50 μl of blood collected via a finger stick in a pregnancy monitoring study currently being conducted on the Thai-Myanmar border.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_7",
            "start": 145,
            "end": 347,
            "label": {}
        },
        {
            "ix": "5-1385_v2_7@2",
            "content": "It will consist of measuring changes in blood transcript abundance in 400 women during the second and third trimester of their pregnancy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_7",
            "start": 349,
            "end": 485,
            "label": {}
        },
        {
            "ix": "5-1385_v2_7@3",
            "content": "A complete description of this study will be provided elsewhere.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_7",
            "start": 487,
            "end": 550,
            "label": {}
        },
        {
            "ix": "5-1385_v2_8@0",
            "content": "Narrative of the procedure",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_8",
            "start": 0,
            "end": 25,
            "label": {}
        },
        {
            "ix": "5-1385_v2_9@0",
            "content": "The procedure described in this article can be employed for serial blood collection in clinical or research laboratory settings as well as for in-home self-collection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_9",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "5-1385_v2_9@1",
            "content": "A narrative is provided here, along with general remarks and considerations.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_9",
            "start": 168,
            "end": 243,
            "label": {}
        },
        {
            "ix": "5-1385_v2_9@2",
            "content": "A detailed point-by-point SOP follows.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_9",
            "start": 245,
            "end": 282,
            "label": {}
        },
        {
            "ix": "5-1385_v2_10@0",
            "content": "Narrative: Tempus RNA tubes are designed for the collection of 3 ml of blood via venipuncture and contain 6 ml of a proprietary RNA stabilizing reagent.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_10",
            "start": 0,
            "end": 151,
            "label": {}
        },
        {
            "ix": "5-1385_v2_10@1",
            "content": "For the collection of 50 μl blood samples 100 μl of the RNA stabilizing reagent is aliquoted in microfuge tubes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_10",
            "start": 153,
            "end": 264,
            "label": {}
        },
        {
            "ix": "5-1385_v2_10@2",
            "content": "Blood is collected with a plastic capillary straw.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_10",
            "start": 266,
            "end": 315,
            "label": {}
        },
        {
            "ix": "5-1385_v2_10@3",
            "content": "Immediately after collection, the tube is shaken vigorously to disrupt the blood cells for at least 20 seconds.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_10",
            "start": 317,
            "end": 427,
            "label": {}
        },
        {
            "ix": "5-1385_v2_10@4",
            "content": "A sufficient quantity of RNA for downstream processing was obtained when tubes were flicked, pipetted, or vortexed, but was reduced when samples were not mixed at all.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_10",
            "start": 429,
            "end": 595,
            "label": {}
        },
        {
            "ix": "5-1385_v2_10@5",
            "content": "Lysis of blood cells occurs upon thoroughly mixing the blood drawn into the tube and the stabilizing reagent.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_10",
            "start": 597,
            "end": 705,
            "label": {}
        },
        {
            "ix": "5-1385_v2_10@6",
            "content": "Furthermore, RNases are inactivated and the freed RNA is selectively precipitated and thus further protected from degradation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_10",
            "start": 707,
            "end": 832,
            "label": {}
        },
        {
            "ix": "5-1385_v2_10@7",
            "content": "Effective stabilization of the RNA ensures that the transcriptional profile is maintained and will accurately reflect the physiological state of the patient at the time of the blood draw.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_10",
            "start": 834,
            "end": 1020,
            "label": {}
        },
        {
            "ix": "5-1385_v2_10@8",
            "content": "RNA properly collected in Tempus solution and stored at -20°C or -80°C will remain stable for minimum of 6 years <REF-32> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_10",
            "start": 1022,
            "end": 1144,
            "label": {}
        },
        {
            "ix": "5-1385_v2_11@0",
            "content": "General remarks : After over 10 years of use across a wide range of clinical settings RNA stabilization using tempus solution has in our hands proven robust and reliable.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_11",
            "start": 0,
            "end": 169,
            "label": {}
        },
        {
            "ix": "5-1385_v2_11@1",
            "content": "However there are a few things that we have learned that are worth sharing:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_11",
            "start": 171,
            "end": 245,
            "label": {}
        },
        {
            "ix": "5-1385_v2_12@0",
            "content": "1) Finger stick : The finger is usually the preferred site for capillary testing in an adult patient.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_12",
            "start": 0,
            "end": 100,
            "label": {}
        },
        {
            "ix": "5-1385_v2_12@1",
            "content": "When samples are collected serially it is recommended to choose a different finger from the one used for the last procedure to prevent bruising.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_12",
            "start": 102,
            "end": 245,
            "label": {}
        },
        {
            "ix": "5-1385_v2_12@2",
            "content": "The sides of the heel are only used in pediatric and neonatal patients.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_12",
            "start": 247,
            "end": 317,
            "label": {}
        },
        {
            "ix": "5-1385_v2_12@3",
            "content": "The guidance given in Section 7.1 of the WHO guidelines on blood drawing: best practices in phlebotomy, can help decide whether to use a finger or heel-stick, and with the selection of an appropriately sized lancet <REF-33> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_12",
            "start": 319,
            "end": 543,
            "label": {}
        },
        {
            "ix": "5-1385_v2_13@0",
            "content": "2) Blood volumes : The volume can be adjusted depending on the application.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_13",
            "start": 0,
            "end": 74,
            "label": {}
        },
        {
            "ix": "5-1385_v2_13@1",
            "content": "Typical yield from 50 μl of blood is the minimum about 500 ng of total RNA.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_13",
            "start": 76,
            "end": 150,
            "label": {}
        },
        {
            "ix": "5-1385_v2_13@2",
            "content": "Procedures for RNA extraction and quality control will be shared in a separate publication (Anguiano E., Rinchai D., Tomei S., Chaussabel D., unpublished report).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_13",
            "start": 152,
            "end": 313,
            "label": {}
        },
        {
            "ix": "5-1385_v2_13@3",
            "content": "A study was conducted where as little as 15 μl of blood was collected, which was sufficient to run a high throughput Fluidigm PCR assay <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_13",
            "start": 315,
            "end": 460,
            "label": {}
        },
        {
            "ix": "5-1385_v2_13@4",
            "content": "Such small blood volumes can also be obtained serially from mice, which allow longitudinal monitoring of individual animals.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_13",
            "start": 462,
            "end": 585,
            "label": {}
        },
        {
            "ix": "5-1385_v2_13@5",
            "content": "In human studies, instead of using a capillary straw small blood volumes can also be collected and measured with a micropipette.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_13",
            "start": 587,
            "end": 714,
            "label": {}
        },
        {
            "ix": "5-1385_v2_13@6",
            "content": "The blood is then placed into the microfuge tube containing the tempus solution.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_13",
            "start": 716,
            "end": 795,
            "label": {}
        },
        {
            "ix": "5-1385_v2_13@7",
            "content": "This can be done when collecting small volumes of blood from a finger stick or obtaining a small aliquot of blood from a larger venous blood draw.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_13",
            "start": 797,
            "end": 942,
            "label": {}
        },
        {
            "ix": "5-1385_v2_14@0",
            "content": "3) Volume of RNA stabilization solution : The appropriate ratio of [Blood : RNA stabilizing reagent] is 1 volume of blood for 2 volumes of tempus solution (in our case 50 μl of blood in 100 μl of RNA stabilizing reagent).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_14",
            "start": 0,
            "end": 220,
            "label": {}
        },
        {
            "ix": "5-1385_v2_14@1",
            "content": "Loss in RNA quality and quantity will be observed if this ratio is not respected.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_14",
            "start": 222,
            "end": 302,
            "label": {}
        },
        {
            "ix": "5-1385_v2_14@2",
            "content": "Collecting more blood will actually result in decreased yields and RNA quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_14",
            "start": 304,
            "end": 382,
            "label": {}
        },
        {
            "ix": "5-1385_v2_14@3",
            "content": "In cases when the amount of blood collected is lower, the volume of tempus solution can be adjusted accordingly when feasible.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_14",
            "start": 384,
            "end": 509,
            "label": {}
        },
        {
            "ix": "5-1385_v2_14@4",
            "content": "The same ratio can be used when working with mouse blood collected from the tail vein using a similar procedure (as mentioned above blood volumes can be lowered to 15 μl).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_14",
            "start": 511,
            "end": 681,
            "label": {}
        },
        {
            "ix": "5-1385_v2_14@5",
            "content": "The volumetric ratio is usually lower when working with non-human primate species (e.g. 1:3, 1:4) and should be determined on a species-by-species basis (a 1:3 ratio is used when collecting blood from macaques <REF-34> ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_14",
            "start": 683,
            "end": 903,
            "label": {}
        },
        {
            "ix": "5-1385_v2_15@0",
            "content": "4) Sample mixing : This, after maintaining an appropriate blood: tempus solution ratio, is the second most critical aspect of the procedure, and a potential cause of sample failure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_15",
            "start": 0,
            "end": 180,
            "label": {}
        },
        {
            "ix": "5-1385_v2_15@1",
            "content": "As mentioned above samples must be homogenized by thorough mixing in order to disrupt cells and release their RNA cargo.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_15",
            "start": 182,
            "end": 301,
            "label": {}
        },
        {
            "ix": "5-1385_v2_15@2",
            "content": "The RNA will precipitate in the tempus solution and in this form is protected from degradation by the RNAses that are present in the sample.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_15",
            "start": 303,
            "end": 442,
            "label": {}
        },
        {
            "ix": "5-1385_v2_16@0",
            "content": "5) Temperature : RNA should remain in a precipitated state at “room temperature”.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_16",
            "start": 0,
            "end": 80,
            "label": {}
        },
        {
            "ix": "5-1385_v2_16@1",
            "content": "Although refrigeration and freezing at the earliest possible time is recommended, based on our observations keeping the blood lysates at room temperature (25°C) for up to 24 hours should not affect RNA quality.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_16",
            "start": 82,
            "end": 291,
            "label": {}
        },
        {
            "ix": "5-1385_v2_16@2",
            "content": "Samples can be stored at 4°C (refrigerator or cold packs) for up to 48 hours, which can simplify the logistics associated with temporary storage, transfer and shipping of samples post-collection.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_16",
            "start": 293,
            "end": 487,
            "label": {}
        },
        {
            "ix": "5-1385_v2_16@3",
            "content": "Based on information provided by the manufacturer RNA should remain in a precipitated state as long as temperatures remain below 30°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_16",
            "start": 489,
            "end": 622,
            "label": {}
        },
        {
            "ix": "5-1385_v2_16@4",
            "content": "It may therefore be necessary to take precaution when working in warm climates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_16",
            "start": 624,
            "end": 702,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@0",
            "content": "6) Storage and shipping : After collecting the blood sample should be kept cold at 4°C no longer than 48 hours and transferred to a -20°C or -80°C freezer for long-term storage.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 0,
            "end": 176,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@1",
            "content": "By default, samples are stored in the lab at -20°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 178,
            "end": 228,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@2",
            "content": "Data obtained using a limited set of samples frozen overnight showed that the RNA yield for samples stored at -80°C was about half the yield of same blood samples stored at -20°C, but was nevertheless still amply sufficient for downstream analyses.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 230,
            "end": 477,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@3",
            "content": "It should also be noted that the plastic tempus tubes are made of will become brittle at temperatures lower than -20°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 479,
            "end": 597,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@4",
            "content": "The effect of storage temperature on RNA yield and quality will have to be evaluated further, especially over extended periods of time where storage at lower temperatures might show benefits (see also referees comments and our response for more details).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 599,
            "end": 852,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@5",
            "content": "Shipments are made on dry ice although for overnight shipping in cooler climates using ice packs should be sufficient (however testing using mock samples is recommended).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 854,
            "end": 1023,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@6",
            "content": "When shipping “off the shelf” tempus tubes direct contact with dry ice should be avoided to prevent breakage.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 1025,
            "end": 1133,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@7",
            "content": "When shipping on dry ice attention should be paid to the thickness of the walls of the polystyrene container holding the tubes along with the dry ice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 1135,
            "end": 1284,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@8",
            "content": "The thinner the walls the faster the shipment will run out of dry ice.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 1286,
            "end": 1355,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@9",
            "content": "This is especially important to consider when contemplating longer transit times and/or warm weather conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 1357,
            "end": 1468,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@10",
            "content": "Regarding biosafety, we have found the tempus solution to prevent growth of bacteria known for their resilience such as Burkholderia pseudomallei (Rinchai D, unpublished report), and thus conclude that threat of contamination via tempus blood lysates is likely to be low.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 1470,
            "end": 1740,
            "label": {}
        },
        {
            "ix": "5-1385_v2_17@11",
            "content": "However, appropriate testing should be carried out on a case-by-case basis and all procedures in the laboratory involving tempus lysates should be consistent with standard blood handling procedures.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_17",
            "start": 1742,
            "end": 1939,
            "label": {}
        },
        {
            "ix": "5-1385_v2_18@0",
            "content": "7) Safety : The hazardous nature of the tempus solution would make extensive roll out of the collection procedure described in this manuscript problematic and is at the moment clearly intended for research use under well controlled conditions, with preferably collection carried out by trained personnel.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_18",
            "start": 0,
            "end": 303,
            "label": {}
        },
        {
            "ix": "5-1385_v2_18@1",
            "content": "However, it should be noted that it has been-field tested for in-home self-collection in a limited number of subject over a period of 6 months without incident <REF-31> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_18",
            "start": 305,
            "end": 474,
            "label": {}
        },
        {
            "ix": "5-1385_v2_18@2",
            "content": "The fact that small volumes of solution are used may alleviate some concerns (30 microliters of solution for 15 microliters of blood in the above-mentioned study, vs 6 ml of solution for 3 ml of blood using “off the shelf” tempus collection tubes).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_18",
            "start": 476,
            "end": 723,
            "label": {}
        },
        {
            "ix": "5-1385_v2_18@3",
            "content": "However, other technical solutions in which liquids are better contained may indeed be preferable (e.g. microfluidics card, sponges), with one of the best example being the recently developed “DxCollect” system (DxTerity, Rancho Dominguez, CA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_18",
            "start": 725,
            "end": 968,
            "label": {}
        },
        {
            "ix": "5-1385_v2_19@0",
            "content": "Materials and methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_19",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "5-1385_v2_20@0",
            "content": "Reagents and equipment",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_20",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "5-1385_v2_21@0",
            "content": "- Tempus TM blood RNA tubes (ThermoFischer Scientific, Waltham, MA, USA; Product number 4342792; https://www.thermofisher.com/order/catalog/product/4342792 )",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_21",
            "start": 0,
            "end": 156,
            "label": {}
        },
        {
            "ix": "5-1385_v2_21@1",
            "content": "- Capillary blood and tube assembly, untreated, 50 μl, thin design (Kabe Labortechnik, Nümbrecht, Germany (Product number GK100, http://www.kabe-labortechnik.de/download/kapillarblut_en.pdf ) <REF-35> , <REF-36>",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_21",
            "start": 158,
            "end": 368,
            "label": {}
        },
        {
            "ix": "5-1385_v2_21@2",
            "content": "- Sterile blood lancets",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_21",
            "start": 370,
            "end": 392,
            "label": {}
        },
        {
            "ix": "5-1385_v2_21@3",
            "content": "- Alcohol pads",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_21",
            "start": 394,
            "end": 407,
            "label": {}
        },
        {
            "ix": "5-1385_v2_21@4",
            "content": "- Biohazard container",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_21",
            "start": 409,
            "end": 429,
            "label": {}
        },
        {
            "ix": "5-1385_v2_21@5",
            "content": "- Lab coat",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_21",
            "start": 431,
            "end": 440,
            "label": {}
        },
        {
            "ix": "5-1385_v2_21@6",
            "content": "- Gloves",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_21",
            "start": 442,
            "end": 449,
            "label": {}
        },
        {
            "ix": "5-1385_v2_21@7",
            "content": "- Ziploc-type biohazard bag and freezer box",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_21",
            "start": 451,
            "end": 493,
            "label": {}
        },
        {
            "ix": "5-1385_v2_21@8",
            "content": "- Adhesive bandages",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_21",
            "start": 495,
            "end": 513,
            "label": {}
        },
        {
            "ix": "5-1385_v2_21@9",
            "content": "- Sample collection tube labels",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_21",
            "start": 515,
            "end": 545,
            "label": {}
        },
        {
            "ix": "5-1385_v2_22@0",
            "content": "Preparation of sample collection tubes",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_22",
            "start": 0,
            "end": 37,
            "label": {}
        },
        {
            "ix": "5-1385_v2_23@0",
            "content": "- 1. Prepare Tempus Tube RNA stabilization into blood collection tubes ( Figure 1 ) a. Place the blood collection tubes on a rack and remove the capillary assembly and place them at the same rack. b. Put the Tempus tube on a second rack and remove the lid c. Pipette 100 ul of RNA stabilizing solution from the open tempus tube and transfer it into the blood collection tubes d. Place the capillary assembly on the collection tube. The blood collection tubes are ready for immediate use. In case the blood collection tubes are prepared for later use the lid should be closed and capillary assembly set aside. e. Store the blood collection tubes containing RNA stabilizing solution in storage box at room temperature",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_23",
            "start": 0,
            "end": 714,
            "label": {}
        },
        {
            "ix": "5-1385_v2_23@1",
            "content": "- 2. For the later use, assembly capillary tube and blood collection tubes a. Open the lid of blood collection tubes containing the RNA stabilizing solution b. Assemble the capillary assembly into the collection tubes containing the RNA stabilising solution",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_23",
            "start": 716,
            "end": 972,
            "label": {}
        },
        {
            "ix": "5-1385_v2_23@2",
            "content": "- 3. Follow the blood sample collection procedure step-by-step",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_23",
            "start": 974,
            "end": 1035,
            "label": {}
        },
        {
            "ix": "5-1385_v2_24@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_24",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "5-1385_v2_26@0",
            "content": "Precautions",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_26",
            "start": 0,
            "end": 10,
            "label": {}
        },
        {
            "ix": "5-1385_v2_27@0",
            "content": "- Personal protective equipment (PPE) must be worn to prevent accidental exposure to blood and bloodborne pathogens, and to help reduce contamination during sample collection [ http://www.cdc.gov/niosh/topics/emres/ppe.html ].",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_27",
            "start": 0,
            "end": 225,
            "label": {}
        },
        {
            "ix": "5-1385_v2_27@1",
            "content": "- Discard all blood collection materials and “sharps” in properly labeled biohazard containers approved for their disposal.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_27",
            "start": 227,
            "end": 349,
            "label": {}
        },
        {
            "ix": "5-1385_v2_27@2",
            "content": "- Check that the liquid preservatives and anticoagulants in the collection tubes are clear and colorless. Do not use any tubes if they are discolored or contain precipitates.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_27",
            "start": 351,
            "end": 524,
            "label": {}
        },
        {
            "ix": "5-1385_v2_27@3",
            "content": "- Tempus Tube RNA stabilization reagent is a potential health hazard; acute oral toxicity, skin corrosion/irritation and serious eye damage/eye irritation can occur upon contact (See MSDS for details).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_27",
            "start": 526,
            "end": 726,
            "label": {}
        },
        {
            "ix": "5-1385_v2_28@0",
            "content": "Procedures",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_28",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "5-1385_v2_29@0",
            "content": "The procedures below are illustrated in Figure 2 and a demonstration video is available here: https://www.youtube.com/watch?v=Mxc36ARxWqQ",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_29",
            "start": 0,
            "end": 136,
            "label": {}
        },
        {
            "ix": "5-1385_v2_30@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_30",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@0",
            "content": "- 1. Assemble equipment and supplies, then complete the finger stick information log by recording relevant information about blood collection such as patient name, patient identity number (patient ID), date of blood collection, frequency number of blood collection (Day 1 st , Day 7 th ... Day 90 th ,…). Double check that the label on the collection tube matches with the patient ID.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 0,
            "end": 383,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@1",
            "content": "- 2. Put on well-fitting gloves",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 385,
            "end": 415,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@2",
            "content": "- 3. Choose one of the subject’s fingers from which blood will be collected. The middle or the ring finger is the best choice for finger stick collection, ideally of the non-dominant hand. Fingers on the non-dominant hand are generally less calloused. Avoid the thumb that may be calloused and has pulse and pinkie finger that is often calloused and potentially more sensitive to pain due to additional nerve ending, fingers with thick calluses, that are injured or swollen and fingers with tight rings as they may constrict blood flow.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 417,
            "end": 952,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@3",
            "content": "- 4. Prepare the puncture site by warming the area. If the subject is particularly cold have the subject wash hands under warm water to stimulate blood flow. In addition, it may be necessary to warm the area with a moist towel for five to ten minutes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 954,
            "end": 1204,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@4",
            "content": "- 5. Wipe the fingertip with the alcohol pad and allow to air-dry completely without blowing or wiping off the alcohol.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 1206,
            "end": 1324,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@5",
            "content": "- 6. To stimulate blood flow, you may shake or gently knead the subject’s hand from palm to fingertip. Blood will also flow better if the hand is kept lower, approximately at the level of the subject’s waist.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 1326,
            "end": 1533,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@6",
            "content": "- 7. Hold finger and press lancet firmly against the side of the center of the finger, with lancet oriented perpendicular to the fingerprint grooves.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 1535,
            "end": 1683,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@7",
            "content": "- 8. Discard lancet in an appropriate container.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 1685,
            "end": 1732,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@8",
            "content": "- 9. Release pressure and allow a full drop of blood to collect on finger. If necessary, gently knead the palm only to stimulate blood flow.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 1734,
            "end": 1873,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@9",
            "content": "- 10. Wipe away the first drop of blood with a sterile gauze pad because it may be contaminated with tissue fluid or debris (sloughing skin).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 1875,
            "end": 2015,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@10",
            "content": "- 11. Collect blood sample into the capillary tube. a. Hold the capillary and micro-tube assembly horizontally, and touch the tip of the capillary to the blood drop. b. The blood will be pulled into the tube via capillary action. c. Be sure to allow the capillary to fill end-to-end to allow collection of accurate blood volume. d. To expel the sample from the capillary, place the capillary and micro-tube assembly vertically and firmly tap the bottom of the tube. Remove capillary tube together with cap assembly system and discard in the appropriate biohazard container. e. It is important to maintain the appropriate blood sample to tempus solution ratio. A volume of 50 μl of blood should be added to the 100 μl of tempus solution. If necessary the volume of solution can be adjusted to the available or desired volume of blood; e.g. for 15 μl of blood use 30 μl of tempus solution. f. Close the micro-tubes, making sure that the cap is pressed down firmly to avoid any spillage during sample homogenization. g. To prevent clotting, blood samples should be collected within 30 seconds of performing the finger stick. Clotted samples will not be usable.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 2017,
            "end": 3173,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@11",
            "content": "- 12. Have the subject apply pressure to the puncture site using sterile gauze pad until bleeding has stopped and apply a bandage. Do not use the alcohol pad as contact of an open wound with alcohol would be painful for the subject.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 3175,
            "end": 3406,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@12",
            "content": "- 13. Immediately, mix the blood sample and preservative thoroughly by holding the top of the tube between thumb and index of one hand and flicking the tube vigorously for 20 seconds with the index finger of the other hand ( Figure 2 ) . This is important because it will allow precipitation of the RNA, which is then protected from degradation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 3408,
            "end": 3752,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@13",
            "content": "- 14. If not already in place stick pre-printed label with sample information on the sample tube.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 3754,
            "end": 3850,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@14",
            "content": "- 15. Place sample tube in appropriate container (e.g. freezer box).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 3852,
            "end": 3919,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@15",
            "content": "- 16. The sample should be kept cold at 4°C no longer than 48 hours and transferred to a -20°C or -80°C freezer for long-term storage. Note that RNA integrity is still preserved when samples are kept at “room temperature” for a few hours as long as the temperature does not rise above 30°C.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 3921,
            "end": 4210,
            "label": {}
        },
        {
            "ix": "5-1385_v2_32@16",
            "content": "- 17. For local transportation samples can be kept in a freezer box containing ice or ice packs. For international shipping samples can be kept on dry ice in a freezer box.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_32",
            "start": 4212,
            "end": 4383,
            "label": {}
        },
        {
            "ix": "5-1385_v2_33@0",
            "content": "<REF-1> Banchereau R Hong S Cantarel B : Personalized Immunomonitoring Uncovers Molecular Networks that Stratify Lupus Patients. Cell. 2016 ; 165 ( 3 ): 551 – 65 . 27040498 10.1016/j.cell.2016.03.008",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_33",
            "start": 0,
            "end": 198,
            "label": {}
        },
        {
            "ix": "5-1385_v2_34@0",
            "content": "<REF-2> Chaussabel D Pulendran B : A vision and a prescription for big data-enabled medicine. Nat Immunol. 2015 ; 16 ( 5 ): 435 – 9 . 25898187 10.1038/ni.3151",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_34",
            "start": 0,
            "end": 157,
            "label": {}
        },
        {
            "ix": "5-1385_v2_35@0",
            "content": "<REF-6> Furman D Davis MM : New approaches to understanding the immune response to vaccination and infection. Vaccine. 2015 ; 33 ( 40 ): 5271 – 81 . 26232539 10.1016/j.vaccine.2015.06.117 4581990",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_35",
            "start": 0,
            "end": 194,
            "label": {}
        },
        {
            "ix": "5-1385_v2_36@0",
            "content": "<REF-7> Nielsen T Wallden B Schaper C : Analytical validation of the PAM50-based Prosigna Breast Cancer Prognostic Gene Signature Assay and nCounter Analysis System using formalin-fixed paraffin-embedded breast tumor specimens. BMC Cancer. 2014 ; 14 : 177 . 24625003 10.1186/1471-2407-14-177 4008304",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_36",
            "start": 0,
            "end": 298,
            "label": {}
        },
        {
            "ix": "5-1385_v2_37@0",
            "content": "<REF-8> Ramilo O Allman W Chung W : Gene expression patterns in blood leukocytes discriminate patients with acute infections. Blood. 2007 ; 109 ( 5 ): 2066 – 77 . 17105821 10.1182/blood-2006-02-002477 1801073",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_37",
            "start": 0,
            "end": 207,
            "label": {}
        },
        {
            "ix": "5-1385_v2_38@0",
            "content": "<REF-11> Tang BM McLean AS Dawes IW : Gene-expression profiling of peripheral blood mononuclear cells in sepsis. Crit Care Med. 2009 ; 37 ( 3 ): 882 – 8 . 19237892 10.1097/CCM.0b013e31819b52fd",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_38",
            "start": 0,
            "end": 191,
            "label": {}
        },
        {
            "ix": "5-1385_v2_39@0",
            "content": "<REF-12> Mejias A Dimo B Suarez NM : Whole blood gene expression profiles to assess pathogenesis and disease severity in infants with respiratory syncytial virus infection. PLoS Med. 2013 ; 10 ( 11 ): e1001549 . 24265599 10.1371/journal.pmed.1001549 3825655",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_39",
            "start": 0,
            "end": 256,
            "label": {}
        },
        {
            "ix": "5-1385_v2_40@0",
            "content": "<REF-13> Berry MP Graham CM McNab FW : An interferon-inducible neutrophil-driven blood transcriptional signature in human tuberculosis. Nature. 2010 ; 466 ( 7309 ): 973 – 7 . 20725040 10.1038/nature09247 3492754",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_40",
            "start": 0,
            "end": 210,
            "label": {}
        },
        {
            "ix": "5-1385_v2_41@0",
            "content": "<REF-15> Newell KA Asare A Kirk AD : Identification of a B cell signature associated with renal transplant tolerance in humans. J Clin Invest. 2010 ; 120 ( 6 ): 1836 – 47 . 20501946 10.1172/JCI39933 2877933",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_41",
            "start": 0,
            "end": 205,
            "label": {}
        },
        {
            "ix": "5-1385_v2_42@0",
            "content": "<REF-16> Obermoser G Presnell S Domico K : Systems scale interactive exploration reveals quantitative and qualitative differences in response to influenza and pneumococcal vaccines. Immunity. 2013 ; 38 ( 4 ): 831 – 44 . 23601689 10.1016/j.immuni.2012.12.008 3681204",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_42",
            "start": 0,
            "end": 264,
            "label": {}
        },
        {
            "ix": "5-1385_v2_43@0",
            "content": "<REF-19> Oswald M Curran ME Lamberth SL : Modular analysis of peripheral blood gene expression in rheumatoid arthritis captures reproducible gene expression changes in tumor necrosis factor responders. Arthritis Rheumatol. 2015 ; 67 ( 2 ): 344 – 51 . 25371395 10.1002/art.38947 4476407",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_43",
            "start": 0,
            "end": 284,
            "label": {}
        },
        {
            "ix": "5-1385_v2_44@0",
            "content": "<REF-20> Querec TD Akondy RS Lee EK : Systems biology approach predicts immunogenicity of the yellow fever vaccine in humans. Nat Immunol. 2009 ; 10 ( 1 ): 116 – 25 . 19029902 10.1038/ni.1688 4049462",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_44",
            "start": 0,
            "end": 198,
            "label": {}
        },
        {
            "ix": "5-1385_v2_45@0",
            "content": "<REF-21> Jourde-Chiche N Chiche L Chaussabel D : Introducing a New Dimension to Molecular Disease Classifications. Trends Mol Med. 2016 ; 22 ( 6 ): 451 – 53 , pii: S1471-4914(16)30009-0. 27161597 10.1016/j.molmed.2016.04.005",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_45",
            "start": 0,
            "end": 223,
            "label": {}
        },
        {
            "ix": "5-1385_v2_46@0",
            "content": "<REF-22> Kaizer EC Glaser CL Chaussabel D : Gene expression in peripheral blood mononuclear cells from children with diabetes. J Clin Endocrinol Metab. 2007 ; 92 ( 9 ): 3705 – 11 . 17595242 10.1210/jc.2007-0979",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_46",
            "start": 0,
            "end": 209,
            "label": {}
        },
        {
            "ix": "5-1385_v2_47@0",
            "content": "<REF-23> Allantaz F Chaussabel D Stichweh D : Blood leukocyte microarrays to diagnose systemic onset juvenile idiopathic arthritis and follow the response to IL-1 blockade. J Exp Med. 2007 ; 204 ( 9 ): 2131 – 44 . 17724127 10.1084/jem.20070070 2118700",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_47",
            "start": 0,
            "end": 250,
            "label": {}
        },
        {
            "ix": "5-1385_v2_48@0",
            "content": "<REF-24> Debey-Pascher S Eggle D Schultze JL : RNA stabilization of peripheral blood and profiling by bead chip analysis. Methods Mol Biol. 2009 ; 496 : 175 – 210 . 18839112 10.1007/978-1-59745-553-4_13",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_48",
            "start": 0,
            "end": 201,
            "label": {}
        },
        {
            "ix": "5-1385_v2_49@0",
            "content": "<REF-25> Asare AL Kolchinsky SA Gao Z : Differential gene expression profiles are dependent upon method of peripheral blood collection and RNA isolation. BMC Genomics. 2008 ; 9 : 474 . 18847473 10.1186/1471-2164-9-474 2573897",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_49",
            "start": 0,
            "end": 224,
            "label": {}
        },
        {
            "ix": "5-1385_v2_50@0",
            "content": "<REF-27> Häntzsch M Tolios A Beutner F : Comparison of whole blood RNA preservation tubes and novel generation RNA extraction kits for analysis of mRNA and MiRNA profiles. PLoS One. 2014 ; 9 ( 12 ): e113298 . 25469788 10.1371/journal.pone.0113298 4254602",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_50",
            "start": 0,
            "end": 253,
            "label": {}
        },
        {
            "ix": "5-1385_v2_51@0",
            "content": "<REF-28> Pankla R Buddhisa S Berry M : Genomic transcriptional profiling identifies a candidate blood biomarker signature for the diagnosis of septicemic melioidosis. Genome Biol. 2009 ; 10 ( 11 ): R127 . 19903332 10.1186/gb-2009-10-11-r127 3091321",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_51",
            "start": 0,
            "end": 247,
            "label": {}
        },
        {
            "ix": "5-1385_v2_52@0",
            "content": "<REF-29> Robison EH Mondala TS Williams AR : Whole genome transcript profiling from fingerstick blood samples: a comparison and feasibility study. BMC Genomics. 2009 ; 10 : 617 . 20017944 10.1186/1471-2164-10-617 2811129",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_52",
            "start": 0,
            "end": 219,
            "label": {}
        },
        {
            "ix": "5-1385_v2_53@0",
            "content": "<REF-30> Rinchai D Anguiano E Nguyen P : Finger stick blood collection for gene expression profiling and storage of tempus blood RNA tubes [version 1; referees: 3 approved with reservations]. F1000Research. 2016 ; 5 : 1385 . 10.12688/f1000research.8841.1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_53",
            "start": 0,
            "end": 253,
            "label": {}
        },
        {
            "ix": "5-1385_v2_54@0",
            "content": "<REF-31> Speake C Whalen E Gersuk VH : Longitudinal Monitoring of Gene Expression in Ultra-Low Volume Blood Samples Self-Collected at Home. Clin Exp Immunol. 2016 . 28009047 10.1111/cei.12916",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_54",
            "start": 0,
            "end": 190,
            "label": {}
        },
        {
            "ix": "5-1385_v2_55@0",
            "content": "<REF-32> Duale N Lipkin WI Briese T : Long-term storage of blood RNA collected in RNA stabilizing Tempus tubes in a large biobank--evaluation of RNA quality and stability. BMC Res Notes. 2014 ; 7 : 633 . 25214016 10.1186/1756-0500-7-633 4168124",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_55",
            "start": 0,
            "end": 243,
            "label": {}
        },
        {
            "ix": "5-1385_v2_56@0",
            "content": "<REF-33> WHO Guidelines Approved by the Guidelines Review Committee : WHO Guidelines on Drawing Blood: Best Practices in Phlebotomy. Geneva, 2010 . 23741774",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_56",
            "start": 0,
            "end": 155,
            "label": {}
        },
        {
            "ix": "5-1385_v2_57@0",
            "content": "<REF-34> Skinner JA Zurawski SM Sugimoto C : Immunologic characterization of a rhesus macaque H1N1 challenge model for candidate influenza virus vaccine assessment. Clin Vaccine Immunol. 2014 ; 21 ( 12 ): 1668 – 80 . 25298110 10.1128/CVI.00547-14 4248778",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "5-1385_v2_57",
            "start": 0,
            "end": 253,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "5-1385_v2_0",
            "tgt_ix": "5-1385_v2_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_1",
            "tgt_ix": "5-1385_v2_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_0",
            "tgt_ix": "5-1385_v2_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_3",
            "tgt_ix": "5-1385_v2_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_3",
            "tgt_ix": "5-1385_v2_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_3",
            "tgt_ix": "5-1385_v2_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_3",
            "tgt_ix": "5-1385_v2_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_3",
            "tgt_ix": "5-1385_v2_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_0",
            "tgt_ix": "5-1385_v2_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_19",
            "tgt_ix": "5-1385_v2_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_20",
            "tgt_ix": "5-1385_v2_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_0",
            "tgt_ix": "5-1385_v2_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_22",
            "tgt_ix": "5-1385_v2_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_22",
            "tgt_ix": "5-1385_v2_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_24",
            "tgt_ix": "5-1385_v2_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_0",
            "tgt_ix": "5-1385_v2_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_26",
            "tgt_ix": "5-1385_v2_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_0",
            "tgt_ix": "5-1385_v2_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_28",
            "tgt_ix": "5-1385_v2_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_28",
            "tgt_ix": "5-1385_v2_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_30",
            "tgt_ix": "5-1385_v2_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_28",
            "tgt_ix": "5-1385_v2_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_0",
            "tgt_ix": "5-1385_v2_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_1",
            "tgt_ix": "5-1385_v2_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_2",
            "tgt_ix": "5-1385_v2_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_3",
            "tgt_ix": "5-1385_v2_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_4",
            "tgt_ix": "5-1385_v2_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_7",
            "tgt_ix": "5-1385_v2_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_9",
            "tgt_ix": "5-1385_v2_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_11",
            "tgt_ix": "5-1385_v2_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_12",
            "tgt_ix": "5-1385_v2_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_13",
            "tgt_ix": "5-1385_v2_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_14",
            "tgt_ix": "5-1385_v2_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_15",
            "tgt_ix": "5-1385_v2_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_16",
            "tgt_ix": "5-1385_v2_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_18",
            "tgt_ix": "5-1385_v2_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_19",
            "tgt_ix": "5-1385_v2_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_20",
            "tgt_ix": "5-1385_v2_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_22",
            "tgt_ix": "5-1385_v2_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_23",
            "tgt_ix": "5-1385_v2_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_24",
            "tgt_ix": "5-1385_v2_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_25",
            "tgt_ix": "5-1385_v2_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_26",
            "tgt_ix": "5-1385_v2_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_27",
            "tgt_ix": "5-1385_v2_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_28",
            "tgt_ix": "5-1385_v2_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_29",
            "tgt_ix": "5-1385_v2_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_30",
            "tgt_ix": "5-1385_v2_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_31",
            "tgt_ix": "5-1385_v2_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_33",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_34",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_35",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_36",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_37",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_38",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_39",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_40",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_41",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_42",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_43",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_44",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_45",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_46",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_48",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_49",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_50",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_51",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_52",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_53",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_54",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_55",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_12",
            "tgt_ix": "5-1385_v2_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_14",
            "tgt_ix": "5-1385_v2_57",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_29",
            "tgt_ix": "5-1385_v2_31",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "5-1385_v2_0",
            "tgt_ix": "5-1385_v2_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_1",
            "tgt_ix": "5-1385_v2_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_2",
            "tgt_ix": "5-1385_v2_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_2",
            "tgt_ix": "5-1385_v2_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_2",
            "tgt_ix": "5-1385_v2_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_2",
            "tgt_ix": "5-1385_v2_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_2",
            "tgt_ix": "5-1385_v2_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_2",
            "tgt_ix": "5-1385_v2_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_2",
            "tgt_ix": "5-1385_v2_2@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_3",
            "tgt_ix": "5-1385_v2_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_4",
            "tgt_ix": "5-1385_v2_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_4",
            "tgt_ix": "5-1385_v2_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_5@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_5@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_5@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_5@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_5",
            "tgt_ix": "5-1385_v2_5@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@14",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@15",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@16",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@17",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@18",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@19",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_6",
            "tgt_ix": "5-1385_v2_6@20",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_7",
            "tgt_ix": "5-1385_v2_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_7",
            "tgt_ix": "5-1385_v2_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_7",
            "tgt_ix": "5-1385_v2_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_7",
            "tgt_ix": "5-1385_v2_7@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_8",
            "tgt_ix": "5-1385_v2_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_9",
            "tgt_ix": "5-1385_v2_9@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_9",
            "tgt_ix": "5-1385_v2_9@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_9",
            "tgt_ix": "5-1385_v2_9@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_10@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_10@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_10@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_10@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_10",
            "tgt_ix": "5-1385_v2_10@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_11",
            "tgt_ix": "5-1385_v2_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_11",
            "tgt_ix": "5-1385_v2_11@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_12",
            "tgt_ix": "5-1385_v2_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_12",
            "tgt_ix": "5-1385_v2_12@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_12",
            "tgt_ix": "5-1385_v2_12@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_12",
            "tgt_ix": "5-1385_v2_12@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_13",
            "tgt_ix": "5-1385_v2_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_13",
            "tgt_ix": "5-1385_v2_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_13",
            "tgt_ix": "5-1385_v2_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_13",
            "tgt_ix": "5-1385_v2_13@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_13",
            "tgt_ix": "5-1385_v2_13@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_13",
            "tgt_ix": "5-1385_v2_13@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_13",
            "tgt_ix": "5-1385_v2_13@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_13",
            "tgt_ix": "5-1385_v2_13@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_14",
            "tgt_ix": "5-1385_v2_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_14",
            "tgt_ix": "5-1385_v2_14@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_14",
            "tgt_ix": "5-1385_v2_14@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_14",
            "tgt_ix": "5-1385_v2_14@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_14",
            "tgt_ix": "5-1385_v2_14@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_14",
            "tgt_ix": "5-1385_v2_14@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_15",
            "tgt_ix": "5-1385_v2_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_15",
            "tgt_ix": "5-1385_v2_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_15",
            "tgt_ix": "5-1385_v2_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_16",
            "tgt_ix": "5-1385_v2_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_16",
            "tgt_ix": "5-1385_v2_16@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_16",
            "tgt_ix": "5-1385_v2_16@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_16",
            "tgt_ix": "5-1385_v2_16@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_16",
            "tgt_ix": "5-1385_v2_16@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_17",
            "tgt_ix": "5-1385_v2_17@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_18",
            "tgt_ix": "5-1385_v2_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_18",
            "tgt_ix": "5-1385_v2_18@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_18",
            "tgt_ix": "5-1385_v2_18@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_18",
            "tgt_ix": "5-1385_v2_18@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_19",
            "tgt_ix": "5-1385_v2_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_20",
            "tgt_ix": "5-1385_v2_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_21@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_21@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_21@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_21@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_21@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_21@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_21@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_21@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_21@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_21",
            "tgt_ix": "5-1385_v2_21@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_22",
            "tgt_ix": "5-1385_v2_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_23",
            "tgt_ix": "5-1385_v2_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_23",
            "tgt_ix": "5-1385_v2_23@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_23",
            "tgt_ix": "5-1385_v2_23@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_24",
            "tgt_ix": "5-1385_v2_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_26",
            "tgt_ix": "5-1385_v2_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_27",
            "tgt_ix": "5-1385_v2_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_27",
            "tgt_ix": "5-1385_v2_27@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_27",
            "tgt_ix": "5-1385_v2_27@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_27",
            "tgt_ix": "5-1385_v2_27@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_28",
            "tgt_ix": "5-1385_v2_28@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_29",
            "tgt_ix": "5-1385_v2_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_30",
            "tgt_ix": "5-1385_v2_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@12",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@13",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@14",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@15",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_32",
            "tgt_ix": "5-1385_v2_32@16",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_33",
            "tgt_ix": "5-1385_v2_33@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_34",
            "tgt_ix": "5-1385_v2_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_35",
            "tgt_ix": "5-1385_v2_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_36",
            "tgt_ix": "5-1385_v2_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_37",
            "tgt_ix": "5-1385_v2_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_38",
            "tgt_ix": "5-1385_v2_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_39",
            "tgt_ix": "5-1385_v2_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_40",
            "tgt_ix": "5-1385_v2_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_41",
            "tgt_ix": "5-1385_v2_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_42",
            "tgt_ix": "5-1385_v2_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_43",
            "tgt_ix": "5-1385_v2_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_44",
            "tgt_ix": "5-1385_v2_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_45",
            "tgt_ix": "5-1385_v2_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_46",
            "tgt_ix": "5-1385_v2_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_47",
            "tgt_ix": "5-1385_v2_47@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_48",
            "tgt_ix": "5-1385_v2_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_49",
            "tgt_ix": "5-1385_v2_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_50",
            "tgt_ix": "5-1385_v2_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_51",
            "tgt_ix": "5-1385_v2_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_52",
            "tgt_ix": "5-1385_v2_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_53",
            "tgt_ix": "5-1385_v2_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_54",
            "tgt_ix": "5-1385_v2_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_55",
            "tgt_ix": "5-1385_v2_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_56",
            "tgt_ix": "5-1385_v2_56@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "5-1385_v2_57",
            "tgt_ix": "5-1385_v2_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "5-1385_v2",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.8841.2",
        "atype": "research-note",
        "license": "http://creativecommons.org/licenses/by/4.0/",
        "title": "Finger stick blood collection for gene expression profiling and storage of tempus blood RNA tubes",
        "abstract": "With this report we aim to make available a standard operating procedure (SOP) developed for RNA stabilization of small blood volumes collected via a finger stick. The anticipation that this procedure may be improved through peer-review and/or readers public comments is another element motivating the publication of this SOP. Procuring blood samples from human subjects can, among other uses, enable assessment of the immune status of an individual subject via the profiling of RNA abundance using technologies such as real time PCR, NanoString, microarrays or RNA-sequencing. It is often desirable to minimize blood volumes and employ methods that are the least invasive and can be practically implemented outside of clinical settings. Finger stick blood samples are increasingly used for measurement of levels of pharmacological drugs and biological analytes. It is a simple and convenient procedure amenable for instance to field use or self-collection at home using a blood sample collection kit. Such methodologies should also enable the procurement of blood samples at high frequency for health or disease monitoring applications.",
        "contributors": [
            {
                "surname": "Rinchai",
                "given-names": "Darawan"
            },
            {
                "surname": "Anguiano",
                "given-names": "Esperanza"
            },
            {
                "surname": "Nguyen",
                "given-names": "Phuong"
            },
            {
                "surname": "Chaussabel",
                "given-names": "Damien"
            }
        ],
        "url": "https://f1000research.com/articles/5-1385/v2/",
        "doc_id": "5-1385",
        "version": 2,
        "ix_counter": 282,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}