{
    "nodes": [
        {
            "ix": "2-58_v1_0",
            "content": "The Binding Ring Illusion: assimilation affects the perceived size of a circular array",
            "ntype": "article-title",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_1",
            "content": "Abstract",
            "ntype": "abstract",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_2",
            "content": "Our perception of an object’s size arises from the integration of multiple sources of visual information including retinal size, perceived distance and its size relative to other objects in the visual field. This constructive process is revealed through a number of classic size illusions such as the Delboeuf Illusion, the Ebbinghaus Illusion and others illustrating size constancy. Here we present a novel variant of the Delbouef and Ebbinghaus size illusions that we have named the Binding Ring Illusion. The illusion is such that the perceived size of a circular array of elements is underestimated when superimposed by a circular contour – a binding ring – and overestimated when the binding ring slightly exceeds the overall size of the array. Here we characterize the stimulus conditions that lead to the illusion, and the perceptual principles that underlie it. Our findings indicate that the perceived size of an array is susceptible to the assimilation of an explicitly defined superimposed contour. Our results also indicate that the assimilation process takes place at a relatively high level in the visual processing stream, after different spatial frequencies have been integrated and global shape has been constructed. We hypothesize that the Binding Ring Illusion arises due to the fact that the size of an array of elements is not explicitly defined and therefore can be influenced (through a process of assimilation) by the presence of a superimposed object that does have an explicit size.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_3",
            "content": "Introduction",
            "ntype": "title",
            "meta": {
                "section": "1",
                "sec-type": "intro",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_4",
            "content": "Correctly perceiving the size of objects is essential to successfully interact with the world around us. Due to the fact that we sense the 3D visual world through an analysis of 2D retinal images, the process of size perception is intrinsically ambiguous. As a result, the perception of an object’s size arises from the integration of multiple sources of visual information including the size of its retinal image, its perceived distance <REF-1> , and its size relative to other objects in the visual scene <REF-2> , <REF-3> . These constructive processes are revealed through a number of classic size illusions such as the Ebbinghaus Illusion <REF-4> ( Figure 1A ) and the Delboeuf Illusion <REF-5> , <REF-6> ( Figure 1B ). In each of these illusions, the perceived size of an explicitly defined object (the inner circle) is influenced by the context in which it is presented. Here we address the question of how we perceive the size of an implicitly defined object–an array of elements–by introducing a novel variant of the Ebbinghaus illusion that we have named the Binding Ring Illusion. We describe the illusion and investigate the underlying mechanisms that lead to misperceived size.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_5",
            "content": "Figure 1.",
            "ntype": "label",
            "meta": {
                "id": "f1",
                "caption": "Notable size illusions: A ) Ebbinghaus illusion, B ) Delboeuf illusion.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_6",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f1\" position=\"float\"> <caption> <p>Notable size illusions: <bold>A</bold>) Ebbinghaus illusion, <bold>B</bold>) Delboeuf illusion.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure1.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f1",
                "caption": "Notable size illusions: A ) Ebbinghaus illusion, B ) Delboeuf illusion.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure1.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_7",
            "content": "A basic stimulus that elicits perception of the Binding Ring Illusion is composed of a circular array of small circles onto which a larger circle is superimposed as shown in Figure 2A . The superimposed circle leads to an underestimation of the perceived radius of the circular array relative to an equally sized array without the binding ring ( Figure 2B ). In the following experiments, we investigate the magnitude of this illusory decrease in size and attempt to study the components of the stimulus that are responsible for the observed effect.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_8",
            "content": "Figure 2.",
            "ntype": "label",
            "meta": {
                "id": "f2",
                "caption": "The Binding Ring Illusion. Which array of circles looks bigger? A ) The test stimulus used in experiment 1 or B ) The reference stimulus used in experiment 1.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_9",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f2\" position=\"float\"> <caption> <title>The Binding Ring Illusion.</title> <p>Which array of circles looks bigger? <bold>A</bold>) The test stimulus used in experiment 1 or <bold>B</bold>) The reference stimulus used in experiment 1.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure2.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f2",
                "caption": "The Binding Ring Illusion. Which array of circles looks bigger? A ) The test stimulus used in experiment 1 or B ) The reference stimulus used in experiment 1.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure2.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_10",
            "content": "In experiment 1, we demonstrate that the effect of the binding ring can be quantified. In experiment 2 we demonstrate that the illusion arises due to assimilation toward the binding ring <REF-7> , <REF-8> . In experiment 3, we investigated the effect of spatial frequency. Finally, in experiments 4a and 4b we investigated the roles of local configural features in producing the illusion.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_11",
            "content": "General methods",
            "ntype": "title",
            "meta": {
                "section": "2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_12",
            "content": "Participants",
            "ntype": "title",
            "meta": {
                "section": "2.1",
                "sec-type": "subjects",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_13",
            "content": "Five observers (3 men, 2 women; age range: 18–25; mean age = 20.2) participated in experiment 1, ten observers participated in experiment 2 (4 men, 6 women; age range: 19–28; mean age = 22.4), twelve observers participated in experiment 3 (6 men, 6 women; age range: 18–27; M = 21.75) and five observers participated in experiment 4 (3 men, 2 women; age range: 18–25; M = 20.6). All participants were naïve to the aims of the experiments, reported normal or corrected-to-normal vision and received course credit for their participation. Prior to participating, each observer provided informed consent according to the guidelines of the Department of Psychology and the IRB of the University of Nevada, Reno.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_14",
            "content": "Apparatus and display",
            "ntype": "title",
            "meta": {
                "section": "2.2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_15",
            "content": "Stimuli were presented on a Dell Trinitron P991 monitor (19 inches, 1024 × 768) with an 85 Hz refresh rate. The stimulus computer was a 2.4 GHz Mac Mini with an NVIDIA GeForce 320M graphics processor (256MB of DDR3 SDRAM). Stimuli were created and presented with the Psychophysics Toolbox <REF-9> for MATLAB (Mathworks Inc., Natick, MA). In experiments 1, 2 and 4, the stimuli were white (120 cd/m 2 ) presented on a black (0.06 cd/m 2 ) background. In experiment 3, the stimuli were either low- or high-pass filtered and presented on a grey background (20.5 cd/m 2 ). Luminance values were measured with a Photo Research PR655 spectroradiometer. Participants placed their head on a chin rest and viewed the stimuli binocularly from a distance of 57cm.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_16",
            "content": "Experiment 1",
            "ntype": "title",
            "meta": {
                "section": "3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_17",
            "content": "The goal of experiment 1 was to establish a ‘standard’ configuration and quantify the magnitude of the illusion in order to serve as a baseline for further testing. Specifically, we sought to measure the perceived reduction in size of an array superimposed with a binding ring compared to an unbound array of equal size.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_18",
            "content": "Stimuli and procedures",
            "ntype": "title",
            "meta": {
                "section": "3.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_19",
            "content": "The basic paradigm is illustrated in Figure 3 . On a given trial, participants were presented with a small central fixation point (0.35º) for 500ms, followed by the additional simultaneous presentation of two circular arrays (a reference and a test) for 500ms at which point the stimuli were removed from the screen and replaced by a random noise mask displayed for 500ms to discourage afterimages. Participants indicated by pressing one of two buttons (two-alternative forced choice; AFC), which of the two stimuli had appeared larger. Each array consisted of 12 small equally spaced circles with radii of 0.05º visual angle. On every trial, the reference array had a fixed radius of 3º visual angle (from the center of the array to the center of any circular element). Using the method of constant stimuli <REF-10> , we investigated the perceived size of each of two test arrays compared to the reference array. The test array either had a binding ring superimposed or did not (the lack of a binding ring served as a control condition). In non-control conditions the binding ring had a radius selected to match the radius of the test circular array that was measured from the center of the array to the center of one of the smaller component circles. Because the control array did not have a superimposed binding ring it was identical to the reference array in all ways except its trial-by-trial size. As such, it was used to determine A) how accurately observers were able to perform the task (discriminate the sizes of the arrays) and B) to serve as a point of comparison for determining the size of the illusory effect. On each trial, the radius of the test array was selected from the following list: 2.5º, 2.6º, 2.8º, 2.9º, 3.0º, 3.1º, 3.3º, 3.4º and 3.5º.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_20",
            "content": "Figure 3.",
            "ntype": "label",
            "meta": {
                "id": "f3",
                "caption": "Schematic diagram of a trial in experiment 1. A fixation point appeared for 500ms followed by the presentation of the reference and test array for 500ms at which point the stimuli were removed from the screen and replaced by a noise mask for another 500ms to prevent the formation of afterimages. The screen then remained blank until participants indicated which array appeared larger via a key press.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_21",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f3\" position=\"float\"> <caption> <title>Schematic diagram of a trial in experiment 1.</title> <p>A fixation point appeared for 500ms followed by the presentation of the reference and test array for 500ms at which point the stimuli were removed from the screen and replaced by a noise mask for another 500ms to prevent the formation of afterimages. The screen then remained blank until participants indicated which array appeared larger via a key press.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure3.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f3",
                "caption": "Schematic diagram of a trial in experiment 1. A fixation point appeared for 500ms followed by the presentation of the reference and test array for 500ms at which point the stimuli were removed from the screen and replaced by a noise mask for another 500ms to prevent the formation of afterimages. The screen then remained blank until participants indicated which array appeared larger via a key press.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure3.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_22",
            "content": "On each trial, the centers of the two arrays were randomly positioned within a circular radius of 1.16º of visual angle centered 6.75º along the horizontal axis to the left or right of the central fixation point. This positional-jitter was used to prevent observers from basing their judgments on horizontal matching or distance comparisons with the edges of the monitor. Participants were instructed to maintain fixation on the center of the screen throughout the experiment. The sides on which the two arrays were presented were randomly determined on each trial. In total there were 18 trial types: nine test radii for both the test and control array types. Trials were pseudo-randomly ordered such that 20 of each trial type were presented in random order for a total of 360 trials. Prior to the experiment, participants were trained on 20 trials of the largest and smallest test array sizes that were not included in the analyses.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_23",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "3.2",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_24",
            "content": "For each array size, we computed the percentage of times the test or control array was perceived to be larger than the reference. Thus, for the test (bound) and control (unbound) arrays, nine values (one for each radius) were calculated. Because the 2AFC task has two categorical responses, the following sigmoidal-shaped binomial-logit function was then fit to the corresponding data for each of the two test arrays using the MATLAB (glmfit() command) <REF-11> :",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_25",
            "content": "f ( x ) = 100 × [ e b 1 + x b 2 1 + e b 1 + x b 2 ]",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_26",
            "content": "The points of subjective equality (PSE) were determined for each subject by interpolating the 50% chance level from the function fit to the data ( x = – b 1 / b 2 ). The PSE indicates the size the test array needs to be in order to be perceived as equal in size to the reference. The resulting curves plotted for the mean responses across participants are shown in Figure 4 . The clear and steep-sloped sigmoidal shaped psychometric curve derived from the control condition in which neither the reference nor control array have a binding ring confirm that participants were able to perform the task and accurately report their perceptions. Specifically, participants were at chance performance when the two arrays were indeed the same size. The rightward shift of the other psychometric curve, derived from the test (binding ring) condition, demonstrates that the size of the array was underestimated when the binding ring was present. The inset of Figure 4 illustrates the mean points of subjective equality across subjects for the test and control arrays.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_27",
            "content": "Figure 4.",
            "ntype": "label",
            "meta": {
                "id": "f4",
                "caption": "Results of experiment 1. Psychometric curves indicate the mean fit of the data averaged across all participants. The inset of the figure illustrates the mean points of subjective equality (PSEs) for the test and reference stimuli. The black curve indicates that participants were accurately judging the radius of an unbound array. The grey curve shows that the array radius must increase by ~0.18º to be perceived as being the same size as an unbound array. Thick curves with error bars indicate the mean response across participants for each array radius. Thin curves indicate the function fitted to the data. Error bars represent the standard error of the mean PSE computed across subject.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_28",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f4\" position=\"float\"> <caption> <title>Results of experiment 1.</title> <p>Psychometric curves indicate the mean fit of the data averaged across all participants. The inset of the figure illustrates the mean points of subjective equality (PSEs) for the test and reference stimuli. The black curve indicates that participants were accurately judging the radius of an unbound array. The grey curve shows that the array radius must increase by ~0.18&#186; to be perceived as being the same size as an unbound array. Thick curves with error bars indicate the mean response across participants for each array radius. Thin curves indicate the function fitted to the data. Error bars represent the standard error of the mean PSE computed across subject.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure4.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f4",
                "caption": "Results of experiment 1. Psychometric curves indicate the mean fit of the data averaged across all participants. The inset of the figure illustrates the mean points of subjective equality (PSEs) for the test and reference stimuli. The black curve indicates that participants were accurately judging the radius of an unbound array. The grey curve shows that the array radius must increase by ~0.18º to be perceived as being the same size as an unbound array. Thick curves with error bars indicate the mean response across participants for each array radius. Thin curves indicate the function fitted to the data. Error bars represent the standard error of the mean PSE computed across subject.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure4.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_29",
            "content": "A paired t-test between the PSEs of the test and control arrays revealed that the addition of the binding ring significantly ( t (4) = 7.71, p < 0.01) reduced the perceived size of the test array. The mean difference of the PSEs between the test and control arrays was ~ 0.18º of visual angle or 6% of the overall radius of the array. Thus, an array superimposed with a binding ring of radius 3.18º was perceived as having the same size as a no-binding ring array with a radius of 3º. This is comparable in magnitude to underestimation effects observed in the classic Ebbinghaus and Delbeouf Illusions <REF-12> , <REF-13> .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_30",
            "content": "Experiment 2",
            "ntype": "title",
            "meta": {
                "section": "4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_31",
            "content": "Having quantified the magnitude of the illusion in experiment 1, we explored possible mechanisms contributing to the underestimation of perceived size. Size illusions such as the Delboeuf and Ebbinghaus illusions have been explained on the basis of size assimilation (when the size of the element of interest is biased toward the reference component) and contrast (when the size of the element of interest is biased away from the reference component) <REF-7> , <REF-8> , <REF-14> , <REF-15> . Because the size of an array is not explicitly defined, it remains unclear whether the illusion arises due to assimilation or contrast with the binding ring. In order to determine if the illusion is mediated by assimilation or contrast we investigated the effect of changing the size of the binding ring (bottom of Figure 5 ). If assimilation is responsible for the effect, we would predict that the magnitude of the illusion should increase as the binding ring gets smaller . Alternatively, if the illusion arises due to contrast, the magnitude of the illusion should increase as the binding ring gets larger .",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_32",
            "content": "Figure 5.",
            "ntype": "label",
            "meta": {
                "id": "f5",
                "caption": "Stimuli and results of experiment 2. The radius of the binding rings from left to right: 2º, 2.67º, 3º, 3.33º and 4º; circular array radius was consistently 3º. The graph illustrates the PSEs for each stimulus type: lines and asterisks below the bars indicate significant (p < 0.05) differences, based on post-hoc paired t-tests, between the three overlapping binding ring conditions. Superimposed asterisks indicate significant changes in perceived size induced by the presence of the binding ring compared to an array without a binding ring (observed for all five conditions). A positive shift on the ordinate axis indicates that the array must increase in size to be perceived as having the same radius as the reference and vice versa. Error bars indicate standard error of the mean.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_33",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f5\" position=\"float\"> <caption> <title>Stimuli and results of experiment 2.</title> <p>The radius of the binding rings from left to right: 2&#186;, 2.67&#186;, 3&#186;, 3.33&#186; and 4&#186;; circular array radius was consistently 3&#186;. The graph illustrates the PSEs for each stimulus type: lines and asterisks below the bars indicate significant (p &lt; 0.05) differences, based on post-hoc paired t-tests, between the three overlapping binding ring conditions. Superimposed asterisks indicate significant changes in perceived size induced by the presence of the binding ring compared to an array without a binding ring (observed for all five conditions). A positive shift on the ordinate axis indicates that the array must increase in size to be perceived as having the same radius as the reference and vice versa. Error bars indicate standard error of the mean.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure5.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f5",
                "caption": "Stimuli and results of experiment 2. The radius of the binding rings from left to right: 2º, 2.67º, 3º, 3.33º and 4º; circular array radius was consistently 3º. The graph illustrates the PSEs for each stimulus type: lines and asterisks below the bars indicate significant (p < 0.05) differences, based on post-hoc paired t-tests, between the three overlapping binding ring conditions. Superimposed asterisks indicate significant changes in perceived size induced by the presence of the binding ring compared to an array without a binding ring (observed for all five conditions). A positive shift on the ordinate axis indicates that the array must increase in size to be perceived as having the same radius as the reference and vice versa. Error bars indicate standard error of the mean.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure5.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_34",
            "content": "Stimuli and procedures",
            "ntype": "title",
            "meta": {
                "section": "4.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_35",
            "content": "The basic stimuli were the same as those used in experiment 1; however, due to the larger number of configurations tested, we used staircase procedures <REF-16> rather than the method of constant stimuli. The individual trials within the staircases again consisted of a reference and test array simultaneously presented for 500ms. As in the previous experiment, the reference array had a fixed radius of 3º; however, unlike the previous experiment, the reference contained a binding ring and the test array did not. This was done so as to be able to compare the magnitude of the illusion for a fixed size array across binding-ring sizes. Separate staircases were run for five distinct reference conditions defined by the size of the binding ring with radii chosen from the following list: 2º, 2.67º, 3º, 3.33º and 4º (see Figure 5 ). Because the radius of each circular element was 0.5º, the binding ring did not physically overlap with the circular array in two of the five conditions and was either entirely inside (2º) or outside (4º) the array. Four staircases were run for each trial type–two in which the initial test or control array was larger than the reference array (descending) and two in which it was initially smaller (ascending). The starting radius for the test or control array was randomly selected to be 0.5º to 1º larger or smaller than the radius of the reference array. On each trial, participants completed a 2AFC task indicating which stimulus had appeared larger. According to standard staircase procedures, the size of the test array was adjusted by a step size ranging randomly on each iteration from 2 to 5 pixels (0.07º to 0.18º) in the direction opposite of the participant’s response. The staircase finished when four reversals were recorded. In total, each participant completed 20 staircases presented in pseudorandom order.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_36",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "4.2",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_37",
            "content": "The mean of the four reversal points was calculated for each staircase and the PSE for each reference condition was obtained by averaging these results across the corresponding four staircases. Although we used a different experimental paradigm than in experiment 1, the size of the measured effect when the binding ring had a radius of 3.0º (same as in experiment 1) is comparable to that observed in experiment 1 (0.16º vs. 0.18º). The results illustrated on the top of Figure 5 indicate:",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_38",
            "content": "A) The size of the binding ring had a significant influence on the perceived size of the array (main effect of binding ring size - repeated measures ANOVA: F (4, 36) = 31.22, p < 0.001).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_39",
            "content": "B) In each of the five conditions, the perceived size of the array was significantly influenced by the presence of the binding ring (one sample two-tailed, t-tests vs. zero: all p < 0.05 uncorrected).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_40",
            "content": "C) The binding ring array was perceived as being smaller than an array without a binding ring in each of the four conditions in which the radius of the binding ring was less than the radius of the exterior portion of the array.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_41",
            "content": "D) In the condition where the binding ring completely encompassed the array, the perceived size of the array was larger than when no binding ring was present. This is the reverse effect of the other four conditions.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_42",
            "content": "E) The magnitude of the effect is greatest when the binding ring is superimposed on the array. A follow-up planned comparison of the three overlapping conditions with the two non-overlapping conditions revealed that the magnitude of the effect is significantly larger when the binding ring intersects the array compared to when it does not intersect the array ( F (1, 9) = 50.87, p < 0.001).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_43",
            "content": "F) A second repeated measures ANOVA examining just the three superimposed conditions revealed that the size of the binding ring (within this range) significantly influences the magnitude of the illusion ( F (2, 18) = 3.84, p < 0.05). As can be seen in Figure 5 , the magnitude of the illusion increases as the size of the binding ring is reduced for the three superimposed conditions. However, once the binding ring becomes too small, such that it no longer overlaps the array, the magnitude of the illusion is greatly decreased. That said, even in this innermost binding ring condition, the perceived size of the array is underestimated. It is noteworthy that this particular stimulus condition is quite similar to that typically used in the Ebbinghaus Illusion (see right side of Figure 1A ). Here we demonstrate that there are in fact two illusory effects revealed in the Ebbinghaus Illusion, one operating on the inner circle (making it appear larger) and one operating on the outer array (making it appear smaller). Taken together, these observed effects are consistent with the assimilation hypothesis and inconsistent with the contrast hypothesis. Furthermore, these results appear to indicate that the outer edge of the circular array is serving as a boundary for the assimilation. When the radius of the binding ring exceeds this boundary, the assimilation bias is to increase the perceived size of the array. Similarly, if the radius of the binding ring is within this boundary, the assimilation bias is to decrease the perceived size of the array.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_44",
            "content": "Experiment 3",
            "ntype": "title",
            "meta": {
                "section": "5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_45",
            "content": "In this and the following experiment, we attempt to identify specific stimulus factors that may influence the Binding Ring Illusion. It is suggested that some visual illusions, including the the Müller-Lyer <REF-17> , are mediated by differential processing of low- and high-spatial frequency information <REF-18> – <REF-22> . Here, we investigated the effect of spatial frequency filtering on the magnitude of the Binding Ring Illusion ( Figure 6A ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_46",
            "content": "Figure 6.",
            "ntype": "label",
            "meta": {
                "id": "f6",
                "caption": "Spatial frequency manipulations. A ) Low- (top left) and high-pass (top right) versions of the binding ring stimuli. B ) Results of experiment 3. The points of subjective equality (PSE) of both high (HSF) and low spatial frequency (LSF) conditions are plotted for both the control and binding ring conditions. Error bars represent standard error of the mean. Asterisks indicate significance at p < 0.05.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure6.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_47",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f6\" position=\"float\"> <caption> <title>Spatial frequency manipulations.</title> <p> <bold>A</bold>) Low- (top left) and high-pass (top right) versions of the binding ring stimuli. <bold>B</bold>) Results of experiment 3. The points of subjective equality (PSE) of both high (HSF) and low spatial frequency (LSF) conditions are plotted for both the control and binding ring conditions. Error bars represent standard error of the mean. Asterisks indicate significance at p &lt; 0.05.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure6.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f6",
                "caption": "Spatial frequency manipulations. A ) Low- (top left) and high-pass (top right) versions of the binding ring stimuli. B ) Results of experiment 3. The points of subjective equality (PSE) of both high (HSF) and low spatial frequency (LSF) conditions are plotted for both the control and binding ring conditions. Error bars represent standard error of the mean. Asterisks indicate significance at p < 0.05.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure6.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_48",
            "content": "Stimuli and procedures",
            "ntype": "title",
            "meta": {
                "section": "5.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_49",
            "content": "The stimuli and procedures used in experiment 3 were analogous to those used in experiment 1 except that the stimuli were either high- or low-pass filtered. The high-pass cutoff was set at (2 cpd) and the low-pass cutoff was (0.5 cpd). Stimuli were presented on a gray (20.5 cd/m 2 ) background. In each case, similarly filtered stimuli were compared to each other (i.e. a high spatial frequency (HSF) reference was compared to a HSF test or control). In total there were 36 trial types: nine test radii (same as in experiment 1) for the test and control array types (with and without binding ring) in both HSF and low spatial frequency (LSF) conditions. Trials were pseudorandomly ordered so that 20 of each trial type were presented for a total of 720 trials.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_50",
            "content": "Results",
            "ntype": "title",
            "meta": {
                "section": "5.2",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_51",
            "content": "After fitting the curves using the same procedures described above, we conducted a 2 (binding ring vs. control) × 2 (HSF vs. LSF) repeated measures ANOVA on the derived PSE for each of the four conditions. This analysis revealed a main effect of the binding ring on perceived size ( F (1, 11) = 27.05, p < 0.01), a main effect of spatial frequency on perceived size ( F (1, 11) = 12.30, p < 0.01) and a significant interaction between the binding ring and spatial frequency ( F (1, 11) = 5.57, p < 0.05). As can be seen in Figure 6B , for both low- and high-pass stimuli, the array containing the binding ring was perceived to be smaller than when no binding ring is present. As reflected in the significant interaction, this effect is greater when the stimuli are low- as compared to high-pass filtered. Although the illusion was observed in both the LSF and HSF configurations, the size of the effect observed for the LSF condition (~0.3º) is substantially larger than that observed in the previous experiments that range from 0.16º to 0.18º. In contrast, when the stimuli were high-pass filtered, the resultant ~0.2º reduction in perceived size is comparable to that observed in the previous experiments.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_52",
            "content": "Experiment 4",
            "ntype": "title",
            "meta": {
                "section": "6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_53",
            "content": "Lastly we investigated the role of the local configural features of the stimulus. A number of visual illusions can be attributed to the processes of local configural features <REF-23> . In these two closely related experiments, we investigated the impact of presenting only parts of the binding ring on the presence or magnitude of the Binding Ring Illusion. In doing so we address the question of whether the Binding Ring Illusion is mediated by the processing of specific local features, or perhaps on the basis of more global representations of the objects present in the image.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_54",
            "content": "In the first part of this experiment, the binding ring only connected the array of elements so that it was not visible in the interiors ( Figure 7A ). In the second part of the experiment, the binding ring was present solely within the interiors of the array elements ( Figure 7B ) leaving them unconnected from each other.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_55",
            "content": "Figure 7.",
            "ntype": "label",
            "meta": {
                "id": "f7",
                "caption": "Configurally altered binding ring stimuli. A ) The test stimulus used in experiment 4a. B ) The test stimulus used in experiment 4b. C ) The results of experiment 4a. D ) The results of experiment 4b. There was no significant difference (n.s.) in perceived size between the control and binding ring tests in either condition.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure7.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_56",
            "content": "<fig xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\" fig-type=\"figure\" id=\"f7\" position=\"float\"> <caption> <title>Configurally altered binding ring stimuli.</title> <p> <bold>A</bold>) The test stimulus used in experiment 4a. <bold>B</bold>) The test stimulus used in experiment 4b. <bold>C</bold>) The results of experiment 4a. <bold>D</bold>) The results of experiment 4b. There was no significant difference (n.s.) in perceived size between the control and binding ring tests in either condition.</p> </caption> <graphic xlink:href=\"https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure7.gif\"/> </fig>",
            "ntype": "fig",
            "meta": {
                "id": "f7",
                "caption": "Configurally altered binding ring stimuli. A ) The test stimulus used in experiment 4a. B ) The test stimulus used in experiment 4b. C ) The results of experiment 4a. D ) The results of experiment 4b. There was no significant difference (n.s.) in perceived size between the control and binding ring tests in either condition.",
                "uri": "https://f1000researchdata.s3.amazonaws.com/manuscripts/859/410ac72a-d8df-4791-b6c0-252d673c4045_figure7.gif",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_57",
            "content": "Stimuli and procedures",
            "ntype": "title",
            "meta": {
                "section": "6.1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_58",
            "content": "The stimuli and procedures used in experiments 4a and 4b were identical to those used in experiment 1 except that in the test condition, the binding ring only connected the array of elements as if viewing a chain of pearls (experiment 4a) or the binding ring was only visible in the interiors of the array elements (experiment 4b).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_59",
            "content": "Results 4a",
            "ntype": "title",
            "meta": {
                "section": "6.2",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_60",
            "content": "The data shown in Figure 7C were analyzed using the same curve fitting method described in the results of experiment 1. A paired samples t-test between the PSEs of the test and control arrays revealed no significant difference in perceived size ( t (4) = 2.05, ns ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_61",
            "content": "Results 4b",
            "ntype": "title",
            "meta": {
                "section": "6.3",
                "sec-type": "results",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_62",
            "content": "The data shown in Figure 7D were analyzed using the same curve fitting method described in the previous experiments. A paired t-test between the PSEs of the test and control arrays again revealed no significant difference in perceived size ( t (4) = 1.93, ns ).",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_63",
            "content": "The Binding Ring Illusion was not observed in either of the partial binding ring configurations tested here. As such, we can conclude that processing of the preserved local features does not underlie the illusion. Alternatively, these results suggest that mechanisms within a higher, more global stage of processing may underlie the illusion.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_64",
            "content": "General discussion",
            "ntype": "title",
            "meta": {
                "section": "7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_65",
            "content": "In this manuscript we introduced a new size illusion that we call the Binding Ring Illusion. The Binding Ring Illusion is a variant of the Delboeuf and Ebbinghaus Illusions and demonstrates that the perceived size of an array is subject to effects of assimilation. Specifically, the perceived size of a circular array of elements is underestimated when a ‘binding ring’ is superimposed on the array. The purpose of the above experiments was to demonstrate that the illusion can be quantified, to investigate possible explanations for its occurrence and to begin to characterize the stimulus factors that lead to misperceived size.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_66",
            "content": "A number of observations can be made based on the results of these experiments. Firstly, the Binding Ring Illusion can indeed be quantified. Using both methods of constant stimuli and adaptive staircases we were able to measure significant differences in the perceived size of an array as a function of the presence and size of a binding ring. Secondly, the size of the binding ring significantly influences the magnitude of the illusion (experiment 2). Specifically, in order to produce the greatest effect, the binding ring has to superimpose the array and furthermore, as the size of the superimposed ring decreases, the magnitude of the illusion increases. These findings are consistent with existing assimilation theories of similar size illusions such as the Delboeuf and Ebbinghaus illusions <REF-7> , <REF-8> , <REF-13> , <REF-15> . In addition, the perceived size of the array was slightly increased only when the binding ring was large enough to completely encompass the array. This suggests that the outer radius of the array serves as the reference point for the assimilation process. It has been argued that assimilation is largely influenced by the perceived unification of the components as a single object <REF-15> , <REF-24> . This is consistent with our results such that the strongest assimilation effects occurred when the circle was superimposed on the array and could be easily perceived as a unified figure. In these conditions we observe a significantly larger magnitude of size illusion than when the binding ring was not superimposed on the array.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_67",
            "content": "The Delboeuf and Ebbinghaus Illusions both demonstrate that the perceived size of an interior object can be influenced by the presence of a surrounding stimulus. The Binding Ring Illusion, on the other hand, provides a complimentary observation that the perceived size of a surrounding stimulus can be influenced by the presence of an interior stimulus. Indeed, the smallest binding ring condition in experiment 2 is an identical configuration to that commonly used to demonstrate the Ebbinghaus illusion.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_68",
            "content": "Secondly, the magnitude of the illusion is greater when the stimuli are low- compared to high-pass filtered (experiment 3). However, in both cases the magnitude of the illusion is comparable if not greater than that observed with full spectrum stimuli. As such, we can conclude that: either processes within distinct spatial frequency channels can independently lead to the illusion, or the illusion is mediated by mechanisms at a later stage of processing that follows the integration of high- and low-spatial frequencies. In the latter case, one may conjecture that the initial LSF bias is attenuated once spatial frequency information has been integrated in object recognition areas such as those located in the inferotemporal cortex (IT) <REF-25> . One hypothesis for why the illusion is greater in the LSF condition is that due to blur, the individual array elements in the LSF condition are perceptually larger than the HSF and full-spectrum conditions. Because the elements appear larger, the perceived distance between the outer radius of the array and the binding ring is increased. The results of experiment 2 suggest that this may lead to an increased assimilation effect. Alternatively, the blurring of the image increases the thickness of the binding ring and it could be the case that this increases its effect on the perceived size of the array. Further research will be necessary to fully determine why the blurred stimulus increased the magnitude of the illusion.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_69",
            "content": "Thirdly, the illusion does not manifest when only the local configural features of the binding ring are present. This was true even when the binding ring only connects the array elements (experiment 4a). This result is intriguing because past work has demonstrated that elements that are perceptually grouped into a common object will be perceived to be closer together than those that are not. Specifically, if a series of dots are arranged to form a dotted contour, the distance between any two adjacent dots will be perceived as being shorter than the distance between any one of them and another equally-distanced dot that does not lie along the contour <REF-26> . One possible extension of this observation is that an object formed out of the grouping of individual elements may appear smaller on the basis of the elements appearing closer together. Based on this assumption we thought it possible that the partial binding ring of experiment 4a may serve as an additional cue that the individual elements belong to a common object and therefore lead to it appearing smaller. The configuration of experiment 4a explicitly links the elements of the array; however, this does not lead to the illusory reduction in perceived size. This may be explained by the observed effects of the Oppel-Kundt Illusion <REF-27> , <REF-28> that demonstrates that the distance between two points is overestimated when it is filled with a number of tick marks compared to two equally spaced points of an undivided extent; however, as the density of these divisions increases, the effect diminishes <REF-28> . Therefore, connecting the interior elements should lead to a more veridical perception as observed here. As such, it is unlikely that the Binding Ring Illusion arises due to a misperception of the perceived distance between array elements.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_70",
            "content": "Conclusion",
            "ntype": "title",
            "meta": {
                "section": "8",
                "sec-type": "conclusions",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_71",
            "content": "Although we readily perceive a circular array of elements as a circle, there are many possible alternate perceptions that could be formed. For example, the circles could be grouped into pairs symmetrical about the vertical axis, or perceived as ellipses arranged in an elliptical array that is receding in depth. That we perceive such a stimulus as a circle reflects the constructive processes that are embodied in the functional and structural architecture of the visual system. Importantly, the circle that we perceive does not explicitly exist in the retinal image and must therefore be constructed. As such, the size of the circle that we perceive must be itself constructed as well. The Binding Ring Illusion demonstrates that this constructive process includes the assimilation of other co-occurring stimuli, particularly those that spatially overlap the array.",
            "ntype": "p",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_72",
            "content": "<REF-1> Emmert E : Grossenverhaeltnisse der Nachbilder. Klin Monbl Augenheilkd. 1881 ; 19 : 443 – 450 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-1",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_73",
            "content": "<REF-2> Roberts B Harris MG Yates TA : The roles of inducer size and distance in the Ebbinghaus illusion (Titchener circles). Perception. 2005 ; 34 ( 7 ): 847 – 856 . 16124270 10.1068/p5273",
            "ntype": "ref",
            "meta": {
                "id": "ref-2",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_74",
            "content": "<REF-3> Ross HE Plug C : The history of size constancy and size illusions . In: Walsh V, Kulikowski J, editors. Perceptual Constancy: Why Things Look the Way They Do. Cambridge: Cambridge University Press, 1998 ; 499 – 528 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-3",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_75",
            "content": "<REF-4> Ebbinghaus H Ernst D : Grundzüge der Psychologie . vols. I and II: Veit; 1902 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-4",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_76",
            "content": "<REF-5> Delboeuf J : Seconde note sur de nouvelles illusions d'optique: Essai d'une théorie psychophysique de la manière dont l'oeil apprécie les grandeurs . Bulletins de l'Académie Royale des Sciences, Lettres et Beaux-arts de Belgique. 1865 ; 20 : 70 – 97 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-5",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_77",
            "content": "<REF-6> Delboeuf JLR : Sur une nouvelle illusion d'optique. Academie Royale des Sciences, des Lettres et des Beaux Arts de Belgique. Bulletins. 1892 ; 24 : 545 – 558 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-6",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_78",
            "content": "<REF-7> Coren S Girgus JS : Seeing is deceiving: the psychology of visual illusions . Hillsdale: Lawrence Erlbaum Associates; 1978 ; 255 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-7",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_79",
            "content": "<REF-8> Robinson JO : The psychology of visual illusion . London: Hutchinson, 1972 ; 288 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-8",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_80",
            "content": "<REF-9> Brainard DH : The Psychophysics Toolbox. Spat Vis. 1997 ; 10 ( 4 ): 433 – 436 . 9176952 10.1163/156856897X00357",
            "ntype": "ref",
            "meta": {
                "id": "ref-9",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_81",
            "content": "<REF-10> Laming D Laming J : F. Hegelmaier: On memory for the length of a line. Psychol Res. 1992 ; 54 ( 4 ): 233 – 239 . 1494608 10.1007/BF01358261",
            "ntype": "ref",
            "meta": {
                "id": "ref-10",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_82",
            "content": "<REF-11> Wichmann FA Hill NJ : The psychometric function: I. Fitting, sampling, and goodness of fit. Percept Psychophys. 2001 ; 63 ( 8 ): 1293 – 1313 . 11800458 10.3758/BF03194544",
            "ntype": "ref",
            "meta": {
                "id": "ref-11",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_83",
            "content": "<REF-12> Girgus JS Coren S Agdern M : The interrelationship between the Ebbinghaus and Delboeuf illusions. J Exp Psychol. 1972 ; 95 ( 2 ): 453 – 455 . 5071920 10.1037/h0033606",
            "ntype": "ref",
            "meta": {
                "id": "ref-12",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_84",
            "content": "<REF-13> Oyama T : Japanese studies on the so-called geometrical-optical illusions. Psychologia. 1960 ; 3 : 7 – 20 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-13",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_85",
            "content": "<REF-14> Girgus JS Coren S : Assimilation and contrast illusions: differences in plasticity. Percept Psychophys. 1982 ; 32 ( 6 ): 555 – 561 . 7167354 10.3758/BF03204210",
            "ntype": "ref",
            "meta": {
                "id": "ref-14",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_86",
            "content": "<REF-15> Goto T Uchiyama I Imai A : Assimilation and contrast in optical illusions. Jpn Psychol Res. 2007 ; 49 ( 1 ): 33 – 44 . 10.1111/j.1468-5884.2007.00330.x",
            "ntype": "ref",
            "meta": {
                "id": "ref-15",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_87",
            "content": "<REF-16> Gescheider G : Chapter 3: The Classical Psychophysical Methods . In: Psychophysics: the fundamentals. 3rd ed. Hillsdale: Lawrence Erlbaum Associates; 1997 ; 45 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-16",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_88",
            "content": "<REF-17> Carrasco M Figueroa JG Willen JD : A test of the spatial- frequency explanation of the Müller-Lyer illusion. Perception. 1986 ; 15 ( 5 ): 553 – 562 . 3588215 10.1068/p150553",
            "ntype": "ref",
            "meta": {
                "id": "ref-17",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_89",
            "content": "<REF-18> Ginsburg AP : Psychological correlates of a model of the human visual system . DTIC Document, 1971 ; 119 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-18",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_90",
            "content": "<REF-22> Ginsburg AP Evans DW : Predicting visual illusions from filtered images based upon biological data (A). J Opt Soc Am. 1979 ; 69 : 1443 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-22",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_91",
            "content": "<REF-23> Zöllner F : Ueber eine neue Art von Pseudoskopie und ihre Beziehungen zu den von Plateau und Oppel beschrieben Bewegungsphaenomenen. Annalen Physik Chemie. 1860 ; 186 ( 7 ): 500 – 523 . 10.1002/andp.18601860712",
            "ntype": "ref",
            "meta": {
                "id": "ref-23",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_92",
            "content": "<REF-24> Goto T Uchiyama I Imai A : Assimilation and contrast. Handbook of the science of illusion . 2005 ; 164 – 176 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-24",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_93",
            "content": "<REF-25> Kveraga K Ghuman AS Bar M : Top-down predictions in the cognitive brain. Brain Cogn. 2007 ; 65 ( 2 ): 145 – 168 . 17923222 10.1016/j.bandc.2007.06.007 2099308",
            "ntype": "ref",
            "meta": {
                "id": "ref-25",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_94",
            "content": "<REF-26> Coren S Girgus JS : Principles of perceptual organization and spatial distortion: the gestalt illusions. J Exp Psychol Hum Percept Perform. 1980 ; 6 ( 3 ): 404 – 412 . 6447756 10.1037/0096-1523.6.3.404",
            "ntype": "ref",
            "meta": {
                "id": "ref-26",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_95",
            "content": "<REF-27> Kundt A : Untersuchungen über Augenmass und optische Täuschungen. Poggendorff Analle. 1863 ; 120 : 118 – 158 .",
            "ntype": "ref",
            "meta": {
                "id": "ref-27",
                "created_by": "F1000XMLParser"
            }
        },
        {
            "ix": "2-58_v1_96",
            "content": "<REF-28> Oppel JJ : Ueber geometrisch-optische Täuschungen. Jahresberichte des physikalischen Vereins zu Frankfurt. 1854/1855 ; 37 – 47 . Reference Source",
            "ntype": "ref",
            "meta": {
                "id": "ref-28",
                "created_by": "F1000XMLParser"
            }
        }
    ],
    "span_nodes": [
        {
            "ix": "2-58_v1_0@0",
            "content": "The Binding Ring Illusion: assimilation affects the perceived size of a circular array",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_0",
            "start": 0,
            "end": 85,
            "label": {}
        },
        {
            "ix": "2-58_v1_1@0",
            "content": "Abstract",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_1",
            "start": 0,
            "end": 7,
            "label": {}
        },
        {
            "ix": "2-58_v1_2@0",
            "content": "Our perception of an object’s size arises from the integration of multiple sources of visual information including retinal size, perceived distance and its size relative to other objects in the visual field.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_2",
            "start": 0,
            "end": 206,
            "label": {}
        },
        {
            "ix": "2-58_v1_2@1",
            "content": "This constructive process is revealed through a number of classic size illusions such as the Delboeuf Illusion, the Ebbinghaus Illusion and others illustrating size constancy.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_2",
            "start": 208,
            "end": 382,
            "label": {}
        },
        {
            "ix": "2-58_v1_2@2",
            "content": "Here we present a novel variant of the Delbouef and Ebbinghaus size illusions that we have named the Binding Ring Illusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_2",
            "start": 384,
            "end": 506,
            "label": {}
        },
        {
            "ix": "2-58_v1_2@3",
            "content": "The illusion is such that the perceived size of a circular array of elements is underestimated when superimposed by a circular contour – a binding ring – and overestimated when the binding ring slightly exceeds the overall size of the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_2",
            "start": 508,
            "end": 748,
            "label": {}
        },
        {
            "ix": "2-58_v1_2@4",
            "content": "Here we characterize the stimulus conditions that lead to the illusion, and the perceptual principles that underlie it.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_2",
            "start": 750,
            "end": 868,
            "label": {}
        },
        {
            "ix": "2-58_v1_2@5",
            "content": "Our findings indicate that the perceived size of an array is susceptible to the assimilation of an explicitly defined superimposed contour.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_2",
            "start": 870,
            "end": 1008,
            "label": {}
        },
        {
            "ix": "2-58_v1_2@6",
            "content": "Our results also indicate that the assimilation process takes place at a relatively high level in the visual processing stream, after different spatial frequencies have been integrated and global shape has been constructed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_2",
            "start": 1010,
            "end": 1232,
            "label": {}
        },
        {
            "ix": "2-58_v1_2@7",
            "content": "We hypothesize that the Binding Ring Illusion arises due to the fact that the size of an array of elements is not explicitly defined and therefore can be influenced (through a process of assimilation) by the presence of a superimposed object that does have an explicit size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_2",
            "start": 1234,
            "end": 1507,
            "label": {}
        },
        {
            "ix": "2-58_v1_3@0",
            "content": "Introduction",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_3",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-58_v1_4@0",
            "content": "Correctly perceiving the size of objects is essential to successfully interact with the world around us.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_4",
            "start": 0,
            "end": 103,
            "label": {}
        },
        {
            "ix": "2-58_v1_4@1",
            "content": "Due to the fact that we sense the 3D visual world through an analysis of 2D retinal images, the process of size perception is intrinsically ambiguous.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_4",
            "start": 105,
            "end": 254,
            "label": {}
        },
        {
            "ix": "2-58_v1_4@2",
            "content": "As a result, the perception of an object’s size arises from the integration of multiple sources of visual information including the size of its retinal image, its perceived distance <REF-1> , and its size relative to other objects in the visual scene <REF-2> , <REF-3> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_4",
            "start": 256,
            "end": 525,
            "label": {}
        },
        {
            "ix": "2-58_v1_4@3",
            "content": "These constructive processes are revealed through a number of classic size illusions such as the Ebbinghaus Illusion <REF-4> ( Figure 1A ) and the Delboeuf Illusion <REF-5> , <REF-6> ( Figure 1B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_4",
            "start": 527,
            "end": 723,
            "label": {}
        },
        {
            "ix": "2-58_v1_4@4",
            "content": "In each of these illusions, the perceived size of an explicitly defined object (the inner circle) is influenced by the context in which it is presented.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_4",
            "start": 725,
            "end": 876,
            "label": {}
        },
        {
            "ix": "2-58_v1_4@5",
            "content": "Here we address the question of how we perceive the size of an implicitly defined object–an array of elements–by introducing a novel variant of the Ebbinghaus illusion that we have named the Binding Ring Illusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_4",
            "start": 878,
            "end": 1090,
            "label": {}
        },
        {
            "ix": "2-58_v1_4@6",
            "content": "We describe the illusion and investigate the underlying mechanisms that lead to misperceived size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_4",
            "start": 1092,
            "end": 1189,
            "label": {}
        },
        {
            "ix": "2-58_v1_5@0",
            "content": "Figure 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_5",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-58_v1_7@0",
            "content": "A basic stimulus that elicits perception of the Binding Ring Illusion is composed of a circular array of small circles onto which a larger circle is superimposed as shown in Figure 2A .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_7",
            "start": 0,
            "end": 184,
            "label": {}
        },
        {
            "ix": "2-58_v1_7@1",
            "content": "The superimposed circle leads to an underestimation of the perceived radius of the circular array relative to an equally sized array without the binding ring ( Figure 2B ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_7",
            "start": 186,
            "end": 357,
            "label": {}
        },
        {
            "ix": "2-58_v1_7@2",
            "content": "In the following experiments, we investigate the magnitude of this illusory decrease in size and attempt to study the components of the stimulus that are responsible for the observed effect.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_7",
            "start": 359,
            "end": 548,
            "label": {}
        },
        {
            "ix": "2-58_v1_8@0",
            "content": "Figure 2.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_8",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-58_v1_10@0",
            "content": "In experiment 1, we demonstrate that the effect of the binding ring can be quantified.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_10",
            "start": 0,
            "end": 85,
            "label": {}
        },
        {
            "ix": "2-58_v1_10@1",
            "content": "In experiment 2 we demonstrate that the illusion arises due to assimilation toward the binding ring <REF-7> , <REF-8> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_10",
            "start": 87,
            "end": 205,
            "label": {}
        },
        {
            "ix": "2-58_v1_10@2",
            "content": "In experiment 3, we investigated the effect of spatial frequency.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_10",
            "start": 207,
            "end": 271,
            "label": {}
        },
        {
            "ix": "2-58_v1_10@3",
            "content": "Finally, in experiments 4a and 4b we investigated the roles of local configural features in producing the illusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_10",
            "start": 273,
            "end": 387,
            "label": {}
        },
        {
            "ix": "2-58_v1_11@0",
            "content": "General methods",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_11",
            "start": 0,
            "end": 14,
            "label": {}
        },
        {
            "ix": "2-58_v1_12@0",
            "content": "Participants",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_12",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-58_v1_13@0",
            "content": "Five observers (3 men, 2 women; age range: 18–25; mean age = 20.2) participated in experiment 1, ten observers participated in experiment 2 (4 men, 6 women; age range: 19–28; mean age = 22.4), twelve observers participated in experiment 3 (6 men, 6 women; age range: 18–27; M = 21.75) and five observers participated in experiment 4 (3 men, 2 women; age range: 18–25; M = 20.6).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_13",
            "start": 0,
            "end": 377,
            "label": {}
        },
        {
            "ix": "2-58_v1_13@1",
            "content": "All participants were naïve to the aims of the experiments, reported normal or corrected-to-normal vision and received course credit for their participation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_13",
            "start": 379,
            "end": 535,
            "label": {}
        },
        {
            "ix": "2-58_v1_13@2",
            "content": "Prior to participating, each observer provided informed consent according to the guidelines of the Department of Psychology and the IRB of the University of Nevada, Reno.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_13",
            "start": 537,
            "end": 706,
            "label": {}
        },
        {
            "ix": "2-58_v1_14@0",
            "content": "Apparatus and display",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_14",
            "start": 0,
            "end": 20,
            "label": {}
        },
        {
            "ix": "2-58_v1_15@0",
            "content": "Stimuli were presented on a Dell Trinitron P991 monitor (19 inches, 1024 × 768) with an 85 Hz refresh rate.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_15",
            "start": 0,
            "end": 106,
            "label": {}
        },
        {
            "ix": "2-58_v1_15@1",
            "content": "The stimulus computer was a 2.4 GHz Mac Mini with an NVIDIA GeForce 320M graphics processor (256MB of DDR3 SDRAM).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_15",
            "start": 108,
            "end": 221,
            "label": {}
        },
        {
            "ix": "2-58_v1_15@2",
            "content": "Stimuli were created and presented with the Psychophysics Toolbox <REF-9> for MATLAB (Mathworks Inc., Natick, MA).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_15",
            "start": 223,
            "end": 336,
            "label": {}
        },
        {
            "ix": "2-58_v1_15@3",
            "content": "In experiments 1, 2 and 4, the stimuli were white (120 cd/m 2 ) presented on a black (0.06 cd/m 2 ) background.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_15",
            "start": 338,
            "end": 448,
            "label": {}
        },
        {
            "ix": "2-58_v1_15@4",
            "content": "In experiment 3, the stimuli were either low- or high-pass filtered and presented on a grey background (20.5 cd/m 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_15",
            "start": 450,
            "end": 567,
            "label": {}
        },
        {
            "ix": "2-58_v1_15@5",
            "content": "Luminance values were measured with a Photo Research PR655 spectroradiometer.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_15",
            "start": 569,
            "end": 645,
            "label": {}
        },
        {
            "ix": "2-58_v1_15@6",
            "content": "Participants placed their head on a chin rest and viewed the stimuli binocularly from a distance of 57cm.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_15",
            "start": 647,
            "end": 751,
            "label": {}
        },
        {
            "ix": "2-58_v1_16@0",
            "content": "Experiment 1",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_16",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-58_v1_17@0",
            "content": "The goal of experiment 1 was to establish a ‘standard’ configuration and quantify the magnitude of the illusion in order to serve as a baseline for further testing.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_17",
            "start": 0,
            "end": 163,
            "label": {}
        },
        {
            "ix": "2-58_v1_17@1",
            "content": "Specifically, we sought to measure the perceived reduction in size of an array superimposed with a binding ring compared to an unbound array of equal size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_17",
            "start": 165,
            "end": 319,
            "label": {}
        },
        {
            "ix": "2-58_v1_18@0",
            "content": "Stimuli and procedures",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_18",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@0",
            "content": "The basic paradigm is illustrated in Figure 3 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 0,
            "end": 46,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@1",
            "content": "On a given trial, participants were presented with a small central fixation point (0.35º) for 500ms, followed by the additional simultaneous presentation of two circular arrays (a reference and a test) for 500ms at which point the stimuli were removed from the screen and replaced by a random noise mask displayed for 500ms to discourage afterimages.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 48,
            "end": 397,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@2",
            "content": "Participants indicated by pressing one of two buttons (two-alternative forced choice; AFC), which of the two stimuli had appeared larger.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 399,
            "end": 535,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@3",
            "content": "Each array consisted of 12 small equally spaced circles with radii of 0.05º visual angle.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 537,
            "end": 625,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@4",
            "content": "On every trial, the reference array had a fixed radius of 3º visual angle (from the center of the array to the center of any circular element).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 627,
            "end": 769,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@5",
            "content": "Using the method of constant stimuli <REF-10> , we investigated the perceived size of each of two test arrays compared to the reference array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 771,
            "end": 912,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@6",
            "content": "The test array either had a binding ring superimposed or did not (the lack of a binding ring served as a control condition).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 914,
            "end": 1037,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@7",
            "content": "In non-control conditions the binding ring had a radius selected to match the radius of the test circular array that was measured from the center of the array to the center of one of the smaller component circles.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 1039,
            "end": 1251,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@8",
            "content": "Because the control array did not have a superimposed binding ring it was identical to the reference array in all ways except its trial-by-trial size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 1253,
            "end": 1402,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@9",
            "content": "As such, it was used to determine A) how accurately observers were able to perform the task (discriminate the sizes of the arrays) and B) to serve as a point of comparison for determining the size of the illusory effect.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 1404,
            "end": 1623,
            "label": {}
        },
        {
            "ix": "2-58_v1_19@10",
            "content": "On each trial, the radius of the test array was selected from the following list: 2.5º, 2.6º, 2.8º, 2.9º, 3.0º, 3.1º, 3.3º, 3.4º and 3.5º.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_19",
            "start": 1625,
            "end": 1762,
            "label": {}
        },
        {
            "ix": "2-58_v1_20@0",
            "content": "Figure 3.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_20",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-58_v1_22@0",
            "content": "On each trial, the centers of the two arrays were randomly positioned within a circular radius of 1.16º of visual angle centered 6.75º along the horizontal axis to the left or right of the central fixation point.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_22",
            "start": 0,
            "end": 211,
            "label": {}
        },
        {
            "ix": "2-58_v1_22@1",
            "content": "This positional-jitter was used to prevent observers from basing their judgments on horizontal matching or distance comparisons with the edges of the monitor.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_22",
            "start": 213,
            "end": 370,
            "label": {}
        },
        {
            "ix": "2-58_v1_22@2",
            "content": "Participants were instructed to maintain fixation on the center of the screen throughout the experiment.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_22",
            "start": 372,
            "end": 475,
            "label": {}
        },
        {
            "ix": "2-58_v1_22@3",
            "content": "The sides on which the two arrays were presented were randomly determined on each trial.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_22",
            "start": 477,
            "end": 564,
            "label": {}
        },
        {
            "ix": "2-58_v1_22@4",
            "content": "In total there were 18 trial types: nine test radii for both the test and control array types.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_22",
            "start": 566,
            "end": 659,
            "label": {}
        },
        {
            "ix": "2-58_v1_22@5",
            "content": "Trials were pseudo-randomly ordered such that 20 of each trial type were presented in random order for a total of 360 trials.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_22",
            "start": 661,
            "end": 785,
            "label": {}
        },
        {
            "ix": "2-58_v1_22@6",
            "content": "Prior to the experiment, participants were trained on 20 trials of the largest and smallest test array sizes that were not included in the analyses.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_22",
            "start": 787,
            "end": 934,
            "label": {}
        },
        {
            "ix": "2-58_v1_23@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_23",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-58_v1_24@0",
            "content": "For each array size, we computed the percentage of times the test or control array was perceived to be larger than the reference.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_24",
            "start": 0,
            "end": 128,
            "label": {}
        },
        {
            "ix": "2-58_v1_24@1",
            "content": "Thus, for the test (bound) and control (unbound) arrays, nine values (one for each radius) were calculated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_24",
            "start": 130,
            "end": 236,
            "label": {}
        },
        {
            "ix": "2-58_v1_24@2",
            "content": "Because the 2AFC task has two categorical responses, the following sigmoidal-shaped binomial-logit function was then fit to the corresponding data for each of the two test arrays using the MATLAB (glmfit() command) <REF-11> :",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_24",
            "start": 238,
            "end": 462,
            "label": {}
        },
        {
            "ix": "2-58_v1_25@0",
            "content": "f ( x ) = 100 × [ e b 1 + x b 2 1 + e b 1 + x b 2 ]",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_25",
            "start": 0,
            "end": 50,
            "label": {}
        },
        {
            "ix": "2-58_v1_26@0",
            "content": "The points of subjective equality (PSE) were determined for each subject by interpolating the 50% chance level from the function fit to the data ( x = – b 1 / b 2 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_26",
            "start": 0,
            "end": 164,
            "label": {}
        },
        {
            "ix": "2-58_v1_26@1",
            "content": "The PSE indicates the size the test array needs to be in order to be perceived as equal in size to the reference.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_26",
            "start": 166,
            "end": 278,
            "label": {}
        },
        {
            "ix": "2-58_v1_26@2",
            "content": "The resulting curves plotted for the mean responses across participants are shown in Figure 4 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_26",
            "start": 280,
            "end": 374,
            "label": {}
        },
        {
            "ix": "2-58_v1_26@3",
            "content": "The clear and steep-sloped sigmoidal shaped psychometric curve derived from the control condition in which neither the reference nor control array have a binding ring confirm that participants were able to perform the task and accurately report their perceptions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_26",
            "start": 376,
            "end": 638,
            "label": {}
        },
        {
            "ix": "2-58_v1_26@4",
            "content": "Specifically, participants were at chance performance when the two arrays were indeed the same size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_26",
            "start": 640,
            "end": 739,
            "label": {}
        },
        {
            "ix": "2-58_v1_26@5",
            "content": "The rightward shift of the other psychometric curve, derived from the test (binding ring) condition, demonstrates that the size of the array was underestimated when the binding ring was present.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_26",
            "start": 741,
            "end": 934,
            "label": {}
        },
        {
            "ix": "2-58_v1_26@6",
            "content": "The inset of Figure 4 illustrates the mean points of subjective equality across subjects for the test and control arrays.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_26",
            "start": 936,
            "end": 1056,
            "label": {}
        },
        {
            "ix": "2-58_v1_27@0",
            "content": "Figure 4.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_27",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-58_v1_29@0",
            "content": "A paired t-test between the PSEs of the test and control arrays revealed that the addition of the binding ring significantly ( t (4) = 7.71, p < 0.01) reduced the perceived size of the test array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_29",
            "start": 0,
            "end": 195,
            "label": {}
        },
        {
            "ix": "2-58_v1_29@1",
            "content": "The mean difference of the PSEs between the test and control arrays was ~ 0.18º of visual angle or 6% of the overall radius of the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_29",
            "start": 197,
            "end": 333,
            "label": {}
        },
        {
            "ix": "2-58_v1_29@2",
            "content": "Thus, an array superimposed with a binding ring of radius 3.18º was perceived as having the same size as a no-binding ring array with a radius of 3º. This is comparable in magnitude to underestimation effects observed in the classic Ebbinghaus and Delbeouf Illusions <REF-12> , <REF-13> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_29",
            "start": 335,
            "end": 622,
            "label": {}
        },
        {
            "ix": "2-58_v1_30@0",
            "content": "Experiment 2",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_30",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-58_v1_31@0",
            "content": "Having quantified the magnitude of the illusion in experiment 1, we explored possible mechanisms contributing to the underestimation of perceived size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_31",
            "start": 0,
            "end": 150,
            "label": {}
        },
        {
            "ix": "2-58_v1_31@1",
            "content": "Size illusions such as the Delboeuf and Ebbinghaus illusions have been explained on the basis of size assimilation (when the size of the element of interest is biased toward the reference component) and contrast (when the size of the element of interest is biased away from the reference component) <REF-7> , <REF-8> , <REF-14> , <REF-15> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_31",
            "start": 152,
            "end": 491,
            "label": {}
        },
        {
            "ix": "2-58_v1_31@2",
            "content": "Because the size of an array is not explicitly defined, it remains unclear whether the illusion arises due to assimilation or contrast with the binding ring.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_31",
            "start": 493,
            "end": 649,
            "label": {}
        },
        {
            "ix": "2-58_v1_31@3",
            "content": "In order to determine if the illusion is mediated by assimilation or contrast we investigated the effect of changing the size of the binding ring (bottom of Figure 5 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_31",
            "start": 651,
            "end": 818,
            "label": {}
        },
        {
            "ix": "2-58_v1_31@4",
            "content": "If assimilation is responsible for the effect, we would predict that the magnitude of the illusion should increase as the binding ring gets smaller .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_31",
            "start": 820,
            "end": 968,
            "label": {}
        },
        {
            "ix": "2-58_v1_31@5",
            "content": "Alternatively, if the illusion arises due to contrast, the magnitude of the illusion should increase as the binding ring gets larger .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_31",
            "start": 970,
            "end": 1103,
            "label": {}
        },
        {
            "ix": "2-58_v1_32@0",
            "content": "Figure 5.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_32",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-58_v1_34@0",
            "content": "Stimuli and procedures",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_34",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@0",
            "content": "The basic stimuli were the same as those used in experiment 1; however, due to the larger number of configurations tested, we used staircase procedures <REF-16> rather than the method of constant stimuli.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 0,
            "end": 203,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@1",
            "content": "The individual trials within the staircases again consisted of a reference and test array simultaneously presented for 500ms.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 205,
            "end": 329,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@2",
            "content": "As in the previous experiment, the reference array had a fixed radius of 3º; however, unlike the previous experiment, the reference contained a binding ring and the test array did not.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 331,
            "end": 514,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@3",
            "content": "This was done so as to be able to compare the magnitude of the illusion for a fixed size array across binding-ring sizes.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 516,
            "end": 636,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@4",
            "content": "Separate staircases were run for five distinct reference conditions defined by the size of the binding ring with radii chosen from the following list: 2º, 2.67º, 3º, 3.33º and 4º (see Figure 5 ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 638,
            "end": 832,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@5",
            "content": "Because the radius of each circular element was 0.5º, the binding ring did not physically overlap with the circular array in two of the five conditions and was either entirely inside (2º) or outside (4º) the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 834,
            "end": 1047,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@6",
            "content": "Four staircases were run for each trial type–two in which the initial test or control array was larger than the reference array (descending) and two in which it was initially smaller (ascending).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 1049,
            "end": 1243,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@7",
            "content": "The starting radius for the test or control array was randomly selected to be 0.5º to 1º larger or smaller than the radius of the reference array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 1245,
            "end": 1390,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@8",
            "content": "On each trial, participants completed a 2AFC task indicating which stimulus had appeared larger.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 1392,
            "end": 1487,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@9",
            "content": "According to standard staircase procedures, the size of the test array was adjusted by a step size ranging randomly on each iteration from 2 to 5 pixels (0.07º to 0.18º) in the direction opposite of the participant’s response.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 1489,
            "end": 1714,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@10",
            "content": "The staircase finished when four reversals were recorded.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 1716,
            "end": 1772,
            "label": {}
        },
        {
            "ix": "2-58_v1_35@11",
            "content": "In total, each participant completed 20 staircases presented in pseudorandom order.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_35",
            "start": 1774,
            "end": 1856,
            "label": {}
        },
        {
            "ix": "2-58_v1_36@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_36",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-58_v1_37@0",
            "content": "The mean of the four reversal points was calculated for each staircase and the PSE for each reference condition was obtained by averaging these results across the corresponding four staircases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_37",
            "start": 0,
            "end": 192,
            "label": {}
        },
        {
            "ix": "2-58_v1_37@1",
            "content": "Although we used a different experimental paradigm than in experiment 1, the size of the measured effect when the binding ring had a radius of 3.0º (same as in experiment 1) is comparable to that observed in experiment 1 (0.16º vs. 0.18º).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_37",
            "start": 194,
            "end": 432,
            "label": {}
        },
        {
            "ix": "2-58_v1_37@2",
            "content": "The results illustrated on the top of Figure 5 indicate:",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_37",
            "start": 434,
            "end": 489,
            "label": {}
        },
        {
            "ix": "2-58_v1_38@0",
            "content": "A) The size of the binding ring had a significant influence on the perceived size of the array (main effect of binding ring size - repeated measures ANOVA: F (4, 36) = 31.22, p < 0.001).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_38",
            "start": 0,
            "end": 185,
            "label": {}
        },
        {
            "ix": "2-58_v1_39@0",
            "content": "B) In each of the five conditions, the perceived size of the array was significantly influenced by the presence of the binding ring (one sample two-tailed, t-tests vs. zero: all p < 0.05 uncorrected).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_39",
            "start": 0,
            "end": 199,
            "label": {}
        },
        {
            "ix": "2-58_v1_40@0",
            "content": "C) The binding ring array was perceived as being smaller than an array without a binding ring in each of the four conditions in which the radius of the binding ring was less than the radius of the exterior portion of the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_40",
            "start": 0,
            "end": 226,
            "label": {}
        },
        {
            "ix": "2-58_v1_41@0",
            "content": "D) In the condition where the binding ring completely encompassed the array, the perceived size of the array was larger than when no binding ring was present.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_41",
            "start": 0,
            "end": 157,
            "label": {}
        },
        {
            "ix": "2-58_v1_41@1",
            "content": "This is the reverse effect of the other four conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_41",
            "start": 159,
            "end": 214,
            "label": {}
        },
        {
            "ix": "2-58_v1_42@0",
            "content": "E) The magnitude of the effect is greatest when the binding ring is superimposed on the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_42",
            "start": 0,
            "end": 93,
            "label": {}
        },
        {
            "ix": "2-58_v1_42@1",
            "content": "A follow-up planned comparison of the three overlapping conditions with the two non-overlapping conditions revealed that the magnitude of the effect is significantly larger when the binding ring intersects the array compared to when it does not intersect the array ( F (1, 9) = 50.87, p < 0.001).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_42",
            "start": 95,
            "end": 390,
            "label": {}
        },
        {
            "ix": "2-58_v1_43@0",
            "content": "F) A second repeated measures ANOVA examining just the three superimposed conditions revealed that the size of the binding ring (within this range) significantly influences the magnitude of the illusion ( F (2, 18) = 3.84, p < 0.05).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_43",
            "start": 0,
            "end": 232,
            "label": {}
        },
        {
            "ix": "2-58_v1_43@1",
            "content": "As can be seen in Figure 5 , the magnitude of the illusion increases as the size of the binding ring is reduced for the three superimposed conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_43",
            "start": 234,
            "end": 383,
            "label": {}
        },
        {
            "ix": "2-58_v1_43@2",
            "content": "However, once the binding ring becomes too small, such that it no longer overlaps the array, the magnitude of the illusion is greatly decreased.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_43",
            "start": 385,
            "end": 528,
            "label": {}
        },
        {
            "ix": "2-58_v1_43@3",
            "content": "That said, even in this innermost binding ring condition, the perceived size of the array is underestimated.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_43",
            "start": 530,
            "end": 637,
            "label": {}
        },
        {
            "ix": "2-58_v1_43@4",
            "content": "It is noteworthy that this particular stimulus condition is quite similar to that typically used in the Ebbinghaus Illusion (see right side of Figure 1A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_43",
            "start": 639,
            "end": 793,
            "label": {}
        },
        {
            "ix": "2-58_v1_43@5",
            "content": "Here we demonstrate that there are in fact two illusory effects revealed in the Ebbinghaus Illusion, one operating on the inner circle (making it appear larger) and one operating on the outer array (making it appear smaller).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_43",
            "start": 795,
            "end": 1019,
            "label": {}
        },
        {
            "ix": "2-58_v1_43@6",
            "content": "Taken together, these observed effects are consistent with the assimilation hypothesis and inconsistent with the contrast hypothesis.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_43",
            "start": 1021,
            "end": 1153,
            "label": {}
        },
        {
            "ix": "2-58_v1_43@7",
            "content": "Furthermore, these results appear to indicate that the outer edge of the circular array is serving as a boundary for the assimilation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_43",
            "start": 1155,
            "end": 1288,
            "label": {}
        },
        {
            "ix": "2-58_v1_43@8",
            "content": "When the radius of the binding ring exceeds this boundary, the assimilation bias is to increase the perceived size of the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_43",
            "start": 1290,
            "end": 1417,
            "label": {}
        },
        {
            "ix": "2-58_v1_43@9",
            "content": "Similarly, if the radius of the binding ring is within this boundary, the assimilation bias is to decrease the perceived size of the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_43",
            "start": 1419,
            "end": 1557,
            "label": {}
        },
        {
            "ix": "2-58_v1_44@0",
            "content": "Experiment 3",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_44",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-58_v1_45@0",
            "content": "In this and the following experiment, we attempt to identify specific stimulus factors that may influence the Binding Ring Illusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_45",
            "start": 0,
            "end": 131,
            "label": {}
        },
        {
            "ix": "2-58_v1_45@1",
            "content": "It is suggested that some visual illusions, including the the Müller-Lyer <REF-17> , are mediated by differential processing of low- and high-spatial frequency information <REF-18> – <REF-22> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_45",
            "start": 133,
            "end": 325,
            "label": {}
        },
        {
            "ix": "2-58_v1_45@2",
            "content": "Here, we investigated the effect of spatial frequency filtering on the magnitude of the Binding Ring Illusion ( Figure 6A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_45",
            "start": 327,
            "end": 450,
            "label": {}
        },
        {
            "ix": "2-58_v1_46@0",
            "content": "Figure 6.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_46",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-58_v1_48@0",
            "content": "Stimuli and procedures",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_48",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "2-58_v1_49@0",
            "content": "The stimuli and procedures used in experiment 3 were analogous to those used in experiment 1 except that the stimuli were either high- or low-pass filtered.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_49",
            "start": 0,
            "end": 155,
            "label": {}
        },
        {
            "ix": "2-58_v1_49@1",
            "content": "The high-pass cutoff was set at (2 cpd) and the low-pass cutoff was (0.5 cpd).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_49",
            "start": 157,
            "end": 234,
            "label": {}
        },
        {
            "ix": "2-58_v1_49@2",
            "content": "Stimuli were presented on a gray (20.5 cd/m 2 ) background.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_49",
            "start": 236,
            "end": 294,
            "label": {}
        },
        {
            "ix": "2-58_v1_49@3",
            "content": "In each case, similarly filtered stimuli were compared to each other (i.e. a high spatial frequency (HSF) reference was compared to a HSF test or control).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_49",
            "start": 296,
            "end": 450,
            "label": {}
        },
        {
            "ix": "2-58_v1_49@4",
            "content": "In total there were 36 trial types: nine test radii (same as in experiment 1) for the test and control array types (with and without binding ring) in both HSF and low spatial frequency (LSF) conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_49",
            "start": 452,
            "end": 653,
            "label": {}
        },
        {
            "ix": "2-58_v1_49@5",
            "content": "Trials were pseudorandomly ordered so that 20 of each trial type were presented for a total of 720 trials.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_49",
            "start": 655,
            "end": 760,
            "label": {}
        },
        {
            "ix": "2-58_v1_50@0",
            "content": "Results",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_50",
            "start": 0,
            "end": 6,
            "label": {}
        },
        {
            "ix": "2-58_v1_51@0",
            "content": "After fitting the curves using the same procedures described above, we conducted a 2 (binding ring vs. control) × 2 (HSF vs. LSF) repeated measures ANOVA on the derived PSE for each of the four conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_51",
            "start": 0,
            "end": 204,
            "label": {}
        },
        {
            "ix": "2-58_v1_51@1",
            "content": "This analysis revealed a main effect of the binding ring on perceived size ( F (1, 11) = 27.05, p < 0.01), a main effect of spatial frequency on perceived size ( F (1, 11) = 12.30, p < 0.01) and a significant interaction between the binding ring and spatial frequency ( F (1, 11) = 5.57, p < 0.05).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_51",
            "start": 206,
            "end": 503,
            "label": {}
        },
        {
            "ix": "2-58_v1_51@2",
            "content": "As can be seen in Figure 6B , for both low- and high-pass stimuli, the array containing the binding ring was perceived to be smaller than when no binding ring is present.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_51",
            "start": 505,
            "end": 674,
            "label": {}
        },
        {
            "ix": "2-58_v1_51@3",
            "content": "As reflected in the significant interaction, this effect is greater when the stimuli are low- as compared to high-pass filtered.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_51",
            "start": 676,
            "end": 803,
            "label": {}
        },
        {
            "ix": "2-58_v1_51@4",
            "content": "Although the illusion was observed in both the LSF and HSF configurations, the size of the effect observed for the LSF condition (~0.3º) is substantially larger than that observed in the previous experiments that range from 0.16º to 0.18º. In contrast, when the stimuli were high-pass filtered, the resultant ~0.2º reduction in perceived size is comparable to that observed in the previous experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_51",
            "start": 805,
            "end": 1206,
            "label": {}
        },
        {
            "ix": "2-58_v1_52@0",
            "content": "Experiment 4",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_52",
            "start": 0,
            "end": 11,
            "label": {}
        },
        {
            "ix": "2-58_v1_53@0",
            "content": "Lastly we investigated the role of the local configural features of the stimulus.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_53",
            "start": 0,
            "end": 80,
            "label": {}
        },
        {
            "ix": "2-58_v1_53@1",
            "content": "A number of visual illusions can be attributed to the processes of local configural features <REF-23> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_53",
            "start": 82,
            "end": 184,
            "label": {}
        },
        {
            "ix": "2-58_v1_53@2",
            "content": "In these two closely related experiments, we investigated the impact of presenting only parts of the binding ring on the presence or magnitude of the Binding Ring Illusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_53",
            "start": 186,
            "end": 357,
            "label": {}
        },
        {
            "ix": "2-58_v1_53@3",
            "content": "In doing so we address the question of whether the Binding Ring Illusion is mediated by the processing of specific local features, or perhaps on the basis of more global representations of the objects present in the image.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_53",
            "start": 359,
            "end": 580,
            "label": {}
        },
        {
            "ix": "2-58_v1_54@0",
            "content": "In the first part of this experiment, the binding ring only connected the array of elements so that it was not visible in the interiors ( Figure 7A ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_54",
            "start": 0,
            "end": 149,
            "label": {}
        },
        {
            "ix": "2-58_v1_54@1",
            "content": "In the second part of the experiment, the binding ring was present solely within the interiors of the array elements ( Figure 7B ) leaving them unconnected from each other.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_54",
            "start": 151,
            "end": 322,
            "label": {}
        },
        {
            "ix": "2-58_v1_55@0",
            "content": "Figure 7.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_55",
            "start": 0,
            "end": 8,
            "label": {}
        },
        {
            "ix": "2-58_v1_57@0",
            "content": "Stimuli and procedures",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_57",
            "start": 0,
            "end": 21,
            "label": {}
        },
        {
            "ix": "2-58_v1_58@0",
            "content": "The stimuli and procedures used in experiments 4a and 4b were identical to those used in experiment 1 except that in the test condition, the binding ring only connected the array of elements as if viewing a chain of pearls (experiment 4a) or the binding ring was only visible in the interiors of the array elements (experiment 4b).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_58",
            "start": 0,
            "end": 330,
            "label": {}
        },
        {
            "ix": "2-58_v1_59@0",
            "content": "Results 4a",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_59",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "2-58_v1_60@0",
            "content": "The data shown in Figure 7C were analyzed using the same curve fitting method described in the results of experiment 1.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_60",
            "start": 0,
            "end": 118,
            "label": {}
        },
        {
            "ix": "2-58_v1_60@1",
            "content": "A paired samples t-test between the PSEs of the test and control arrays revealed no significant difference in perceived size ( t (4) = 2.05, ns ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_60",
            "start": 120,
            "end": 265,
            "label": {}
        },
        {
            "ix": "2-58_v1_61@0",
            "content": "Results 4b",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_61",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "2-58_v1_62@0",
            "content": "The data shown in Figure 7D were analyzed using the same curve fitting method described in the previous experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_62",
            "start": 0,
            "end": 115,
            "label": {}
        },
        {
            "ix": "2-58_v1_62@1",
            "content": "A paired t-test between the PSEs of the test and control arrays again revealed no significant difference in perceived size ( t (4) = 1.93, ns ).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_62",
            "start": 117,
            "end": 260,
            "label": {}
        },
        {
            "ix": "2-58_v1_63@0",
            "content": "The Binding Ring Illusion was not observed in either of the partial binding ring configurations tested here.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_63",
            "start": 0,
            "end": 107,
            "label": {}
        },
        {
            "ix": "2-58_v1_63@1",
            "content": "As such, we can conclude that processing of the preserved local features does not underlie the illusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_63",
            "start": 109,
            "end": 212,
            "label": {}
        },
        {
            "ix": "2-58_v1_63@2",
            "content": "Alternatively, these results suggest that mechanisms within a higher, more global stage of processing may underlie the illusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_63",
            "start": 214,
            "end": 341,
            "label": {}
        },
        {
            "ix": "2-58_v1_64@0",
            "content": "General discussion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_64",
            "start": 0,
            "end": 17,
            "label": {}
        },
        {
            "ix": "2-58_v1_65@0",
            "content": "In this manuscript we introduced a new size illusion that we call the Binding Ring Illusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_65",
            "start": 0,
            "end": 91,
            "label": {}
        },
        {
            "ix": "2-58_v1_65@1",
            "content": "The Binding Ring Illusion is a variant of the Delboeuf and Ebbinghaus Illusions and demonstrates that the perceived size of an array is subject to effects of assimilation.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_65",
            "start": 93,
            "end": 263,
            "label": {}
        },
        {
            "ix": "2-58_v1_65@2",
            "content": "Specifically, the perceived size of a circular array of elements is underestimated when a ‘binding ring’ is superimposed on the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_65",
            "start": 265,
            "end": 398,
            "label": {}
        },
        {
            "ix": "2-58_v1_65@3",
            "content": "The purpose of the above experiments was to demonstrate that the illusion can be quantified, to investigate possible explanations for its occurrence and to begin to characterize the stimulus factors that lead to misperceived size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_65",
            "start": 400,
            "end": 629,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@0",
            "content": "A number of observations can be made based on the results of these experiments.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 0,
            "end": 78,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@1",
            "content": "Firstly, the Binding Ring Illusion can indeed be quantified.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 80,
            "end": 139,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@2",
            "content": "Using both methods of constant stimuli and adaptive staircases we were able to measure significant differences in the perceived size of an array as a function of the presence and size of a binding ring.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 141,
            "end": 342,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@3",
            "content": "Secondly, the size of the binding ring significantly influences the magnitude of the illusion (experiment 2).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 344,
            "end": 452,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@4",
            "content": "Specifically, in order to produce the greatest effect, the binding ring has to superimpose the array and furthermore, as the size of the superimposed ring decreases, the magnitude of the illusion increases.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 454,
            "end": 659,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@5",
            "content": "These findings are consistent with existing assimilation theories of similar size illusions such as the Delboeuf and Ebbinghaus illusions <REF-7> , <REF-8> , <REF-13> , <REF-15> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 661,
            "end": 839,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@6",
            "content": "In addition, the perceived size of the array was slightly increased only when the binding ring was large enough to completely encompass the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 841,
            "end": 986,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@7",
            "content": "This suggests that the outer radius of the array serves as the reference point for the assimilation process.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 988,
            "end": 1095,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@8",
            "content": "It has been argued that assimilation is largely influenced by the perceived unification of the components as a single object <REF-15> , <REF-24> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 1097,
            "end": 1242,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@9",
            "content": "This is consistent with our results such that the strongest assimilation effects occurred when the circle was superimposed on the array and could be easily perceived as a unified figure.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 1244,
            "end": 1429,
            "label": {}
        },
        {
            "ix": "2-58_v1_66@10",
            "content": "In these conditions we observe a significantly larger magnitude of size illusion than when the binding ring was not superimposed on the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_66",
            "start": 1431,
            "end": 1572,
            "label": {}
        },
        {
            "ix": "2-58_v1_67@0",
            "content": "The Delboeuf and Ebbinghaus Illusions both demonstrate that the perceived size of an interior object can be influenced by the presence of a surrounding stimulus.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_67",
            "start": 0,
            "end": 160,
            "label": {}
        },
        {
            "ix": "2-58_v1_67@1",
            "content": "The Binding Ring Illusion, on the other hand, provides a complimentary observation that the perceived size of a surrounding stimulus can be influenced by the presence of an interior stimulus.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_67",
            "start": 162,
            "end": 352,
            "label": {}
        },
        {
            "ix": "2-58_v1_67@2",
            "content": "Indeed, the smallest binding ring condition in experiment 2 is an identical configuration to that commonly used to demonstrate the Ebbinghaus illusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_67",
            "start": 354,
            "end": 504,
            "label": {}
        },
        {
            "ix": "2-58_v1_68@0",
            "content": "Secondly, the magnitude of the illusion is greater when the stimuli are low- compared to high-pass filtered (experiment 3).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_68",
            "start": 0,
            "end": 122,
            "label": {}
        },
        {
            "ix": "2-58_v1_68@1",
            "content": "However, in both cases the magnitude of the illusion is comparable if not greater than that observed with full spectrum stimuli.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_68",
            "start": 124,
            "end": 251,
            "label": {}
        },
        {
            "ix": "2-58_v1_68@2",
            "content": "As such, we can conclude that: either processes within distinct spatial frequency channels can independently lead to the illusion, or the illusion is mediated by mechanisms at a later stage of processing that follows the integration of high- and low-spatial frequencies.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_68",
            "start": 253,
            "end": 522,
            "label": {}
        },
        {
            "ix": "2-58_v1_68@3",
            "content": "In the latter case, one may conjecture that the initial LSF bias is attenuated once spatial frequency information has been integrated in object recognition areas such as those located in the inferotemporal cortex (IT) <REF-25> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_68",
            "start": 524,
            "end": 751,
            "label": {}
        },
        {
            "ix": "2-58_v1_68@4",
            "content": "One hypothesis for why the illusion is greater in the LSF condition is that due to blur, the individual array elements in the LSF condition are perceptually larger than the HSF and full-spectrum conditions.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_68",
            "start": 753,
            "end": 958,
            "label": {}
        },
        {
            "ix": "2-58_v1_68@5",
            "content": "Because the elements appear larger, the perceived distance between the outer radius of the array and the binding ring is increased.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_68",
            "start": 960,
            "end": 1090,
            "label": {}
        },
        {
            "ix": "2-58_v1_68@6",
            "content": "The results of experiment 2 suggest that this may lead to an increased assimilation effect.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_68",
            "start": 1092,
            "end": 1182,
            "label": {}
        },
        {
            "ix": "2-58_v1_68@7",
            "content": "Alternatively, the blurring of the image increases the thickness of the binding ring and it could be the case that this increases its effect on the perceived size of the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_68",
            "start": 1184,
            "end": 1359,
            "label": {}
        },
        {
            "ix": "2-58_v1_68@8",
            "content": "Further research will be necessary to fully determine why the blurred stimulus increased the magnitude of the illusion.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_68",
            "start": 1361,
            "end": 1479,
            "label": {}
        },
        {
            "ix": "2-58_v1_69@0",
            "content": "Thirdly, the illusion does not manifest when only the local configural features of the binding ring are present.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_69",
            "start": 0,
            "end": 111,
            "label": {}
        },
        {
            "ix": "2-58_v1_69@1",
            "content": "This was true even when the binding ring only connects the array elements (experiment 4a).",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_69",
            "start": 113,
            "end": 202,
            "label": {}
        },
        {
            "ix": "2-58_v1_69@2",
            "content": "This result is intriguing because past work has demonstrated that elements that are perceptually grouped into a common object will be perceived to be closer together than those that are not.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_69",
            "start": 204,
            "end": 393,
            "label": {}
        },
        {
            "ix": "2-58_v1_69@3",
            "content": "Specifically, if a series of dots are arranged to form a dotted contour, the distance between any two adjacent dots will be perceived as being shorter than the distance between any one of them and another equally-distanced dot that does not lie along the contour <REF-26> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_69",
            "start": 395,
            "end": 667,
            "label": {}
        },
        {
            "ix": "2-58_v1_69@4",
            "content": "One possible extension of this observation is that an object formed out of the grouping of individual elements may appear smaller on the basis of the elements appearing closer together.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_69",
            "start": 669,
            "end": 853,
            "label": {}
        },
        {
            "ix": "2-58_v1_69@5",
            "content": "Based on this assumption we thought it possible that the partial binding ring of experiment 4a may serve as an additional cue that the individual elements belong to a common object and therefore lead to it appearing smaller.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_69",
            "start": 855,
            "end": 1078,
            "label": {}
        },
        {
            "ix": "2-58_v1_69@6",
            "content": "The configuration of experiment 4a explicitly links the elements of the array; however, this does not lead to the illusory reduction in perceived size.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_69",
            "start": 1080,
            "end": 1230,
            "label": {}
        },
        {
            "ix": "2-58_v1_69@7",
            "content": "This may be explained by the observed effects of the Oppel-Kundt Illusion <REF-27> , <REF-28> that demonstrates that the distance between two points is overestimated when it is filled with a number of tick marks compared to two equally spaced points of an undivided extent; however, as the density of these divisions increases, the effect diminishes <REF-28> .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_69",
            "start": 1232,
            "end": 1591,
            "label": {}
        },
        {
            "ix": "2-58_v1_69@8",
            "content": "Therefore, connecting the interior elements should lead to a more veridical perception as observed here.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_69",
            "start": 1593,
            "end": 1696,
            "label": {}
        },
        {
            "ix": "2-58_v1_69@9",
            "content": "As such, it is unlikely that the Binding Ring Illusion arises due to a misperception of the perceived distance between array elements.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_69",
            "start": 1698,
            "end": 1831,
            "label": {}
        },
        {
            "ix": "2-58_v1_70@0",
            "content": "Conclusion",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_70",
            "start": 0,
            "end": 9,
            "label": {}
        },
        {
            "ix": "2-58_v1_71@0",
            "content": "Although we readily perceive a circular array of elements as a circle, there are many possible alternate perceptions that could be formed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_71",
            "start": 0,
            "end": 137,
            "label": {}
        },
        {
            "ix": "2-58_v1_71@1",
            "content": "For example, the circles could be grouped into pairs symmetrical about the vertical axis, or perceived as ellipses arranged in an elliptical array that is receding in depth.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_71",
            "start": 139,
            "end": 311,
            "label": {}
        },
        {
            "ix": "2-58_v1_71@2",
            "content": "That we perceive such a stimulus as a circle reflects the constructive processes that are embodied in the functional and structural architecture of the visual system.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_71",
            "start": 313,
            "end": 478,
            "label": {}
        },
        {
            "ix": "2-58_v1_71@3",
            "content": "Importantly, the circle that we perceive does not explicitly exist in the retinal image and must therefore be constructed.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_71",
            "start": 480,
            "end": 601,
            "label": {}
        },
        {
            "ix": "2-58_v1_71@4",
            "content": "As such, the size of the circle that we perceive must be itself constructed as well.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_71",
            "start": 603,
            "end": 686,
            "label": {}
        },
        {
            "ix": "2-58_v1_71@5",
            "content": "The Binding Ring Illusion demonstrates that this constructive process includes the assimilation of other co-occurring stimuli, particularly those that spatially overlap the array.",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_71",
            "start": 688,
            "end": 866,
            "label": {}
        },
        {
            "ix": "2-58_v1_72@0",
            "content": "<REF-1> Emmert E : Grossenverhaeltnisse der Nachbilder. Klin Monbl Augenheilkd. 1881 ; 19 : 443 – 450 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_72",
            "start": 0,
            "end": 102,
            "label": {}
        },
        {
            "ix": "2-58_v1_73@0",
            "content": "<REF-2> Roberts B Harris MG Yates TA : The roles of inducer size and distance in the Ebbinghaus illusion (Titchener circles). Perception. 2005 ; 34 ( 7 ): 847 – 856 . 16124270 10.1068/p5273",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_73",
            "start": 0,
            "end": 188,
            "label": {}
        },
        {
            "ix": "2-58_v1_74@0",
            "content": "<REF-3> Ross HE Plug C : The history of size constancy and size illusions . In: Walsh V, Kulikowski J, editors. Perceptual Constancy: Why Things Look the Way They Do. Cambridge: Cambridge University Press, 1998 ; 499 – 528 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_74",
            "start": 0,
            "end": 240,
            "label": {}
        },
        {
            "ix": "2-58_v1_75@0",
            "content": "<REF-4> Ebbinghaus H Ernst D : Grundzüge der Psychologie . vols. I and II: Veit; 1902 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_75",
            "start": 0,
            "end": 103,
            "label": {}
        },
        {
            "ix": "2-58_v1_76@0",
            "content": "<REF-5> Delboeuf J : Seconde note sur de nouvelles illusions d'optique: Essai d'une théorie psychophysique de la manière dont l'oeil apprécie les grandeurs . Bulletins de l'Académie Royale des Sciences, Lettres et Beaux-arts de Belgique. 1865 ; 20 : 70 – 97 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_76",
            "start": 0,
            "end": 275,
            "label": {}
        },
        {
            "ix": "2-58_v1_77@0",
            "content": "<REF-6> Delboeuf JLR : Sur une nouvelle illusion d'optique. Academie Royale des Sciences, des Lettres et des Beaux Arts de Belgique. Bulletins. 1892 ; 24 : 545 – 558 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_77",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "2-58_v1_78@0",
            "content": "<REF-7> Coren S Girgus JS : Seeing is deceiving: the psychology of visual illusions . Hillsdale: Lawrence Erlbaum Associates; 1978 ; 255 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_78",
            "start": 0,
            "end": 154,
            "label": {}
        },
        {
            "ix": "2-58_v1_79@0",
            "content": "<REF-8> Robinson JO : The psychology of visual illusion . London: Hutchinson, 1972 ; 288 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_79",
            "start": 0,
            "end": 106,
            "label": {}
        },
        {
            "ix": "2-58_v1_80@0",
            "content": "<REF-9> Brainard DH : The Psychophysics Toolbox. Spat Vis. 1997 ; 10 ( 4 ): 433 – 436 . 9176952 10.1163/156856897X00357",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_80",
            "start": 0,
            "end": 118,
            "label": {}
        },
        {
            "ix": "2-58_v1_81@0",
            "content": "<REF-10> Laming D Laming J : F. Hegelmaier: On memory for the length of a line. Psychol Res. 1992 ; 54 ( 4 ): 233 – 239 . 1494608 10.1007/BF01358261",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_81",
            "start": 0,
            "end": 147,
            "label": {}
        },
        {
            "ix": "2-58_v1_82@0",
            "content": "<REF-11> Wichmann FA Hill NJ : The psychometric function: I. Fitting, sampling, and goodness of fit. Percept Psychophys. 2001 ; 63 ( 8 ): 1293 – 1313 . 11800458 10.3758/BF03194544",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_82",
            "start": 0,
            "end": 178,
            "label": {}
        },
        {
            "ix": "2-58_v1_83@0",
            "content": "<REF-12> Girgus JS Coren S Agdern M : The interrelationship between the Ebbinghaus and Delboeuf illusions. J Exp Psychol. 1972 ; 95 ( 2 ): 453 – 455 . 5071920 10.1037/h0033606",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_83",
            "start": 0,
            "end": 174,
            "label": {}
        },
        {
            "ix": "2-58_v1_84@0",
            "content": "<REF-13> Oyama T : Japanese studies on the so-called geometrical-optical illusions. Psychologia. 1960 ; 3 : 7 – 20 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_84",
            "start": 0,
            "end": 132,
            "label": {}
        },
        {
            "ix": "2-58_v1_85@0",
            "content": "<REF-14> Girgus JS Coren S : Assimilation and contrast illusions: differences in plasticity. Percept Psychophys. 1982 ; 32 ( 6 ): 555 – 561 . 7167354 10.3758/BF03204210",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_85",
            "start": 0,
            "end": 167,
            "label": {}
        },
        {
            "ix": "2-58_v1_86@0",
            "content": "<REF-15> Goto T Uchiyama I Imai A : Assimilation and contrast in optical illusions. Jpn Psychol Res. 2007 ; 49 ( 1 ): 33 – 44 . 10.1111/j.1468-5884.2007.00330.x",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_86",
            "start": 0,
            "end": 159,
            "label": {}
        },
        {
            "ix": "2-58_v1_87@0",
            "content": "<REF-16> Gescheider G : Chapter 3: The Classical Psychophysical Methods . In: Psychophysics: the fundamentals. 3rd ed. Hillsdale: Lawrence Erlbaum Associates; 1997 ; 45 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_87",
            "start": 0,
            "end": 186,
            "label": {}
        },
        {
            "ix": "2-58_v1_88@0",
            "content": "<REF-17> Carrasco M Figueroa JG Willen JD : A test of the spatial- frequency explanation of the Müller-Lyer illusion. Perception. 1986 ; 15 ( 5 ): 553 – 562 . 3588215 10.1068/p150553",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_88",
            "start": 0,
            "end": 181,
            "label": {}
        },
        {
            "ix": "2-58_v1_89@0",
            "content": "<REF-18> Ginsburg AP : Psychological correlates of a model of the human visual system . DTIC Document, 1971 ; 119 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_89",
            "start": 0,
            "end": 131,
            "label": {}
        },
        {
            "ix": "2-58_v1_90@0",
            "content": "<REF-22> Ginsburg AP Evans DW : Predicting visual illusions from filtered images based upon biological data (A). J Opt Soc Am. 1979 ; 69 : 1443 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_90",
            "start": 0,
            "end": 161,
            "label": {}
        },
        {
            "ix": "2-58_v1_91@0",
            "content": "<REF-23> Zöllner F : Ueber eine neue Art von Pseudoskopie und ihre Beziehungen zu den von Plateau und Oppel beschrieben Bewegungsphaenomenen. Annalen Physik Chemie. 1860 ; 186 ( 7 ): 500 – 523 . 10.1002/andp.18601860712",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_91",
            "start": 0,
            "end": 218,
            "label": {}
        },
        {
            "ix": "2-58_v1_92@0",
            "content": "<REF-24> Goto T Uchiyama I Imai A : Assimilation and contrast. Handbook of the science of illusion . 2005 ; 164 – 176 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_92",
            "start": 0,
            "end": 135,
            "label": {}
        },
        {
            "ix": "2-58_v1_93@0",
            "content": "<REF-25> Kveraga K Ghuman AS Bar M : Top-down predictions in the cognitive brain. Brain Cogn. 2007 ; 65 ( 2 ): 145 – 168 . 17923222 10.1016/j.bandc.2007.06.007 2099308",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_93",
            "start": 0,
            "end": 166,
            "label": {}
        },
        {
            "ix": "2-58_v1_94@0",
            "content": "<REF-26> Coren S Girgus JS : Principles of perceptual organization and spatial distortion: the gestalt illusions. J Exp Psychol Hum Percept Perform. 1980 ; 6 ( 3 ): 404 – 412 . 6447756 10.1037/0096-1523.6.3.404",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_94",
            "start": 0,
            "end": 209,
            "label": {}
        },
        {
            "ix": "2-58_v1_95@0",
            "content": "<REF-27> Kundt A : Untersuchungen über Augenmass und optische Täuschungen. Poggendorff Analle. 1863 ; 120 : 118 – 158 .",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_95",
            "start": 0,
            "end": 118,
            "label": {}
        },
        {
            "ix": "2-58_v1_96@0",
            "content": "<REF-28> Oppel JJ : Ueber geometrisch-optische Täuschungen. Jahresberichte des physikalischen Vereins zu Frankfurt. 1854/1855 ; 37 – 47 . Reference Source",
            "ntype": "s",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            },
            "src_ix": "2-58_v1_96",
            "start": 0,
            "end": 153,
            "label": {}
        }
    ],
    "edges": [
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_1",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_1",
            "tgt_ix": "2-58_v1_2",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_3",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_3",
            "tgt_ix": "2-58_v1_4",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_3",
            "tgt_ix": "2-58_v1_5",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_5",
            "tgt_ix": "2-58_v1_6",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_3",
            "tgt_ix": "2-58_v1_7",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_3",
            "tgt_ix": "2-58_v1_8",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_8",
            "tgt_ix": "2-58_v1_9",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_3",
            "tgt_ix": "2-58_v1_10",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_11",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_11",
            "tgt_ix": "2-58_v1_12",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_12",
            "tgt_ix": "2-58_v1_13",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_11",
            "tgt_ix": "2-58_v1_14",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_14",
            "tgt_ix": "2-58_v1_15",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_16",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_16",
            "tgt_ix": "2-58_v1_17",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_16",
            "tgt_ix": "2-58_v1_18",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_18",
            "tgt_ix": "2-58_v1_19",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_18",
            "tgt_ix": "2-58_v1_20",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_20",
            "tgt_ix": "2-58_v1_21",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_18",
            "tgt_ix": "2-58_v1_22",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_16",
            "tgt_ix": "2-58_v1_23",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_23",
            "tgt_ix": "2-58_v1_24",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_23",
            "tgt_ix": "2-58_v1_25",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_23",
            "tgt_ix": "2-58_v1_26",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_23",
            "tgt_ix": "2-58_v1_27",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_27",
            "tgt_ix": "2-58_v1_28",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_23",
            "tgt_ix": "2-58_v1_29",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_30",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_30",
            "tgt_ix": "2-58_v1_31",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_30",
            "tgt_ix": "2-58_v1_32",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_32",
            "tgt_ix": "2-58_v1_33",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_30",
            "tgt_ix": "2-58_v1_34",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_34",
            "tgt_ix": "2-58_v1_35",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_30",
            "tgt_ix": "2-58_v1_36",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_36",
            "tgt_ix": "2-58_v1_37",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_36",
            "tgt_ix": "2-58_v1_38",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_36",
            "tgt_ix": "2-58_v1_39",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_36",
            "tgt_ix": "2-58_v1_40",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_36",
            "tgt_ix": "2-58_v1_41",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_36",
            "tgt_ix": "2-58_v1_42",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_36",
            "tgt_ix": "2-58_v1_43",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_44",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_44",
            "tgt_ix": "2-58_v1_45",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_44",
            "tgt_ix": "2-58_v1_46",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_46",
            "tgt_ix": "2-58_v1_47",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_44",
            "tgt_ix": "2-58_v1_48",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_48",
            "tgt_ix": "2-58_v1_49",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_44",
            "tgt_ix": "2-58_v1_50",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_50",
            "tgt_ix": "2-58_v1_51",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_52",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_52",
            "tgt_ix": "2-58_v1_53",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_52",
            "tgt_ix": "2-58_v1_54",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_52",
            "tgt_ix": "2-58_v1_55",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_55",
            "tgt_ix": "2-58_v1_56",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_52",
            "tgt_ix": "2-58_v1_57",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_57",
            "tgt_ix": "2-58_v1_58",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_52",
            "tgt_ix": "2-58_v1_59",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_59",
            "tgt_ix": "2-58_v1_60",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_52",
            "tgt_ix": "2-58_v1_61",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_61",
            "tgt_ix": "2-58_v1_62",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_61",
            "tgt_ix": "2-58_v1_63",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_64",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_64",
            "tgt_ix": "2-58_v1_65",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_64",
            "tgt_ix": "2-58_v1_66",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_64",
            "tgt_ix": "2-58_v1_67",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_64",
            "tgt_ix": "2-58_v1_68",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_64",
            "tgt_ix": "2-58_v1_69",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_70",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_70",
            "tgt_ix": "2-58_v1_71",
            "etype": "parent",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_1",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_1",
            "tgt_ix": "2-58_v1_2",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_2",
            "tgt_ix": "2-58_v1_3",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_3",
            "tgt_ix": "2-58_v1_4",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_5",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_5",
            "tgt_ix": "2-58_v1_6",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_6",
            "tgt_ix": "2-58_v1_7",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_7",
            "tgt_ix": "2-58_v1_8",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_8",
            "tgt_ix": "2-58_v1_9",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_9",
            "tgt_ix": "2-58_v1_10",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_10",
            "tgt_ix": "2-58_v1_11",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_11",
            "tgt_ix": "2-58_v1_12",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_12",
            "tgt_ix": "2-58_v1_13",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_13",
            "tgt_ix": "2-58_v1_14",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_14",
            "tgt_ix": "2-58_v1_15",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_15",
            "tgt_ix": "2-58_v1_16",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_16",
            "tgt_ix": "2-58_v1_17",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_17",
            "tgt_ix": "2-58_v1_18",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_18",
            "tgt_ix": "2-58_v1_19",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_20",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_20",
            "tgt_ix": "2-58_v1_21",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_21",
            "tgt_ix": "2-58_v1_22",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_22",
            "tgt_ix": "2-58_v1_23",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_23",
            "tgt_ix": "2-58_v1_24",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_24",
            "tgt_ix": "2-58_v1_25",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_25",
            "tgt_ix": "2-58_v1_26",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_26",
            "tgt_ix": "2-58_v1_27",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_27",
            "tgt_ix": "2-58_v1_28",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_28",
            "tgt_ix": "2-58_v1_29",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_29",
            "tgt_ix": "2-58_v1_30",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_30",
            "tgt_ix": "2-58_v1_31",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_31",
            "tgt_ix": "2-58_v1_32",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_32",
            "tgt_ix": "2-58_v1_33",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_33",
            "tgt_ix": "2-58_v1_34",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_34",
            "tgt_ix": "2-58_v1_35",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_36",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_36",
            "tgt_ix": "2-58_v1_37",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_37",
            "tgt_ix": "2-58_v1_38",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_38",
            "tgt_ix": "2-58_v1_39",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_39",
            "tgt_ix": "2-58_v1_40",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_40",
            "tgt_ix": "2-58_v1_41",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_41",
            "tgt_ix": "2-58_v1_42",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_42",
            "tgt_ix": "2-58_v1_43",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_44",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_44",
            "tgt_ix": "2-58_v1_45",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_45",
            "tgt_ix": "2-58_v1_46",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_46",
            "tgt_ix": "2-58_v1_47",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_47",
            "tgt_ix": "2-58_v1_48",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_48",
            "tgt_ix": "2-58_v1_49",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_49",
            "tgt_ix": "2-58_v1_50",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_50",
            "tgt_ix": "2-58_v1_51",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_51",
            "tgt_ix": "2-58_v1_52",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_52",
            "tgt_ix": "2-58_v1_53",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_53",
            "tgt_ix": "2-58_v1_54",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_54",
            "tgt_ix": "2-58_v1_55",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_55",
            "tgt_ix": "2-58_v1_56",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_56",
            "tgt_ix": "2-58_v1_57",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_57",
            "tgt_ix": "2-58_v1_58",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_58",
            "tgt_ix": "2-58_v1_59",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_59",
            "tgt_ix": "2-58_v1_60",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_60",
            "tgt_ix": "2-58_v1_61",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_61",
            "tgt_ix": "2-58_v1_62",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_62",
            "tgt_ix": "2-58_v1_63",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_63",
            "tgt_ix": "2-58_v1_64",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_64",
            "tgt_ix": "2-58_v1_65",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_65",
            "tgt_ix": "2-58_v1_66",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_67",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_67",
            "tgt_ix": "2-58_v1_68",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_69",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_70",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_70",
            "tgt_ix": "2-58_v1_71",
            "etype": "next",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_72",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_73",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_74",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_75",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_76",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_77",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_10",
            "tgt_ix": "2-58_v1_78",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_10",
            "tgt_ix": "2-58_v1_79",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_15",
            "tgt_ix": "2-58_v1_80",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_81",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_24",
            "tgt_ix": "2-58_v1_82",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_29",
            "tgt_ix": "2-58_v1_83",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_29",
            "tgt_ix": "2-58_v1_84",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_31",
            "tgt_ix": "2-58_v1_85",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_31",
            "tgt_ix": "2-58_v1_86",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_87",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_45",
            "tgt_ix": "2-58_v1_88",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_45",
            "tgt_ix": "2-58_v1_89",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_45",
            "tgt_ix": "2-58_v1_90",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_53",
            "tgt_ix": "2-58_v1_91",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_92",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_93",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_94",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_95",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_96",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_6",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_7",
            "tgt_ix": "2-58_v1_9",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_21",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_26",
            "tgt_ix": "2-58_v1_28",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_31",
            "tgt_ix": "2-58_v1_33",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_45",
            "tgt_ix": "2-58_v1_47",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_54",
            "tgt_ix": "2-58_v1_56",
            "etype": "link",
            "meta": {
                "created_by": "F1000XMLParser"
            }
        },
        {
            "src_ix": "2-58_v1_0",
            "tgt_ix": "2-58_v1_0@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_1",
            "tgt_ix": "2-58_v1_1@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_2",
            "tgt_ix": "2-58_v1_2@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_2",
            "tgt_ix": "2-58_v1_2@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_2",
            "tgt_ix": "2-58_v1_2@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_2",
            "tgt_ix": "2-58_v1_2@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_2",
            "tgt_ix": "2-58_v1_2@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_2",
            "tgt_ix": "2-58_v1_2@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_2",
            "tgt_ix": "2-58_v1_2@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_2",
            "tgt_ix": "2-58_v1_2@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_3",
            "tgt_ix": "2-58_v1_3@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_4@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_4@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_4@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_4@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_4@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_4@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_4",
            "tgt_ix": "2-58_v1_4@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_5",
            "tgt_ix": "2-58_v1_5@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_7",
            "tgt_ix": "2-58_v1_7@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_7",
            "tgt_ix": "2-58_v1_7@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_7",
            "tgt_ix": "2-58_v1_7@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_8",
            "tgt_ix": "2-58_v1_8@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_10",
            "tgt_ix": "2-58_v1_10@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_10",
            "tgt_ix": "2-58_v1_10@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_10",
            "tgt_ix": "2-58_v1_10@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_10",
            "tgt_ix": "2-58_v1_10@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_11",
            "tgt_ix": "2-58_v1_11@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_12",
            "tgt_ix": "2-58_v1_12@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_13",
            "tgt_ix": "2-58_v1_13@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_13",
            "tgt_ix": "2-58_v1_13@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_13",
            "tgt_ix": "2-58_v1_13@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_14",
            "tgt_ix": "2-58_v1_14@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_15",
            "tgt_ix": "2-58_v1_15@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_15",
            "tgt_ix": "2-58_v1_15@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_15",
            "tgt_ix": "2-58_v1_15@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_15",
            "tgt_ix": "2-58_v1_15@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_15",
            "tgt_ix": "2-58_v1_15@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_15",
            "tgt_ix": "2-58_v1_15@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_15",
            "tgt_ix": "2-58_v1_15@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_16",
            "tgt_ix": "2-58_v1_16@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_17",
            "tgt_ix": "2-58_v1_17@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_17",
            "tgt_ix": "2-58_v1_17@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_18",
            "tgt_ix": "2-58_v1_18@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_19",
            "tgt_ix": "2-58_v1_19@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_20",
            "tgt_ix": "2-58_v1_20@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_22",
            "tgt_ix": "2-58_v1_22@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_22",
            "tgt_ix": "2-58_v1_22@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_22",
            "tgt_ix": "2-58_v1_22@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_22",
            "tgt_ix": "2-58_v1_22@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_22",
            "tgt_ix": "2-58_v1_22@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_22",
            "tgt_ix": "2-58_v1_22@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_22",
            "tgt_ix": "2-58_v1_22@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_23",
            "tgt_ix": "2-58_v1_23@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_24",
            "tgt_ix": "2-58_v1_24@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_24",
            "tgt_ix": "2-58_v1_24@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_24",
            "tgt_ix": "2-58_v1_24@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_25",
            "tgt_ix": "2-58_v1_25@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_26",
            "tgt_ix": "2-58_v1_26@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_26",
            "tgt_ix": "2-58_v1_26@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_26",
            "tgt_ix": "2-58_v1_26@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_26",
            "tgt_ix": "2-58_v1_26@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_26",
            "tgt_ix": "2-58_v1_26@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_26",
            "tgt_ix": "2-58_v1_26@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_26",
            "tgt_ix": "2-58_v1_26@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_27",
            "tgt_ix": "2-58_v1_27@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_29",
            "tgt_ix": "2-58_v1_29@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_29",
            "tgt_ix": "2-58_v1_29@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_29",
            "tgt_ix": "2-58_v1_29@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_30",
            "tgt_ix": "2-58_v1_30@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_31",
            "tgt_ix": "2-58_v1_31@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_31",
            "tgt_ix": "2-58_v1_31@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_31",
            "tgt_ix": "2-58_v1_31@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_31",
            "tgt_ix": "2-58_v1_31@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_31",
            "tgt_ix": "2-58_v1_31@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_31",
            "tgt_ix": "2-58_v1_31@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_32",
            "tgt_ix": "2-58_v1_32@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_34",
            "tgt_ix": "2-58_v1_34@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_35",
            "tgt_ix": "2-58_v1_35@11",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_36",
            "tgt_ix": "2-58_v1_36@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_37",
            "tgt_ix": "2-58_v1_37@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_37",
            "tgt_ix": "2-58_v1_37@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_37",
            "tgt_ix": "2-58_v1_37@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_38",
            "tgt_ix": "2-58_v1_38@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_39",
            "tgt_ix": "2-58_v1_39@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_40",
            "tgt_ix": "2-58_v1_40@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_41",
            "tgt_ix": "2-58_v1_41@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_41",
            "tgt_ix": "2-58_v1_41@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_42",
            "tgt_ix": "2-58_v1_42@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_42",
            "tgt_ix": "2-58_v1_42@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_43@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_43@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_43@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_43@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_43@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_43@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_43@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_43@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_43@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_43",
            "tgt_ix": "2-58_v1_43@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_44",
            "tgt_ix": "2-58_v1_44@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_45",
            "tgt_ix": "2-58_v1_45@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_45",
            "tgt_ix": "2-58_v1_45@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_45",
            "tgt_ix": "2-58_v1_45@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_46",
            "tgt_ix": "2-58_v1_46@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_48",
            "tgt_ix": "2-58_v1_48@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_49",
            "tgt_ix": "2-58_v1_49@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_49",
            "tgt_ix": "2-58_v1_49@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_49",
            "tgt_ix": "2-58_v1_49@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_49",
            "tgt_ix": "2-58_v1_49@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_49",
            "tgt_ix": "2-58_v1_49@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_49",
            "tgt_ix": "2-58_v1_49@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_50",
            "tgt_ix": "2-58_v1_50@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_51",
            "tgt_ix": "2-58_v1_51@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_51",
            "tgt_ix": "2-58_v1_51@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_51",
            "tgt_ix": "2-58_v1_51@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_51",
            "tgt_ix": "2-58_v1_51@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_51",
            "tgt_ix": "2-58_v1_51@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_52",
            "tgt_ix": "2-58_v1_52@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_53",
            "tgt_ix": "2-58_v1_53@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_53",
            "tgt_ix": "2-58_v1_53@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_53",
            "tgt_ix": "2-58_v1_53@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_53",
            "tgt_ix": "2-58_v1_53@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_54",
            "tgt_ix": "2-58_v1_54@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_54",
            "tgt_ix": "2-58_v1_54@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_55",
            "tgt_ix": "2-58_v1_55@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_57",
            "tgt_ix": "2-58_v1_57@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_58",
            "tgt_ix": "2-58_v1_58@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_59",
            "tgt_ix": "2-58_v1_59@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_60",
            "tgt_ix": "2-58_v1_60@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_60",
            "tgt_ix": "2-58_v1_60@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_61",
            "tgt_ix": "2-58_v1_61@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_62",
            "tgt_ix": "2-58_v1_62@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_62",
            "tgt_ix": "2-58_v1_62@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_63",
            "tgt_ix": "2-58_v1_63@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_63",
            "tgt_ix": "2-58_v1_63@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_63",
            "tgt_ix": "2-58_v1_63@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_64",
            "tgt_ix": "2-58_v1_64@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_65",
            "tgt_ix": "2-58_v1_65@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_65",
            "tgt_ix": "2-58_v1_65@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_65",
            "tgt_ix": "2-58_v1_65@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_65",
            "tgt_ix": "2-58_v1_65@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_66",
            "tgt_ix": "2-58_v1_66@10",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_67",
            "tgt_ix": "2-58_v1_67@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_67",
            "tgt_ix": "2-58_v1_67@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_67",
            "tgt_ix": "2-58_v1_67@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_68@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_68@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_68@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_68@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_68@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_68@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_68@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_68@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_68",
            "tgt_ix": "2-58_v1_68@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_69@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_69@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_69@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_69@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_69@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_69@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_69@6",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_69@7",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_69@8",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_69",
            "tgt_ix": "2-58_v1_69@9",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_70",
            "tgt_ix": "2-58_v1_70@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_71",
            "tgt_ix": "2-58_v1_71@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_71",
            "tgt_ix": "2-58_v1_71@1",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_71",
            "tgt_ix": "2-58_v1_71@2",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_71",
            "tgt_ix": "2-58_v1_71@3",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_71",
            "tgt_ix": "2-58_v1_71@4",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_71",
            "tgt_ix": "2-58_v1_71@5",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_72",
            "tgt_ix": "2-58_v1_72@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_73",
            "tgt_ix": "2-58_v1_73@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_74",
            "tgt_ix": "2-58_v1_74@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_75",
            "tgt_ix": "2-58_v1_75@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_76",
            "tgt_ix": "2-58_v1_76@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_77",
            "tgt_ix": "2-58_v1_77@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_78",
            "tgt_ix": "2-58_v1_78@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_79",
            "tgt_ix": "2-58_v1_79@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_80",
            "tgt_ix": "2-58_v1_80@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_81",
            "tgt_ix": "2-58_v1_81@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_82",
            "tgt_ix": "2-58_v1_82@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_83",
            "tgt_ix": "2-58_v1_83@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_84",
            "tgt_ix": "2-58_v1_84@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_85",
            "tgt_ix": "2-58_v1_85@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_86",
            "tgt_ix": "2-58_v1_86@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_87",
            "tgt_ix": "2-58_v1_87@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_88",
            "tgt_ix": "2-58_v1_88@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_89",
            "tgt_ix": "2-58_v1_89@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_90",
            "tgt_ix": "2-58_v1_90@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_91",
            "tgt_ix": "2-58_v1_91@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_92",
            "tgt_ix": "2-58_v1_92@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_93",
            "tgt_ix": "2-58_v1_93@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_94",
            "tgt_ix": "2-58_v1_94@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_95",
            "tgt_ix": "2-58_v1_95@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        },
        {
            "src_ix": "2-58_v1_96",
            "tgt_ix": "2-58_v1_96@0",
            "etype": "link",
            "meta": {
                "created_by": "IntertextSentenceSplitter_all"
            }
        }
    ],
    "prefix": "2-58_v1",
    "meta": {
        "parser": "F1000XMLParser",
        "intertext-graph": "N/A",
        "doi": "10.12688/f1000research.2-58.v1",
        "atype": "research-article",
        "license": "http://creativecommons.org/licenses/by/3.0/",
        "title": "The Binding Ring Illusion: assimilation affects the perceived size of a circular array",
        "abstract": "Our perception of an object’s size arises from the integration of multiple sources of visual information including retinal size, perceived distance and its size relative to other objects in the visual field. This constructive process is revealed through a number of classic size illusions such as the Delboeuf Illusion, the Ebbinghaus Illusion and others illustrating size constancy. Here we present a novel variant of the Delbouef and Ebbinghaus size illusions that we have named the Binding Ring Illusion. The illusion is such that the perceived size of a circular array of elements is underestimated when superimposed by a circular contour – a binding ring – and overestimated when the binding ring slightly exceeds the overall size of the array. Here we characterize the stimulus conditions that lead to the illusion, and the perceptual principles that underlie it. Our findings indicate that the perceived size of an array is susceptible to the assimilation of an explicitly defined superimposed contour. Our results also indicate that the assimilation process takes place at a relatively high level in the visual processing stream, after different spatial frequencies have been integrated and global shape has been constructed. We hypothesize that the Binding Ring Illusion arises due to the fact that the size of an array of elements is not explicitly defined and therefore can be influenced (through a process of assimilation) by the presence of a superimposed object that does have an explicit size.",
        "contributors": [
            {
                "surname": "McCarthy",
                "given-names": "J Daniel"
            },
            {
                "surname": "Kupitz",
                "given-names": "Colin"
            },
            {
                "surname": "Caplovitz",
                "given-names": "Gideon P"
            }
        ],
        "url": "https://f1000research.com/articles/2-58/v1/",
        "doc_id": "2-58",
        "version": 1,
        "ix_counter": 421,
        "sentence_split_type": "HybridSplitterLessAndLong",
        "sentence_split_model": "HybridSplitterLessAndLong_SciSpacy+Spacy"
    }
}